; ModuleID = 'x264_src/input/timecode.c'
source_filename = "x264_src/input/timecode.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cli_input_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr }

@timecode_input = dso_local local_unnamed_addr global %struct.cli_input_t { ptr @open_file, ptr @get_frame_total, ptr null, ptr @read_frame, ptr @release_frame, ptr null, ptr @close_file }, align 8, !dbg !0
@stderr = external local_unnamed_addr global ptr, align 8
@.str = private unnamed_addr constant [33 x i8] c"timecode [error]: malloc failed\0A\00", align 1, !dbg !14
@input = external local_unnamed_addr global %struct.cli_input_t, align 8
@.str.1 = private unnamed_addr constant [8 x i8] c"%lu/%lu\00", align 1, !dbg !20
@.str.2 = private unnamed_addr constant [64 x i8] c"timecode [error]: timebase you specified exceeds H.264 maximum\0A\00", align 1, !dbg !25
@.str.3 = private unnamed_addr constant [3 x i8] c"rb\00", align 1, !dbg !30
@.str.4 = private unnamed_addr constant [35 x i8] c"timecode [error]: can't open `%s'\0A\00", align 1, !dbg !35
@.str.6 = private unnamed_addr constant [22 x i8] c"# timecode format v%d\00", align 1, !dbg !45
@.str.7 = private unnamed_addr constant [47 x i8] c"timecode [error]: unsupported timecode format\0A\00", align 1, !dbg !50
@.str.8 = private unnamed_addr constant [11 x i8] c"assume %lf\00", align 1, !dbg !55

!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(scope: null, file: !3, line: 150, type: !74, isLocal: true, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 296, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 37)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(scope: null, file: !3, line: 154, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 80, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 10)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(scope: null, file: !3, line: 157, type: !84, isLocal: true, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 320, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 40)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(scope: null, file: !3, line: 162, type: !89, isLocal: true, isDefinition: true)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 440, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 55)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(scope: null, file: !3, line: 264, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 480, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 60)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(scope: null, file: !3, line: 274, type: !99, isLocal: true, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 32, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 4)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(scope: null, file: !3, line: 277, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 416, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 52)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(scope: null, file: !3, line: 289, type: !109, isLocal: true, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 424, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 53)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(scope: null, file: !3, line: 345, type: !114, isLocal: true, isDefinition: true)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 448, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 56)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(scope: null, file: !3, line: 349, type: !119, isLocal: true, isDefinition: true)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 936, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 117)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(scope: null, file: !3, line: 365, type: !124, isLocal: true, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 488, elements: !125)
!125 = !{!126}
!126 = !DISubrange(count: 61)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(scope: null, file: !3, line: 66, type: !129, isLocal: true, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 1008, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 126)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !3, line: 96, type: !134, isLocal: true, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 816, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 102)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(scope: null, file: !3, line: 469, type: !139, isLocal: true, isDefinition: true)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 944, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 118)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_input_t", file: !143, line: 63, baseType: !144)
!143 = !DIFile(filename: "x264_src/input/input.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "f28c863d273681dfcaca9779e9fcbd53")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 54, size: 448, elements: !145)
!145 = !{!146, !182, !186, !390, !394, !398, !402}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "open_file", scope: !144, file: !143, line: 56, baseType: !147, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!6, !150, !151, !154, !174}
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "hnd_t", file: !153, line: 30, baseType: !5)
!153 = !DIFile(filename: "x264_src/muxers.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "bcea0820748b2dc47392b7f6393a96ff")
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "video_info_t", file: !143, line: 52, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 38, size: 384, elements: !157)
!157 = !{!158, !159, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "csp", scope: !156, file: !143, line: 40, baseType: !6, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "fps_num", scope: !156, file: !143, line: 41, baseType: !160, size: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !161, line: 26, baseType: !162)
!161 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !11, line: 42, baseType: !163)
!163 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "fps_den", scope: !156, file: !143, line: 42, baseType: !160, size: 32, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !156, file: !143, line: 43, baseType: !6, size: 32, offset: 96)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !156, file: !143, line: 44, baseType: !6, size: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !156, file: !143, line: 45, baseType: !160, size: 32, offset: 160)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !156, file: !143, line: 46, baseType: !160, size: 32, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tff", scope: !156, file: !143, line: 47, baseType: !6, size: 32, offset: 224)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_num", scope: !156, file: !143, line: 48, baseType: !160, size: 32, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_den", scope: !156, file: !143, line: 49, baseType: !160, size: 32, offset: 288)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "vfr", scope: !156, file: !143, line: 50, baseType: !6, size: 32, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !156, file: !143, line: 51, baseType: !6, size: 32, offset: 352)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_input_opt_t", file: !143, line: 35, baseType: !176)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 29, size: 256, elements: !177)
!177 = !{!178, !179, !180, !181}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !176, file: !143, line: 31, baseType: !150, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !176, file: !143, line: 32, baseType: !150, size: 64, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "timebase", scope: !176, file: !143, line: 33, baseType: !150, size: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !176, file: !143, line: 34, baseType: !6, size: 32, offset: 192)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "get_frame_total", scope: !144, file: !143, line: 57, baseType: !183, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!6, !152}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "picture_alloc", scope: !144, file: !143, line: 58, baseType: !187, size: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DISubroutineType(types: !189)
!189 = !{!6, !190, !6, !6, !6}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_picture_t", file: !192, line: 549, baseType: !193)
!192 = !DIFile(filename: "x264_src/x264.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 513, size: 1088, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !370, !381, !389}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !193, file: !192, line: 521, baseType: !6, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !193, file: !192, line: 523, baseType: !6, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !193, file: !192, line: 526, baseType: !6, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !193, file: !192, line: 529, baseType: !6, size: 32, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !193, file: !192, line: 531, baseType: !8, size: 64, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !193, file: !192, line: 534, baseType: !8, size: 64, offset: 192)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !193, file: !192, line: 541, baseType: !202, size: 64, offset: 256)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !192, line: 376, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !192, line: 176, size: 5632, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !254, !255, !256, !257, !259, !260, !273, !274, !275, !276, !277, !308, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !204, file: !192, line: 179, baseType: !163, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !204, file: !192, line: 180, baseType: !6, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !204, file: !192, line: 181, baseType: !6, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !204, file: !192, line: 182, baseType: !6, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !204, file: !192, line: 183, baseType: !6, size: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !204, file: !192, line: 186, baseType: !6, size: 32, offset: 160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !204, file: !192, line: 187, baseType: !6, size: 32, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !204, file: !192, line: 188, baseType: !6, size: 32, offset: 224)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !204, file: !192, line: 189, baseType: !6, size: 32, offset: 256)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !204, file: !192, line: 190, baseType: !6, size: 32, offset: 288)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !204, file: !192, line: 198, baseType: !6, size: 32, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !204, file: !192, line: 215, baseType: !218, size: 288, offset: 352)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !204, file: !192, line: 200, size: 288, elements: !219)
!219 = !{!220, !221, !222, !223, !224, !225, !226, !227, !228}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !218, file: !192, line: 203, baseType: !6, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !218, file: !192, line: 204, baseType: !6, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !218, file: !192, line: 206, baseType: !6, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !218, file: !192, line: 209, baseType: !6, size: 32, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !218, file: !192, line: 210, baseType: !6, size: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !218, file: !192, line: 211, baseType: !6, size: 32, offset: 160)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !218, file: !192, line: 212, baseType: !6, size: 32, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !218, file: !192, line: 213, baseType: !6, size: 32, offset: 224)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !218, file: !192, line: 214, baseType: !6, size: 32, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !204, file: !192, line: 218, baseType: !6, size: 32, offset: 640)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !204, file: !192, line: 219, baseType: !6, size: 32, offset: 672)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !204, file: !192, line: 220, baseType: !6, size: 32, offset: 704)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !204, file: !192, line: 221, baseType: !6, size: 32, offset: 736)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !204, file: !192, line: 222, baseType: !6, size: 32, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !204, file: !192, line: 224, baseType: !6, size: 32, offset: 800)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !204, file: !192, line: 225, baseType: !6, size: 32, offset: 832)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !204, file: !192, line: 226, baseType: !6, size: 32, offset: 864)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !204, file: !192, line: 227, baseType: !6, size: 32, offset: 896)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !204, file: !192, line: 229, baseType: !6, size: 32, offset: 928)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !204, file: !192, line: 230, baseType: !6, size: 32, offset: 960)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !204, file: !192, line: 231, baseType: !6, size: 32, offset: 992)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !204, file: !192, line: 233, baseType: !6, size: 32, offset: 1024)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !204, file: !192, line: 234, baseType: !6, size: 32, offset: 1056)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !204, file: !192, line: 236, baseType: !6, size: 32, offset: 1088)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !204, file: !192, line: 237, baseType: !6, size: 32, offset: 1120)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !204, file: !192, line: 239, baseType: !6, size: 32, offset: 1152)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !204, file: !192, line: 240, baseType: !150, size: 64, offset: 1216)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !204, file: !192, line: 241, baseType: !248, size: 128, offset: 1280)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 128, elements: !252)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !161, line: 24, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !11, line: 38, baseType: !251)
!251 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!252 = !{!253}
!253 = !DISubrange(count: 16)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !204, file: !192, line: 242, baseType: !248, size: 128, offset: 1408)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !204, file: !192, line: 243, baseType: !248, size: 128, offset: 1536)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !204, file: !192, line: 244, baseType: !248, size: 128, offset: 1664)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !204, file: !192, line: 245, baseType: !258, size: 512, offset: 1792)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 512, elements: !28)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !204, file: !192, line: 246, baseType: !258, size: 512, offset: 2304)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !204, file: !192, line: 249, baseType: !261, size: 64, offset: 2816)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !5, !6, !264, !266}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !268)
!268 = !{!269, !270, !271, !272}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !267, file: !3, line: 499, baseType: !163, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !267, file: !3, line: 499, baseType: !163, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !267, file: !3, line: 499, baseType: !5, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !267, file: !3, line: 499, baseType: !5, size: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !204, file: !192, line: 250, baseType: !5, size: 64, offset: 2880)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !204, file: !192, line: 251, baseType: !6, size: 32, offset: 2944)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !204, file: !192, line: 252, baseType: !6, size: 32, offset: 2976)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !204, file: !192, line: 253, baseType: !150, size: 64, offset: 3008)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !204, file: !192, line: 287, baseType: !278, size: 800, offset: 3072)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !204, file: !192, line: 256, size: 800, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !300, !301, !302, !306, !307}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !278, file: !192, line: 258, baseType: !163, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !278, file: !192, line: 259, baseType: !163, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !278, file: !192, line: 261, baseType: !6, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !278, file: !192, line: 262, baseType: !6, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !278, file: !192, line: 263, baseType: !6, size: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !278, file: !192, line: 264, baseType: !6, size: 32, offset: 160)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !278, file: !192, line: 265, baseType: !6, size: 32, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !278, file: !192, line: 267, baseType: !6, size: 32, offset: 224)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !278, file: !192, line: 268, baseType: !6, size: 32, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !278, file: !192, line: 269, baseType: !6, size: 32, offset: 288)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !278, file: !192, line: 270, baseType: !6, size: 32, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !278, file: !192, line: 271, baseType: !6, size: 32, offset: 352)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !278, file: !192, line: 272, baseType: !6, size: 32, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !278, file: !192, line: 273, baseType: !6, size: 32, offset: 416)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !278, file: !192, line: 274, baseType: !6, size: 32, offset: 448)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !278, file: !192, line: 275, baseType: !6, size: 32, offset: 480)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !278, file: !192, line: 276, baseType: !6, size: 32, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !278, file: !192, line: 277, baseType: !6, size: 32, offset: 544)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !278, file: !192, line: 278, baseType: !299, size: 32, offset: 576)
!299 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !278, file: !192, line: 279, baseType: !299, size: 32, offset: 608)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !278, file: !192, line: 280, baseType: !6, size: 32, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !278, file: !192, line: 283, baseType: !303, size: 64, offset: 672)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !304)
!304 = !{!305}
!305 = !DISubrange(count: 2)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !278, file: !192, line: 285, baseType: !6, size: 32, offset: 736)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !278, file: !192, line: 286, baseType: !6, size: 32, offset: 768)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !204, file: !192, line: 327, baseType: !309, size: 1152, offset: 3904)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !204, file: !192, line: 290, size: 1152, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !348, !349}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !309, file: !192, line: 292, baseType: !6, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !309, file: !192, line: 294, baseType: !6, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !309, file: !192, line: 295, baseType: !6, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !309, file: !192, line: 296, baseType: !6, size: 32, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !309, file: !192, line: 297, baseType: !6, size: 32, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !309, file: !192, line: 299, baseType: !6, size: 32, offset: 160)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !309, file: !192, line: 300, baseType: !299, size: 32, offset: 192)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !309, file: !192, line: 301, baseType: !299, size: 32, offset: 224)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !309, file: !192, line: 302, baseType: !299, size: 32, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !309, file: !192, line: 303, baseType: !6, size: 32, offset: 288)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !309, file: !192, line: 304, baseType: !6, size: 32, offset: 320)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !309, file: !192, line: 305, baseType: !299, size: 32, offset: 352)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !309, file: !192, line: 306, baseType: !299, size: 32, offset: 384)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !309, file: !192, line: 307, baseType: !299, size: 32, offset: 416)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !309, file: !192, line: 309, baseType: !6, size: 32, offset: 448)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !309, file: !192, line: 310, baseType: !299, size: 32, offset: 480)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !309, file: !192, line: 311, baseType: !6, size: 32, offset: 512)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !309, file: !192, line: 312, baseType: !6, size: 32, offset: 544)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !309, file: !192, line: 315, baseType: !6, size: 32, offset: 576)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !309, file: !192, line: 316, baseType: !150, size: 64, offset: 640)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !309, file: !192, line: 317, baseType: !6, size: 32, offset: 704)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !309, file: !192, line: 318, baseType: !150, size: 64, offset: 768)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !309, file: !192, line: 321, baseType: !299, size: 32, offset: 832)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !309, file: !192, line: 322, baseType: !299, size: 32, offset: 864)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !309, file: !192, line: 323, baseType: !299, size: 32, offset: 896)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !309, file: !192, line: 324, baseType: !337, size: 64, offset: 960)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !192, line: 174, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 167, size: 256, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !339, file: !192, line: 169, baseType: !6, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !339, file: !192, line: 169, baseType: !6, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !339, file: !192, line: 170, baseType: !6, size: 32, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !339, file: !192, line: 171, baseType: !6, size: 32, offset: 96)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !339, file: !192, line: 172, baseType: !299, size: 32, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !339, file: !192, line: 173, baseType: !347, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !309, file: !192, line: 325, baseType: !6, size: 32, offset: 1024)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !309, file: !192, line: 326, baseType: !150, size: 64, offset: 1088)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !204, file: !192, line: 330, baseType: !6, size: 32, offset: 5056)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !204, file: !192, line: 331, baseType: !6, size: 32, offset: 5088)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !204, file: !192, line: 332, baseType: !6, size: 32, offset: 5120)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !204, file: !192, line: 334, baseType: !6, size: 32, offset: 5152)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !204, file: !192, line: 335, baseType: !6, size: 32, offset: 5184)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !204, file: !192, line: 336, baseType: !160, size: 32, offset: 5216)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !204, file: !192, line: 337, baseType: !160, size: 32, offset: 5248)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !204, file: !192, line: 338, baseType: !160, size: 32, offset: 5280)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !204, file: !192, line: 339, baseType: !160, size: 32, offset: 5312)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !204, file: !192, line: 340, baseType: !6, size: 32, offset: 5344)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !204, file: !192, line: 344, baseType: !6, size: 32, offset: 5376)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !204, file: !192, line: 356, baseType: !6, size: 32, offset: 5408)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !204, file: !192, line: 364, baseType: !6, size: 32, offset: 5440)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !204, file: !192, line: 367, baseType: !6, size: 32, offset: 5472)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !204, file: !192, line: 368, baseType: !6, size: 32, offset: 5504)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !204, file: !192, line: 369, baseType: !6, size: 32, offset: 5536)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !204, file: !192, line: 375, baseType: !367, size: 64, offset: 5568)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !5}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "img", scope: !193, file: !192, line: 543, baseType: !371, size: 448, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_image_t", file: !192, line: 511, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 505, size: 448, elements: !373)
!373 = !{!374, !375, !376, !378}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !372, file: !192, line: 507, baseType: !6, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !372, file: !192, line: 508, baseType: !6, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !372, file: !192, line: 509, baseType: !377, size: 128, offset: 64)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, elements: !100)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !372, file: !192, line: 510, baseType: !379, size: 256, offset: 192)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 256, elements: !100)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !193, file: !192, line: 545, baseType: !382, size: 256, offset: 768)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !192, line: 503, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 496, size: 256, elements: !384)
!384 = !{!385, !386, !387, !388}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !383, file: !192, line: 498, baseType: !7, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !383, file: !192, line: 499, baseType: !7, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !383, file: !192, line: 500, baseType: !7, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !383, file: !192, line: 502, baseType: !7, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !193, file: !192, line: 548, baseType: !5, size: 64, offset: 1024)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "read_frame", scope: !144, file: !143, line: 59, baseType: !391, size: 64, offset: 192)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!6, !190, !152, !6}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "release_frame", scope: !144, file: !143, line: 60, baseType: !395, size: 64, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!6, !190, !152}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "picture_clean", scope: !144, file: !143, line: 61, baseType: !399, size: 64, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !190}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "close_file", scope: !144, file: !143, line: 62, baseType: !183, size: 64, offset: 384)
!403 = !{i32 7, !"Dwarf Version", i32 5}
!404 = !{i32 2, !"Debug Info Version", i32 3}
!405 = !{i32 1, !"wchar_size", i32 4}
!406 = !{i32 8, !"PIC Level", i32 2}
!407 = !{i32 7, !"PIE Level", i32 2}
!408 = !{i32 7, !"uwtable", i32 2}
!409 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!410 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!411 = distinct !DISubprogram(name: "open_file", scope: !3, file: !3, line: 384, type: !148, scopeLine: 385, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !476}
!413 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !411, file: !3, line: 384, type: !150)
!414 = !DILocalVariable(name: "p_handle", arg: 2, scope: !411, file: !3, line: 384, type: !151)
!415 = !DILocalVariable(name: "info", arg: 3, scope: !411, file: !3, line: 384, type: !154)
!416 = !DILocalVariable(name: "opt", arg: 4, scope: !411, file: !3, line: 384, type: !174)
!417 = !DILocalVariable(name: "ret", scope: !411, file: !3, line: 386, type: !6)
!418 = !DILocalVariable(name: "tcfile_in", scope: !411, file: !3, line: 387, type: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !421, line: 7, baseType: !422)
!421 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !423, line: 49, size: 1728, elements: !424)
!423 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !440, !442, !443, !444, !446, !448, !450, !454, !457, !459, !462, !465, !466, !467, !471, !472}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !422, file: !423, line: 51, baseType: !6, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !422, file: !423, line: 54, baseType: !150, size: 64, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !422, file: !423, line: 55, baseType: !150, size: 64, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !422, file: !423, line: 56, baseType: !150, size: 64, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !422, file: !423, line: 57, baseType: !150, size: 64, offset: 256)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !422, file: !423, line: 58, baseType: !150, size: 64, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !422, file: !423, line: 59, baseType: !150, size: 64, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !422, file: !423, line: 60, baseType: !150, size: 64, offset: 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !422, file: !423, line: 61, baseType: !150, size: 64, offset: 512)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !422, file: !423, line: 64, baseType: !150, size: 64, offset: 576)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !422, file: !423, line: 65, baseType: !150, size: 64, offset: 640)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !422, file: !423, line: 66, baseType: !150, size: 64, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !422, file: !423, line: 68, baseType: !438, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !423, line: 36, flags: DIFlagFwdDecl)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !422, file: !423, line: 70, baseType: !441, size: 64, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !422, file: !423, line: 72, baseType: !6, size: 32, offset: 896)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !422, file: !423, line: 73, baseType: !6, size: 32, offset: 928)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !422, file: !423, line: 74, baseType: !445, size: 64, offset: 960)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !11, line: 152, baseType: !12)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !422, file: !423, line: 77, baseType: !447, size: 16, offset: 1024)
!447 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !422, file: !423, line: 78, baseType: !449, size: 8, offset: 1040)
!449 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !422, file: !423, line: 79, baseType: !451, size: 8, offset: 1048)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 1)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !422, file: !423, line: 81, baseType: !455, size: 64, offset: 1088)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !423, line: 43, baseType: null)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !422, file: !423, line: 89, baseType: !458, size: 64, offset: 1152)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !11, line: 153, baseType: !12)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !422, file: !423, line: 91, baseType: !460, size: 64, offset: 1216)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !423, line: 37, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !422, file: !423, line: 92, baseType: !463, size: 64, offset: 1280)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !423, line: 38, flags: DIFlagFwdDecl)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !422, file: !423, line: 93, baseType: !441, size: 64, offset: 1344)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !422, file: !423, line: 94, baseType: !5, size: 64, offset: 1408)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !422, file: !423, line: 95, baseType: !468, size: 64, offset: 1472)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !469, line: 18, baseType: !470)
!469 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!470 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !422, file: !423, line: 96, baseType: !6, size: 32, offset: 1536)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !422, file: !423, line: 98, baseType: !473, size: 160, offset: 1568)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 160, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 20)
!476 = !DILocalVariable(name: "h", scope: !411, file: !3, line: 388, type: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "timecode_hnd_t", file: !3, line: 42, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 28, size: 1024, elements: !480)
!480 = !{!481, !482, !483, !484, !485, !486, !489, !490, !491, !492, !494, !495}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !479, file: !3, line: 30, baseType: !142, size: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "p_handle", scope: !479, file: !3, line: 31, baseType: !152, size: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "frame_total", scope: !479, file: !3, line: 32, baseType: !6, size: 32, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "auto_timebase_num", scope: !479, file: !3, line: 33, baseType: !6, size: 32, offset: 544)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "auto_timebase_den", scope: !479, file: !3, line: 34, baseType: !6, size: 32, offset: 576)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_num", scope: !479, file: !3, line: 35, baseType: !487, size: 64, offset: 640)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !161, line: 27, baseType: !488)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !11, line: 45, baseType: !470)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_den", scope: !479, file: !3, line: 36, baseType: !487, size: 64, offset: 704)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !479, file: !3, line: 37, baseType: !6, size: 32, offset: 768)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "stored_pts_num", scope: !479, file: !3, line: 38, baseType: !6, size: 32, offset: 800)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !479, file: !3, line: 39, baseType: !493, size: 64, offset: 832)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "assume_fps", scope: !479, file: !3, line: 40, baseType: !7, size: 64, offset: 896)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "last_timecode", scope: !479, file: !3, line: 41, baseType: !7, size: 64, offset: 960)
!496 = distinct !DIAssignID()
!497 = !DILocalVariable(name: "buff", scope: !498, file: !3, line: 106, type: !547)
!498 = distinct !DISubprogram(name: "parse_tcfile", scope: !3, file: !3, line: 104, type: !499, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !501)
!499 = !DISubroutineType(types: !500)
!500 = !{!6, !419, !477, !154}
!501 = !{!502, !503, !504, !497, !505, !506, !507, !508, !509, !510, !511, !513, !514, !517, !518, !519, !520, !521, !522, !523, !526, !527, !528, !530, !539, !540, !541, !542, !543, !546}
!502 = !DILocalVariable(name: "tcfile_in", arg: 1, scope: !498, file: !3, line: 104, type: !419)
!503 = !DILocalVariable(name: "h", arg: 2, scope: !498, file: !3, line: 104, type: !477)
!504 = !DILocalVariable(name: "info", arg: 3, scope: !498, file: !3, line: 104, type: !154)
!505 = !DILocalVariable(name: "ret", scope: !498, file: !3, line: 107, type: !6)
!506 = !DILocalVariable(name: "tcfv", scope: !498, file: !3, line: 107, type: !6)
!507 = !DILocalVariable(name: "num", scope: !498, file: !3, line: 107, type: !6)
!508 = !DILocalVariable(name: "seq_num", scope: !498, file: !3, line: 107, type: !6)
!509 = !DILocalVariable(name: "timecodes_num", scope: !498, file: !3, line: 107, type: !6)
!510 = !DILocalVariable(name: "pts_seek_offset", scope: !498, file: !3, line: 108, type: !8)
!511 = !DILocalVariable(name: "timecodes", scope: !498, file: !3, line: 109, type: !512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!513 = !DILocalVariable(name: "fpss", scope: !498, file: !3, line: 110, type: !512)
!514 = !DILocalVariable(name: "file_pos", scope: !515, file: !3, line: 121, type: !487)
!515 = distinct !DILexicalBlock(scope: !516, file: !3, line: 120, column: 5)
!516 = distinct !DILexicalBlock(scope: !498, file: !3, line: 119, column: 9)
!517 = !DILocalVariable(name: "assume_fps", scope: !515, file: !3, line: 122, type: !7)
!518 = !DILocalVariable(name: "seq_fps", scope: !515, file: !3, line: 122, type: !7)
!519 = !DILocalVariable(name: "start", scope: !515, file: !3, line: 123, type: !6)
!520 = !DILocalVariable(name: "end", scope: !515, file: !3, line: 123, type: !6)
!521 = !DILocalVariable(name: "prev_start", scope: !515, file: !3, line: 124, type: !6)
!522 = !DILocalVariable(name: "prev_end", scope: !515, file: !3, line: 124, type: !6)
!523 = !DILocalVariable(name: "exponent", scope: !524, file: !3, line: 215, type: !7)
!524 = distinct !DILexicalBlock(scope: !525, file: !3, line: 214, column: 9)
!525 = distinct !DILexicalBlock(scope: !515, file: !3, line: 213, column: 13)
!526 = !DILocalVariable(name: "assume_fps_sig", scope: !524, file: !3, line: 216, type: !7)
!527 = !DILocalVariable(name: "seq_fps_sig", scope: !524, file: !3, line: 216, type: !7)
!528 = !DILocalVariable(name: "file_pos", scope: !529, file: !3, line: 246, type: !487)
!529 = distinct !DILexicalBlock(scope: !516, file: !3, line: 245, column: 5)
!530 = !DILocalVariable(name: "i", scope: !531, file: !3, line: 307, type: !6)
!531 = distinct !DILexicalBlock(scope: !532, file: !3, line: 306, column: 17)
!532 = distinct !DILexicalBlock(scope: !533, file: !3, line: 305, column: 21)
!533 = distinct !DILexicalBlock(scope: !534, file: !3, line: 303, column: 13)
!534 = distinct !DILexicalBlock(scope: !535, file: !3, line: 302, column: 13)
!535 = distinct !DILexicalBlock(scope: !536, file: !3, line: 302, column: 13)
!536 = distinct !DILexicalBlock(scope: !537, file: !3, line: 298, column: 9)
!537 = distinct !DILexicalBlock(scope: !538, file: !3, line: 297, column: 18)
!538 = distinct !DILexicalBlock(scope: !529, file: !3, line: 295, column: 13)
!539 = !DILocalVariable(name: "fps_num", scope: !531, file: !3, line: 308, type: !487)
!540 = !DILocalVariable(name: "fps_den", scope: !531, file: !3, line: 308, type: !487)
