; ModuleID = 'x264_src/input/y4m.c'
source_filename = "x264_src/input/y4m.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cli_input_t = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr }

@y4m_input = dso_local local_unnamed_addr constant %struct.cli_input_t { ptr @open_file, ptr @get_frame_total, ptr @x264_picture_alloc, ptr @read_frame, ptr null, ptr @x264_picture_clean, ptr @close_file }, align 8, !dbg !0
@stdin = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1, !dbg !40
@.str.2 = private unnamed_addr constant [10 x i8] c"YUV4MPEG2\00", align 1, !dbg !45
@.str.4 = private unnamed_addr constant [6 x i8] c"%u:%u\00", align 1, !dbg !53
@.str.5 = private unnamed_addr constant [7 x i8] c"YSCSS=\00", align 1, !dbg !58
@stderr = external local_unnamed_addr global ptr, align 8
@.str.6 = private unnamed_addr constant [35 x i8] c"y4m [error]: colorspace unhandled\0A\00", align 1, !dbg !63
@.str.7 = private unnamed_addr constant [6 x i8] c"FRAME\00", align 1, !dbg !68
@.str.8 = private unnamed_addr constant [43 x i8] c"y4m [error]: bad header magic (%x <=> %s)\0A\00", align 1, !dbg !70
@.str.9 = private unnamed_addr constant [32 x i8] c"y4m [error]: bad frame header!\0A\00", align 1, !dbg !75

; Function Attrs: nounwind uwtable

!17 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !15, file: !14, line: 89, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 26, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !10, line: 42, baseType: !20)
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !15, file: !14, line: 89, baseType: !22, size: 32)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, elements: !26)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !8, line: 25, baseType: !24)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !10, line: 40, baseType: !25)
!25 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!26 = !{!27}
!27 = !DISubrange(count: 2)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !15, file: !14, line: 89, baseType: !29, size: 32)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 32, elements: !33)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !8, line: 24, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !10, line: 38, baseType: !32)
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !{!34}
!34 = !DISubrange(count: 4)
!35 = !{!0, !36, !40, !45, !50, !53, !58, !63, !68, !70, !75}
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(scope: null, file: !3, line: 55, type: !38, isLocal: true, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 16, elements: !26)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(scope: null, file: !3, line: 58, type: !42, isLocal: true, isDefinition: true)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 24, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 3)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(scope: null, file: !3, line: 77, type: !47, isLocal: true, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 80, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 10)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(scope: null, file: !3, line: 98, type: !52, isLocal: true, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 32, elements: !33)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(scope: null, file: !3, line: 125, type: !55, isLocal: true, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 48, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 6)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(scope: null, file: !3, line: 144, type: !60, isLocal: true, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 56, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 7)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(scope: null, file: !3, line: 167, type: !65, isLocal: true, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 280, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 35)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(scope: null, file: !3, line: 205, type: !55, isLocal: true, isDefinition: true)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(scope: null, file: !3, line: 207, type: !72, isLocal: true, isDefinition: true)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 344, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 43)
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(scope: null, file: !3, line: 217, type: !77, isLocal: true, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 256, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 32)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_input_t", file: !82, line: 63, baseType: !83)
!82 = !DIFile(filename: "x264_src/input/input.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "f28c863d273681dfcaca9779e9fcbd53")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 54, size: 448, elements: !84)
!84 = !{!85, !117, !121, !327, !331, !335, !339}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "open_file", scope: !83, file: !82, line: 56, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!6, !89, !90, !93, !109}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "hnd_t", file: !92, line: 30, baseType: !5)
!92 = !DIFile(filename: "x264_src/muxers.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "bcea0820748b2dc47392b7f6393a96ff")
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "video_info_t", file: !82, line: 52, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 38, size: 384, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "csp", scope: !95, file: !82, line: 40, baseType: !6, size: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "fps_num", scope: !95, file: !82, line: 41, baseType: !18, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "fps_den", scope: !95, file: !82, line: 42, baseType: !18, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !95, file: !82, line: 43, baseType: !6, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !95, file: !82, line: 44, baseType: !6, size: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !95, file: !82, line: 45, baseType: !18, size: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !95, file: !82, line: 46, baseType: !18, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tff", scope: !95, file: !82, line: 47, baseType: !6, size: 32, offset: 224)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_num", scope: !95, file: !82, line: 48, baseType: !18, size: 32, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "timebase_den", scope: !95, file: !82, line: 49, baseType: !18, size: 32, offset: 288)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "vfr", scope: !95, file: !82, line: 50, baseType: !6, size: 32, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !95, file: !82, line: 51, baseType: !6, size: 32, offset: 352)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_input_opt_t", file: !82, line: 35, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 29, size: 256, elements: !112)
!112 = !{!113, !114, !115, !116}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !111, file: !82, line: 31, baseType: !89, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "resolution", scope: !111, file: !82, line: 32, baseType: !89, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "timebase", scope: !111, file: !82, line: 33, baseType: !89, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !111, file: !82, line: 34, baseType: !6, size: 32, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "get_frame_total", scope: !83, file: !82, line: 57, baseType: !118, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!6, !91}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "picture_alloc", scope: !83, file: !82, line: 58, baseType: !122, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!6, !125, !6, !6, !6}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_picture_t", file: !127, line: 549, baseType: !128)
!127 = !DIFile(filename: "x264_src/x264.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 513, size: 1088, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !139, !140, !306, !317, !326}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !128, file: !127, line: 521, baseType: !6, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !128, file: !127, line: 523, baseType: !6, size: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !128, file: !127, line: 526, baseType: !6, size: 32, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !128, file: !127, line: 529, baseType: !6, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !128, file: !127, line: 531, baseType: !135, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !136, line: 27, baseType: !137)
!136 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !10, line: 44, baseType: !138)
!138 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !128, file: !127, line: 534, baseType: !135, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !128, file: !127, line: 541, baseType: !141, size: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !127, line: 376, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !127, line: 176, size: 5632, elements: !144)
!144 = !{!145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !190, !191, !192, !193, !197, !198, !211, !212, !213, !214, !215, !244, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !143, file: !127, line: 179, baseType: !20, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !143, file: !127, line: 180, baseType: !6, size: 32, offset: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !143, file: !127, line: 181, baseType: !6, size: 32, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !143, file: !127, line: 182, baseType: !6, size: 32, offset: 96)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !143, file: !127, line: 183, baseType: !6, size: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !143, file: !127, line: 186, baseType: !6, size: 32, offset: 160)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !143, file: !127, line: 187, baseType: !6, size: 32, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !143, file: !127, line: 188, baseType: !6, size: 32, offset: 224)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !143, file: !127, line: 189, baseType: !6, size: 32, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !143, file: !127, line: 190, baseType: !6, size: 32, offset: 288)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !143, file: !127, line: 198, baseType: !6, size: 32, offset: 320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !143, file: !127, line: 215, baseType: !157, size: 288, offset: 352)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !143, file: !127, line: 200, size: 288, elements: !158)
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166, !167}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !157, file: !127, line: 203, baseType: !6, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !157, file: !127, line: 204, baseType: !6, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !157, file: !127, line: 206, baseType: !6, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !157, file: !127, line: 209, baseType: !6, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !157, file: !127, line: 210, baseType: !6, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !157, file: !127, line: 211, baseType: !6, size: 32, offset: 160)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !157, file: !127, line: 212, baseType: !6, size: 32, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !157, file: !127, line: 213, baseType: !6, size: 32, offset: 224)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !157, file: !127, line: 214, baseType: !6, size: 32, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !143, file: !127, line: 218, baseType: !6, size: 32, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !143, file: !127, line: 219, baseType: !6, size: 32, offset: 672)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !143, file: !127, line: 220, baseType: !6, size: 32, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !143, file: !127, line: 221, baseType: !6, size: 32, offset: 736)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !143, file: !127, line: 222, baseType: !6, size: 32, offset: 768)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !143, file: !127, line: 224, baseType: !6, size: 32, offset: 800)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !143, file: !127, line: 225, baseType: !6, size: 32, offset: 832)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !143, file: !127, line: 226, baseType: !6, size: 32, offset: 864)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !143, file: !127, line: 227, baseType: !6, size: 32, offset: 896)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !143, file: !127, line: 229, baseType: !6, size: 32, offset: 928)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !143, file: !127, line: 230, baseType: !6, size: 32, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !143, file: !127, line: 231, baseType: !6, size: 32, offset: 992)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !143, file: !127, line: 233, baseType: !6, size: 32, offset: 1024)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !143, file: !127, line: 234, baseType: !6, size: 32, offset: 1056)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !143, file: !127, line: 236, baseType: !6, size: 32, offset: 1088)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !143, file: !127, line: 237, baseType: !6, size: 32, offset: 1120)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !143, file: !127, line: 239, baseType: !6, size: 32, offset: 1152)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !143, file: !127, line: 240, baseType: !89, size: 64, offset: 1216)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !143, file: !127, line: 241, baseType: !187, size: 128, offset: 1280)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 16)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !143, file: !127, line: 242, baseType: !187, size: 128, offset: 1408)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !143, file: !127, line: 243, baseType: !187, size: 128, offset: 1536)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !143, file: !127, line: 244, baseType: !187, size: 128, offset: 1664)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !143, file: !127, line: 245, baseType: !194, size: 512, offset: 1792)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 512, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !143, file: !127, line: 246, baseType: !194, size: 512, offset: 2304)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !143, file: !127, line: 249, baseType: !199, size: 64, offset: 2816)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !5, !6, !202, !204}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !206)
!206 = !{!207, !208, !209, !210}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !205, file: !3, line: 265, baseType: !20, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !205, file: !3, line: 265, baseType: !20, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !205, file: !3, line: 265, baseType: !5, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !205, file: !3, line: 265, baseType: !5, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !143, file: !127, line: 250, baseType: !5, size: 64, offset: 2880)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !143, file: !127, line: 251, baseType: !6, size: 32, offset: 2944)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !143, file: !127, line: 252, baseType: !6, size: 32, offset: 2976)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !143, file: !127, line: 253, baseType: !89, size: 64, offset: 3008)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !143, file: !127, line: 287, baseType: !216, size: 800, offset: 3072)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !143, file: !127, line: 256, size: 800, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !238, !239, !240, !242, !243}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !216, file: !127, line: 258, baseType: !20, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !216, file: !127, line: 259, baseType: !20, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !216, file: !127, line: 261, baseType: !6, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !216, file: !127, line: 262, baseType: !6, size: 32, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !216, file: !127, line: 263, baseType: !6, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !216, file: !127, line: 264, baseType: !6, size: 32, offset: 160)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !216, file: !127, line: 265, baseType: !6, size: 32, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !216, file: !127, line: 267, baseType: !6, size: 32, offset: 224)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !216, file: !127, line: 268, baseType: !6, size: 32, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !216, file: !127, line: 269, baseType: !6, size: 32, offset: 288)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !216, file: !127, line: 270, baseType: !6, size: 32, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !216, file: !127, line: 271, baseType: !6, size: 32, offset: 352)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !216, file: !127, line: 272, baseType: !6, size: 32, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !216, file: !127, line: 273, baseType: !6, size: 32, offset: 416)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !216, file: !127, line: 274, baseType: !6, size: 32, offset: 448)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !216, file: !127, line: 275, baseType: !6, size: 32, offset: 480)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !216, file: !127, line: 276, baseType: !6, size: 32, offset: 512)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !216, file: !127, line: 277, baseType: !6, size: 32, offset: 544)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !216, file: !127, line: 278, baseType: !237, size: 32, offset: 576)
!237 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !216, file: !127, line: 279, baseType: !237, size: 32, offset: 608)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !216, file: !127, line: 280, baseType: !6, size: 32, offset: 640)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !216, file: !127, line: 283, baseType: !241, size: 64, offset: 672)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 64, elements: !26)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !216, file: !127, line: 285, baseType: !6, size: 32, offset: 736)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !216, file: !127, line: 286, baseType: !6, size: 32, offset: 768)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !143, file: !127, line: 327, baseType: !245, size: 1152, offset: 3904)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !143, file: !127, line: 290, size: 1152, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !284, !285}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !245, file: !127, line: 292, baseType: !6, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !245, file: !127, line: 294, baseType: !6, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !245, file: !127, line: 295, baseType: !6, size: 32, offset: 64)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !245, file: !127, line: 296, baseType: !6, size: 32, offset: 96)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !245, file: !127, line: 297, baseType: !6, size: 32, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !245, file: !127, line: 299, baseType: !6, size: 32, offset: 160)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !245, file: !127, line: 300, baseType: !237, size: 32, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !245, file: !127, line: 301, baseType: !237, size: 32, offset: 224)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !245, file: !127, line: 302, baseType: !237, size: 32, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !245, file: !127, line: 303, baseType: !6, size: 32, offset: 288)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !245, file: !127, line: 304, baseType: !6, size: 32, offset: 320)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !245, file: !127, line: 305, baseType: !237, size: 32, offset: 352)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !245, file: !127, line: 306, baseType: !237, size: 32, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !245, file: !127, line: 307, baseType: !237, size: 32, offset: 416)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !245, file: !127, line: 309, baseType: !6, size: 32, offset: 448)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !245, file: !127, line: 310, baseType: !237, size: 32, offset: 480)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !245, file: !127, line: 311, baseType: !6, size: 32, offset: 512)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !245, file: !127, line: 312, baseType: !6, size: 32, offset: 544)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !245, file: !127, line: 315, baseType: !6, size: 32, offset: 576)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !245, file: !127, line: 316, baseType: !89, size: 64, offset: 640)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !245, file: !127, line: 317, baseType: !6, size: 32, offset: 704)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !245, file: !127, line: 318, baseType: !89, size: 64, offset: 768)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !245, file: !127, line: 321, baseType: !237, size: 32, offset: 832)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !245, file: !127, line: 322, baseType: !237, size: 32, offset: 864)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !245, file: !127, line: 323, baseType: !237, size: 32, offset: 896)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !245, file: !127, line: 324, baseType: !273, size: 64, offset: 960)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !127, line: 174, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 167, size: 256, elements: !276)
!276 = !{!277, !278, !279, !280, !281, !282}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !275, file: !127, line: 169, baseType: !6, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !275, file: !127, line: 169, baseType: !6, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !275, file: !127, line: 170, baseType: !6, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !275, file: !127, line: 171, baseType: !6, size: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !275, file: !127, line: 172, baseType: !237, size: 32, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !275, file: !127, line: 173, baseType: !283, size: 64, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !245, file: !127, line: 325, baseType: !6, size: 32, offset: 1024)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !245, file: !127, line: 326, baseType: !89, size: 64, offset: 1088)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !143, file: !127, line: 330, baseType: !6, size: 32, offset: 5056)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !143, file: !127, line: 331, baseType: !6, size: 32, offset: 5088)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !143, file: !127, line: 332, baseType: !6, size: 32, offset: 5120)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !143, file: !127, line: 334, baseType: !6, size: 32, offset: 5152)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !143, file: !127, line: 335, baseType: !6, size: 32, offset: 5184)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !143, file: !127, line: 336, baseType: !18, size: 32, offset: 5216)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !143, file: !127, line: 337, baseType: !18, size: 32, offset: 5248)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !143, file: !127, line: 338, baseType: !18, size: 32, offset: 5280)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !143, file: !127, line: 339, baseType: !18, size: 32, offset: 5312)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !143, file: !127, line: 340, baseType: !6, size: 32, offset: 5344)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !143, file: !127, line: 344, baseType: !6, size: 32, offset: 5376)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !143, file: !127, line: 356, baseType: !6, size: 32, offset: 5408)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !143, file: !127, line: 364, baseType: !6, size: 32, offset: 5440)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !143, file: !127, line: 367, baseType: !6, size: 32, offset: 5472)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !143, file: !127, line: 368, baseType: !6, size: 32, offset: 5504)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !143, file: !127, line: 369, baseType: !6, size: 32, offset: 5536)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !143, file: !127, line: 375, baseType: !303, size: 64, offset: 5568)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !5}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "img", scope: !128, file: !127, line: 543, baseType: !307, size: 448, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_image_t", file: !127, line: 511, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 505, size: 448, elements: !309)
!309 = !{!310, !311, !312, !314}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !308, file: !127, line: 507, baseType: !6, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !308, file: !127, line: 508, baseType: !6, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !308, file: !127, line: 509, baseType: !313, size: 128, offset: 64)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, elements: !33)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !308, file: !127, line: 510, baseType: !315, size: 256, offset: 192)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 256, elements: !33)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !128, file: !127, line: 545, baseType: !318, size: 256, offset: 768)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !127, line: 503, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 496, size: 256, elements: !320)
!320 = !{!321, !323, !324, !325}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !319, file: !127, line: 498, baseType: !322, size: 64)
!322 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !319, file: !127, line: 499, baseType: !322, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !319, file: !127, line: 500, baseType: !322, size: 64, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !319, file: !127, line: 502, baseType: !322, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !128, file: !127, line: 548, baseType: !5, size: 64, offset: 1024)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "read_frame", scope: !83, file: !82, line: 59, baseType: !328, size: 64, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!6, !125, !91, !6}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "release_frame", scope: !83, file: !82, line: 60, baseType: !332, size: 64, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DISubroutineType(types: !334)
!334 = !{!6, !125, !91}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "picture_clean", scope: !83, file: !82, line: 61, baseType: !336, size: 64, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !125}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "close_file", scope: !83, file: !82, line: 62, baseType: !118, size: 64, offset: 384)
!340 = !{i32 7, !"Dwarf Version", i32 5}
!341 = !{i32 2, !"Debug Info Version", i32 3}
!342 = !{i32 1, !"wchar_size", i32 4}
!343 = !{i32 8, !"PIC Level", i32 2}
!344 = !{i32 7, !"PIE Level", i32 2}
!345 = !{i32 7, !"uwtable", i32 2}
!346 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!347 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!348 = distinct !DISubprogram(name: "open_file", scope: !3, file: !3, line: 40, type: !87, scopeLine: 41, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !349)
!349 = !{!350, !351, !352, !353, !354, !421, !422, !423, !424, !428, !429, !430, !431, !432}
!350 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !348, file: !3, line: 40, type: !89)
!351 = !DILocalVariable(name: "p_handle", arg: 2, scope: !348, file: !3, line: 40, type: !90)
!352 = !DILocalVariable(name: "info", arg: 3, scope: !348, file: !3, line: 40, type: !93)
!353 = !DILocalVariable(name: "opt", arg: 4, scope: !348, file: !3, line: 40, type: !109)
!354 = !DILocalVariable(name: "h", scope: !348, file: !3, line: 42, type: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "y4m_hnd_t", file: !3, line: 33, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 26, size: 256, elements: !358)
!358 = !{!359, !415, !416, !417, !418, !419, !420}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "fh", scope: !357, file: !3, line: 28, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !362, line: 7, baseType: !363)
!362 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !364, line: 49, size: 1728, elements: !365)
!364 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !381, !383, !384, !385, !387, !388, !390, !394, !397, !399, !402, !405, !406, !407, !410, !411}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !363, file: !364, line: 51, baseType: !6, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !363, file: !364, line: 54, baseType: !89, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !363, file: !364, line: 55, baseType: !89, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !363, file: !364, line: 56, baseType: !89, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !363, file: !364, line: 57, baseType: !89, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !363, file: !364, line: 58, baseType: !89, size: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !363, file: !364, line: 59, baseType: !89, size: 64, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !363, file: !364, line: 60, baseType: !89, size: 64, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !363, file: !364, line: 61, baseType: !89, size: 64, offset: 512)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !363, file: !364, line: 64, baseType: !89, size: 64, offset: 576)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !363, file: !364, line: 65, baseType: !89, size: 64, offset: 640)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !363, file: !364, line: 66, baseType: !89, size: 64, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !363, file: !364, line: 68, baseType: !379, size: 64, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !364, line: 36, flags: DIFlagFwdDecl)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !363, file: !364, line: 70, baseType: !382, size: 64, offset: 832)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !363, file: !364, line: 72, baseType: !6, size: 32, offset: 896)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !363, file: !364, line: 73, baseType: !6, size: 32, offset: 928)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !363, file: !364, line: 74, baseType: !386, size: 64, offset: 960)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !10, line: 152, baseType: !138)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !363, file: !364, line: 77, baseType: !25, size: 16, offset: 1024)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !363, file: !364, line: 78, baseType: !389, size: 8, offset: 1040)
!389 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !363, file: !364, line: 79, baseType: !391, size: 8, offset: 1048)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 8, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 1)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !363, file: !364, line: 81, baseType: !395, size: 64, offset: 1088)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !364, line: 43, baseType: null)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !363, file: !364, line: 89, baseType: !398, size: 64, offset: 1152)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !10, line: 153, baseType: !138)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !363, file: !364, line: 91, baseType: !400, size: 64, offset: 1216)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !364, line: 37, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !363, file: !364, line: 92, baseType: !403, size: 64, offset: 1280)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !364, line: 38, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !363, file: !364, line: 93, baseType: !382, size: 64, offset: 1344)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !363, file: !364, line: 94, baseType: !5, size: 64, offset: 1408)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !363, file: !364, line: 95, baseType: !408, size: 64, offset: 1472)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !409, line: 18, baseType: !11)
!409 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !363, file: !364, line: 96, baseType: !6, size: 32, offset: 1536)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !363, file: !364, line: 98, baseType: !412, size: 160, offset: 1568)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 160, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 20)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !357, file: !3, line: 29, baseType: !6, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !357, file: !3, line: 29, baseType: !6, size: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame", scope: !357, file: !3, line: 30, baseType: !6, size: 32, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "seq_header_len", scope: !357, file: !3, line: 31, baseType: !6, size: 32, offset: 160)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "frame_header_len", scope: !357, file: !3, line: 31, baseType: !6, size: 32, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !357, file: !3, line: 32, baseType: !6, size: 32, offset: 224)
!421 = !DILocalVariable(name: "i", scope: !348, file: !3, line: 43, type: !6)
!422 = !DILocalVariable(name: "n", scope: !348, file: !3, line: 44, type: !18)
!423 = !DILocalVariable(name: "d", scope: !348, file: !3, line: 44, type: !18)
!424 = !DILocalVariable(name: "header", scope: !348, file: !3, line: 45, type: !425)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 720, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 90)
!428 = !DILocalVariable(name: "tokend", scope: !348, file: !3, line: 46, type: !89)
!429 = !DILocalVariable(name: "header_end", scope: !348, file: !3, line: 46, type: !89)
!430 = !DILocalVariable(name: "colorspace", scope: !348, file: !3, line: 47, type: !6)
!431 = !DILocalVariable(name: "alt_colorspace", scope: !348, file: !3, line: 48, type: !6)
!432 = !DILocalVariable(name: "tokstart", scope: !433, file: !3, line: 83, type: !89)
!433 = distinct !DILexicalBlock(scope: !348, file: !3, line: 83, column: 5)
!434 = distinct !DIAssignID()
!435 = !DILocation(line: 0, scope: !348)
!436 = distinct !DIAssignID()
!437 = distinct !DIAssignID()
!438 = distinct !DIAssignID()
!439 = !DILocation(line: 42, column: 20, scope: !348)
!440 = !DILocation(line: 44, column: 5, scope: !348)
!441 = !DILocation(line: 45, column: 5, scope: !348)
!442 = !DILocation(line: 46, column: 5, scope: !348)
!443 = !DILocation(line: 49, column: 10, scope: !444)
!444 = distinct !DILexicalBlock(scope: !348, file: !3, line: 49, column: 9)
!445 = !DILocation(line: 49, column: 9, scope: !348)
!446 = !DILocation(line: 52, column: 8, scope: !348)
!447 = !DILocation(line: 52, column: 19, scope: !348)
!448 = !DILocation(line: 53, column: 11, scope: !348)
!449 = !DILocation(line: 53, column: 15, scope: !348)
!450 = !DILocation(line: 55, column: 10, scope: !451)
!451 = distinct !DILexicalBlock(scope: !348, file: !3, line: 55, column: 9)
!452 = !DILocation(line: 55, column: 9, scope: !348)
!453 = !DILocation(line: 56, column: 17, scope: !451)
!454 = !DILocation(line: 56, column: 9, scope: !451)
!455 = !DILocation(line: 58, column: 17, scope: !451)
!456 = !DILocation(line: 0, scope: !451)
!457 = !DILocation(line: 59, column: 15, scope: !458)
!458 = distinct !DILexicalBlock(scope: !348, file: !3, line: 59, column: 9)
!459 = !DILocation(line: 59, column: 9, scope: !348)
!460 = !DILocation(line: 62, column: 8, scope: !348)
!461 = !DILocation(line: 62, column: 25, scope: !348)
!462 = !DILocation(line: 65, column: 5, scope: !463)
!463 = distinct !DILexicalBlock(scope: !348, file: !3, line: 65, column: 5)
!464 = !DILocation(line: 67, column: 21, scope: !465)
!465 = distinct !DILexicalBlock(scope: !466, file: !3, line: 66, column: 5)
!466 = distinct !DILexicalBlock(scope: !463, file: !3, line: 65, column: 5)
!467 = !DILocation(line: 67, column: 9, scope: !465)
!468 = !DILocation(line: 67, column: 19, scope: !465)
!469 = !DILocation(line: 68, column: 23, scope: !470)
!470 = distinct !DILexicalBlock(scope: !465, file: !3, line: 68, column: 13)
!471 = !DILocation(line: 0, scope: !466)
!472 = !DILocation(line: 68, column: 13, scope: !465)
!473 = !DILocation(line: 65, column: 19, scope: !466)
!474 = distinct !{!474, !462, !475}
!475 = !DILocation(line: 76, column: 5, scope: !463)
!476 = !DILocation(line: 72, column: 13, scope: !477)
!477 = distinct !DILexicalBlock(scope: !470, file: !3, line: 69, column: 9)
!478 = !DILocation(line: 72, column: 25, scope: !477)
!479 = !DILocation(line: 73, column: 21, scope: !477)
!480 = !DILocation(line: 73, column: 13, scope: !477)
!481 = !DILocation(line: 73, column: 25, scope: !477)
!482 = !DILocation(line: 77, column: 33, scope: !483)
!483 = distinct !DILexicalBlock(scope: !348, file: !3, line: 77, column: 9)
!484 = !DILocation(line: 77, column: 9, scope: !348)
!485 = !DILocation(line: 72, column: 21, scope: !477)
!486 = !DILocation(line: 81, column: 27, scope: !348)
