; ModuleID = 'x264_src/encoder/cabac.c'
source_filename = "x264_src/encoder/cabac.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@x264_mb_pred_mode4x4_fix = internal unnamed_addr constant [13 x i8] c"\FF\00\01\02\03\04\05\06\07\08\02\02\02", align 1, !dbg !0
@x264_scan8 = internal unnamed_addr constant [27 x i32] [i32 12, i32 13, i32 20, i32 21, i32 14, i32 15, i32 22, i32 23, i32 28, i32 29, i32 36, i32 37, i32 30, i32 31, i32 38, i32 39, i32 9, i32 10, i32 17, i32 18, i32 33, i32 34, i32 41, i32 42, i32 44, i32 46, i32 47], align 16, !dbg !1456
@block_idx_x = internal unnamed_addr constant [16 x i8] c"\00\01\00\01\02\03\02\03\00\01\00\01\02\03\02\03", align 16, !dbg !1486
@block_idx_y = internal unnamed_addr constant [16 x i8] c"\00\00\01\01\00\00\01\01\02\02\03\03\02\02\03\03", align 16, !dbg !1489
@x264_mb_partition_listX_table = internal unnamed_addr constant [2 x [17 x i8]] [[17 x i8] c"\01\01\01\01\00\00\00\00\01\01\01\01\00\00\00\00\00", [17 x i8] c"\00\00\00\00\01\01\01\01\01\01\01\01\00\00\00\00\00"], align 16, !dbg !1491

!92 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!93 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union16_t", file: !38, line: 88, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !38, line: 88, size: 16, elements: !97)
!97 = !{!98, !102}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !96, file: !38, line: 88, baseType: !99, size: 16)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !90, line: 25, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !92, line: 40, baseType: !101)
!101 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !96, file: !38, line: 88, baseType: !103, size: 16)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 16, elements: !107)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !90, line: 24, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !92, line: 38, baseType: !106)
!106 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!107 = !{!108}
!108 = !DISubrange(count: 2)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union32_t", file: !38, line: 89, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !38, line: 89, size: 32, elements: !112)
!112 = !{!113, !116, !118}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !111, file: !38, line: 89, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !90, line: 26, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !92, line: 42, baseType: !7)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !111, file: !38, line: 89, baseType: !117, size: 32)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 32, elements: !107)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !111, file: !38, line: 89, baseType: !119, size: 32)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 32, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 4)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union64_t", file: !38, line: 90, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !38, line: 90, size: 64, elements: !125)
!125 = !{!126, !127, !129, !131}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !124, file: !38, line: 90, baseType: !89, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !124, file: !38, line: 90, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 64, elements: !107)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !124, file: !38, line: 90, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 64, elements: !120)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !124, file: !38, line: 90, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 64, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 8)
!135 = !{!136, !1453, !0, !1456, !1459, !1461, !1486, !1489, !1491, !1494, !1498, !1506, !1511, !1513, !1516, !1521, !1525, !1528, !1530, !1532}
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "i_mb_bits", scope: !138, file: !3, line: 151, type: !1450, isLocal: true, isDefinition: true)
!138 = distinct !DISubprogram(name: "x264_cabac_mb_type", scope: !3, file: !3, line: 70, type: !139, scopeLine: 71, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1434)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !141, !1433}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !143, line: 46, baseType: !144)
!143 = !DIFile(filename: "x264_src/x264.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !38, line: 381, size: 266752, elements: !145)
!145 = !{!146, !315, !319, !320, !321, !322, !323, !324, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !460, !462, !490, !492, !493, !494, !498, !502, !503, !504, !508, !512, !513, !514, !519, !522, !523, !600, !617, !778, !779, !780, !781, !785, !786, !787, !788, !789, !790, !791, !806, !999, !1003, !1064, !1067, !1069, !1070, !1071, !1074, !1079, !1087, !1088, !1096, !1098, !1103, !1179, !1265, !1309, !1331, !1380, !1409}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !144, file: !38, line: 384, baseType: !147, size: 5632)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !143, line: 376, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !143, line: 176, size: 5632, elements: !149)
!149 = !{!150, !151, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !194, !198, !199, !200, !201, !205, !206, !220, !221, !222, !223, !224, !253, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !148, file: !143, line: 179, baseType: !7, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !148, file: !143, line: 180, baseType: !152, size: 32, offset: 32)
!152 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !148, file: !143, line: 181, baseType: !152, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !148, file: !143, line: 182, baseType: !152, size: 32, offset: 96)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !148, file: !143, line: 183, baseType: !152, size: 32, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !148, file: !143, line: 186, baseType: !152, size: 32, offset: 160)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !148, file: !143, line: 187, baseType: !152, size: 32, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !148, file: !143, line: 188, baseType: !152, size: 32, offset: 224)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !148, file: !143, line: 189, baseType: !152, size: 32, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !148, file: !143, line: 190, baseType: !152, size: 32, offset: 288)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !148, file: !143, line: 198, baseType: !152, size: 32, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !148, file: !143, line: 215, baseType: !163, size: 288, offset: 352)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !143, line: 200, size: 288, elements: !164)
!164 = !{!165, !166, !167, !168, !169, !170, !171, !172, !173}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !163, file: !143, line: 203, baseType: !152, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !163, file: !143, line: 204, baseType: !152, size: 32, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !163, file: !143, line: 206, baseType: !152, size: 32, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !163, file: !143, line: 209, baseType: !152, size: 32, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !163, file: !143, line: 210, baseType: !152, size: 32, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !163, file: !143, line: 211, baseType: !152, size: 32, offset: 160)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !163, file: !143, line: 212, baseType: !152, size: 32, offset: 192)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !163, file: !143, line: 213, baseType: !152, size: 32, offset: 224)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !163, file: !143, line: 214, baseType: !152, size: 32, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !148, file: !143, line: 218, baseType: !152, size: 32, offset: 640)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !148, file: !143, line: 219, baseType: !152, size: 32, offset: 672)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !148, file: !143, line: 220, baseType: !152, size: 32, offset: 704)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !148, file: !143, line: 221, baseType: !152, size: 32, offset: 736)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !148, file: !143, line: 222, baseType: !152, size: 32, offset: 768)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !148, file: !143, line: 224, baseType: !152, size: 32, offset: 800)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !148, file: !143, line: 225, baseType: !152, size: 32, offset: 832)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !148, file: !143, line: 226, baseType: !152, size: 32, offset: 864)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !148, file: !143, line: 227, baseType: !152, size: 32, offset: 896)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !148, file: !143, line: 229, baseType: !152, size: 32, offset: 928)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !148, file: !143, line: 230, baseType: !152, size: 32, offset: 960)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !148, file: !143, line: 231, baseType: !152, size: 32, offset: 992)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !148, file: !143, line: 233, baseType: !152, size: 32, offset: 1024)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !148, file: !143, line: 234, baseType: !152, size: 32, offset: 1056)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !148, file: !143, line: 236, baseType: !152, size: 32, offset: 1088)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !148, file: !143, line: 237, baseType: !152, size: 32, offset: 1120)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !148, file: !143, line: 239, baseType: !152, size: 32, offset: 1152)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !148, file: !143, line: 240, baseType: !192, size: 64, offset: 1216)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !148, file: !143, line: 241, baseType: !195, size: 128, offset: 1280)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 128, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !148, file: !143, line: 242, baseType: !195, size: 128, offset: 1408)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !148, file: !143, line: 243, baseType: !195, size: 128, offset: 1536)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !148, file: !143, line: 244, baseType: !195, size: 128, offset: 1664)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !148, file: !143, line: 245, baseType: !202, size: 512, offset: 1792)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 512, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !148, file: !143, line: 246, baseType: !202, size: 512, offset: 2304)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !148, file: !143, line: 249, baseType: !207, size: 64, offset: 2816)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !210, !152, !211, !213}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !215)
!215 = !{!216, !217, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !214, file: !3, baseType: !7, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !214, file: !3, baseType: !7, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !214, file: !3, baseType: !210, size: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !214, file: !3, baseType: !210, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !148, file: !143, line: 250, baseType: !210, size: 64, offset: 2880)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !148, file: !143, line: 251, baseType: !152, size: 32, offset: 2944)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !148, file: !143, line: 252, baseType: !152, size: 32, offset: 2976)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !148, file: !143, line: 253, baseType: !192, size: 64, offset: 3008)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !148, file: !143, line: 287, baseType: !225, size: 800, offset: 3072)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !143, line: 256, size: 800, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !247, !248, !249, !251, !252}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !225, file: !143, line: 258, baseType: !7, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !225, file: !143, line: 259, baseType: !7, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !225, file: !143, line: 261, baseType: !152, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !225, file: !143, line: 262, baseType: !152, size: 32, offset: 96)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !225, file: !143, line: 263, baseType: !152, size: 32, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !225, file: !143, line: 264, baseType: !152, size: 32, offset: 160)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !225, file: !143, line: 265, baseType: !152, size: 32, offset: 192)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !225, file: !143, line: 267, baseType: !152, size: 32, offset: 224)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !225, file: !143, line: 268, baseType: !152, size: 32, offset: 256)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !225, file: !143, line: 269, baseType: !152, size: 32, offset: 288)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !225, file: !143, line: 270, baseType: !152, size: 32, offset: 320)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !225, file: !143, line: 271, baseType: !152, size: 32, offset: 352)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !225, file: !143, line: 272, baseType: !152, size: 32, offset: 384)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !225, file: !143, line: 273, baseType: !152, size: 32, offset: 416)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !225, file: !143, line: 274, baseType: !152, size: 32, offset: 448)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !225, file: !143, line: 275, baseType: !152, size: 32, offset: 480)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !225, file: !143, line: 276, baseType: !152, size: 32, offset: 512)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !225, file: !143, line: 277, baseType: !152, size: 32, offset: 544)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !225, file: !143, line: 278, baseType: !246, size: 32, offset: 576)
!246 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !225, file: !143, line: 279, baseType: !246, size: 32, offset: 608)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !225, file: !143, line: 280, baseType: !152, size: 32, offset: 640)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !225, file: !143, line: 283, baseType: !250, size: 64, offset: 672)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 64, elements: !107)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !225, file: !143, line: 285, baseType: !152, size: 32, offset: 736)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !225, file: !143, line: 286, baseType: !152, size: 32, offset: 768)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !148, file: !143, line: 327, baseType: !254, size: 1152, offset: 3904)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !148, file: !143, line: 290, size: 1152, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !293, !294}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !254, file: !143, line: 292, baseType: !152, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !254, file: !143, line: 294, baseType: !152, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !254, file: !143, line: 295, baseType: !152, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !254, file: !143, line: 296, baseType: !152, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !254, file: !143, line: 297, baseType: !152, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !254, file: !143, line: 299, baseType: !152, size: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !254, file: !143, line: 300, baseType: !246, size: 32, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !254, file: !143, line: 301, baseType: !246, size: 32, offset: 224)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !254, file: !143, line: 302, baseType: !246, size: 32, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !254, file: !143, line: 303, baseType: !152, size: 32, offset: 288)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !254, file: !143, line: 304, baseType: !152, size: 32, offset: 320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !254, file: !143, line: 305, baseType: !246, size: 32, offset: 352)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !254, file: !143, line: 306, baseType: !246, size: 32, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !254, file: !143, line: 307, baseType: !246, size: 32, offset: 416)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !254, file: !143, line: 309, baseType: !152, size: 32, offset: 448)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !254, file: !143, line: 310, baseType: !246, size: 32, offset: 480)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !254, file: !143, line: 311, baseType: !152, size: 32, offset: 512)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !254, file: !143, line: 312, baseType: !152, size: 32, offset: 544)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !254, file: !143, line: 315, baseType: !152, size: 32, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !254, file: !143, line: 316, baseType: !192, size: 64, offset: 640)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !254, file: !143, line: 317, baseType: !152, size: 32, offset: 704)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !254, file: !143, line: 318, baseType: !192, size: 64, offset: 768)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !254, file: !143, line: 321, baseType: !246, size: 32, offset: 832)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !254, file: !143, line: 322, baseType: !246, size: 32, offset: 864)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !254, file: !143, line: 323, baseType: !246, size: 32, offset: 896)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !254, file: !143, line: 324, baseType: !282, size: 64, offset: 960)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !143, line: 174, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 167, size: 256, elements: !285)
!285 = !{!286, !287, !288, !289, !290, !291}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !284, file: !143, line: 169, baseType: !152, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !284, file: !143, line: 169, baseType: !152, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !284, file: !143, line: 170, baseType: !152, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !284, file: !143, line: 171, baseType: !152, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !284, file: !143, line: 172, baseType: !246, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !284, file: !143, line: 173, baseType: !292, size: 64, offset: 192)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !254, file: !143, line: 325, baseType: !152, size: 32, offset: 1024)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !254, file: !143, line: 326, baseType: !192, size: 64, offset: 1088)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !148, file: !143, line: 330, baseType: !152, size: 32, offset: 5056)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !148, file: !143, line: 331, baseType: !152, size: 32, offset: 5088)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !148, file: !143, line: 332, baseType: !152, size: 32, offset: 5120)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !148, file: !143, line: 334, baseType: !152, size: 32, offset: 5152)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !148, file: !143, line: 335, baseType: !152, size: 32, offset: 5184)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !148, file: !143, line: 336, baseType: !114, size: 32, offset: 5216)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !148, file: !143, line: 337, baseType: !114, size: 32, offset: 5248)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !148, file: !143, line: 338, baseType: !114, size: 32, offset: 5280)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !148, file: !143, line: 339, baseType: !114, size: 32, offset: 5312)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !148, file: !143, line: 340, baseType: !152, size: 32, offset: 5344)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !148, file: !143, line: 344, baseType: !152, size: 32, offset: 5376)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !148, file: !143, line: 356, baseType: !152, size: 32, offset: 5408)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !148, file: !143, line: 364, baseType: !152, size: 32, offset: 5440)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !148, file: !143, line: 367, baseType: !152, size: 32, offset: 5472)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !148, file: !143, line: 368, baseType: !152, size: 32, offset: 5504)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !148, file: !143, line: 369, baseType: !152, size: 32, offset: 5536)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !148, file: !143, line: 375, baseType: !312, size: 64, offset: 5568)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !210}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !144, file: !38, line: 386, baseType: !316, size: 8256, offset: 5632)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 8256, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 129)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !144, file: !38, line: 387, baseType: !152, size: 32, offset: 13888)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !144, file: !38, line: 388, baseType: !152, size: 32, offset: 13920)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !144, file: !38, line: 389, baseType: !152, size: 32, offset: 13952)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !144, file: !38, line: 390, baseType: !152, size: 32, offset: 13984)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !144, file: !38, line: 391, baseType: !152, size: 32, offset: 14016)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !144, file: !38, line: 402, baseType: !325, size: 576, offset: 14080)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !144, file: !38, line: 394, size: 576, elements: !326)
!326 = !{!327, !328, !329, !339, !340, !341}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !325, file: !38, line: 396, baseType: !152, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !325, file: !38, line: 397, baseType: !152, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !325, file: !38, line: 398, baseType: !330, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !143, line: 604, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 593, size: 192, elements: !333)
!333 = !{!334, !335, !336, !337}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !332, file: !143, line: 595, baseType: !152, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !332, file: !143, line: 596, baseType: !152, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !332, file: !143, line: 599, baseType: !152, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !332, file: !143, line: 603, baseType: !338, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !325, file: !38, line: 399, baseType: !152, size: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !325, file: !38, line: 400, baseType: !338, size: 64, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !325, file: !38, line: 401, baseType: !342, size: 320, offset: 256)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !343, line: 56, baseType: !344)
!343 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !343, line: 47, size: 320, elements: !345)
!345 = !{!346, !347, !348, !349, !353, !354}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !344, file: !343, line: 49, baseType: !338, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !344, file: !343, line: 50, baseType: !338, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !344, file: !343, line: 51, baseType: !338, size: 64, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !344, file: !343, line: 53, baseType: !350, size: 64, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !351, line: 87, baseType: !352)
!351 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!352 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !344, file: !343, line: 54, baseType: !152, size: 32, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !344, file: !343, line: 55, baseType: !152, size: 32, offset: 288)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !144, file: !38, line: 404, baseType: !338, size: 64, offset: 14656)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !144, file: !38, line: 405, baseType: !152, size: 32, offset: 14720)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !144, file: !38, line: 410, baseType: !152, size: 32, offset: 14752)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !144, file: !38, line: 411, baseType: !152, size: 32, offset: 14784)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !144, file: !38, line: 413, baseType: !152, size: 32, offset: 14816)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !144, file: !38, line: 415, baseType: !152, size: 32, offset: 14848)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !144, file: !38, line: 416, baseType: !152, size: 32, offset: 14880)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !144, file: !38, line: 418, baseType: !152, size: 32, offset: 14912)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !144, file: !38, line: 419, baseType: !152, size: 32, offset: 14944)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !144, file: !38, line: 420, baseType: !152, size: 32, offset: 14976)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !144, file: !38, line: 421, baseType: !152, size: 32, offset: 15008)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !144, file: !38, line: 422, baseType: !152, size: 32, offset: 15040)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !144, file: !38, line: 424, baseType: !152, size: 32, offset: 15072)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !144, file: !38, line: 425, baseType: !152, size: 32, offset: 15104)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !144, file: !38, line: 427, baseType: !152, size: 32, offset: 15136)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !144, file: !38, line: 430, baseType: !371, size: 10400, offset: 15168)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 10400, elements: !458)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !373, line: 154, baseType: !374)
!373 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 52, size: 10400, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !393, !394, !395, !396, !397, !398, !399, !400, !401, !408, !409, !457}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !374, file: !373, line: 54, baseType: !152, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !374, file: !373, line: 56, baseType: !152, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !374, file: !373, line: 57, baseType: !152, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !374, file: !373, line: 59, baseType: !152, size: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !374, file: !373, line: 60, baseType: !152, size: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !374, file: !373, line: 61, baseType: !152, size: 32, offset: 160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !374, file: !373, line: 63, baseType: !152, size: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !374, file: !373, line: 65, baseType: !152, size: 32, offset: 224)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !374, file: !373, line: 67, baseType: !152, size: 32, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !374, file: !373, line: 69, baseType: !152, size: 32, offset: 288)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !374, file: !373, line: 70, baseType: !152, size: 32, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !374, file: !373, line: 71, baseType: !152, size: 32, offset: 352)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !374, file: !373, line: 72, baseType: !152, size: 32, offset: 384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !374, file: !373, line: 73, baseType: !390, size: 8192, offset: 416)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 8192, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 256)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !374, file: !373, line: 75, baseType: !152, size: 32, offset: 8608)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !374, file: !373, line: 76, baseType: !152, size: 32, offset: 8640)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !374, file: !373, line: 77, baseType: !152, size: 32, offset: 8672)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !374, file: !373, line: 78, baseType: !152, size: 32, offset: 8704)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !374, file: !373, line: 79, baseType: !152, size: 32, offset: 8736)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !374, file: !373, line: 80, baseType: !152, size: 32, offset: 8768)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !374, file: !373, line: 81, baseType: !152, size: 32, offset: 8800)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !374, file: !373, line: 83, baseType: !152, size: 32, offset: 8832)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !374, file: !373, line: 90, baseType: !402, size: 128, offset: 8864)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !374, file: !373, line: 84, size: 128, elements: !403)
!403 = !{!404, !405, !406, !407}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !402, file: !373, line: 86, baseType: !152, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !402, file: !373, line: 87, baseType: !152, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !402, file: !373, line: 88, baseType: !152, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !402, file: !373, line: 89, baseType: !152, size: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !374, file: !373, line: 92, baseType: !152, size: 32, offset: 8992)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !374, file: !373, line: 150, baseType: !410, size: 1344, offset: 9024)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !374, file: !373, line: 93, size: 1344, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !448, !449, !450, !451, !452, !453, !454, !455, !456}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !410, file: !373, line: 95, baseType: !152, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !410, file: !373, line: 96, baseType: !152, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !410, file: !373, line: 97, baseType: !152, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !410, file: !373, line: 99, baseType: !152, size: 32, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !410, file: !373, line: 100, baseType: !152, size: 32, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !410, file: !373, line: 102, baseType: !152, size: 32, offset: 160)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !410, file: !373, line: 103, baseType: !152, size: 32, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !410, file: !373, line: 104, baseType: !152, size: 32, offset: 224)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !410, file: !373, line: 105, baseType: !152, size: 32, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !410, file: !373, line: 106, baseType: !152, size: 32, offset: 288)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !410, file: !373, line: 107, baseType: !152, size: 32, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !410, file: !373, line: 108, baseType: !152, size: 32, offset: 352)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !410, file: !373, line: 110, baseType: !152, size: 32, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !410, file: !373, line: 111, baseType: !152, size: 32, offset: 416)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !410, file: !373, line: 112, baseType: !152, size: 32, offset: 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !410, file: !373, line: 114, baseType: !152, size: 32, offset: 480)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !410, file: !373, line: 115, baseType: !114, size: 32, offset: 512)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !410, file: !373, line: 116, baseType: !114, size: 32, offset: 544)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !410, file: !373, line: 117, baseType: !152, size: 32, offset: 576)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !410, file: !373, line: 119, baseType: !152, size: 32, offset: 608)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !410, file: !373, line: 120, baseType: !152, size: 32, offset: 640)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !410, file: !373, line: 137, baseType: !434, size: 384, offset: 672)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !410, file: !373, line: 122, size: 384, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !434, file: !373, line: 124, baseType: !152, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !434, file: !373, line: 125, baseType: !152, size: 32, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !434, file: !373, line: 126, baseType: !152, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !434, file: !373, line: 127, baseType: !152, size: 32, offset: 96)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !434, file: !373, line: 128, baseType: !152, size: 32, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !434, file: !373, line: 129, baseType: !152, size: 32, offset: 160)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !434, file: !373, line: 130, baseType: !152, size: 32, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !434, file: !373, line: 131, baseType: !152, size: 32, offset: 224)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !434, file: !373, line: 133, baseType: !152, size: 32, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !434, file: !373, line: 134, baseType: !152, size: 32, offset: 288)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !434, file: !373, line: 135, baseType: !152, size: 32, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !434, file: !373, line: 136, baseType: !152, size: 32, offset: 352)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !410, file: !373, line: 139, baseType: !152, size: 32, offset: 1056)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !410, file: !373, line: 140, baseType: !152, size: 32, offset: 1088)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !410, file: !373, line: 141, baseType: !152, size: 32, offset: 1120)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !410, file: !373, line: 142, baseType: !152, size: 32, offset: 1152)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !410, file: !373, line: 143, baseType: !152, size: 32, offset: 1184)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !410, file: !373, line: 144, baseType: !152, size: 32, offset: 1216)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !410, file: !373, line: 145, baseType: !152, size: 32, offset: 1248)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !410, file: !373, line: 146, baseType: !152, size: 32, offset: 1280)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !410, file: !373, line: 147, baseType: !152, size: 32, offset: 1312)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !374, file: !373, line: 152, baseType: !152, size: 32, offset: 10368)
!458 = !{!459}
!459 = !DISubrange(count: 1)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !144, file: !38, line: 431, baseType: !461, size: 64, offset: 25600)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !144, file: !38, line: 432, baseType: !463, size: 960, offset: 25664)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 960, elements: !458)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !373, line: 186, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 156, size: 960, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !465, file: !373, line: 158, baseType: !152, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !465, file: !373, line: 159, baseType: !152, size: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !465, file: !373, line: 161, baseType: !152, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !465, file: !373, line: 163, baseType: !152, size: 32, offset: 96)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !465, file: !373, line: 164, baseType: !152, size: 32, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !465, file: !373, line: 166, baseType: !152, size: 32, offset: 160)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !465, file: !373, line: 167, baseType: !152, size: 32, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !465, file: !373, line: 169, baseType: !152, size: 32, offset: 224)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !465, file: !373, line: 170, baseType: !152, size: 32, offset: 256)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !465, file: !373, line: 172, baseType: !152, size: 32, offset: 288)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !465, file: !373, line: 173, baseType: !152, size: 32, offset: 320)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !465, file: !373, line: 175, baseType: !152, size: 32, offset: 352)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !465, file: !373, line: 177, baseType: !152, size: 32, offset: 384)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !465, file: !373, line: 178, baseType: !152, size: 32, offset: 416)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !465, file: !373, line: 179, baseType: !152, size: 32, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !465, file: !373, line: 181, baseType: !152, size: 32, offset: 480)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !465, file: !373, line: 183, baseType: !152, size: 32, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !465, file: !373, line: 184, baseType: !485, size: 384, offset: 576)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 384, elements: !488)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!488 = !{!489}
!489 = !DISubrange(count: 6)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !144, file: !38, line: 433, baseType: !491, size: 64, offset: 26624)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !144, file: !38, line: 434, baseType: !152, size: 32, offset: 26688)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !144, file: !38, line: 437, baseType: !152, size: 32, offset: 26720)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !144, file: !38, line: 440, baseType: !495, size: 256, offset: 26752)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !496, size: 256, elements: !120)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 512, elements: !196)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !144, file: !38, line: 441, baseType: !499, size: 128, offset: 27008)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 128, elements: !107)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 2048, elements: !203)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !144, file: !38, line: 443, baseType: !495, size: 256, offset: 27136)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !144, file: !38, line: 444, baseType: !499, size: 128, offset: 27392)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !144, file: !38, line: 446, baseType: !505, size: 256, offset: 27520)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 256, elements: !120)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 256, elements: !196)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !144, file: !38, line: 447, baseType: !509, size: 128, offset: 27776)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 128, elements: !107)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 1024, elements: !203)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !144, file: !38, line: 448, baseType: !505, size: 256, offset: 27904)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !144, file: !38, line: 449, baseType: !509, size: 128, offset: 28160)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !144, file: !38, line: 454, baseType: !515, size: 5888, offset: 28288)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 5888, elements: !517)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!517 = !{!518}
!518 = !DISubrange(count: 92)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !144, file: !38, line: 455, baseType: !520, size: 23552, offset: 34176)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 23552, elements: !521)
!521 = !{!518, !121}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !144, file: !38, line: 457, baseType: !486, size: 64, offset: 57728)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !144, file: !38, line: 460, baseType: !524, size: 53376, offset: 57856)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !38, line: 364, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !38, line: 302, size: 53376, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !555, !584, !585, !586, !592, !593, !594, !595, !596, !597, !598, !599}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !525, file: !38, line: 304, baseType: !461, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !525, file: !38, line: 305, baseType: !491, size: 64, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !525, file: !38, line: 307, baseType: !152, size: 32, offset: 128)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !525, file: !38, line: 308, baseType: !152, size: 32, offset: 160)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !525, file: !38, line: 309, baseType: !152, size: 32, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !525, file: !38, line: 311, baseType: !152, size: 32, offset: 224)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !525, file: !38, line: 313, baseType: !152, size: 32, offset: 256)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !525, file: !38, line: 315, baseType: !152, size: 32, offset: 288)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !525, file: !38, line: 316, baseType: !152, size: 32, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !525, file: !38, line: 317, baseType: !152, size: 32, offset: 352)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !525, file: !38, line: 319, baseType: !152, size: 32, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !525, file: !38, line: 321, baseType: !152, size: 32, offset: 416)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !525, file: !38, line: 322, baseType: !152, size: 32, offset: 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !525, file: !38, line: 324, baseType: !250, size: 64, offset: 480)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !525, file: !38, line: 325, baseType: !152, size: 32, offset: 544)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !525, file: !38, line: 327, baseType: !152, size: 32, offset: 576)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !525, file: !38, line: 329, baseType: !152, size: 32, offset: 608)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !525, file: !38, line: 330, baseType: !152, size: 32, offset: 640)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !525, file: !38, line: 331, baseType: !152, size: 32, offset: 672)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !525, file: !38, line: 333, baseType: !152, size: 32, offset: 704)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !525, file: !38, line: 334, baseType: !152, size: 32, offset: 736)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !525, file: !38, line: 339, baseType: !549, size: 2048, offset: 768)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 2048, elements: !554)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !525, file: !38, line: 335, size: 64, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !550, file: !38, line: 337, baseType: !152, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !550, file: !38, line: 338, baseType: !152, size: 32, offset: 32)
!554 = !{!108, !197}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !525, file: !38, line: 342, baseType: !556, size: 49152, align: 128, offset: 2816)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 49152, align: 128, elements: !581)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !558, line: 36, baseType: !559, align: 128)
!558 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !558, line: 26, size: 512, elements: !560)
!560 = !{!561, !567, !568, !571, !572, !573}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !559, file: !558, line: 30, baseType: !562, size: 128, align: 128)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 128, elements: !133)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !564, line: 25, baseType: !565)
!564 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !92, line: 39, baseType: !566)
!566 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !559, file: !558, line: 31, baseType: !562, size: 128, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !559, file: !558, line: 32, baseType: !569, size: 32, offset: 256)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !564, line: 26, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !92, line: 41, baseType: !152)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !559, file: !558, line: 33, baseType: !569, size: 32, offset: 288)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !559, file: !558, line: 34, baseType: !569, size: 32, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !559, file: !558, line: 35, baseType: !574, size: 64, offset: 384)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !558, line: 25, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !338, !152, !338, !152, !579, !152}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!581 = !{!582, !583}
!582 = !DISubrange(count: 32)
!583 = !DISubrange(count: 3)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !525, file: !38, line: 344, baseType: !152, size: 32, offset: 51968)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !525, file: !38, line: 345, baseType: !152, size: 32, offset: 52000)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !525, file: !38, line: 350, baseType: !587, size: 1024, offset: 52032)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 1024, elements: !196)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !525, file: !38, line: 346, size: 64, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !588, file: !38, line: 348, baseType: !152, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !588, file: !38, line: 349, baseType: !152, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !525, file: !38, line: 352, baseType: !152, size: 32, offset: 53056)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !525, file: !38, line: 354, baseType: !152, size: 32, offset: 53088)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !525, file: !38, line: 355, baseType: !152, size: 32, offset: 53120)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !525, file: !38, line: 356, baseType: !152, size: 32, offset: 53152)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !525, file: !38, line: 357, baseType: !152, size: 32, offset: 53184)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !525, file: !38, line: 360, baseType: !152, size: 32, offset: 53216)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !525, file: !38, line: 361, baseType: !152, size: 32, offset: 53248)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !525, file: !38, line: 362, baseType: !152, size: 32, offset: 53280)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !144, file: !38, line: 463, baseType: !601, size: 4096, offset: 111232)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !602, line: 46, baseType: !603)
!602 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !602, line: 27, size: 4096, elements: !604)
!604 = !{!605, !606, !607, !608, !609, !610, !611, !612, !613}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !603, file: !602, line: 30, baseType: !152, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !603, file: !602, line: 31, baseType: !152, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !603, file: !602, line: 34, baseType: !152, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !603, file: !602, line: 35, baseType: !152, size: 32, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !603, file: !602, line: 37, baseType: !338, size: 64, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !603, file: !602, line: 38, baseType: !338, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !603, file: !602, line: 39, baseType: !338, size: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !603, file: !602, line: 42, baseType: !152, size: 32, align: 128, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !603, file: !602, line: 45, baseType: !614, size: 3680, offset: 416)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 3680, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 460)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !144, file: !38, line: 494, baseType: !618, size: 2112, offset: 115328)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !144, file: !38, line: 465, size: 2112, elements: !619)
!619 = !{!620, !758, !760, !761, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !774, !775, !776, !777}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !618, file: !38, line: 468, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !624, line: 146, baseType: !625)
!624 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !624, line: 31, size: 125056, elements: !626)
!626 = !{!627, !628, !629, !630, !633, !634, !635, !636, !637, !638, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !657, !658, !659, !660, !661, !662, !664, !666, !667, !668, !669, !670, !673, !675, !676, !678, !683, !684, !688, !689, !693, !697, !700, !702, !703, !705, !706, !708, !709, !710, !713, !715, !716, !717, !719, !720, !721, !722, !723, !724, !725, !726, !728, !729, !730, !739, !743, !745, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !625, file: !624, line: 34, baseType: !152, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !625, file: !624, line: 35, baseType: !152, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !625, file: !624, line: 36, baseType: !152, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !625, file: !624, line: 37, baseType: !631, size: 64, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !564, line: 27, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !92, line: 44, baseType: !352)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !625, file: !624, line: 38, baseType: !631, size: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !625, file: !624, line: 39, baseType: !152, size: 32, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !625, file: !624, line: 40, baseType: !152, size: 32, offset: 288)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !625, file: !624, line: 41, baseType: !152, size: 32, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !625, file: !624, line: 42, baseType: !152, size: 32, offset: 352)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !625, file: !624, line: 43, baseType: !639, size: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !625, file: !624, line: 45, baseType: !152, size: 32, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !625, file: !624, line: 46, baseType: !152, size: 32, offset: 480)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !625, file: !624, line: 47, baseType: !152, size: 32, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !625, file: !624, line: 48, baseType: !152, size: 32, offset: 544)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !625, file: !624, line: 49, baseType: !152, size: 32, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !625, file: !624, line: 50, baseType: !152, size: 32, offset: 608)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !625, file: !624, line: 51, baseType: !152, size: 32, offset: 640)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !625, file: !624, line: 52, baseType: !104, size: 8, offset: 672)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !625, file: !624, line: 53, baseType: !104, size: 8, offset: 680)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !625, file: !624, line: 54, baseType: !104, size: 8, offset: 688)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !625, file: !624, line: 55, baseType: !246, size: 32, offset: 704)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !625, file: !624, line: 56, baseType: !246, size: 32, offset: 736)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !625, file: !624, line: 57, baseType: !152, size: 32, offset: 768)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !625, file: !624, line: 60, baseType: !152, size: 32, offset: 800)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !625, file: !624, line: 61, baseType: !655, size: 96, offset: 832)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 96, elements: !656)
!656 = !{!583}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !625, file: !624, line: 62, baseType: !655, size: 96, offset: 928)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !625, file: !624, line: 63, baseType: !655, size: 96, offset: 1024)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !625, file: !624, line: 64, baseType: !152, size: 32, offset: 1120)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !625, file: !624, line: 65, baseType: !152, size: 32, offset: 1152)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !625, file: !624, line: 66, baseType: !152, size: 32, offset: 1184)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !625, file: !624, line: 67, baseType: !663, size: 192, offset: 1216)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 192, elements: !656)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !625, file: !624, line: 68, baseType: !665, size: 256, offset: 1408)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 256, elements: !120)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !625, file: !624, line: 69, baseType: !665, size: 256, offset: 1664)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !625, file: !624, line: 70, baseType: !516, size: 64, offset: 1920)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !625, file: !624, line: 74, baseType: !665, size: 256, offset: 1984)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !625, file: !624, line: 75, baseType: !665, size: 256, offset: 2240)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !625, file: !624, line: 77, baseType: !671, size: 24576, align: 128, offset: 2560)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !557, size: 24576, align: 128, elements: !672)
!672 = !{!197, !583}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !625, file: !624, line: 78, baseType: !674, size: 1024, offset: 27136)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 1024, elements: !196)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !625, file: !624, line: 79, baseType: !152, size: 32, offset: 28160)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !625, file: !624, line: 80, baseType: !677, size: 64, offset: 28224)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !625, file: !624, line: 83, baseType: !679, size: 64, offset: 28288)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !564, line: 24, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !92, line: 37, baseType: !682)
!682 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !625, file: !624, line: 84, baseType: !338, size: 64, offset: 28352)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !625, file: !624, line: 85, baseType: !685, size: 128, offset: 28416)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 128, elements: !107)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 32, elements: !107)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !625, file: !624, line: 86, baseType: !686, size: 64, offset: 28544)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !625, file: !624, line: 87, baseType: !690, size: 2176, offset: 28608)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 2176, elements: !691)
!691 = !{!108, !692}
!692 = !DISubrange(count: 17)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !625, file: !624, line: 92, baseType: !694, size: 20736, offset: 30784)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, size: 20736, elements: !695)
!695 = !{!696, !696}
!696 = !DISubrange(count: 18)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !625, file: !624, line: 96, baseType: !698, size: 2176, offset: 51520)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 2176, elements: !691)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !625, file: !624, line: 97, baseType: !701, size: 128, offset: 53696)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 128, elements: !107)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !625, file: !624, line: 98, baseType: !250, size: 64, offset: 53824)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !625, file: !624, line: 99, baseType: !704, size: 1024, offset: 53888)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 1024, elements: !554)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !625, file: !624, line: 100, baseType: !687, size: 32, offset: 54912)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !625, file: !624, line: 105, baseType: !707, size: 10368, offset: 54944)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 10368, elements: !695)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !625, file: !624, line: 106, baseType: !707, size: 10368, offset: 65312)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !625, file: !624, line: 107, baseType: !152, size: 32, offset: 75680)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !625, file: !624, line: 108, baseType: !711, size: 576, offset: 75712)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 576, elements: !712)
!712 = !{!696}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !625, file: !624, line: 109, baseType: !714, size: 20736, offset: 76288)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 20736, elements: !695)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !625, file: !624, line: 110, baseType: !699, size: 64, offset: 97024)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !625, file: !624, line: 111, baseType: !699, size: 64, offset: 97088)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !625, file: !624, line: 112, baseType: !718, size: 64, offset: 97152)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !625, file: !624, line: 113, baseType: !718, size: 64, offset: 97216)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !625, file: !624, line: 114, baseType: !718, size: 64, offset: 97280)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !625, file: !624, line: 115, baseType: !152, size: 32, offset: 97344)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !625, file: !624, line: 116, baseType: !516, size: 64, offset: 97408)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !625, file: !624, line: 117, baseType: !516, size: 64, offset: 97472)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !625, file: !624, line: 118, baseType: !516, size: 64, offset: 97536)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !625, file: !624, line: 119, baseType: !152, size: 32, offset: 97600)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !625, file: !624, line: 120, baseType: !727, size: 576, offset: 97632)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 576, elements: !712)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !625, file: !624, line: 121, baseType: !114, size: 32, offset: 98208)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !625, file: !624, line: 122, baseType: !89, size: 64, offset: 98240)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !625, file: !624, line: 125, baseType: !731, size: 256, offset: 98304)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !143, line: 503, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !143, line: 496, size: 256, elements: !733)
!733 = !{!734, !736, !737, !738}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !732, file: !143, line: 498, baseType: !735, size: 64)
!735 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !732, file: !143, line: 499, baseType: !735, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !732, file: !143, line: 500, baseType: !735, size: 64, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !732, file: !143, line: 502, baseType: !735, size: 64, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !625, file: !624, line: 128, baseType: !740, size: 2008, offset: 98560)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 2008, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 251)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !625, file: !624, line: 129, baseType: !744, size: 8032, offset: 100576)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 8032, elements: !741)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !625, file: !624, line: 130, baseType: !746, size: 16064, offset: 108608)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 16064, elements: !741)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !625, file: !624, line: 131, baseType: !152, size: 32, offset: 124672)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !625, file: !624, line: 132, baseType: !152, size: 32, offset: 124704)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !625, file: !624, line: 135, baseType: !152, size: 32, offset: 124736)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !625, file: !624, line: 136, baseType: !152, size: 32, offset: 124768)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !625, file: !624, line: 137, baseType: !152, size: 32, offset: 124800)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !625, file: !624, line: 138, baseType: !152, size: 32, offset: 124832)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !625, file: !624, line: 139, baseType: !152, size: 32, offset: 124864)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !625, file: !624, line: 142, baseType: !246, size: 32, offset: 124896)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !625, file: !624, line: 143, baseType: !152, size: 32, offset: 124928)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !625, file: !624, line: 144, baseType: !152, size: 32, offset: 124960)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !625, file: !624, line: 145, baseType: !152, size: 32, offset: 124992)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !618, file: !38, line: 470, baseType: !759, size: 128, offset: 64)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 128, elements: !107)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !618, file: !38, line: 473, baseType: !621, size: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !618, file: !38, line: 476, baseType: !762, size: 1152, offset: 256)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 1152, elements: !712)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !618, file: !38, line: 478, baseType: !152, size: 32, offset: 1408)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !618, file: !38, line: 480, baseType: !152, size: 32, offset: 1440)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !618, file: !38, line: 482, baseType: !152, size: 32, offset: 1472)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !618, file: !38, line: 483, baseType: !152, size: 32, offset: 1504)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !618, file: !38, line: 484, baseType: !152, size: 32, offset: 1536)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !618, file: !38, line: 485, baseType: !152, size: 32, offset: 1568)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !618, file: !38, line: 486, baseType: !152, size: 32, offset: 1600)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !618, file: !38, line: 487, baseType: !631, size: 64, offset: 1664)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !618, file: !38, line: 488, baseType: !631, size: 64, offset: 1728)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !618, file: !38, line: 489, baseType: !773, size: 128, offset: 1792)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 128, elements: !107)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !618, file: !38, line: 490, baseType: !631, size: 64, offset: 1920)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !618, file: !38, line: 491, baseType: !631, size: 64, offset: 1984)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !618, file: !38, line: 492, baseType: !152, size: 32, offset: 2048)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !618, file: !38, line: 493, baseType: !152, size: 32, offset: 2080)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !144, file: !38, line: 497, baseType: !622, size: 64, offset: 117440)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !144, file: !38, line: 500, baseType: !622, size: 64, offset: 117504)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !144, file: !38, line: 503, baseType: !152, size: 32, offset: 117568)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !144, file: !38, line: 504, baseType: !782, size: 1216, offset: 117632)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 1216, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 19)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !144, file: !38, line: 505, baseType: !152, size: 32, offset: 118848)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !144, file: !38, line: 506, baseType: !782, size: 1216, offset: 118912)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !144, file: !38, line: 507, baseType: !250, size: 64, offset: 120128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !144, file: !38, line: 510, baseType: !152, size: 32, offset: 120192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !144, file: !38, line: 511, baseType: !152, size: 32, offset: 120224)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !144, file: !38, line: 512, baseType: !631, size: 64, offset: 120256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !144, file: !38, line: 522, baseType: !792, size: 10624, offset: 120320)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !144, file: !38, line: 515, size: 10624, elements: !793)
!793 = !{!794, !796, !799, !802}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !792, file: !38, line: 517, baseType: !795, size: 256, align: 128)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 256, elements: !196)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !792, file: !38, line: 518, baseType: !797, size: 128, align: 128, offset: 256)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 128, elements: !798)
!798 = !{!108, !121}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !792, file: !38, line: 520, baseType: !800, size: 4096, align: 128, offset: 384)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 4096, elements: !801)
!801 = !{!121, !204}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !792, file: !38, line: 521, baseType: !803, size: 6144, align: 128, offset: 4480)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 6144, elements: !804)
!804 = !{!805, !197}
!805 = !DISubrange(count: 24)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !144, file: !38, line: 732, baseType: !807, size: 82688, offset: 130944)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !144, file: !38, line: 525, size: 82688, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !836, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !854, !857, !861, !862, !863, !868, !869, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !937, !968, !969, !970, !971, !972, !973, !974, !975, !976, !979, !980, !981, !984, !987, !989, !992, !994, !995}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !807, file: !38, line: 527, baseType: !152, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !807, file: !38, line: 530, baseType: !152, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !807, file: !38, line: 531, baseType: !152, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !807, file: !38, line: 532, baseType: !152, size: 32, offset: 96)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !807, file: !38, line: 535, baseType: !152, size: 32, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !807, file: !38, line: 536, baseType: !152, size: 32, offset: 160)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !807, file: !38, line: 537, baseType: !152, size: 32, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !807, file: !38, line: 538, baseType: !152, size: 32, offset: 224)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !807, file: !38, line: 539, baseType: !152, size: 32, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !807, file: !38, line: 542, baseType: !152, size: 32, offset: 288)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !807, file: !38, line: 543, baseType: !152, size: 32, offset: 320)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !807, file: !38, line: 544, baseType: !152, size: 32, offset: 352)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !807, file: !38, line: 545, baseType: !152, size: 32, offset: 384)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !807, file: !38, line: 546, baseType: !152, size: 32, offset: 416)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !807, file: !38, line: 547, baseType: !152, size: 32, offset: 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !807, file: !38, line: 548, baseType: !152, size: 32, offset: 480)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !807, file: !38, line: 549, baseType: !152, size: 32, offset: 512)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !807, file: !38, line: 551, baseType: !152, size: 32, offset: 544)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !807, file: !38, line: 554, baseType: !250, size: 64, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !807, file: !38, line: 555, baseType: !250, size: 64, offset: 640)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !807, file: !38, line: 558, baseType: !250, size: 64, offset: 704)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !807, file: !38, line: 559, baseType: !250, size: 64, offset: 768)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !807, file: !38, line: 561, baseType: !250, size: 64, offset: 832)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !807, file: !38, line: 562, baseType: !250, size: 64, offset: 896)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !807, file: !38, line: 565, baseType: !7, size: 32, offset: 960)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !807, file: !38, line: 566, baseType: !835, size: 128, offset: 992)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !120)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !807, file: !38, line: 567, baseType: !837, size: 512, offset: 1120)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !196)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !807, file: !38, line: 568, baseType: !7, size: 32, offset: 1632)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !807, file: !38, line: 569, baseType: !7, size: 32, offset: 1664)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !807, file: !38, line: 570, baseType: !152, size: 32, offset: 1696)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !807, file: !38, line: 571, baseType: !152, size: 32, offset: 1728)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !807, file: !38, line: 572, baseType: !152, size: 32, offset: 1760)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !807, file: !38, line: 573, baseType: !152, size: 32, offset: 1792)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !807, file: !38, line: 574, baseType: !152, size: 32, offset: 1824)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !807, file: !38, line: 575, baseType: !152, size: 32, offset: 1856)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !807, file: !38, line: 576, baseType: !152, size: 32, offset: 1888)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !807, file: !38, line: 577, baseType: !152, size: 32, offset: 1920)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !807, file: !38, line: 578, baseType: !152, size: 32, offset: 1952)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !807, file: !38, line: 585, baseType: !679, size: 64, offset: 1984)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !807, file: !38, line: 586, baseType: !338, size: 64, offset: 2048)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !807, file: !38, line: 587, baseType: !679, size: 64, offset: 2112)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !807, file: !38, line: 588, baseType: !853, size: 64, offset: 2176)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !807, file: !38, line: 589, baseType: !855, size: 64, offset: 2240)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !680, size: 64, elements: !133)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !807, file: !38, line: 591, baseType: !858, size: 64, offset: 2304)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 192, elements: !860)
!860 = !{!805}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !807, file: !38, line: 592, baseType: !679, size: 64, offset: 2368)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !807, file: !38, line: 593, baseType: !685, size: 128, offset: 2432)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !807, file: !38, line: 594, baseType: !864, size: 128, offset: 2560)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !865, size: 128, elements: !107)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 128, elements: !867)
!867 = !{!134, !108}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !807, file: !38, line: 595, baseType: !701, size: 128, offset: 2688)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !807, file: !38, line: 596, baseType: !870, size: 4096, offset: 2816)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 4096, elements: !871)
!871 = !{!108, !582}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !807, file: !38, line: 597, baseType: !679, size: 64, offset: 6912)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !807, file: !38, line: 598, baseType: !679, size: 64, offset: 6976)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !807, file: !38, line: 599, baseType: !516, size: 64, offset: 7040)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !807, file: !38, line: 603, baseType: !674, size: 1024, offset: 7104)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !807, file: !38, line: 606, baseType: !152, size: 32, offset: 8128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !807, file: !38, line: 607, baseType: !152, size: 32, offset: 8160)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !807, file: !38, line: 608, baseType: !119, size: 32, align: 32, offset: 8192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !807, file: !38, line: 609, baseType: !152, size: 32, offset: 8224)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !807, file: !38, line: 611, baseType: !152, size: 32, offset: 8256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !807, file: !38, line: 612, baseType: !152, size: 32, offset: 8288)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !807, file: !38, line: 614, baseType: !152, size: 32, offset: 8320)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !807, file: !38, line: 615, baseType: !152, size: 32, offset: 8352)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !807, file: !38, line: 621, baseType: !152, size: 32, offset: 8384)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !807, file: !38, line: 624, baseType: !152, size: 32, offset: 8416)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !807, file: !38, line: 626, baseType: !152, size: 32, offset: 8448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !807, file: !38, line: 627, baseType: !152, size: 32, offset: 8480)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !807, file: !38, line: 671, baseType: !889, size: 60672, offset: 8576)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !807, file: !38, line: 629, size: 60672, elements: !890)
!890 = !{!891, !895, !899, !901, !902, !905, !909, !911, !912, !913, !914, !915, !918, !922, !925, !926, !927, !928, !929, !932, !934, !936}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !889, file: !38, line: 634, baseType: !892, size: 3072, align: 128)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 3072, elements: !893)
!893 = !{!894}
!894 = !DISubrange(count: 384)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !889, file: !38, line: 635, baseType: !896, size: 6912, align: 128, offset: 3072)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 6912, elements: !897)
!897 = !{!898}
!898 = !DISubrange(count: 864)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !889, file: !38, line: 638, baseType: !900, size: 2048, align: 128, offset: 9984)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 2048, elements: !391)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !889, file: !38, line: 639, baseType: !900, size: 2048, align: 128, offset: 12032)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !889, file: !38, line: 640, baseType: !903, size: 3072, align: 128, offset: 14080)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 3072, elements: !904)
!904 = !{!583, !204}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !889, file: !38, line: 641, baseType: !906, size: 3840, align: 128, offset: 17152)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 3840, elements: !907)
!907 = !{!908, !197}
!908 = !DISubrange(count: 15)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !889, file: !38, line: 642, baseType: !910, size: 128, offset: 20992)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 128, elements: !120)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !889, file: !38, line: 643, baseType: !910, size: 128, offset: 21120)
