; ModuleID = 'x264_src/encoder/cavlc.c'
source_filename = "x264_src/encoder/cavlc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.vlc_t = type { i8, i8 }
%struct.vlc_large_t = type { i16, i8, i8 }
%struct.x264_run_level_t = type { i32, [16 x i16], [16 x i8] }

@x264_macroblock_write_cavlc.i_offsets = internal unnamed_addr constant [3 x i8] c"\05\17\00", align 1, !dbg !0
@x264_mb_pred_mode4x4_fix = internal unnamed_addr constant [13 x i8] c"\FF\00\01\02\03\04\05\06\07\08\02\02\02", align 1, !dbg !1412
@x264_scan8 = internal unnamed_addr constant [27 x i32] [i32 12, i32 13, i32 20, i32 21, i32 14, i32 15, i32 22, i32 23, i32 28, i32 29, i32 36, i32 37, i32 30, i32 31, i32 38, i32 39, i32 9, i32 10, i32 17, i32 18, i32 33, i32 34, i32 41, i32 42, i32 44, i32 46, i32 47], align 16, !dbg !1417
@x264_mb_pred_mode8x8c_fix = internal unnamed_addr constant [7 x i8] c"\00\01\02\03\00\00\00", align 1, !dbg !1423
@x264_mb_pred_mode16x16_fix = internal unnamed_addr constant [7 x i8] c"\00\01\02\03\02\02\02", align 1, !dbg !1426
@sub_mb_type_p_to_golomb = internal unnamed_addr constant [4 x i8] c"\03\01\02\00", align 1, !dbg !1428
@sub_mb_type_b_to_golomb = internal unnamed_addr constant [13 x i8] c"\0A\04\05\01\0B\06\07\02\0C\08\09\03\00", align 1, !dbg !1431

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "i_offsets", scope: !2, file: !3, line: 294, type: !1596, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "x264_macroblock_write_cavlc", scope: !3, file: !3, line: 290, type: !4, scopeLine: 291, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1322, retainedNodes: !1515)
!3 = !DIFile(filename: "x264_src/encoder/cavlc.c", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "75a5da4a09d0be3f3469f38c5a0088f2")
!4 = !DISubroutineType(types: !5)
!5 = !{null, !6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !8, line: 46, baseType: !9)
!8 = !DIFile(filename: "x264_src/x264.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !10, line: 381, size: 266752, elements: !11)
!10 = !DIFile(filename: "x264_src/common/common.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5afac7bf2f5673f1628c455d7d320ad7")
!11 = !{!12, !191, !195, !196, !197, !198, !199, !200, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !336, !338, !366, !368, !369, !370, !376, !380, !381, !382, !389, !393, !394, !395, !400, !403, !404, !483, !500, !664, !665, !666, !667, !671, !672, !673, !674, !675, !676, !677, !692, !886, !890, !951, !954, !956, !958, !959, !962, !967, !976, !977, !985, !987, !992, !1068, !1154, !1198, !1220, !1269, !1298}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !9, file: !10, line: 384, baseType: !13, size: 5632)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !8, line: 376, baseType: !14)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !8, line: 176, size: 5632, elements: !15)
!15 = !{!16, !18, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !61, !70, !71, !72, !73, !77, !78, !92, !93, !94, !95, !96, !127, !169, !170, !171, !172, !173, !174, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !14, file: !8, line: 179, baseType: !17, size: 32)
!17 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !14, file: !8, line: 180, baseType: !19, size: 32, offset: 32)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !14, file: !8, line: 181, baseType: !19, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !14, file: !8, line: 182, baseType: !19, size: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !14, file: !8, line: 183, baseType: !19, size: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !14, file: !8, line: 186, baseType: !19, size: 32, offset: 160)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !14, file: !8, line: 187, baseType: !19, size: 32, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !14, file: !8, line: 188, baseType: !19, size: 32, offset: 224)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !14, file: !8, line: 189, baseType: !19, size: 32, offset: 256)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !14, file: !8, line: 190, baseType: !19, size: 32, offset: 288)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !14, file: !8, line: 198, baseType: !19, size: 32, offset: 320)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !14, file: !8, line: 215, baseType: !30, size: 288, offset: 352)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !14, file: !8, line: 200, size: 288, elements: !31)
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !30, file: !8, line: 203, baseType: !19, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !30, file: !8, line: 204, baseType: !19, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !30, file: !8, line: 206, baseType: !19, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !30, file: !8, line: 209, baseType: !19, size: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !30, file: !8, line: 210, baseType: !19, size: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !30, file: !8, line: 211, baseType: !19, size: 32, offset: 160)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !30, file: !8, line: 212, baseType: !19, size: 32, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !30, file: !8, line: 213, baseType: !19, size: 32, offset: 224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !30, file: !8, line: 214, baseType: !19, size: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !14, file: !8, line: 218, baseType: !19, size: 32, offset: 640)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !14, file: !8, line: 219, baseType: !19, size: 32, offset: 672)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !14, file: !8, line: 220, baseType: !19, size: 32, offset: 704)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !14, file: !8, line: 221, baseType: !19, size: 32, offset: 736)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !14, file: !8, line: 222, baseType: !19, size: 32, offset: 768)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !14, file: !8, line: 224, baseType: !19, size: 32, offset: 800)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !14, file: !8, line: 225, baseType: !19, size: 32, offset: 832)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !14, file: !8, line: 226, baseType: !19, size: 32, offset: 864)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !14, file: !8, line: 227, baseType: !19, size: 32, offset: 896)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !14, file: !8, line: 229, baseType: !19, size: 32, offset: 928)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !14, file: !8, line: 230, baseType: !19, size: 32, offset: 960)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !14, file: !8, line: 231, baseType: !19, size: 32, offset: 992)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !14, file: !8, line: 233, baseType: !19, size: 32, offset: 1024)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !14, file: !8, line: 234, baseType: !19, size: 32, offset: 1056)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !14, file: !8, line: 236, baseType: !19, size: 32, offset: 1088)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !14, file: !8, line: 237, baseType: !19, size: 32, offset: 1120)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !14, file: !8, line: 239, baseType: !19, size: 32, offset: 1152)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !14, file: !8, line: 240, baseType: !59, size: 64, offset: 1216)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !14, file: !8, line: 241, baseType: !62, size: 128, offset: 1280)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, elements: !68)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !64, line: 24, baseType: !65)
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !66, line: 38, baseType: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!67 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!68 = !{!69}
!69 = !DISubrange(count: 16)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !14, file: !8, line: 242, baseType: !62, size: 128, offset: 1408)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !14, file: !8, line: 243, baseType: !62, size: 128, offset: 1536)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !14, file: !8, line: 244, baseType: !62, size: 128, offset: 1664)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !14, file: !8, line: 245, baseType: !74, size: 512, offset: 1792)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 512, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !14, file: !8, line: 246, baseType: !74, size: 512, offset: 2304)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !14, file: !8, line: 249, baseType: !79, size: 64, offset: 2816)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !82, !19, !83, !85}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !87)
!87 = !{!88, !89, !90, !91}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !86, file: !3, baseType: !17, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !86, file: !3, baseType: !17, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !86, file: !3, baseType: !82, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !86, file: !3, baseType: !82, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !14, file: !8, line: 250, baseType: !82, size: 64, offset: 2880)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !14, file: !8, line: 251, baseType: !19, size: 32, offset: 2944)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !14, file: !8, line: 252, baseType: !19, size: 32, offset: 2976)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !14, file: !8, line: 253, baseType: !59, size: 64, offset: 3008)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !14, file: !8, line: 287, baseType: !97, size: 800, offset: 3072)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !14, file: !8, line: 256, size: 800, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !119, !120, !121, !125, !126}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !97, file: !8, line: 258, baseType: !17, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !97, file: !8, line: 259, baseType: !17, size: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !97, file: !8, line: 261, baseType: !19, size: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !97, file: !8, line: 262, baseType: !19, size: 32, offset: 96)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !97, file: !8, line: 263, baseType: !19, size: 32, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !97, file: !8, line: 264, baseType: !19, size: 32, offset: 160)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !97, file: !8, line: 265, baseType: !19, size: 32, offset: 192)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !97, file: !8, line: 267, baseType: !19, size: 32, offset: 224)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !97, file: !8, line: 268, baseType: !19, size: 32, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !97, file: !8, line: 269, baseType: !19, size: 32, offset: 288)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !97, file: !8, line: 270, baseType: !19, size: 32, offset: 320)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !97, file: !8, line: 271, baseType: !19, size: 32, offset: 352)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !97, file: !8, line: 272, baseType: !19, size: 32, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !97, file: !8, line: 273, baseType: !19, size: 32, offset: 416)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !97, file: !8, line: 274, baseType: !19, size: 32, offset: 448)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !97, file: !8, line: 275, baseType: !19, size: 32, offset: 480)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !97, file: !8, line: 276, baseType: !19, size: 32, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !97, file: !8, line: 277, baseType: !19, size: 32, offset: 544)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !97, file: !8, line: 278, baseType: !118, size: 32, offset: 576)
!118 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !97, file: !8, line: 279, baseType: !118, size: 32, offset: 608)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !97, file: !8, line: 280, baseType: !19, size: 32, offset: 640)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !97, file: !8, line: 283, baseType: !122, size: 64, offset: 672)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 2)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !97, file: !8, line: 285, baseType: !19, size: 32, offset: 736)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !97, file: !8, line: 286, baseType: !19, size: 32, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !14, file: !8, line: 327, baseType: !128, size: 1152, offset: 3904)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !14, file: !8, line: 290, size: 1152, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !167, !168}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !128, file: !8, line: 292, baseType: !19, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !128, file: !8, line: 294, baseType: !19, size: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !128, file: !8, line: 295, baseType: !19, size: 32, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !128, file: !8, line: 296, baseType: !19, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !128, file: !8, line: 297, baseType: !19, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !128, file: !8, line: 299, baseType: !19, size: 32, offset: 160)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !128, file: !8, line: 300, baseType: !118, size: 32, offset: 192)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !128, file: !8, line: 301, baseType: !118, size: 32, offset: 224)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !128, file: !8, line: 302, baseType: !118, size: 32, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !128, file: !8, line: 303, baseType: !19, size: 32, offset: 288)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !128, file: !8, line: 304, baseType: !19, size: 32, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !128, file: !8, line: 305, baseType: !118, size: 32, offset: 352)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !128, file: !8, line: 306, baseType: !118, size: 32, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !128, file: !8, line: 307, baseType: !118, size: 32, offset: 416)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !128, file: !8, line: 309, baseType: !19, size: 32, offset: 448)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !128, file: !8, line: 310, baseType: !118, size: 32, offset: 480)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !128, file: !8, line: 311, baseType: !19, size: 32, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !128, file: !8, line: 312, baseType: !19, size: 32, offset: 544)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !128, file: !8, line: 315, baseType: !19, size: 32, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !128, file: !8, line: 316, baseType: !59, size: 64, offset: 640)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !128, file: !8, line: 317, baseType: !19, size: 32, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !128, file: !8, line: 318, baseType: !59, size: 64, offset: 768)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !128, file: !8, line: 321, baseType: !118, size: 32, offset: 832)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !128, file: !8, line: 322, baseType: !118, size: 32, offset: 864)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !128, file: !8, line: 323, baseType: !118, size: 32, offset: 896)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !128, file: !8, line: 324, baseType: !156, size: 64, offset: 960)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !8, line: 174, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 167, size: 256, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !158, file: !8, line: 169, baseType: !19, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !158, file: !8, line: 169, baseType: !19, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !158, file: !8, line: 170, baseType: !19, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !158, file: !8, line: 171, baseType: !19, size: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !158, file: !8, line: 172, baseType: !118, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !158, file: !8, line: 173, baseType: !166, size: 64, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !128, file: !8, line: 325, baseType: !19, size: 32, offset: 1024)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !128, file: !8, line: 326, baseType: !59, size: 64, offset: 1088)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !14, file: !8, line: 330, baseType: !19, size: 32, offset: 5056)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !14, file: !8, line: 331, baseType: !19, size: 32, offset: 5088)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !14, file: !8, line: 332, baseType: !19, size: 32, offset: 5120)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !14, file: !8, line: 334, baseType: !19, size: 32, offset: 5152)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !14, file: !8, line: 335, baseType: !19, size: 32, offset: 5184)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !14, file: !8, line: 336, baseType: !175, size: 32, offset: 5216)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !64, line: 26, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !66, line: 42, baseType: !17)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !14, file: !8, line: 337, baseType: !175, size: 32, offset: 5248)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !14, file: !8, line: 338, baseType: !175, size: 32, offset: 5280)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !14, file: !8, line: 339, baseType: !175, size: 32, offset: 5312)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !14, file: !8, line: 340, baseType: !19, size: 32, offset: 5344)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !14, file: !8, line: 344, baseType: !19, size: 32, offset: 5376)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !14, file: !8, line: 356, baseType: !19, size: 32, offset: 5408)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !14, file: !8, line: 364, baseType: !19, size: 32, offset: 5440)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !14, file: !8, line: 367, baseType: !19, size: 32, offset: 5472)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !14, file: !8, line: 368, baseType: !19, size: 32, offset: 5504)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !14, file: !8, line: 369, baseType: !19, size: 32, offset: 5536)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !14, file: !8, line: 375, baseType: !188, size: 64, offset: 5568)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{null, !82}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !9, file: !10, line: 386, baseType: !192, size: 8256, offset: 5632)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 8256, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 129)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !9, file: !10, line: 387, baseType: !19, size: 32, offset: 13888)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !9, file: !10, line: 388, baseType: !19, size: 32, offset: 13920)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !9, file: !10, line: 389, baseType: !19, size: 32, offset: 13952)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !9, file: !10, line: 390, baseType: !19, size: 32, offset: 13984)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !9, file: !10, line: 391, baseType: !19, size: 32, offset: 14016)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !9, file: !10, line: 402, baseType: !201, size: 576, offset: 14080)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !9, file: !10, line: 394, size: 576, elements: !202)
!202 = !{!203, !204, !205, !215, !216, !217}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !201, file: !10, line: 396, baseType: !19, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !201, file: !10, line: 397, baseType: !19, size: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !201, file: !10, line: 398, baseType: !206, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !8, line: 604, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 593, size: 192, elements: !209)
!209 = !{!210, !211, !212, !213}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !208, file: !8, line: 595, baseType: !19, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !208, file: !8, line: 596, baseType: !19, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !208, file: !8, line: 599, baseType: !19, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !208, file: !8, line: 603, baseType: !214, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !201, file: !10, line: 399, baseType: !19, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !201, file: !10, line: 400, baseType: !214, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !201, file: !10, line: 401, baseType: !218, size: 320, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !219, line: 56, baseType: !220)
!219 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !219, line: 47, size: 320, elements: !221)
!221 = !{!222, !223, !224, !225, !229, !230}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !220, file: !219, line: 49, baseType: !214, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !220, file: !219, line: 50, baseType: !214, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !220, file: !219, line: 51, baseType: !214, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !220, file: !219, line: 53, baseType: !226, size: 64, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !227, line: 87, baseType: !228)
!227 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!228 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !220, file: !219, line: 54, baseType: !19, size: 32, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !220, file: !219, line: 55, baseType: !19, size: 32, offset: 288)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !9, file: !10, line: 404, baseType: !214, size: 64, offset: 14656)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !9, file: !10, line: 405, baseType: !19, size: 32, offset: 14720)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !9, file: !10, line: 410, baseType: !19, size: 32, offset: 14752)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !9, file: !10, line: 411, baseType: !19, size: 32, offset: 14784)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !9, file: !10, line: 413, baseType: !19, size: 32, offset: 14816)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !9, file: !10, line: 415, baseType: !19, size: 32, offset: 14848)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !9, file: !10, line: 416, baseType: !19, size: 32, offset: 14880)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !9, file: !10, line: 418, baseType: !19, size: 32, offset: 14912)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !9, file: !10, line: 419, baseType: !19, size: 32, offset: 14944)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !9, file: !10, line: 420, baseType: !19, size: 32, offset: 14976)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !9, file: !10, line: 421, baseType: !19, size: 32, offset: 15008)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !9, file: !10, line: 422, baseType: !19, size: 32, offset: 15040)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !9, file: !10, line: 424, baseType: !19, size: 32, offset: 15072)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !9, file: !10, line: 425, baseType: !19, size: 32, offset: 15104)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !9, file: !10, line: 427, baseType: !19, size: 32, offset: 15136)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !9, file: !10, line: 430, baseType: !247, size: 10400, offset: 15168)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 10400, elements: !334)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !249, line: 154, baseType: !250)
!249 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !249, line: 52, size: 10400, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !269, !270, !271, !272, !273, !274, !275, !276, !277, !284, !285, !333}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !250, file: !249, line: 54, baseType: !19, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !250, file: !249, line: 56, baseType: !19, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !250, file: !249, line: 57, baseType: !19, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !250, file: !249, line: 59, baseType: !19, size: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !250, file: !249, line: 60, baseType: !19, size: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !250, file: !249, line: 61, baseType: !19, size: 32, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !250, file: !249, line: 63, baseType: !19, size: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !250, file: !249, line: 65, baseType: !19, size: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !250, file: !249, line: 67, baseType: !19, size: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !250, file: !249, line: 69, baseType: !19, size: 32, offset: 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !250, file: !249, line: 70, baseType: !19, size: 32, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !250, file: !249, line: 71, baseType: !19, size: 32, offset: 352)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !250, file: !249, line: 72, baseType: !19, size: 32, offset: 384)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !250, file: !249, line: 73, baseType: !266, size: 8192, offset: 416)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8192, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 256)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !250, file: !249, line: 75, baseType: !19, size: 32, offset: 8608)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !250, file: !249, line: 76, baseType: !19, size: 32, offset: 8640)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !250, file: !249, line: 77, baseType: !19, size: 32, offset: 8672)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !250, file: !249, line: 78, baseType: !19, size: 32, offset: 8704)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !250, file: !249, line: 79, baseType: !19, size: 32, offset: 8736)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !250, file: !249, line: 80, baseType: !19, size: 32, offset: 8768)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !250, file: !249, line: 81, baseType: !19, size: 32, offset: 8800)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !250, file: !249, line: 83, baseType: !19, size: 32, offset: 8832)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !250, file: !249, line: 90, baseType: !278, size: 128, offset: 8864)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !250, file: !249, line: 84, size: 128, elements: !279)
!279 = !{!280, !281, !282, !283}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !278, file: !249, line: 86, baseType: !19, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !278, file: !249, line: 87, baseType: !19, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !278, file: !249, line: 88, baseType: !19, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !278, file: !249, line: 89, baseType: !19, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !250, file: !249, line: 92, baseType: !19, size: 32, offset: 8992)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !250, file: !249, line: 150, baseType: !286, size: 1344, offset: 9024)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !250, file: !249, line: 93, size: 1344, elements: !287)
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !324, !325, !326, !327, !328, !329, !330, !331, !332}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !286, file: !249, line: 95, baseType: !19, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !286, file: !249, line: 96, baseType: !19, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !286, file: !249, line: 97, baseType: !19, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !286, file: !249, line: 99, baseType: !19, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !286, file: !249, line: 100, baseType: !19, size: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !286, file: !249, line: 102, baseType: !19, size: 32, offset: 160)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !286, file: !249, line: 103, baseType: !19, size: 32, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !286, file: !249, line: 104, baseType: !19, size: 32, offset: 224)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !286, file: !249, line: 105, baseType: !19, size: 32, offset: 256)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !286, file: !249, line: 106, baseType: !19, size: 32, offset: 288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !286, file: !249, line: 107, baseType: !19, size: 32, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !286, file: !249, line: 108, baseType: !19, size: 32, offset: 352)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !286, file: !249, line: 110, baseType: !19, size: 32, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !286, file: !249, line: 111, baseType: !19, size: 32, offset: 416)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !286, file: !249, line: 112, baseType: !19, size: 32, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !286, file: !249, line: 114, baseType: !19, size: 32, offset: 480)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !286, file: !249, line: 115, baseType: !175, size: 32, offset: 512)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !286, file: !249, line: 116, baseType: !175, size: 32, offset: 544)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !286, file: !249, line: 117, baseType: !19, size: 32, offset: 576)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !286, file: !249, line: 119, baseType: !19, size: 32, offset: 608)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !286, file: !249, line: 120, baseType: !19, size: 32, offset: 640)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !286, file: !249, line: 137, baseType: !310, size: 384, offset: 672)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !249, line: 122, size: 384, elements: !311)
!311 = !{!312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !310, file: !249, line: 124, baseType: !19, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !310, file: !249, line: 125, baseType: !19, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !310, file: !249, line: 126, baseType: !19, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !310, file: !249, line: 127, baseType: !19, size: 32, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !310, file: !249, line: 128, baseType: !19, size: 32, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !310, file: !249, line: 129, baseType: !19, size: 32, offset: 160)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !310, file: !249, line: 130, baseType: !19, size: 32, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !310, file: !249, line: 131, baseType: !19, size: 32, offset: 224)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !310, file: !249, line: 133, baseType: !19, size: 32, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !310, file: !249, line: 134, baseType: !19, size: 32, offset: 288)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !310, file: !249, line: 135, baseType: !19, size: 32, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !310, file: !249, line: 136, baseType: !19, size: 32, offset: 352)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !286, file: !249, line: 139, baseType: !19, size: 32, offset: 1056)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !286, file: !249, line: 140, baseType: !19, size: 32, offset: 1088)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !286, file: !249, line: 141, baseType: !19, size: 32, offset: 1120)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !286, file: !249, line: 142, baseType: !19, size: 32, offset: 1152)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !286, file: !249, line: 143, baseType: !19, size: 32, offset: 1184)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !286, file: !249, line: 144, baseType: !19, size: 32, offset: 1216)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !286, file: !249, line: 145, baseType: !19, size: 32, offset: 1248)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !286, file: !249, line: 146, baseType: !19, size: 32, offset: 1280)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !286, file: !249, line: 147, baseType: !19, size: 32, offset: 1312)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !250, file: !249, line: 152, baseType: !19, size: 32, offset: 10368)
!334 = !{!335}
!335 = !DISubrange(count: 1)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !9, file: !10, line: 431, baseType: !337, size: 64, offset: 25600)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !9, file: !10, line: 432, baseType: !339, size: 960, offset: 25664)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 960, elements: !334)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !249, line: 186, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !249, line: 156, size: 960, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !341, file: !249, line: 158, baseType: !19, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !341, file: !249, line: 159, baseType: !19, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !341, file: !249, line: 161, baseType: !19, size: 32, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !341, file: !249, line: 163, baseType: !19, size: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !341, file: !249, line: 164, baseType: !19, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !341, file: !249, line: 166, baseType: !19, size: 32, offset: 160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !341, file: !249, line: 167, baseType: !19, size: 32, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !341, file: !249, line: 169, baseType: !19, size: 32, offset: 224)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !341, file: !249, line: 170, baseType: !19, size: 32, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !341, file: !249, line: 172, baseType: !19, size: 32, offset: 288)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !341, file: !249, line: 173, baseType: !19, size: 32, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !341, file: !249, line: 175, baseType: !19, size: 32, offset: 352)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !341, file: !249, line: 177, baseType: !19, size: 32, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !341, file: !249, line: 178, baseType: !19, size: 32, offset: 416)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !341, file: !249, line: 179, baseType: !19, size: 32, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !341, file: !249, line: 181, baseType: !19, size: 32, offset: 480)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !341, file: !249, line: 183, baseType: !19, size: 32, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !341, file: !249, line: 184, baseType: !361, size: 384, offset: 576)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 384, elements: !364)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!364 = !{!365}
!365 = !DISubrange(count: 6)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !9, file: !10, line: 433, baseType: !367, size: 64, offset: 26624)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !9, file: !10, line: 434, baseType: !19, size: 32, offset: 26688)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !9, file: !10, line: 437, baseType: !19, size: 32, offset: 26720)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !9, file: !10, line: 440, baseType: !371, size: 256, offset: 26752)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 256, elements: !374)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 512, elements: !68)
!374 = !{!375}
!375 = !DISubrange(count: 4)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !9, file: !10, line: 441, baseType: !377, size: 128, offset: 27008)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 128, elements: !123)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 2048, elements: !75)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !9, file: !10, line: 443, baseType: !371, size: 256, offset: 27136)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !9, file: !10, line: 444, baseType: !377, size: 128, offset: 27392)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !9, file: !10, line: 446, baseType: !383, size: 256, offset: 27520)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 256, elements: !374)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 256, elements: !68)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !64, line: 25, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !66, line: 40, baseType: !388)
!388 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !9, file: !10, line: 447, baseType: !390, size: 128, offset: 27776)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 128, elements: !123)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 1024, elements: !75)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !9, file: !10, line: 448, baseType: !383, size: 256, offset: 27904)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !9, file: !10, line: 449, baseType: !390, size: 128, offset: 28160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !9, file: !10, line: 454, baseType: !396, size: 5888, offset: 28288)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 5888, elements: !398)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!398 = !{!399}
!399 = !DISubrange(count: 92)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !9, file: !10, line: 455, baseType: !401, size: 23552, offset: 34176)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 23552, elements: !402)
!402 = !{!399, !375}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !9, file: !10, line: 457, baseType: !362, size: 64, offset: 57728)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !9, file: !10, line: 460, baseType: !405, size: 53376, offset: 57856)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !10, line: 364, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !10, line: 302, size: 53376, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !436, !467, !468, !469, !475, !476, !477, !478, !479, !480, !481, !482}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !406, file: !10, line: 304, baseType: !337, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !406, file: !10, line: 305, baseType: !367, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !406, file: !10, line: 307, baseType: !19, size: 32, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !406, file: !10, line: 308, baseType: !19, size: 32, offset: 160)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !406, file: !10, line: 309, baseType: !19, size: 32, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !406, file: !10, line: 311, baseType: !19, size: 32, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !406, file: !10, line: 313, baseType: !19, size: 32, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !406, file: !10, line: 315, baseType: !19, size: 32, offset: 288)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !406, file: !10, line: 316, baseType: !19, size: 32, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !406, file: !10, line: 317, baseType: !19, size: 32, offset: 352)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !406, file: !10, line: 319, baseType: !19, size: 32, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !406, file: !10, line: 321, baseType: !19, size: 32, offset: 416)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !406, file: !10, line: 322, baseType: !19, size: 32, offset: 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !406, file: !10, line: 324, baseType: !122, size: 64, offset: 480)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !406, file: !10, line: 325, baseType: !19, size: 32, offset: 544)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !406, file: !10, line: 327, baseType: !19, size: 32, offset: 576)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !406, file: !10, line: 329, baseType: !19, size: 32, offset: 608)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !406, file: !10, line: 330, baseType: !19, size: 32, offset: 640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !406, file: !10, line: 331, baseType: !19, size: 32, offset: 672)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !406, file: !10, line: 333, baseType: !19, size: 32, offset: 704)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !406, file: !10, line: 334, baseType: !19, size: 32, offset: 736)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !406, file: !10, line: 339, baseType: !430, size: 2048, offset: 768)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 2048, elements: !435)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !406, file: !10, line: 335, size: 64, elements: !432)
!432 = !{!433, !434}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !431, file: !10, line: 337, baseType: !19, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !431, file: !10, line: 338, baseType: !19, size: 32, offset: 32)
!435 = !{!124, !69}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !406, file: !10, line: 342, baseType: !437, size: 49152, align: 128, offset: 2816)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 49152, align: 128, elements: !464)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !439, line: 36, baseType: !440, align: 128)
!439 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !439, line: 26, size: 512, elements: !441)
!441 = !{!442, !450, !451, !454, !455, !456}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !440, file: !439, line: 30, baseType: !443, size: 128, align: 128)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 128, elements: !448)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !445, line: 25, baseType: !446)
!445 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !66, line: 39, baseType: !447)
!447 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!448 = !{!449}
!449 = !DISubrange(count: 8)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !440, file: !439, line: 31, baseType: !443, size: 128, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !440, file: !439, line: 32, baseType: !452, size: 32, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !445, line: 26, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !66, line: 41, baseType: !19)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !440, file: !439, line: 33, baseType: !452, size: 32, offset: 288)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !440, file: !439, line: 34, baseType: !452, size: 32, offset: 320)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !440, file: !439, line: 35, baseType: !457, size: 64, offset: 384)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !439, line: 25, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !214, !19, !214, !19, !462, !19}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !440)
!464 = !{!465, !466}
!465 = !DISubrange(count: 32)
!466 = !DISubrange(count: 3)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !406, file: !10, line: 344, baseType: !19, size: 32, offset: 51968)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !406, file: !10, line: 345, baseType: !19, size: 32, offset: 52000)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !406, file: !10, line: 350, baseType: !470, size: 1024, offset: 52032)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 1024, elements: !68)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !406, file: !10, line: 346, size: 64, elements: !472)
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !471, file: !10, line: 348, baseType: !19, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !471, file: !10, line: 349, baseType: !19, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !406, file: !10, line: 352, baseType: !19, size: 32, offset: 53056)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !406, file: !10, line: 354, baseType: !19, size: 32, offset: 53088)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !406, file: !10, line: 355, baseType: !19, size: 32, offset: 53120)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !406, file: !10, line: 356, baseType: !19, size: 32, offset: 53152)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !406, file: !10, line: 357, baseType: !19, size: 32, offset: 53184)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !406, file: !10, line: 360, baseType: !19, size: 32, offset: 53216)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !406, file: !10, line: 361, baseType: !19, size: 32, offset: 53248)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !406, file: !10, line: 362, baseType: !19, size: 32, offset: 53280)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !9, file: !10, line: 463, baseType: !484, size: 4096, offset: 111232)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !485, line: 46, baseType: !486)
!485 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !485, line: 27, size: 4096, elements: !487)
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495, !496}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !486, file: !485, line: 30, baseType: !19, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !486, file: !485, line: 31, baseType: !19, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !486, file: !485, line: 34, baseType: !19, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !486, file: !485, line: 35, baseType: !19, size: 32, offset: 96)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !486, file: !485, line: 37, baseType: !214, size: 64, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !486, file: !485, line: 38, baseType: !214, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !486, file: !485, line: 39, baseType: !214, size: 64, offset: 256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !486, file: !485, line: 42, baseType: !19, size: 32, align: 128, offset: 384)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !486, file: !485, line: 45, baseType: !497, size: 3680, offset: 416)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 3680, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 460)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !9, file: !10, line: 494, baseType: !501, size: 2112, offset: 115328)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !9, file: !10, line: 465, size: 2112, elements: !502)
!502 = !{!503, !644, !646, !647, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !660, !661, !662, !663}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !501, file: !10, line: 468, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !507, line: 146, baseType: !508)
!507 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !507, line: 31, size: 125056, elements: !509)
!509 = !{!510, !511, !512, !513, !516, !517, !518, !519, !520, !521, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !540, !541, !542, !543, !544, !545, !547, !549, !550, !551, !552, !553, !556, !558, !559, !561, !566, !567, !571, !572, !576, !580, !583, !585, !586, !588, !589, !591, !592, !593, !596, !598, !599, !600, !602, !603, !604, !605, !606, !607, !608, !609, !611, !612, !616, !625, !629, !631, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !508, file: !507, line: 34, baseType: !19, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !508, file: !507, line: 35, baseType: !19, size: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !508, file: !507, line: 36, baseType: !19, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !508, file: !507, line: 37, baseType: !514, size: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !445, line: 27, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !66, line: 44, baseType: !228)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !508, file: !507, line: 38, baseType: !514, size: 64, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !508, file: !507, line: 39, baseType: !19, size: 32, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !508, file: !507, line: 40, baseType: !19, size: 32, offset: 288)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !508, file: !507, line: 41, baseType: !19, size: 32, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !508, file: !507, line: 42, baseType: !19, size: 32, offset: 352)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !508, file: !507, line: 43, baseType: !522, size: 64, offset: 384)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !508, file: !507, line: 45, baseType: !19, size: 32, offset: 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !508, file: !507, line: 46, baseType: !19, size: 32, offset: 480)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !508, file: !507, line: 47, baseType: !19, size: 32, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !508, file: !507, line: 48, baseType: !19, size: 32, offset: 544)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !508, file: !507, line: 49, baseType: !19, size: 32, offset: 576)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !508, file: !507, line: 50, baseType: !19, size: 32, offset: 608)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !508, file: !507, line: 51, baseType: !19, size: 32, offset: 640)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !508, file: !507, line: 52, baseType: !63, size: 8, offset: 672)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !508, file: !507, line: 53, baseType: !63, size: 8, offset: 680)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !508, file: !507, line: 54, baseType: !63, size: 8, offset: 688)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !508, file: !507, line: 55, baseType: !118, size: 32, offset: 704)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !508, file: !507, line: 56, baseType: !118, size: 32, offset: 736)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !508, file: !507, line: 57, baseType: !19, size: 32, offset: 768)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !508, file: !507, line: 60, baseType: !19, size: 32, offset: 800)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !508, file: !507, line: 61, baseType: !538, size: 96, offset: 832)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 96, elements: !539)
!539 = !{!466}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !508, file: !507, line: 62, baseType: !538, size: 96, offset: 928)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !508, file: !507, line: 63, baseType: !538, size: 96, offset: 1024)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !508, file: !507, line: 64, baseType: !19, size: 32, offset: 1120)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !508, file: !507, line: 65, baseType: !19, size: 32, offset: 1152)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !508, file: !507, line: 66, baseType: !19, size: 32, offset: 1184)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !508, file: !507, line: 67, baseType: !546, size: 192, offset: 1216)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 192, elements: !539)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !508, file: !507, line: 68, baseType: !548, size: 256, offset: 1408)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 256, elements: !374)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !508, file: !507, line: 69, baseType: !548, size: 256, offset: 1664)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !508, file: !507, line: 70, baseType: !397, size: 64, offset: 1920)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !508, file: !507, line: 74, baseType: !548, size: 256, offset: 1984)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !508, file: !507, line: 75, baseType: !548, size: 256, offset: 2240)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !508, file: !507, line: 77, baseType: !554, size: 24576, align: 128, offset: 2560)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 24576, align: 128, elements: !555)
!555 = !{!69, !466}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !508, file: !507, line: 78, baseType: !557, size: 1024, offset: 27136)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 1024, elements: !68)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !508, file: !507, line: 79, baseType: !19, size: 32, offset: 28160)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !508, file: !507, line: 80, baseType: !560, size: 64, offset: 28224)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !508, file: !507, line: 83, baseType: !562, size: 64, offset: 28288)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !445, line: 24, baseType: !564)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !66, line: 37, baseType: !565)
!565 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !508, file: !507, line: 84, baseType: !214, size: 64, offset: 28352)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !508, file: !507, line: 85, baseType: !568, size: 128, offset: 28416)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 128, elements: !123)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 32, elements: !123)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !508, file: !507, line: 86, baseType: !569, size: 64, offset: 28544)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !508, file: !507, line: 87, baseType: !573, size: 2176, offset: 28608)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 2176, elements: !574)
!574 = !{!124, !575}
!575 = !DISubrange(count: 17)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !508, file: !507, line: 92, baseType: !577, size: 20736, offset: 30784)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 20736, elements: !578)
!578 = !{!579, !579}
!579 = !DISubrange(count: 18)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !508, file: !507, line: 96, baseType: !581, size: 2176, offset: 51520)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 2176, elements: !574)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !508, file: !507, line: 97, baseType: !584, size: 128, offset: 53696)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 128, elements: !123)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !508, file: !507, line: 98, baseType: !122, size: 64, offset: 53824)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !508, file: !507, line: 99, baseType: !587, size: 1024, offset: 53888)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 1024, elements: !435)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !508, file: !507, line: 100, baseType: !570, size: 32, offset: 54912)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !508, file: !507, line: 105, baseType: !590, size: 10368, offset: 54944)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 10368, elements: !578)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !508, file: !507, line: 106, baseType: !590, size: 10368, offset: 65312)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !508, file: !507, line: 107, baseType: !19, size: 32, offset: 75680)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !508, file: !507, line: 108, baseType: !594, size: 576, offset: 75712)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 576, elements: !595)
!595 = !{!579}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !508, file: !507, line: 109, baseType: !597, size: 20736, offset: 76288)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 20736, elements: !578)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !508, file: !507, line: 110, baseType: !582, size: 64, offset: 97024)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !508, file: !507, line: 111, baseType: !582, size: 64, offset: 97088)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !508, file: !507, line: 112, baseType: !601, size: 64, offset: 97152)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !508, file: !507, line: 113, baseType: !601, size: 64, offset: 97216)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !508, file: !507, line: 114, baseType: !601, size: 64, offset: 97280)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !508, file: !507, line: 115, baseType: !19, size: 32, offset: 97344)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !508, file: !507, line: 116, baseType: !397, size: 64, offset: 97408)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !508, file: !507, line: 117, baseType: !397, size: 64, offset: 97472)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !508, file: !507, line: 118, baseType: !397, size: 64, offset: 97536)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !508, file: !507, line: 119, baseType: !19, size: 32, offset: 97600)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !508, file: !507, line: 120, baseType: !610, size: 576, offset: 97632)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 576, elements: !595)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !508, file: !507, line: 121, baseType: !175, size: 32, offset: 98208)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !508, file: !507, line: 122, baseType: !613, size: 64, offset: 98240)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !64, line: 27, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !66, line: 45, baseType: !615)
!615 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !508, file: !507, line: 125, baseType: !617, size: 256, offset: 98304)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !8, line: 503, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 496, size: 256, elements: !619)
!619 = !{!620, !622, !623, !624}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !618, file: !8, line: 498, baseType: !621, size: 64)
!621 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !618, file: !8, line: 499, baseType: !621, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !618, file: !8, line: 500, baseType: !621, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !618, file: !8, line: 502, baseType: !621, size: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !508, file: !507, line: 128, baseType: !626, size: 2008, offset: 98560)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 2008, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 251)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !508, file: !507, line: 129, baseType: !630, size: 8032, offset: 100576)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8032, elements: !627)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !508, file: !507, line: 130, baseType: !632, size: 16064, offset: 108608)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 16064, elements: !627)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !508, file: !507, line: 131, baseType: !19, size: 32, offset: 124672)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !508, file: !507, line: 132, baseType: !19, size: 32, offset: 124704)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !508, file: !507, line: 135, baseType: !19, size: 32, offset: 124736)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !508, file: !507, line: 136, baseType: !19, size: 32, offset: 124768)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !508, file: !507, line: 137, baseType: !19, size: 32, offset: 124800)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !508, file: !507, line: 138, baseType: !19, size: 32, offset: 124832)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !508, file: !507, line: 139, baseType: !19, size: 32, offset: 124864)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !508, file: !507, line: 142, baseType: !118, size: 32, offset: 124896)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !508, file: !507, line: 143, baseType: !19, size: 32, offset: 124928)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !508, file: !507, line: 144, baseType: !19, size: 32, offset: 124960)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !508, file: !507, line: 145, baseType: !19, size: 32, offset: 124992)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !501, file: !10, line: 470, baseType: !645, size: 128, offset: 64)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 128, elements: !123)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !501, file: !10, line: 473, baseType: !504, size: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !501, file: !10, line: 476, baseType: !648, size: 1152, offset: 256)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 1152, elements: !595)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !501, file: !10, line: 478, baseType: !19, size: 32, offset: 1408)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !501, file: !10, line: 480, baseType: !19, size: 32, offset: 1440)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !501, file: !10, line: 482, baseType: !19, size: 32, offset: 1472)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !501, file: !10, line: 483, baseType: !19, size: 32, offset: 1504)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !501, file: !10, line: 484, baseType: !19, size: 32, offset: 1536)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !501, file: !10, line: 485, baseType: !19, size: 32, offset: 1568)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !501, file: !10, line: 486, baseType: !19, size: 32, offset: 1600)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !501, file: !10, line: 487, baseType: !514, size: 64, offset: 1664)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !501, file: !10, line: 488, baseType: !514, size: 64, offset: 1728)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !501, file: !10, line: 489, baseType: !659, size: 128, offset: 1792)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 128, elements: !123)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !501, file: !10, line: 490, baseType: !514, size: 64, offset: 1920)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !501, file: !10, line: 491, baseType: !514, size: 64, offset: 1984)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !501, file: !10, line: 492, baseType: !19, size: 32, offset: 2048)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !501, file: !10, line: 493, baseType: !19, size: 32, offset: 2080)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !9, file: !10, line: 497, baseType: !505, size: 64, offset: 117440)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !9, file: !10, line: 500, baseType: !505, size: 64, offset: 117504)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !9, file: !10, line: 503, baseType: !19, size: 32, offset: 117568)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !9, file: !10, line: 504, baseType: !668, size: 1216, offset: 117632)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 1216, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 19)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !9, file: !10, line: 505, baseType: !19, size: 32, offset: 118848)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !9, file: !10, line: 506, baseType: !668, size: 1216, offset: 118912)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !9, file: !10, line: 507, baseType: !122, size: 64, offset: 120128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !9, file: !10, line: 510, baseType: !19, size: 32, offset: 120192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !9, file: !10, line: 511, baseType: !19, size: 32, offset: 120224)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !9, file: !10, line: 512, baseType: !514, size: 64, offset: 120256)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !9, file: !10, line: 522, baseType: !678, size: 10624, offset: 120320)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !9, file: !10, line: 515, size: 10624, elements: !679)
!679 = !{!680, !682, !685, !688}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !678, file: !10, line: 517, baseType: !681, size: 256, align: 128)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 256, elements: !68)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !678, file: !10, line: 518, baseType: !683, size: 128, align: 128, offset: 256)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 128, elements: !684)
!684 = !{!124, !375}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !678, file: !10, line: 520, baseType: !686, size: 4096, align: 128, offset: 384)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 4096, elements: !687)
!687 = !{!375, !76}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !678, file: !10, line: 521, baseType: !689, size: 6144, align: 128, offset: 4480)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 6144, elements: !690)
!690 = !{!691, !69}
!691 = !DISubrange(count: 24)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !9, file: !10, line: 732, baseType: !693, size: 82688, offset: 130944)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !9, file: !10, line: 525, size: 82688, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !722, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !740, !743, !747, !748, !749, !754, !755, !758, !759, !760, !761, !762, !763, !764, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !824, !855, !856, !857, !858, !859, !860, !861, !862, !863, !866, !867, !868, !871, !874, !876, !879, !881, !882}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !693, file: !10, line: 527, baseType: !19, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !693, file: !10, line: 530, baseType: !19, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !693, file: !10, line: 531, baseType: !19, size: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !693, file: !10, line: 532, baseType: !19, size: 32, offset: 96)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !693, file: !10, line: 535, baseType: !19, size: 32, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !693, file: !10, line: 536, baseType: !19, size: 32, offset: 160)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !693, file: !10, line: 537, baseType: !19, size: 32, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !693, file: !10, line: 538, baseType: !19, size: 32, offset: 224)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !693, file: !10, line: 539, baseType: !19, size: 32, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !693, file: !10, line: 542, baseType: !19, size: 32, offset: 288)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !693, file: !10, line: 543, baseType: !19, size: 32, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !693, file: !10, line: 544, baseType: !19, size: 32, offset: 352)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !693, file: !10, line: 545, baseType: !19, size: 32, offset: 384)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !693, file: !10, line: 546, baseType: !19, size: 32, offset: 416)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !693, file: !10, line: 547, baseType: !19, size: 32, offset: 448)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !693, file: !10, line: 548, baseType: !19, size: 32, offset: 480)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !693, file: !10, line: 549, baseType: !19, size: 32, offset: 512)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !693, file: !10, line: 551, baseType: !19, size: 32, offset: 544)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !693, file: !10, line: 554, baseType: !122, size: 64, offset: 576)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !693, file: !10, line: 555, baseType: !122, size: 64, offset: 640)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !693, file: !10, line: 558, baseType: !122, size: 64, offset: 704)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !693, file: !10, line: 559, baseType: !122, size: 64, offset: 768)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !693, file: !10, line: 561, baseType: !122, size: 64, offset: 832)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !693, file: !10, line: 562, baseType: !122, size: 64, offset: 896)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !693, file: !10, line: 565, baseType: !17, size: 32, offset: 960)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !693, file: !10, line: 566, baseType: !721, size: 128, offset: 992)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 128, elements: !374)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !693, file: !10, line: 567, baseType: !723, size: 512, offset: 1120)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 512, elements: !68)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !693, file: !10, line: 568, baseType: !17, size: 32, offset: 1632)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !693, file: !10, line: 569, baseType: !17, size: 32, offset: 1664)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !693, file: !10, line: 570, baseType: !19, size: 32, offset: 1696)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !693, file: !10, line: 571, baseType: !19, size: 32, offset: 1728)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !693, file: !10, line: 572, baseType: !19, size: 32, offset: 1760)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !693, file: !10, line: 573, baseType: !19, size: 32, offset: 1792)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !693, file: !10, line: 574, baseType: !19, size: 32, offset: 1824)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !693, file: !10, line: 575, baseType: !19, size: 32, offset: 1856)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !693, file: !10, line: 576, baseType: !19, size: 32, offset: 1888)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !693, file: !10, line: 577, baseType: !19, size: 32, offset: 1920)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !693, file: !10, line: 578, baseType: !19, size: 32, offset: 1952)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !693, file: !10, line: 585, baseType: !562, size: 64, offset: 1984)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !693, file: !10, line: 586, baseType: !214, size: 64, offset: 2048)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !693, file: !10, line: 587, baseType: !562, size: 64, offset: 2112)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !693, file: !10, line: 588, baseType: !739, size: 64, offset: 2176)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !693, file: !10, line: 589, baseType: !741, size: 64, offset: 2240)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 64, elements: !448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !693, file: !10, line: 591, baseType: !744, size: 64, offset: 2304)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 192, elements: !746)
!746 = !{!691}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !693, file: !10, line: 592, baseType: !562, size: 64, offset: 2368)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !693, file: !10, line: 593, baseType: !568, size: 128, offset: 2432)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !693, file: !10, line: 594, baseType: !750, size: 128, offset: 2560)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 128, elements: !123)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, elements: !753)
!753 = !{!449, !124}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !693, file: !10, line: 595, baseType: !584, size: 128, offset: 2688)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !693, file: !10, line: 596, baseType: !756, size: 4096, offset: 2816)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 4096, elements: !757)
!757 = !{!124, !465}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !693, file: !10, line: 597, baseType: !562, size: 64, offset: 6912)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !693, file: !10, line: 598, baseType: !562, size: 64, offset: 6976)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !693, file: !10, line: 599, baseType: !397, size: 64, offset: 7040)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !693, file: !10, line: 603, baseType: !557, size: 1024, offset: 7104)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !693, file: !10, line: 606, baseType: !19, size: 32, offset: 8128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !693, file: !10, line: 607, baseType: !19, size: 32, offset: 8160)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !693, file: !10, line: 608, baseType: !765, size: 32, align: 32, offset: 8192)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 32, elements: !374)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !693, file: !10, line: 609, baseType: !19, size: 32, offset: 8224)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !693, file: !10, line: 611, baseType: !19, size: 32, offset: 8256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !693, file: !10, line: 612, baseType: !19, size: 32, offset: 8288)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !693, file: !10, line: 614, baseType: !19, size: 32, offset: 8320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !693, file: !10, line: 615, baseType: !19, size: 32, offset: 8352)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !693, file: !10, line: 621, baseType: !19, size: 32, offset: 8384)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !693, file: !10, line: 624, baseType: !19, size: 32, offset: 8416)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !693, file: !10, line: 626, baseType: !19, size: 32, offset: 8448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !693, file: !10, line: 627, baseType: !19, size: 32, offset: 8480)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !693, file: !10, line: 671, baseType: !776, size: 60672, offset: 8576)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !693, file: !10, line: 629, size: 60672, elements: !777)
!777 = !{!778, !782, !786, !788, !789, !792, !796, !798, !799, !800, !801, !802, !805, !809, !812, !813, !814, !815, !816, !819, !821, !823}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !776, file: !10, line: 634, baseType: !779, size: 3072, align: 128)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 3072, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !776, file: !10, line: 635, baseType: !783, size: 6912, align: 128, offset: 3072)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 6912, elements: !784)
!784 = !{!785}
!785 = !DISubrange(count: 864)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !776, file: !10, line: 638, baseType: !787, size: 2048, align: 128, offset: 9984)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 2048, elements: !267)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !776, file: !10, line: 639, baseType: !787, size: 2048, align: 128, offset: 12032)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !776, file: !10, line: 640, baseType: !790, size: 3072, align: 128, offset: 14080)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 3072, elements: !791)
!791 = !{!466, !76}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !776, file: !10, line: 641, baseType: !793, size: 3840, align: 128, offset: 17152)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 3840, elements: !794)
!794 = !{!795, !69}
!795 = !DISubrange(count: 15)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !776, file: !10, line: 642, baseType: !797, size: 128, offset: 20992)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 128, elements: !374)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !776, file: !10, line: 643, baseType: !797, size: 128, offset: 21120)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !776, file: !10, line: 644, baseType: !19, size: 32, offset: 21248)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !776, file: !10, line: 645, baseType: !19, size: 32, offset: 21280)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !776, file: !10, line: 648, baseType: !686, size: 4096, align: 128, offset: 21376)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !776, file: !10, line: 649, baseType: !803, size: 4096, align: 128, offset: 25472)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 4096, elements: !804)
!804 = !{!69, !69}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_hadamard_cache", scope: !776, file: !10, line: 652, baseType: !806, size: 576, align: 128, offset: 29568)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 576, elements: !807)
!807 = !{!808}
!808 = !DISubrange(count: 9)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_satd_cache", scope: !776, file: !10, line: 653, baseType: !810, size: 1024, align: 128, offset: 30208)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 1024, elements: !811)
!811 = !{!465}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc", scope: !776, file: !10, line: 656, baseType: !546, size: 192, offset: 31232)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "p_fenc_plane", scope: !776, file: !10, line: 658, baseType: !546, size: 192, offset: 31424)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "p_fdec", scope: !776, file: !10, line: 661, baseType: !546, size: 192, offset: 31616)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "i_fref", scope: !776, file: !10, line: 664, baseType: !122, size: 64, offset: 31808)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref", scope: !776, file: !10, line: 665, baseType: !817, size: 24576, offset: 31872)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 24576, elements: !818)
!818 = !{!124, !465, !365}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "p_fref_w", scope: !776, file: !10, line: 666, baseType: !820, size: 2048, offset: 56448)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 2048, elements: !811)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "p_integral", scope: !776, file: !10, line: 667, baseType: !822, size: 2048, offset: 58496)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 2048, elements: !435)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !776, file: !10, line: 670, baseType: !538, size: 96, offset: 60544)
