; ModuleID = 'x264_src/encoder/encoder.c'
source_filename = "x264_src/encoder/encoder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_cpu_name_t = type { [16 x i8], i32 }
%struct.x264_level_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.x264_weight_t = type { [8 x i16], [8 x i16], i32, i32, i32, ptr, [8 x i8] }
%struct.x264_nal_t = type { i32, i32, i32, ptr }
%struct.anon.7 = type { i32, i32 }
%struct.bs_s = type { ptr, ptr, ptr, i64, i32, i32 }
%struct.x264_cabac_t = type { i32, i32, i32, i32, ptr, ptr, ptr, [8 x i8], i32, [460 x i8] }
%struct.anon.6 = type { i32, i32 }

@.str = private unnamed_addr constant [50 x i8] c"DTS compresion changed timebase: %u/%u -> %u/%lu\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [58 x i8] c"Effective timebase denominator %lu exceeds H.264 maximum\0A\00", align 1, !dbg !7
@i_chroma_qp_table = internal constant [76 x i8] c"\00\00\00\00\00\00\00\00\00\00\00\00\00\01\02\03\04\05\06\07\08\09\0A\0B\0C\0D\0E\0F\10\11\12\13\14\15\16\17\18\19\1A\1B\1C\1D\1D\1E\1F  !\22\22##$$%%%&&&''''''''''''''''", align 16, !dbg !12
@.str.2 = private unnamed_addr constant [24 x i8] c"using cpu capabilities:\00", align 1, !dbg !192
@x264_cpu_names = external constant [0 x %struct.x264_cpu_name_t], align 4
@.str.3 = private unnamed_addr constant [5 x i8] c"SSE2\00", align 1, !dbg !197

!222 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1055, type: !223, isLocal: true, isDefinition: true)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 45)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1057, type: !228, isLocal: true, isDefinition: true)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 520, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 65)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1058, type: !233, isLocal: true, isDefinition: true)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 21)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1112, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 26)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1113, type: !243, isLocal: true, isDefinition: true)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !244)
!244 = !{!245}
!245 = !DISubrange(count: 19)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1119, type: !248, isLocal: true, isDefinition: true)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !181)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1122, type: !251, isLocal: true, isDefinition: true)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 29)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1127, type: !218, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1133, type: !258, isLocal: true, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 25)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1134, type: !263, isLocal: true, isDefinition: true)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 9)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1135, type: !199, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1136, type: !199, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1137, type: !272, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 22)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2256, type: !277, isLocal: true, isDefinition: true)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !278)
!278 = !{!279}
!279 = !DISubrange(count: 28)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "slice_order", scope: !282, file: !2, line: 2876, type: !1671, isLocal: true, isDefinition: true)
!282 = distinct !DISubprogram(name: "x264_encoder_close", scope: !2, file: !2, line: 2838, type: !283, scopeLine: 2839, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !1557)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !285}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !29, line: 46, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !59, line: 381, size: 266752, elements: !288)
!288 = !{!289, !454, !458, !459, !460, !461, !462, !463, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !594, !596, !624, !626, !627, !628, !632, !636, !637, !638, !642, !646, !647, !648, !653, !656, !657, !736, !753, !912, !913, !914, !915, !917, !918, !919, !920, !921, !922, !923, !937, !1127, !1131, !1190, !1193, !1195, !1197, !1198, !1201, !1206, !1212, !1213, !1221, !1223, !1228, !1303, !1389, !1433, !1455, !1504, !1533}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !287, file: !59, line: 384, baseType: !290, size: 5632)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !29, line: 376, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !29, line: 176, size: 5632, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !335, !339, !340, !341, !342, !346, !347, !360, !361, !362, !363, !364, !392, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !291, file: !29, line: 179, baseType: !18, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !291, file: !29, line: 180, baseType: !156, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !291, file: !29, line: 181, baseType: !156, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !291, file: !29, line: 182, baseType: !156, size: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !291, file: !29, line: 183, baseType: !156, size: 32, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !291, file: !29, line: 186, baseType: !156, size: 32, offset: 160)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !291, file: !29, line: 187, baseType: !156, size: 32, offset: 192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !291, file: !29, line: 188, baseType: !156, size: 32, offset: 224)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !291, file: !29, line: 189, baseType: !156, size: 32, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !291, file: !29, line: 190, baseType: !156, size: 32, offset: 288)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !291, file: !29, line: 198, baseType: !156, size: 32, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !291, file: !29, line: 215, baseType: !305, size: 288, offset: 352)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !291, file: !29, line: 200, size: 288, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !305, file: !29, line: 203, baseType: !156, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !305, file: !29, line: 204, baseType: !156, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !305, file: !29, line: 206, baseType: !156, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !305, file: !29, line: 209, baseType: !156, size: 32, offset: 96)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !305, file: !29, line: 210, baseType: !156, size: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !305, file: !29, line: 211, baseType: !156, size: 32, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !305, file: !29, line: 212, baseType: !156, size: 32, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !305, file: !29, line: 213, baseType: !156, size: 32, offset: 224)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !305, file: !29, line: 214, baseType: !156, size: 32, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !291, file: !29, line: 218, baseType: !156, size: 32, offset: 640)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !291, file: !29, line: 219, baseType: !156, size: 32, offset: 672)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !291, file: !29, line: 220, baseType: !156, size: 32, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !291, file: !29, line: 221, baseType: !156, size: 32, offset: 736)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !291, file: !29, line: 222, baseType: !156, size: 32, offset: 768)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !291, file: !29, line: 224, baseType: !156, size: 32, offset: 800)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !291, file: !29, line: 225, baseType: !156, size: 32, offset: 832)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !291, file: !29, line: 226, baseType: !156, size: 32, offset: 864)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !291, file: !29, line: 227, baseType: !156, size: 32, offset: 896)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !291, file: !29, line: 229, baseType: !156, size: 32, offset: 928)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !291, file: !29, line: 230, baseType: !156, size: 32, offset: 960)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !291, file: !29, line: 231, baseType: !156, size: 32, offset: 992)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !291, file: !29, line: 233, baseType: !156, size: 32, offset: 1024)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !291, file: !29, line: 234, baseType: !156, size: 32, offset: 1056)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !291, file: !29, line: 236, baseType: !156, size: 32, offset: 1088)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !291, file: !29, line: 237, baseType: !156, size: 32, offset: 1120)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !291, file: !29, line: 239, baseType: !156, size: 32, offset: 1152)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !291, file: !29, line: 240, baseType: !334, size: 64, offset: 1216)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !291, file: !29, line: 241, baseType: !336, size: 128, offset: 1280)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 128, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 16)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !291, file: !29, line: 242, baseType: !336, size: 128, offset: 1408)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !291, file: !29, line: 243, baseType: !336, size: 128, offset: 1536)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !291, file: !29, line: 244, baseType: !336, size: 128, offset: 1664)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !291, file: !29, line: 245, baseType: !343, size: 512, offset: 1792)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 512, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !291, file: !29, line: 246, baseType: !343, size: 512, offset: 2304)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !291, file: !29, line: 249, baseType: !348, size: 64, offset: 2816)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !157, !156, !351, !353}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !355)
!355 = !{!356, !357, !358, !359}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !354, file: !2, baseType: !18, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !354, file: !2, baseType: !18, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !354, file: !2, baseType: !157, size: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !354, file: !2, baseType: !157, size: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !291, file: !29, line: 250, baseType: !157, size: 64, offset: 2880)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !291, file: !29, line: 251, baseType: !156, size: 32, offset: 2944)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !291, file: !29, line: 252, baseType: !156, size: 32, offset: 2976)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !291, file: !29, line: 253, baseType: !334, size: 64, offset: 3008)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !291, file: !29, line: 287, baseType: !365, size: 800, offset: 3072)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !291, file: !29, line: 256, size: 800, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !390, !391}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !365, file: !29, line: 258, baseType: !18, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !365, file: !29, line: 259, baseType: !18, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !365, file: !29, line: 261, baseType: !156, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !365, file: !29, line: 262, baseType: !156, size: 32, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !365, file: !29, line: 263, baseType: !156, size: 32, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !365, file: !29, line: 264, baseType: !156, size: 32, offset: 160)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !365, file: !29, line: 265, baseType: !156, size: 32, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !365, file: !29, line: 267, baseType: !156, size: 32, offset: 224)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !365, file: !29, line: 268, baseType: !156, size: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !365, file: !29, line: 269, baseType: !156, size: 32, offset: 288)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !365, file: !29, line: 270, baseType: !156, size: 32, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !365, file: !29, line: 271, baseType: !156, size: 32, offset: 352)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !365, file: !29, line: 272, baseType: !156, size: 32, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !365, file: !29, line: 273, baseType: !156, size: 32, offset: 416)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !365, file: !29, line: 274, baseType: !156, size: 32, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !365, file: !29, line: 275, baseType: !156, size: 32, offset: 480)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !365, file: !29, line: 276, baseType: !156, size: 32, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !365, file: !29, line: 277, baseType: !156, size: 32, offset: 544)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !365, file: !29, line: 278, baseType: !158, size: 32, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !365, file: !29, line: 279, baseType: !158, size: 32, offset: 608)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !365, file: !29, line: 280, baseType: !156, size: 32, offset: 640)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !365, file: !29, line: 283, baseType: !389, size: 64, offset: 672)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 64, elements: !181)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !365, file: !29, line: 285, baseType: !156, size: 32, offset: 736)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !365, file: !29, line: 286, baseType: !156, size: 32, offset: 768)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !291, file: !29, line: 327, baseType: !393, size: 1152, offset: 3904)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !291, file: !29, line: 290, size: 1152, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !432, !433}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !393, file: !29, line: 292, baseType: !156, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !393, file: !29, line: 294, baseType: !156, size: 32, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !393, file: !29, line: 295, baseType: !156, size: 32, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !393, file: !29, line: 296, baseType: !156, size: 32, offset: 96)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !393, file: !29, line: 297, baseType: !156, size: 32, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !393, file: !29, line: 299, baseType: !156, size: 32, offset: 160)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !393, file: !29, line: 300, baseType: !158, size: 32, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !393, file: !29, line: 301, baseType: !158, size: 32, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !393, file: !29, line: 302, baseType: !158, size: 32, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !393, file: !29, line: 303, baseType: !156, size: 32, offset: 288)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !393, file: !29, line: 304, baseType: !156, size: 32, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !393, file: !29, line: 305, baseType: !158, size: 32, offset: 352)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !393, file: !29, line: 306, baseType: !158, size: 32, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !393, file: !29, line: 307, baseType: !158, size: 32, offset: 416)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !393, file: !29, line: 309, baseType: !156, size: 32, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !393, file: !29, line: 310, baseType: !158, size: 32, offset: 480)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !393, file: !29, line: 311, baseType: !156, size: 32, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !393, file: !29, line: 312, baseType: !156, size: 32, offset: 544)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !393, file: !29, line: 315, baseType: !156, size: 32, offset: 576)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !393, file: !29, line: 316, baseType: !334, size: 64, offset: 640)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !393, file: !29, line: 317, baseType: !156, size: 32, offset: 704)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !393, file: !29, line: 318, baseType: !334, size: 64, offset: 768)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !393, file: !29, line: 321, baseType: !158, size: 32, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !393, file: !29, line: 322, baseType: !158, size: 32, offset: 864)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !393, file: !29, line: 323, baseType: !158, size: 32, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !393, file: !29, line: 324, baseType: !421, size: 64, offset: 960)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !29, line: 174, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 167, size: 256, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !423, file: !29, line: 169, baseType: !156, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !423, file: !29, line: 169, baseType: !156, size: 32, offset: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !423, file: !29, line: 170, baseType: !156, size: 32, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !423, file: !29, line: 171, baseType: !156, size: 32, offset: 96)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !423, file: !29, line: 172, baseType: !158, size: 32, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !423, file: !29, line: 173, baseType: !431, size: 64, offset: 192)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !393, file: !29, line: 325, baseType: !156, size: 32, offset: 1024)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !393, file: !29, line: 326, baseType: !334, size: 64, offset: 1088)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !291, file: !29, line: 330, baseType: !156, size: 32, offset: 5056)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !291, file: !29, line: 331, baseType: !156, size: 32, offset: 5088)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !291, file: !29, line: 332, baseType: !156, size: 32, offset: 5120)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !291, file: !29, line: 334, baseType: !156, size: 32, offset: 5152)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !291, file: !29, line: 335, baseType: !156, size: 32, offset: 5184)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !291, file: !29, line: 336, baseType: !174, size: 32, offset: 5216)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !291, file: !29, line: 337, baseType: !174, size: 32, offset: 5248)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !291, file: !29, line: 338, baseType: !174, size: 32, offset: 5280)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !291, file: !29, line: 339, baseType: !174, size: 32, offset: 5312)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !291, file: !29, line: 340, baseType: !156, size: 32, offset: 5344)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !291, file: !29, line: 344, baseType: !156, size: 32, offset: 5376)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !291, file: !29, line: 356, baseType: !156, size: 32, offset: 5408)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !291, file: !29, line: 364, baseType: !156, size: 32, offset: 5440)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !291, file: !29, line: 367, baseType: !156, size: 32, offset: 5472)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !291, file: !29, line: 368, baseType: !156, size: 32, offset: 5504)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !291, file: !29, line: 369, baseType: !156, size: 32, offset: 5536)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !291, file: !29, line: 375, baseType: !451, size: 64, offset: 5568)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !157}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !287, file: !59, line: 386, baseType: !455, size: 8256, offset: 5632)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 8256, elements: !456)
!456 = !{!457}
!457 = !DISubrange(count: 129)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !287, file: !59, line: 387, baseType: !156, size: 32, offset: 13888)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !287, file: !59, line: 388, baseType: !156, size: 32, offset: 13920)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !287, file: !59, line: 389, baseType: !156, size: 32, offset: 13952)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !287, file: !59, line: 390, baseType: !156, size: 32, offset: 13984)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !287, file: !59, line: 391, baseType: !156, size: 32, offset: 14016)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !287, file: !59, line: 402, baseType: !464, size: 576, offset: 14080)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !287, file: !59, line: 394, size: 576, elements: !465)
!465 = !{!466, !467, !468, !477, !478, !479}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !464, file: !59, line: 396, baseType: !156, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !464, file: !59, line: 397, baseType: !156, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !464, file: !59, line: 398, baseType: !469, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !29, line: 604, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 593, size: 192, elements: !472)
!472 = !{!473, !474, !475, !476}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !471, file: !29, line: 595, baseType: !156, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !471, file: !29, line: 596, baseType: !156, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !471, file: !29, line: 599, baseType: !156, size: 32, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !471, file: !29, line: 603, baseType: !163, size: 64, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !464, file: !59, line: 399, baseType: !156, size: 32, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !464, file: !59, line: 400, baseType: !163, size: 64, offset: 192)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !464, file: !59, line: 401, baseType: !480, size: 320, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !481, line: 56, baseType: !482)
!481 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !481, line: 47, size: 320, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !482, file: !481, line: 49, baseType: !163, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !482, file: !481, line: 50, baseType: !163, size: 64, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !482, file: !481, line: 51, baseType: !163, size: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !482, file: !481, line: 53, baseType: !159, size: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !482, file: !481, line: 54, baseType: !156, size: 32, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !482, file: !481, line: 55, baseType: !156, size: 32, offset: 288)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !287, file: !59, line: 404, baseType: !163, size: 64, offset: 14656)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !287, file: !59, line: 405, baseType: !156, size: 32, offset: 14720)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !287, file: !59, line: 410, baseType: !156, size: 32, offset: 14752)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !287, file: !59, line: 411, baseType: !156, size: 32, offset: 14784)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !287, file: !59, line: 413, baseType: !156, size: 32, offset: 14816)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !287, file: !59, line: 415, baseType: !156, size: 32, offset: 14848)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !287, file: !59, line: 416, baseType: !156, size: 32, offset: 14880)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !287, file: !59, line: 418, baseType: !156, size: 32, offset: 14912)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !287, file: !59, line: 419, baseType: !156, size: 32, offset: 14944)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !287, file: !59, line: 420, baseType: !156, size: 32, offset: 14976)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !287, file: !59, line: 421, baseType: !156, size: 32, offset: 15008)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !287, file: !59, line: 422, baseType: !156, size: 32, offset: 15040)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !287, file: !59, line: 424, baseType: !156, size: 32, offset: 15072)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !287, file: !59, line: 425, baseType: !156, size: 32, offset: 15104)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !287, file: !59, line: 427, baseType: !156, size: 32, offset: 15136)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !287, file: !59, line: 430, baseType: !506, size: 10400, offset: 15168)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 10400, elements: !592)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !17, line: 154, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 52, size: 10400, elements: !509)
!509 = !{!510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !527, !528, !529, !530, !531, !532, !533, !534, !535, !542, !543, !591}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !508, file: !17, line: 54, baseType: !156, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !508, file: !17, line: 56, baseType: !156, size: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !508, file: !17, line: 57, baseType: !156, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !508, file: !17, line: 59, baseType: !156, size: 32, offset: 96)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !508, file: !17, line: 60, baseType: !156, size: 32, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !508, file: !17, line: 61, baseType: !156, size: 32, offset: 160)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !508, file: !17, line: 63, baseType: !156, size: 32, offset: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !508, file: !17, line: 65, baseType: !156, size: 32, offset: 224)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !508, file: !17, line: 67, baseType: !156, size: 32, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !508, file: !17, line: 69, baseType: !156, size: 32, offset: 288)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !508, file: !17, line: 70, baseType: !156, size: 32, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !508, file: !17, line: 71, baseType: !156, size: 32, offset: 352)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !508, file: !17, line: 72, baseType: !156, size: 32, offset: 384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !508, file: !17, line: 73, baseType: !524, size: 8192, offset: 416)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 8192, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 256)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !508, file: !17, line: 75, baseType: !156, size: 32, offset: 8608)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !508, file: !17, line: 76, baseType: !156, size: 32, offset: 8640)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !508, file: !17, line: 77, baseType: !156, size: 32, offset: 8672)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !508, file: !17, line: 78, baseType: !156, size: 32, offset: 8704)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !508, file: !17, line: 79, baseType: !156, size: 32, offset: 8736)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !508, file: !17, line: 80, baseType: !156, size: 32, offset: 8768)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !508, file: !17, line: 81, baseType: !156, size: 32, offset: 8800)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !508, file: !17, line: 83, baseType: !156, size: 32, offset: 8832)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !508, file: !17, line: 90, baseType: !536, size: 128, offset: 8864)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !508, file: !17, line: 84, size: 128, elements: !537)
!537 = !{!538, !539, !540, !541}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !536, file: !17, line: 86, baseType: !156, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !536, file: !17, line: 87, baseType: !156, size: 32, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !536, file: !17, line: 88, baseType: !156, size: 32, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !536, file: !17, line: 89, baseType: !156, size: 32, offset: 96)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !508, file: !17, line: 92, baseType: !156, size: 32, offset: 8992)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !508, file: !17, line: 150, baseType: !544, size: 1344, offset: 9024)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !508, file: !17, line: 93, size: 1344, elements: !545)
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !582, !583, !584, !585, !586, !587, !588, !589, !590}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !544, file: !17, line: 95, baseType: !156, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !544, file: !17, line: 96, baseType: !156, size: 32, offset: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !544, file: !17, line: 97, baseType: !156, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !544, file: !17, line: 99, baseType: !156, size: 32, offset: 96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !544, file: !17, line: 100, baseType: !156, size: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !544, file: !17, line: 102, baseType: !156, size: 32, offset: 160)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !544, file: !17, line: 103, baseType: !156, size: 32, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !544, file: !17, line: 104, baseType: !156, size: 32, offset: 224)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !544, file: !17, line: 105, baseType: !156, size: 32, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !544, file: !17, line: 106, baseType: !156, size: 32, offset: 288)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !544, file: !17, line: 107, baseType: !156, size: 32, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !544, file: !17, line: 108, baseType: !156, size: 32, offset: 352)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !544, file: !17, line: 110, baseType: !156, size: 32, offset: 384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !544, file: !17, line: 111, baseType: !156, size: 32, offset: 416)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !544, file: !17, line: 112, baseType: !156, size: 32, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !544, file: !17, line: 114, baseType: !156, size: 32, offset: 480)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !544, file: !17, line: 115, baseType: !174, size: 32, offset: 512)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !544, file: !17, line: 116, baseType: !174, size: 32, offset: 544)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !544, file: !17, line: 117, baseType: !156, size: 32, offset: 576)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !544, file: !17, line: 119, baseType: !156, size: 32, offset: 608)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !544, file: !17, line: 120, baseType: !156, size: 32, offset: 640)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !544, file: !17, line: 137, baseType: !568, size: 384, offset: 672)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !544, file: !17, line: 122, size: 384, elements: !569)
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !568, file: !17, line: 124, baseType: !156, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !568, file: !17, line: 125, baseType: !156, size: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !568, file: !17, line: 126, baseType: !156, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !568, file: !17, line: 127, baseType: !156, size: 32, offset: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !568, file: !17, line: 128, baseType: !156, size: 32, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !568, file: !17, line: 129, baseType: !156, size: 32, offset: 160)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !568, file: !17, line: 130, baseType: !156, size: 32, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !568, file: !17, line: 131, baseType: !156, size: 32, offset: 224)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !568, file: !17, line: 133, baseType: !156, size: 32, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !568, file: !17, line: 134, baseType: !156, size: 32, offset: 288)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !568, file: !17, line: 135, baseType: !156, size: 32, offset: 320)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !568, file: !17, line: 136, baseType: !156, size: 32, offset: 352)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !544, file: !17, line: 139, baseType: !156, size: 32, offset: 1056)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !544, file: !17, line: 140, baseType: !156, size: 32, offset: 1088)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !544, file: !17, line: 141, baseType: !156, size: 32, offset: 1120)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !544, file: !17, line: 142, baseType: !156, size: 32, offset: 1152)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !544, file: !17, line: 143, baseType: !156, size: 32, offset: 1184)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !544, file: !17, line: 144, baseType: !156, size: 32, offset: 1216)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !544, file: !17, line: 145, baseType: !156, size: 32, offset: 1248)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !544, file: !17, line: 146, baseType: !156, size: 32, offset: 1280)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !544, file: !17, line: 147, baseType: !156, size: 32, offset: 1312)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !508, file: !17, line: 152, baseType: !156, size: 32, offset: 10368)
!592 = !{!593}
!593 = !DISubrange(count: 1)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !287, file: !59, line: 431, baseType: !595, size: 64, offset: 25600)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !287, file: !59, line: 432, baseType: !597, size: 960, offset: 25664)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 960, elements: !592)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !17, line: 186, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !17, line: 156, size: 960, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !599, file: !17, line: 158, baseType: !156, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !599, file: !17, line: 159, baseType: !156, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !599, file: !17, line: 161, baseType: !156, size: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !599, file: !17, line: 163, baseType: !156, size: 32, offset: 96)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !599, file: !17, line: 164, baseType: !156, size: 32, offset: 128)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !599, file: !17, line: 166, baseType: !156, size: 32, offset: 160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !599, file: !17, line: 167, baseType: !156, size: 32, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !599, file: !17, line: 169, baseType: !156, size: 32, offset: 224)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !599, file: !17, line: 170, baseType: !156, size: 32, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !599, file: !17, line: 172, baseType: !156, size: 32, offset: 288)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !599, file: !17, line: 173, baseType: !156, size: 32, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !599, file: !17, line: 175, baseType: !156, size: 32, offset: 352)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !599, file: !17, line: 177, baseType: !156, size: 32, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !599, file: !17, line: 178, baseType: !156, size: 32, offset: 416)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !599, file: !17, line: 179, baseType: !156, size: 32, offset: 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !599, file: !17, line: 181, baseType: !156, size: 32, offset: 480)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !599, file: !17, line: 183, baseType: !156, size: 32, offset: 512)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !599, file: !17, line: 184, baseType: !619, size: 384, offset: 576)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 384, elements: !622)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!622 = !{!623}
!623 = !DISubrange(count: 6)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !287, file: !59, line: 433, baseType: !625, size: 64, offset: 26624)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !287, file: !59, line: 434, baseType: !156, size: 32, offset: 26688)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !287, file: !59, line: 437, baseType: !156, size: 32, offset: 26720)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !287, file: !59, line: 440, baseType: !629, size: 256, offset: 26752)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 256, elements: !185)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 512, elements: !337)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !287, file: !59, line: 441, baseType: !633, size: 128, offset: 27008)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 128, elements: !181)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 2048, elements: !344)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !287, file: !59, line: 443, baseType: !629, size: 256, offset: 27136)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !287, file: !59, line: 444, baseType: !633, size: 128, offset: 27392)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !287, file: !59, line: 446, baseType: !639, size: 256, offset: 27520)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 256, elements: !185)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 256, elements: !337)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !287, file: !59, line: 447, baseType: !643, size: 128, offset: 27776)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 128, elements: !181)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 1024, elements: !344)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !287, file: !59, line: 448, baseType: !639, size: 256, offset: 27904)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !287, file: !59, line: 449, baseType: !643, size: 128, offset: 28160)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !287, file: !59, line: 454, baseType: !649, size: 5888, offset: 28288)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 5888, elements: !651)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!651 = !{!652}
!652 = !DISubrange(count: 92)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !287, file: !59, line: 455, baseType: !654, size: 23552, offset: 34176)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 23552, elements: !655)
!655 = !{!652, !186}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !287, file: !59, line: 457, baseType: !620, size: 64, offset: 57728)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !287, file: !59, line: 460, baseType: !658, size: 53376, offset: 57856)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !59, line: 364, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !59, line: 302, size: 53376, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !689, !720, !721, !722, !728, !729, !730, !731, !732, !733, !734, !735}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !659, file: !59, line: 304, baseType: !595, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !659, file: !59, line: 305, baseType: !625, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !659, file: !59, line: 307, baseType: !156, size: 32, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !659, file: !59, line: 308, baseType: !156, size: 32, offset: 160)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !659, file: !59, line: 309, baseType: !156, size: 32, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !659, file: !59, line: 311, baseType: !156, size: 32, offset: 224)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !659, file: !59, line: 313, baseType: !156, size: 32, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !659, file: !59, line: 315, baseType: !156, size: 32, offset: 288)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !659, file: !59, line: 316, baseType: !156, size: 32, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !659, file: !59, line: 317, baseType: !156, size: 32, offset: 352)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !659, file: !59, line: 319, baseType: !156, size: 32, offset: 384)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !659, file: !59, line: 321, baseType: !156, size: 32, offset: 416)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !659, file: !59, line: 322, baseType: !156, size: 32, offset: 448)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !659, file: !59, line: 324, baseType: !389, size: 64, offset: 480)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !659, file: !59, line: 325, baseType: !156, size: 32, offset: 544)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !659, file: !59, line: 327, baseType: !156, size: 32, offset: 576)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !659, file: !59, line: 329, baseType: !156, size: 32, offset: 608)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !659, file: !59, line: 330, baseType: !156, size: 32, offset: 640)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !659, file: !59, line: 331, baseType: !156, size: 32, offset: 672)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !659, file: !59, line: 333, baseType: !156, size: 32, offset: 704)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !659, file: !59, line: 334, baseType: !156, size: 32, offset: 736)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !659, file: !59, line: 339, baseType: !683, size: 2048, offset: 768)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 2048, elements: !688)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !659, file: !59, line: 335, size: 64, elements: !685)
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !684, file: !59, line: 337, baseType: !156, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !684, file: !59, line: 338, baseType: !156, size: 32, offset: 32)
!688 = !{!182, !338}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !659, file: !59, line: 342, baseType: !690, size: 49152, align: 128, offset: 2816)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 49152, align: 128, elements: !717)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !692, line: 36, baseType: !693, align: 128)
!692 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !692, line: 26, size: 512, elements: !694)
!694 = !{!695, !703, !704, !707, !708, !709}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !693, file: !692, line: 30, baseType: !696, size: 128, align: 128)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 128, elements: !701)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !698, line: 25, baseType: !699)
!698 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !167, line: 39, baseType: !700)
!700 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!701 = !{!702}
!702 = !DISubrange(count: 8)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !693, file: !692, line: 31, baseType: !696, size: 128, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !693, file: !692, line: 32, baseType: !705, size: 32, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !698, line: 26, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !167, line: 41, baseType: !156)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !693, file: !692, line: 33, baseType: !705, size: 32, offset: 288)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !693, file: !692, line: 34, baseType: !705, size: 32, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !693, file: !692, line: 35, baseType: !710, size: 64, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !692, line: 25, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !163, !156, !163, !156, !715, !156}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !693)
!717 = !{!718, !719}
!718 = !DISubrange(count: 32)
!719 = !DISubrange(count: 3)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !659, file: !59, line: 344, baseType: !156, size: 32, offset: 51968)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !659, file: !59, line: 345, baseType: !156, size: 32, offset: 52000)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !659, file: !59, line: 350, baseType: !723, size: 1024, offset: 52032)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 1024, elements: !337)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !659, file: !59, line: 346, size: 64, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !724, file: !59, line: 348, baseType: !156, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !724, file: !59, line: 349, baseType: !156, size: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !659, file: !59, line: 352, baseType: !156, size: 32, offset: 53056)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !659, file: !59, line: 354, baseType: !156, size: 32, offset: 53088)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !659, file: !59, line: 355, baseType: !156, size: 32, offset: 53120)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !659, file: !59, line: 356, baseType: !156, size: 32, offset: 53152)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !659, file: !59, line: 357, baseType: !156, size: 32, offset: 53184)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !659, file: !59, line: 360, baseType: !156, size: 32, offset: 53216)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !659, file: !59, line: 361, baseType: !156, size: 32, offset: 53248)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !659, file: !59, line: 362, baseType: !156, size: 32, offset: 53280)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !287, file: !59, line: 463, baseType: !737, size: 4096, offset: 111232)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !738, line: 46, baseType: !739)
!738 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !738, line: 27, size: 4096, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !739, file: !738, line: 30, baseType: !156, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !739, file: !738, line: 31, baseType: !156, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !739, file: !738, line: 34, baseType: !156, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !739, file: !738, line: 35, baseType: !156, size: 32, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !739, file: !738, line: 37, baseType: !163, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !739, file: !738, line: 38, baseType: !163, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !739, file: !738, line: 39, baseType: !163, size: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !739, file: !738, line: 42, baseType: !156, size: 32, align: 128, offset: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !739, file: !738, line: 45, baseType: !750, size: 3680, offset: 416)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 3680, elements: !751)
!751 = !{!752}
!752 = !DISubrange(count: 460)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !287, file: !59, line: 494, baseType: !754, size: 2112, offset: 115328)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !287, file: !59, line: 465, size: 2112, elements: !755)
!755 = !{!756, !892, !894, !895, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !908, !909, !910, !911}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !754, file: !59, line: 468, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !760, line: 146, baseType: !761)
!760 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !760, line: 31, size: 125056, elements: !762)
!762 = !{!763, !764, !765, !766, !769, !770, !771, !772, !773, !774, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !793, !794, !795, !796, !797, !798, !800, !802, !803, !804, !805, !806, !809, !811, !812, !814, !819, !820, !824, !825, !829, !833, !835, !837, !838, !840, !841, !843, !844, !845, !848, !850, !851, !852, !854, !855, !856, !857, !858, !859, !860, !861, !863, !864, !865, !873, !877, !879, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !761, file: !760, line: 34, baseType: !156, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !761, file: !760, line: 35, baseType: !156, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !761, file: !760, line: 36, baseType: !156, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !761, file: !760, line: 37, baseType: !767, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !698, line: 27, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !167, line: 44, baseType: !161)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !761, file: !760, line: 38, baseType: !767, size: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !761, file: !760, line: 39, baseType: !156, size: 32, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !761, file: !760, line: 40, baseType: !156, size: 32, offset: 288)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !761, file: !760, line: 41, baseType: !156, size: 32, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !761, file: !760, line: 42, baseType: !156, size: 32, offset: 352)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !761, file: !760, line: 43, baseType: !775, size: 64, offset: 384)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !761, file: !760, line: 45, baseType: !156, size: 32, offset: 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !761, file: !760, line: 46, baseType: !156, size: 32, offset: 480)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !761, file: !760, line: 47, baseType: !156, size: 32, offset: 512)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !761, file: !760, line: 48, baseType: !156, size: 32, offset: 544)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !761, file: !760, line: 49, baseType: !156, size: 32, offset: 576)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !761, file: !760, line: 50, baseType: !156, size: 32, offset: 608)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !761, file: !760, line: 51, baseType: !156, size: 32, offset: 640)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !761, file: !760, line: 52, baseType: !164, size: 8, offset: 672)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !761, file: !760, line: 53, baseType: !164, size: 8, offset: 680)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !761, file: !760, line: 54, baseType: !164, size: 8, offset: 688)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !761, file: !760, line: 55, baseType: !158, size: 32, offset: 704)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !761, file: !760, line: 56, baseType: !158, size: 32, offset: 736)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !761, file: !760, line: 57, baseType: !156, size: 32, offset: 768)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !761, file: !760, line: 60, baseType: !156, size: 32, offset: 800)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !761, file: !760, line: 61, baseType: !791, size: 96, offset: 832)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 96, elements: !792)
!792 = !{!719}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !761, file: !760, line: 62, baseType: !791, size: 96, offset: 928)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !761, file: !760, line: 63, baseType: !791, size: 96, offset: 1024)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !761, file: !760, line: 64, baseType: !156, size: 32, offset: 1120)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !761, file: !760, line: 65, baseType: !156, size: 32, offset: 1152)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !761, file: !760, line: 66, baseType: !156, size: 32, offset: 1184)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !761, file: !760, line: 67, baseType: !799, size: 192, offset: 1216)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 192, elements: !792)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !761, file: !760, line: 68, baseType: !801, size: 256, offset: 1408)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 256, elements: !185)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !761, file: !760, line: 69, baseType: !801, size: 256, offset: 1664)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !761, file: !760, line: 70, baseType: !650, size: 64, offset: 1920)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !761, file: !760, line: 74, baseType: !801, size: 256, offset: 1984)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !761, file: !760, line: 75, baseType: !801, size: 256, offset: 2240)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !761, file: !760, line: 77, baseType: !807, size: 24576, align: 128, offset: 2560)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 24576, align: 128, elements: !808)
!808 = !{!338, !719}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !761, file: !760, line: 78, baseType: !810, size: 1024, offset: 27136)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 1024, elements: !337)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !761, file: !760, line: 79, baseType: !156, size: 32, offset: 28160)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !761, file: !760, line: 80, baseType: !813, size: 64, offset: 28224)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !761, file: !760, line: 83, baseType: !815, size: 64, offset: 28288)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !698, line: 24, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !167, line: 37, baseType: !818)
!818 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !761, file: !760, line: 84, baseType: !163, size: 64, offset: 28352)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !761, file: !760, line: 85, baseType: !821, size: 128, offset: 28416)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 128, elements: !181)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 32, elements: !181)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !761, file: !760, line: 86, baseType: !822, size: 64, offset: 28544)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !761, file: !760, line: 87, baseType: !826, size: 2176, offset: 28608)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 2176, elements: !827)
!827 = !{!182, !828}
!828 = !DISubrange(count: 17)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !761, file: !760, line: 92, baseType: !830, size: 20736, offset: 30784)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 20736, elements: !831)
!831 = !{!832, !832}
!832 = !DISubrange(count: 18)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !761, file: !760, line: 96, baseType: !834, size: 2176, offset: 51520)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 2176, elements: !827)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !761, file: !760, line: 97, baseType: !836, size: 128, offset: 53696)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 128, elements: !181)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !761, file: !760, line: 98, baseType: !389, size: 64, offset: 53824)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !761, file: !760, line: 99, baseType: !839, size: 1024, offset: 53888)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 1024, elements: !688)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !761, file: !760, line: 100, baseType: !823, size: 32, offset: 54912)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !761, file: !760, line: 105, baseType: !842, size: 10368, offset: 54944)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 10368, elements: !831)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !761, file: !760, line: 106, baseType: !842, size: 10368, offset: 65312)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !761, file: !760, line: 107, baseType: !156, size: 32, offset: 75680)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !761, file: !760, line: 108, baseType: !846, size: 576, offset: 75712)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 576, elements: !847)
!847 = !{!832}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !761, file: !760, line: 109, baseType: !849, size: 20736, offset: 76288)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 20736, elements: !831)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !761, file: !760, line: 110, baseType: !190, size: 64, offset: 97024)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !761, file: !760, line: 111, baseType: !190, size: 64, offset: 97088)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !761, file: !760, line: 112, baseType: !853, size: 64, offset: 97152)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !761, file: !760, line: 113, baseType: !853, size: 64, offset: 97216)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !761, file: !760, line: 114, baseType: !853, size: 64, offset: 97280)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !761, file: !760, line: 115, baseType: !156, size: 32, offset: 97344)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !761, file: !760, line: 116, baseType: !650, size: 64, offset: 97408)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !761, file: !760, line: 117, baseType: !650, size: 64, offset: 97472)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !761, file: !760, line: 118, baseType: !650, size: 64, offset: 97536)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !761, file: !760, line: 119, baseType: !156, size: 32, offset: 97600)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !761, file: !760, line: 120, baseType: !862, size: 576, offset: 97632)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 576, elements: !847)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !761, file: !760, line: 121, baseType: !174, size: 32, offset: 98208)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !761, file: !760, line: 122, baseType: !187, size: 64, offset: 98240)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !761, file: !760, line: 125, baseType: !866, size: 256, offset: 98304)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !29, line: 503, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 496, size: 256, elements: !868)
!868 = !{!869, !870, !871, !872}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !867, file: !29, line: 498, baseType: !162, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !867, file: !29, line: 499, baseType: !162, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !867, file: !29, line: 500, baseType: !162, size: 64, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !867, file: !29, line: 502, baseType: !162, size: 64, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !761, file: !760, line: 128, baseType: !874, size: 2008, offset: 98560)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 2008, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 251)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !761, file: !760, line: 129, baseType: !878, size: 8032, offset: 100576)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 8032, elements: !875)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !761, file: !760, line: 130, baseType: !880, size: 16064, offset: 108608)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !162, size: 16064, elements: !875)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !761, file: !760, line: 131, baseType: !156, size: 32, offset: 124672)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !761, file: !760, line: 132, baseType: !156, size: 32, offset: 124704)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !761, file: !760, line: 135, baseType: !156, size: 32, offset: 124736)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !761, file: !760, line: 136, baseType: !156, size: 32, offset: 124768)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !761, file: !760, line: 137, baseType: !156, size: 32, offset: 124800)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !761, file: !760, line: 138, baseType: !156, size: 32, offset: 124832)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !761, file: !760, line: 139, baseType: !156, size: 32, offset: 124864)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !761, file: !760, line: 142, baseType: !158, size: 32, offset: 124896)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !761, file: !760, line: 143, baseType: !156, size: 32, offset: 124928)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !761, file: !760, line: 144, baseType: !156, size: 32, offset: 124960)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !761, file: !760, line: 145, baseType: !156, size: 32, offset: 124992)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !754, file: !59, line: 470, baseType: !893, size: 128, offset: 64)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 128, elements: !181)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !754, file: !59, line: 473, baseType: !757, size: 64, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !754, file: !59, line: 476, baseType: !896, size: 1152, offset: 256)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 1152, elements: !847)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !754, file: !59, line: 478, baseType: !156, size: 32, offset: 1408)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !754, file: !59, line: 480, baseType: !156, size: 32, offset: 1440)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !754, file: !59, line: 482, baseType: !156, size: 32, offset: 1472)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !754, file: !59, line: 483, baseType: !156, size: 32, offset: 1504)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !754, file: !59, line: 484, baseType: !156, size: 32, offset: 1536)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !754, file: !59, line: 485, baseType: !156, size: 32, offset: 1568)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !754, file: !59, line: 486, baseType: !156, size: 32, offset: 1600)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !754, file: !59, line: 487, baseType: !767, size: 64, offset: 1664)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !754, file: !59, line: 488, baseType: !767, size: 64, offset: 1728)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !754, file: !59, line: 489, baseType: !907, size: 128, offset: 1792)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 128, elements: !181)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !754, file: !59, line: 490, baseType: !767, size: 64, offset: 1920)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !754, file: !59, line: 491, baseType: !767, size: 64, offset: 1984)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !754, file: !59, line: 492, baseType: !156, size: 32, offset: 2048)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !754, file: !59, line: 493, baseType: !156, size: 32, offset: 2080)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !287, file: !59, line: 497, baseType: !758, size: 64, offset: 117440)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !287, file: !59, line: 500, baseType: !758, size: 64, offset: 117504)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !287, file: !59, line: 503, baseType: !156, size: 32, offset: 117568)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !287, file: !59, line: 504, baseType: !916, size: 1216, offset: 117632)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 1216, elements: !244)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !287, file: !59, line: 505, baseType: !156, size: 32, offset: 118848)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !287, file: !59, line: 506, baseType: !916, size: 1216, offset: 118912)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !287, file: !59, line: 507, baseType: !389, size: 64, offset: 120128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !287, file: !59, line: 510, baseType: !156, size: 32, offset: 120192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !287, file: !59, line: 511, baseType: !156, size: 32, offset: 120224)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !287, file: !59, line: 512, baseType: !767, size: 64, offset: 120256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !287, file: !59, line: 522, baseType: !924, size: 10624, offset: 120320)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !287, file: !59, line: 515, size: 10624, elements: !925)
!925 = !{!926, !928, !931, !934}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !924, file: !59, line: 517, baseType: !927, size: 256, align: 128)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 256, elements: !337)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !924, file: !59, line: 518, baseType: !929, size: 128, align: 128, offset: 256)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 128, elements: !930)
!930 = !{!182, !186}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !924, file: !59, line: 520, baseType: !932, size: 4096, align: 128, offset: 384)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 4096, elements: !933)
!933 = !{!186, !345}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !924, file: !59, line: 521, baseType: !935, size: 6144, align: 128, offset: 4480)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 6144, elements: !936)
!936 = !{!196, !338}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !287, file: !59, line: 732, baseType: !938, size: 82688, offset: 130944)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !287, file: !59, line: 525, size: 82688, elements: !939)
!939 = !{!940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !967, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !985, !988, !991, !992, !993, !998, !999, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1065, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1107, !1108, !1109, !1112, !1115, !1117, !1120, !1122, !1123}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !938, file: !59, line: 527, baseType: !156, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !938, file: !59, line: 530, baseType: !156, size: 32, offset: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !938, file: !59, line: 531, baseType: !156, size: 32, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !938, file: !59, line: 532, baseType: !156, size: 32, offset: 96)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !938, file: !59, line: 535, baseType: !156, size: 32, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !938, file: !59, line: 536, baseType: !156, size: 32, offset: 160)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !938, file: !59, line: 537, baseType: !156, size: 32, offset: 192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !938, file: !59, line: 538, baseType: !156, size: 32, offset: 224)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !938, file: !59, line: 539, baseType: !156, size: 32, offset: 256)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !938, file: !59, line: 542, baseType: !156, size: 32, offset: 288)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !938, file: !59, line: 543, baseType: !156, size: 32, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !938, file: !59, line: 544, baseType: !156, size: 32, offset: 352)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !938, file: !59, line: 545, baseType: !156, size: 32, offset: 384)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !938, file: !59, line: 546, baseType: !156, size: 32, offset: 416)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !938, file: !59, line: 547, baseType: !156, size: 32, offset: 448)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !938, file: !59, line: 548, baseType: !156, size: 32, offset: 480)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !938, file: !59, line: 549, baseType: !156, size: 32, offset: 512)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !938, file: !59, line: 551, baseType: !156, size: 32, offset: 544)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !938, file: !59, line: 554, baseType: !389, size: 64, offset: 576)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !938, file: !59, line: 555, baseType: !389, size: 64, offset: 640)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !938, file: !59, line: 558, baseType: !389, size: 64, offset: 704)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !938, file: !59, line: 559, baseType: !389, size: 64, offset: 768)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !938, file: !59, line: 561, baseType: !389, size: 64, offset: 832)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !938, file: !59, line: 562, baseType: !389, size: 64, offset: 896)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !938, file: !59, line: 565, baseType: !18, size: 32, offset: 960)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !938, file: !59, line: 566, baseType: !966, size: 128, offset: 992)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 128, elements: !185)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !938, file: !59, line: 567, baseType: !968, size: 512, offset: 1120)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 512, elements: !337)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !938, file: !59, line: 568, baseType: !18, size: 32, offset: 1632)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !938, file: !59, line: 569, baseType: !18, size: 32, offset: 1664)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !938, file: !59, line: 570, baseType: !156, size: 32, offset: 1696)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !938, file: !59, line: 571, baseType: !156, size: 32, offset: 1728)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !938, file: !59, line: 572, baseType: !156, size: 32, offset: 1760)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !938, file: !59, line: 573, baseType: !156, size: 32, offset: 1792)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !938, file: !59, line: 574, baseType: !156, size: 32, offset: 1824)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !938, file: !59, line: 575, baseType: !156, size: 32, offset: 1856)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !938, file: !59, line: 576, baseType: !156, size: 32, offset: 1888)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !938, file: !59, line: 577, baseType: !156, size: 32, offset: 1920)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !938, file: !59, line: 578, baseType: !156, size: 32, offset: 1952)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !938, file: !59, line: 585, baseType: !815, size: 64, offset: 1984)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !938, file: !59, line: 586, baseType: !163, size: 64, offset: 2048)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !938, file: !59, line: 587, baseType: !815, size: 64, offset: 2112)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !938, file: !59, line: 588, baseType: !984, size: 64, offset: 2176)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !938, file: !59, line: 589, baseType: !986, size: 64, offset: 2240)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, size: 64, elements: !701)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !938, file: !59, line: 591, baseType: !989, size: 64, offset: 2304)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 192, elements: !195)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !938, file: !59, line: 592, baseType: !815, size: 64, offset: 2368)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !938, file: !59, line: 593, baseType: !821, size: 128, offset: 2432)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !938, file: !59, line: 594, baseType: !994, size: 128, offset: 2560)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !995, size: 128, elements: !181)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 128, elements: !997)
!997 = !{!702, !182}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !938, file: !59, line: 595, baseType: !836, size: 128, offset: 2688)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !938, file: !59, line: 596, baseType: !1000, size: 4096, offset: 2816)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 4096, elements: !1001)
!1001 = !{!182, !718}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !938, file: !59, line: 597, baseType: !815, size: 64, offset: 6912)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !938, file: !59, line: 598, baseType: !815, size: 64, offset: 6976)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !938, file: !59, line: 599, baseType: !650, size: 64, offset: 7040)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !938, file: !59, line: 603, baseType: !810, size: 1024, offset: 7104)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !938, file: !59, line: 606, baseType: !156, size: 32, offset: 8128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !938, file: !59, line: 607, baseType: !156, size: 32, offset: 8160)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !938, file: !59, line: 608, baseType: !184, size: 32, align: 32, offset: 8192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !938, file: !59, line: 609, baseType: !156, size: 32, offset: 8224)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !938, file: !59, line: 611, baseType: !156, size: 32, offset: 8256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !938, file: !59, line: 612, baseType: !156, size: 32, offset: 8288)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !938, file: !59, line: 614, baseType: !156, size: 32, offset: 8320)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !938, file: !59, line: 615, baseType: !156, size: 32, offset: 8352)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !938, file: !59, line: 621, baseType: !156, size: 32, offset: 8384)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !938, file: !59, line: 624, baseType: !156, size: 32, offset: 8416)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !938, file: !59, line: 626, baseType: !156, size: 32, offset: 8448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !938, file: !59, line: 627, baseType: !156, size: 32, offset: 8480)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !938, file: !59, line: 671, baseType: !1019, size: 60672, offset: 8576)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !938, file: !59, line: 629, size: 60672, elements: !1020)
!1020 = !{!1021, !1025, !1029, !1031, !1032, !1035, !1039, !1041, !1042, !1043, !1044, !1045, !1048, !1050, !1053, !1054, !1055, !1056, !1057, !1060, !1062, !1064}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !1019, file: !59, line: 634, baseType: !1022, size: 3072, align: 128)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 3072, elements: !1023)
!1023 = !{!1024}
!1024 = !DISubrange(count: 384)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !1019, file: !59, line: 635, baseType: !1026, size: 6912, align: 128, offset: 3072)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 6912, elements: !1027)
!1027 = !{!1028}
!1028 = !DISubrange(count: 864)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !1019, file: !59, line: 638, baseType: !1030, size: 2048, align: 128, offset: 9984)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 2048, elements: !525)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !1019, file: !59, line: 639, baseType: !1030, size: 2048, align: 128, offset: 12032)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !1019, file: !59, line: 640, baseType: !1033, size: 3072, align: 128, offset: 14080)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 3072, elements: !1034)
!1034 = !{!719, !345}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !1019, file: !59, line: 641, baseType: !1036, size: 3840, align: 128, offset: 17152)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 3840, elements: !1037)
!1037 = !{!1038, !338}
!1038 = !DISubrange(count: 15)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !1019, file: !59, line: 642, baseType: !1040, size: 128, offset: 20992)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 128, elements: !185)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !1019, file: !59, line: 643, baseType: !1040, size: 128, offset: 21120)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !1019, file: !59, line: 644, baseType: !156, size: 32, offset: 21248)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !1019, file: !59, line: 645, baseType: !156, size: 32, offset: 21280)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !1019, file: !59, line: 648, baseType: !932, size: 4096, align: 128, offset: 21376)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !1019, file: !59, line: 649, baseType: !1046, size: 4096, align: 128, offset: 25472)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 4096, elements: !1047)
!1047 = !{!338, !338}
