; ModuleID = 'x264_src/encoder/macroblock.c'
source_filename = "x264_src/encoder/macroblock.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_weight_t = type { [8 x i16], [8 x i16], i32, i32, i32, ptr, [8 x i8] }

@block_idx_xy_fenc = internal unnamed_addr constant [16 x i8] c"\00\04@D\08\0CHL\80\84\C0\C4\88\8C\C8\CC", align 16, !dbg !0
@block_idx_xy_fdec = internal unnamed_addr constant [16 x i16] [i16 0, i16 4, i16 128, i16 132, i16 8, i16 12, i16 136, i16 140, i16 256, i16 260, i16 384, i16 388, i16 264, i16 268, i16 392, i16 396], align 16, !dbg !185
@x264_scan8 = internal unnamed_addr constant [27 x i32] [i32 12, i32 13, i32 20, i32 21, i32 14, i32 15, i32 22, i32 23, i32 28, i32 29, i32 36, i32 37, i32 30, i32 31, i32 38, i32 39, i32 9, i32 10, i32 17, i32 18, i32 33, i32 34, i32 41, i32 42, i32 44, i32 46, i32 47], align 16, !dbg !191
@x264_lambda2_tab = external local_unnamed_addr constant [52 x i32], align 16
@block_idx_x = internal unnamed_addr constant [16 x i8] c"\00\01\00\01\02\03\02\03\00\01\00\01\02\03\02\03", align 16, !dbg !198
@block_idx_y = internal unnamed_addr constant [16 x i8] c"\00\00\01\01\00\00\01\01\02\02\03\03\02\02\03\03", align 16, !dbg !202
@x264_pred_i4x4_neighbors = internal unnamed_addr constant [12 x i8] c"\02\01\03\06\0B\0B\0B\06\01\01\02\00", align 1, !dbg !208

!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 64, elements: !153)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !173, file: !139, line: 90, baseType: !179, size: 64)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 64, elements: !166)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !173, file: !139, line: 90, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 64, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 8)
!184 = !{!0, !185, !191, !198, !202, !204, !206, !208, !213, !219}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "block_idx_xy_fdec", scope: !2, file: !6, line: 234, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 256, elements: !189)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!189 = !{!190}
!190 = !DISubrange(count: 16)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "x264_scan8", scope: !2, file: !139, line: 125, type: !193, isLocal: true, isDefinition: true)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 864, elements: !196)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!196 = !{!197}
!197 = !DISubrange(count: 27)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "block_idx_x", scope: !2, file: !6, line: 200, type: !200, isLocal: true, isDefinition: true)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 128, elements: !189)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "block_idx_y", scope: !2, file: !6, line: 204, type: !200, isLocal: true, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "block_idx_yx_1d", scope: !2, file: !6, line: 219, type: !200, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "block_idx_xy_1d", scope: !2, file: !6, line: 215, type: !200, isLocal: true, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "x264_pred_i4x4_neighbors", scope: !2, file: !6, line: 45, type: !210, isLocal: true, isDefinition: true)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 96, elements: !211)
!211 = !{!212}
!212 = !DISubrange(count: 12)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "x264_dct8_weight2_tab", scope: !2, file: !215, line: 73, type: !216, isLocal: true, isDefinition: true)
!215 = !DIFile(filename: "x264_src/common/dct.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d983c98245ed7221137d0c4902e9385f")
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 1024, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 64)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "x264_dct4_weight2_tab", scope: !2, file: !215, line: 59, type: !187, isLocal: true, isDefinition: true)
!221 = !{i32 7, !"Dwarf Version", i32 5}
!222 = !{i32 2, !"Debug Info Version", i32 3}
!223 = !{i32 1, !"wchar_size", i32 4}
!224 = !{i32 8, !"PIC Level", i32 2}
!225 = !{i32 7, !"PIE Level", i32 2}
!226 = !{i32 7, !"uwtable", i32 2}
!227 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!228 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!229 = distinct !DISubprogram(name: "x264_mb_encode_i4x4", scope: !3, file: !3, line: 110, type: !230, scopeLine: 111, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1513)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !232, !195, !195}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !234, line: 46, baseType: !235)
!234 = !DIFile(filename: "x264_src/x264.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !139, line: 381, size: 266752, elements: !236)
!236 = !{!237, !401, !405, !406, !407, !408, !409, !410, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !545, !547, !574, !576, !577, !578, !582, !586, !587, !588, !592, !596, !597, !598, !603, !606, !607, !684, !701, !862, !863, !864, !865, !869, !870, !871, !872, !873, !874, !875, !890, !1083, !1087, !1148, !1151, !1153, !1154, !1155, !1158, !1163, !1171, !1172, !1178, !1180, !1185, !1260, !1346, !1389, !1411, !1460, !1489}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !235, file: !139, line: 384, baseType: !238, size: 5632)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !234, line: 376, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !234, line: 176, size: 5632, elements: !240)
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !284, !286, !287, !288, !289, !291, !292, !306, !307, !308, !309, !310, !339, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !239, file: !234, line: 179, baseType: !7, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !239, file: !234, line: 180, baseType: !195, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !239, file: !234, line: 181, baseType: !195, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !239, file: !234, line: 182, baseType: !195, size: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !239, file: !234, line: 183, baseType: !195, size: 32, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !239, file: !234, line: 186, baseType: !195, size: 32, offset: 160)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !239, file: !234, line: 187, baseType: !195, size: 32, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !239, file: !234, line: 188, baseType: !195, size: 32, offset: 224)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !239, file: !234, line: 189, baseType: !195, size: 32, offset: 256)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !239, file: !234, line: 190, baseType: !195, size: 32, offset: 288)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !239, file: !234, line: 198, baseType: !195, size: 32, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !239, file: !234, line: 215, baseType: !253, size: 288, offset: 352)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !239, file: !234, line: 200, size: 288, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !260, !261, !262, !263}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !253, file: !234, line: 203, baseType: !195, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !253, file: !234, line: 204, baseType: !195, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !253, file: !234, line: 206, baseType: !195, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !253, file: !234, line: 209, baseType: !195, size: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !253, file: !234, line: 210, baseType: !195, size: 32, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !253, file: !234, line: 211, baseType: !195, size: 32, offset: 160)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !253, file: !234, line: 212, baseType: !195, size: 32, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !253, file: !234, line: 213, baseType: !195, size: 32, offset: 224)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !253, file: !234, line: 214, baseType: !195, size: 32, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !239, file: !234, line: 218, baseType: !195, size: 32, offset: 640)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !239, file: !234, line: 219, baseType: !195, size: 32, offset: 672)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !239, file: !234, line: 220, baseType: !195, size: 32, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !239, file: !234, line: 221, baseType: !195, size: 32, offset: 736)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !239, file: !234, line: 222, baseType: !195, size: 32, offset: 768)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !239, file: !234, line: 224, baseType: !195, size: 32, offset: 800)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !239, file: !234, line: 225, baseType: !195, size: 32, offset: 832)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !239, file: !234, line: 226, baseType: !195, size: 32, offset: 864)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !239, file: !234, line: 227, baseType: !195, size: 32, offset: 896)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !239, file: !234, line: 229, baseType: !195, size: 32, offset: 928)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !239, file: !234, line: 230, baseType: !195, size: 32, offset: 960)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !239, file: !234, line: 231, baseType: !195, size: 32, offset: 992)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !239, file: !234, line: 233, baseType: !195, size: 32, offset: 1024)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !239, file: !234, line: 234, baseType: !195, size: 32, offset: 1056)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !239, file: !234, line: 236, baseType: !195, size: 32, offset: 1088)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !239, file: !234, line: 237, baseType: !195, size: 32, offset: 1120)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !239, file: !234, line: 239, baseType: !195, size: 32, offset: 1152)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !239, file: !234, line: 240, baseType: !282, size: 64, offset: 1216)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !239, file: !234, line: 241, baseType: !285, size: 128, offset: 1280)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 128, elements: !189)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !239, file: !234, line: 242, baseType: !285, size: 128, offset: 1408)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !239, file: !234, line: 243, baseType: !285, size: 128, offset: 1536)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !239, file: !234, line: 244, baseType: !285, size: 128, offset: 1664)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !239, file: !234, line: 245, baseType: !290, size: 512, offset: 1792)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 512, elements: !217)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !239, file: !234, line: 246, baseType: !290, size: 512, offset: 2304)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !239, file: !234, line: 249, baseType: !293, size: 64, offset: 2816)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !296, !195, !297, !299}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !283)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !301)
!301 = !{!302, !303, !304, !305}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !300, file: !3, baseType: !7, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !300, file: !3, baseType: !7, size: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !300, file: !3, baseType: !296, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !300, file: !3, baseType: !296, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !239, file: !234, line: 250, baseType: !296, size: 64, offset: 2880)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !239, file: !234, line: 251, baseType: !195, size: 32, offset: 2944)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !239, file: !234, line: 252, baseType: !195, size: 32, offset: 2976)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !239, file: !234, line: 253, baseType: !282, size: 64, offset: 3008)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !239, file: !234, line: 287, baseType: !311, size: 800, offset: 3072)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !239, file: !234, line: 256, size: 800, elements: !312)
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !333, !334, !335, !337, !338}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !311, file: !234, line: 258, baseType: !7, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !311, file: !234, line: 259, baseType: !7, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !311, file: !234, line: 261, baseType: !195, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !311, file: !234, line: 262, baseType: !195, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !311, file: !234, line: 263, baseType: !195, size: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !311, file: !234, line: 264, baseType: !195, size: 32, offset: 160)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !311, file: !234, line: 265, baseType: !195, size: 32, offset: 192)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !311, file: !234, line: 267, baseType: !195, size: 32, offset: 224)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !311, file: !234, line: 268, baseType: !195, size: 32, offset: 256)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !311, file: !234, line: 269, baseType: !195, size: 32, offset: 288)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !311, file: !234, line: 270, baseType: !195, size: 32, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !311, file: !234, line: 271, baseType: !195, size: 32, offset: 352)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !311, file: !234, line: 272, baseType: !195, size: 32, offset: 384)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !311, file: !234, line: 273, baseType: !195, size: 32, offset: 416)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !311, file: !234, line: 274, baseType: !195, size: 32, offset: 448)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !311, file: !234, line: 275, baseType: !195, size: 32, offset: 480)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !311, file: !234, line: 276, baseType: !195, size: 32, offset: 512)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !311, file: !234, line: 277, baseType: !195, size: 32, offset: 544)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !311, file: !234, line: 278, baseType: !332, size: 32, offset: 576)
!332 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !311, file: !234, line: 279, baseType: !332, size: 32, offset: 608)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !311, file: !234, line: 280, baseType: !195, size: 32, offset: 640)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !311, file: !234, line: 283, baseType: !336, size: 64, offset: 672)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 64, elements: !153)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !311, file: !234, line: 285, baseType: !195, size: 32, offset: 736)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !311, file: !234, line: 286, baseType: !195, size: 32, offset: 768)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !239, file: !234, line: 327, baseType: !340, size: 1152, offset: 3904)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !239, file: !234, line: 290, size: 1152, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !379, !380}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !340, file: !234, line: 292, baseType: !195, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !340, file: !234, line: 294, baseType: !195, size: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !340, file: !234, line: 295, baseType: !195, size: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !340, file: !234, line: 296, baseType: !195, size: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !340, file: !234, line: 297, baseType: !195, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !340, file: !234, line: 299, baseType: !195, size: 32, offset: 160)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !340, file: !234, line: 300, baseType: !332, size: 32, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !340, file: !234, line: 301, baseType: !332, size: 32, offset: 224)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !340, file: !234, line: 302, baseType: !332, size: 32, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !340, file: !234, line: 303, baseType: !195, size: 32, offset: 288)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !340, file: !234, line: 304, baseType: !195, size: 32, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !340, file: !234, line: 305, baseType: !332, size: 32, offset: 352)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !340, file: !234, line: 306, baseType: !332, size: 32, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !340, file: !234, line: 307, baseType: !332, size: 32, offset: 416)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !340, file: !234, line: 309, baseType: !195, size: 32, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !340, file: !234, line: 310, baseType: !332, size: 32, offset: 480)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !340, file: !234, line: 311, baseType: !195, size: 32, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !340, file: !234, line: 312, baseType: !195, size: 32, offset: 544)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !340, file: !234, line: 315, baseType: !195, size: 32, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !340, file: !234, line: 316, baseType: !282, size: 64, offset: 640)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !340, file: !234, line: 317, baseType: !195, size: 32, offset: 704)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !340, file: !234, line: 318, baseType: !282, size: 64, offset: 768)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !340, file: !234, line: 321, baseType: !332, size: 32, offset: 832)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !340, file: !234, line: 322, baseType: !332, size: 32, offset: 864)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !340, file: !234, line: 323, baseType: !332, size: 32, offset: 896)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !340, file: !234, line: 324, baseType: !368, size: 64, offset: 960)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !234, line: 174, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 167, size: 256, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !377}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !370, file: !234, line: 169, baseType: !195, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !370, file: !234, line: 169, baseType: !195, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !370, file: !234, line: 170, baseType: !195, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !370, file: !234, line: 171, baseType: !195, size: 32, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !370, file: !234, line: 172, baseType: !332, size: 32, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !370, file: !234, line: 173, baseType: !378, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !340, file: !234, line: 325, baseType: !195, size: 32, offset: 1024)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !340, file: !234, line: 326, baseType: !282, size: 64, offset: 1088)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !239, file: !234, line: 330, baseType: !195, size: 32, offset: 5056)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !239, file: !234, line: 331, baseType: !195, size: 32, offset: 5088)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !239, file: !234, line: 332, baseType: !195, size: 32, offset: 5120)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !239, file: !234, line: 334, baseType: !195, size: 32, offset: 5152)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !239, file: !234, line: 335, baseType: !195, size: 32, offset: 5184)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !239, file: !234, line: 336, baseType: !160, size: 32, offset: 5216)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !239, file: !234, line: 337, baseType: !160, size: 32, offset: 5248)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !239, file: !234, line: 338, baseType: !160, size: 32, offset: 5280)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !239, file: !234, line: 339, baseType: !160, size: 32, offset: 5312)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !239, file: !234, line: 340, baseType: !195, size: 32, offset: 5344)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !239, file: !234, line: 344, baseType: !195, size: 32, offset: 5376)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !239, file: !234, line: 356, baseType: !195, size: 32, offset: 5408)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !239, file: !234, line: 364, baseType: !195, size: 32, offset: 5440)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !239, file: !234, line: 367, baseType: !195, size: 32, offset: 5472)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !239, file: !234, line: 368, baseType: !195, size: 32, offset: 5504)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !239, file: !234, line: 369, baseType: !195, size: 32, offset: 5536)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !239, file: !234, line: 375, baseType: !398, size: 64, offset: 5568)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !296}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !235, file: !139, line: 386, baseType: !402, size: 8256, offset: 5632)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 8256, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 129)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !235, file: !139, line: 387, baseType: !195, size: 32, offset: 13888)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !235, file: !139, line: 388, baseType: !195, size: 32, offset: 13920)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !235, file: !139, line: 389, baseType: !195, size: 32, offset: 13952)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !235, file: !139, line: 390, baseType: !195, size: 32, offset: 13984)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !235, file: !139, line: 391, baseType: !195, size: 32, offset: 14016)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !235, file: !139, line: 402, baseType: !411, size: 576, offset: 14080)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !235, file: !139, line: 394, size: 576, elements: !412)
!412 = !{!413, !414, !415, !425, !426, !427}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !411, file: !139, line: 396, baseType: !195, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !411, file: !139, line: 397, baseType: !195, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !411, file: !139, line: 398, baseType: !416, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !234, line: 604, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 593, size: 192, elements: !419)
!419 = !{!420, !421, !422, !423}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !418, file: !234, line: 595, baseType: !195, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !418, file: !234, line: 596, baseType: !195, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !418, file: !234, line: 599, baseType: !195, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !418, file: !234, line: 603, baseType: !424, size: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !411, file: !139, line: 399, baseType: !195, size: 32, offset: 128)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !411, file: !139, line: 400, baseType: !424, size: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !411, file: !139, line: 401, baseType: !428, size: 320, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !429, line: 56, baseType: !430)
!429 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !429, line: 47, size: 320, elements: !431)
!431 = !{!432, !433, !434, !435, !439, !440}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !430, file: !429, line: 49, baseType: !424, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !430, file: !429, line: 50, baseType: !424, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !430, file: !429, line: 51, baseType: !424, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !430, file: !429, line: 53, baseType: !436, size: 64, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !437, line: 87, baseType: !438)
!437 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!438 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !430, file: !429, line: 54, baseType: !195, size: 32, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !430, file: !429, line: 55, baseType: !195, size: 32, offset: 288)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !235, file: !139, line: 404, baseType: !424, size: 64, offset: 14656)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !235, file: !139, line: 405, baseType: !195, size: 32, offset: 14720)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !235, file: !139, line: 410, baseType: !195, size: 32, offset: 14752)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !235, file: !139, line: 411, baseType: !195, size: 32, offset: 14784)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !235, file: !139, line: 413, baseType: !195, size: 32, offset: 14816)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !235, file: !139, line: 415, baseType: !195, size: 32, offset: 14848)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !235, file: !139, line: 416, baseType: !195, size: 32, offset: 14880)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !235, file: !139, line: 418, baseType: !195, size: 32, offset: 14912)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !235, file: !139, line: 419, baseType: !195, size: 32, offset: 14944)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !235, file: !139, line: 420, baseType: !195, size: 32, offset: 14976)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !235, file: !139, line: 421, baseType: !195, size: 32, offset: 15008)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !235, file: !139, line: 422, baseType: !195, size: 32, offset: 15040)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !235, file: !139, line: 424, baseType: !195, size: 32, offset: 15072)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !235, file: !139, line: 425, baseType: !195, size: 32, offset: 15104)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !235, file: !139, line: 427, baseType: !195, size: 32, offset: 15136)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !235, file: !139, line: 430, baseType: !457, size: 10400, offset: 15168)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 10400, elements: !543)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !16, line: 154, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 52, size: 10400, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !478, !479, !480, !481, !482, !483, !484, !485, !486, !493, !494, !542}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !459, file: !16, line: 54, baseType: !195, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !459, file: !16, line: 56, baseType: !195, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !459, file: !16, line: 57, baseType: !195, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !459, file: !16, line: 59, baseType: !195, size: 32, offset: 96)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !459, file: !16, line: 60, baseType: !195, size: 32, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !459, file: !16, line: 61, baseType: !195, size: 32, offset: 160)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !459, file: !16, line: 63, baseType: !195, size: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !459, file: !16, line: 65, baseType: !195, size: 32, offset: 224)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !459, file: !16, line: 67, baseType: !195, size: 32, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !459, file: !16, line: 69, baseType: !195, size: 32, offset: 288)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !459, file: !16, line: 70, baseType: !195, size: 32, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !459, file: !16, line: 71, baseType: !195, size: 32, offset: 352)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !459, file: !16, line: 72, baseType: !195, size: 32, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !459, file: !16, line: 73, baseType: !475, size: 8192, offset: 416)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 8192, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !459, file: !16, line: 75, baseType: !195, size: 32, offset: 8608)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !459, file: !16, line: 76, baseType: !195, size: 32, offset: 8640)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !459, file: !16, line: 77, baseType: !195, size: 32, offset: 8672)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !459, file: !16, line: 78, baseType: !195, size: 32, offset: 8704)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !459, file: !16, line: 79, baseType: !195, size: 32, offset: 8736)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !459, file: !16, line: 80, baseType: !195, size: 32, offset: 8768)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !459, file: !16, line: 81, baseType: !195, size: 32, offset: 8800)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !459, file: !16, line: 83, baseType: !195, size: 32, offset: 8832)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !459, file: !16, line: 90, baseType: !487, size: 128, offset: 8864)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !459, file: !16, line: 84, size: 128, elements: !488)
!488 = !{!489, !490, !491, !492}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !487, file: !16, line: 86, baseType: !195, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !487, file: !16, line: 87, baseType: !195, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !487, file: !16, line: 88, baseType: !195, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !487, file: !16, line: 89, baseType: !195, size: 32, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !459, file: !16, line: 92, baseType: !195, size: 32, offset: 8992)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !459, file: !16, line: 150, baseType: !495, size: 1344, offset: 9024)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !459, file: !16, line: 93, size: 1344, elements: !496)
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !533, !534, !535, !536, !537, !538, !539, !540, !541}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !495, file: !16, line: 95, baseType: !195, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !495, file: !16, line: 96, baseType: !195, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !495, file: !16, line: 97, baseType: !195, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !495, file: !16, line: 99, baseType: !195, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !495, file: !16, line: 100, baseType: !195, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !495, file: !16, line: 102, baseType: !195, size: 32, offset: 160)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !495, file: !16, line: 103, baseType: !195, size: 32, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !495, file: !16, line: 104, baseType: !195, size: 32, offset: 224)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !495, file: !16, line: 105, baseType: !195, size: 32, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !495, file: !16, line: 106, baseType: !195, size: 32, offset: 288)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !495, file: !16, line: 107, baseType: !195, size: 32, offset: 320)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !495, file: !16, line: 108, baseType: !195, size: 32, offset: 352)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !495, file: !16, line: 110, baseType: !195, size: 32, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !495, file: !16, line: 111, baseType: !195, size: 32, offset: 416)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !495, file: !16, line: 112, baseType: !195, size: 32, offset: 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !495, file: !16, line: 114, baseType: !195, size: 32, offset: 480)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !495, file: !16, line: 115, baseType: !160, size: 32, offset: 512)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !495, file: !16, line: 116, baseType: !160, size: 32, offset: 544)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !495, file: !16, line: 117, baseType: !195, size: 32, offset: 576)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !495, file: !16, line: 119, baseType: !195, size: 32, offset: 608)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !495, file: !16, line: 120, baseType: !195, size: 32, offset: 640)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !495, file: !16, line: 137, baseType: !519, size: 384, offset: 672)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !495, file: !16, line: 122, size: 384, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !519, file: !16, line: 124, baseType: !195, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !519, file: !16, line: 125, baseType: !195, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !519, file: !16, line: 126, baseType: !195, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !519, file: !16, line: 127, baseType: !195, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !519, file: !16, line: 128, baseType: !195, size: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !519, file: !16, line: 129, baseType: !195, size: 32, offset: 160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !519, file: !16, line: 130, baseType: !195, size: 32, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !519, file: !16, line: 131, baseType: !195, size: 32, offset: 224)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !519, file: !16, line: 133, baseType: !195, size: 32, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !519, file: !16, line: 134, baseType: !195, size: 32, offset: 288)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !519, file: !16, line: 135, baseType: !195, size: 32, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !519, file: !16, line: 136, baseType: !195, size: 32, offset: 352)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !495, file: !16, line: 139, baseType: !195, size: 32, offset: 1056)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !495, file: !16, line: 140, baseType: !195, size: 32, offset: 1088)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !495, file: !16, line: 141, baseType: !195, size: 32, offset: 1120)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !495, file: !16, line: 142, baseType: !195, size: 32, offset: 1152)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !495, file: !16, line: 143, baseType: !195, size: 32, offset: 1184)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !495, file: !16, line: 144, baseType: !195, size: 32, offset: 1216)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !495, file: !16, line: 145, baseType: !195, size: 32, offset: 1248)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !495, file: !16, line: 146, baseType: !195, size: 32, offset: 1280)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !495, file: !16, line: 147, baseType: !195, size: 32, offset: 1312)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !459, file: !16, line: 152, baseType: !195, size: 32, offset: 10368)
!543 = !{!544}
!544 = !DISubrange(count: 1)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !235, file: !139, line: 431, baseType: !546, size: 64, offset: 25600)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !235, file: !139, line: 432, baseType: !548, size: 960, offset: 25664)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 960, elements: !543)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !16, line: 186, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !16, line: 156, size: 960, elements: !551)
!551 = !{!552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !550, file: !16, line: 158, baseType: !195, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !550, file: !16, line: 159, baseType: !195, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !550, file: !16, line: 161, baseType: !195, size: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !550, file: !16, line: 163, baseType: !195, size: 32, offset: 96)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !550, file: !16, line: 164, baseType: !195, size: 32, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !550, file: !16, line: 166, baseType: !195, size: 32, offset: 160)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !550, file: !16, line: 167, baseType: !195, size: 32, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !550, file: !16, line: 169, baseType: !195, size: 32, offset: 224)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !550, file: !16, line: 170, baseType: !195, size: 32, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !550, file: !16, line: 172, baseType: !195, size: 32, offset: 288)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !550, file: !16, line: 173, baseType: !195, size: 32, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !550, file: !16, line: 175, baseType: !195, size: 32, offset: 352)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !550, file: !16, line: 177, baseType: !195, size: 32, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !550, file: !16, line: 178, baseType: !195, size: 32, offset: 416)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !550, file: !16, line: 179, baseType: !195, size: 32, offset: 448)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !550, file: !16, line: 181, baseType: !195, size: 32, offset: 480)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !550, file: !16, line: 183, baseType: !195, size: 32, offset: 512)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !550, file: !16, line: 184, baseType: !570, size: 384, offset: 576)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 384, elements: !572)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!572 = !{!573}
!573 = !DISubrange(count: 6)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !235, file: !139, line: 433, baseType: !575, size: 64, offset: 26624)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !235, file: !139, line: 434, baseType: !195, size: 32, offset: 26688)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !235, file: !139, line: 437, baseType: !195, size: 32, offset: 26720)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !235, file: !139, line: 440, baseType: !579, size: 256, offset: 26752)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 256, elements: !166)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 512, elements: !189)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !235, file: !139, line: 441, baseType: !583, size: 128, offset: 27008)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 128, elements: !153)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 2048, elements: !217)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !235, file: !139, line: 443, baseType: !579, size: 256, offset: 27136)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !235, file: !139, line: 444, baseType: !583, size: 128, offset: 27392)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !235, file: !139, line: 446, baseType: !589, size: 256, offset: 27520)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 256, elements: !166)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 256, elements: !189)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !235, file: !139, line: 447, baseType: !593, size: 128, offset: 27776)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !594, size: 128, elements: !153)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 1024, elements: !217)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !235, file: !139, line: 448, baseType: !589, size: 256, offset: 27904)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !235, file: !139, line: 449, baseType: !593, size: 128, offset: 28160)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !235, file: !139, line: 454, baseType: !599, size: 5888, offset: 28288)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 5888, elements: !601)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!601 = !{!602}
!602 = !DISubrange(count: 92)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !235, file: !139, line: 455, baseType: !604, size: 23552, offset: 34176)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 23552, elements: !605)
!605 = !{!602, !167}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !235, file: !139, line: 457, baseType: !571, size: 64, offset: 57728)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !235, file: !139, line: 460, baseType: !608, size: 53376, offset: 57856)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !139, line: 364, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 302, size: 53376, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !639, !668, !669, !670, !676, !677, !678, !679, !680, !681, !682, !683}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !609, file: !139, line: 304, baseType: !546, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !609, file: !139, line: 305, baseType: !575, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !609, file: !139, line: 307, baseType: !195, size: 32, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !609, file: !139, line: 308, baseType: !195, size: 32, offset: 160)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !609, file: !139, line: 309, baseType: !195, size: 32, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !609, file: !139, line: 311, baseType: !195, size: 32, offset: 224)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !609, file: !139, line: 313, baseType: !195, size: 32, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !609, file: !139, line: 315, baseType: !195, size: 32, offset: 288)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !609, file: !139, line: 316, baseType: !195, size: 32, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !609, file: !139, line: 317, baseType: !195, size: 32, offset: 352)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !609, file: !139, line: 319, baseType: !195, size: 32, offset: 384)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !609, file: !139, line: 321, baseType: !195, size: 32, offset: 416)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !609, file: !139, line: 322, baseType: !195, size: 32, offset: 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !609, file: !139, line: 324, baseType: !336, size: 64, offset: 480)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !609, file: !139, line: 325, baseType: !195, size: 32, offset: 544)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !609, file: !139, line: 327, baseType: !195, size: 32, offset: 576)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !609, file: !139, line: 329, baseType: !195, size: 32, offset: 608)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !609, file: !139, line: 330, baseType: !195, size: 32, offset: 640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !609, file: !139, line: 331, baseType: !195, size: 32, offset: 672)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !609, file: !139, line: 333, baseType: !195, size: 32, offset: 704)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !609, file: !139, line: 334, baseType: !195, size: 32, offset: 736)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !609, file: !139, line: 339, baseType: !633, size: 2048, offset: 768)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 2048, elements: !638)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !609, file: !139, line: 335, size: 64, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !634, file: !139, line: 337, baseType: !195, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !634, file: !139, line: 338, baseType: !195, size: 32, offset: 32)
!638 = !{!154, !190}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !609, file: !139, line: 342, baseType: !640, size: 49152, align: 128, offset: 2816)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 49152, align: 128, elements: !665)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !642, line: 36, baseType: !643, align: 128)
!642 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !642, line: 26, size: 512, elements: !644)
!644 = !{!645, !651, !652, !655, !656, !657}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !643, file: !642, line: 30, baseType: !646, size: 128, align: 128)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 128, elements: !182)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !648, line: 25, baseType: !649)
!648 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !146, line: 39, baseType: !650)
!650 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !643, file: !642, line: 31, baseType: !646, size: 128, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !643, file: !642, line: 32, baseType: !653, size: 32, offset: 256)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !648, line: 26, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !146, line: 41, baseType: !195)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !643, file: !642, line: 33, baseType: !653, size: 32, offset: 288)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !643, file: !642, line: 34, baseType: !653, size: 32, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !643, file: !642, line: 35, baseType: !658, size: 64, offset: 384)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !642, line: 25, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !424, !195, !424, !195, !663, !195}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !643)
!665 = !{!666, !667}
!666 = !DISubrange(count: 32)
!667 = !DISubrange(count: 3)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !609, file: !139, line: 344, baseType: !195, size: 32, offset: 51968)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !609, file: !139, line: 345, baseType: !195, size: 32, offset: 52000)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !609, file: !139, line: 350, baseType: !671, size: 1024, offset: 52032)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 1024, elements: !189)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !609, file: !139, line: 346, size: 64, elements: !673)
!673 = !{!674, !675}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !672, file: !139, line: 348, baseType: !195, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !672, file: !139, line: 349, baseType: !195, size: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !609, file: !139, line: 352, baseType: !195, size: 32, offset: 53056)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !609, file: !139, line: 354, baseType: !195, size: 32, offset: 53088)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !609, file: !139, line: 355, baseType: !195, size: 32, offset: 53120)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !609, file: !139, line: 356, baseType: !195, size: 32, offset: 53152)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !609, file: !139, line: 357, baseType: !195, size: 32, offset: 53184)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !609, file: !139, line: 360, baseType: !195, size: 32, offset: 53216)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !609, file: !139, line: 361, baseType: !195, size: 32, offset: 53248)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !609, file: !139, line: 362, baseType: !195, size: 32, offset: 53280)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !235, file: !139, line: 463, baseType: !685, size: 4096, offset: 111232)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !686, line: 46, baseType: !687)
!686 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !686, line: 27, size: 4096, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !687, file: !686, line: 30, baseType: !195, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !687, file: !686, line: 31, baseType: !195, size: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !687, file: !686, line: 34, baseType: !195, size: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !687, file: !686, line: 35, baseType: !195, size: 32, offset: 96)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !687, file: !686, line: 37, baseType: !424, size: 64, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !687, file: !686, line: 38, baseType: !424, size: 64, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !687, file: !686, line: 39, baseType: !424, size: 64, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !687, file: !686, line: 42, baseType: !195, size: 32, align: 128, offset: 384)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !687, file: !686, line: 45, baseType: !698, size: 3680, offset: 416)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 3680, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 460)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !235, file: !139, line: 494, baseType: !702, size: 2112, offset: 115328)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !235, file: !139, line: 465, size: 2112, elements: !703)
!703 = !{!704, !842, !844, !845, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !858, !859, !860, !861}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !702, file: !139, line: 468, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !708, line: 146, baseType: !709)
!708 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !708, line: 31, size: 125056, elements: !710)
!710 = !{!711, !712, !713, !714, !717, !718, !719, !720, !721, !722, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !741, !742, !743, !744, !745, !746, !748, !750, !751, !752, !753, !754, !757, !759, !760, !762, !767, !768, !772, !773, !777, !781, !784, !786, !787, !789, !790, !792, !793, !794, !797, !799, !800, !801, !803, !804, !805, !806, !807, !808, !809, !810, !812, !813, !814, !823, !827, !829, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !709, file: !708, line: 34, baseType: !195, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !709, file: !708, line: 35, baseType: !195, size: 32, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !709, file: !708, line: 36, baseType: !195, size: 32, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !709, file: !708, line: 37, baseType: !715, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !648, line: 27, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !146, line: 44, baseType: !438)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !709, file: !708, line: 38, baseType: !715, size: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !709, file: !708, line: 39, baseType: !195, size: 32, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !709, file: !708, line: 40, baseType: !195, size: 32, offset: 288)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !709, file: !708, line: 41, baseType: !195, size: 32, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !709, file: !708, line: 42, baseType: !195, size: 32, offset: 352)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !709, file: !708, line: 43, baseType: !723, size: 64, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !709, file: !708, line: 45, baseType: !195, size: 32, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !709, file: !708, line: 46, baseType: !195, size: 32, offset: 480)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !709, file: !708, line: 47, baseType: !195, size: 32, offset: 512)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !709, file: !708, line: 48, baseType: !195, size: 32, offset: 544)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !709, file: !708, line: 49, baseType: !195, size: 32, offset: 576)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !709, file: !708, line: 50, baseType: !195, size: 32, offset: 608)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !709, file: !708, line: 51, baseType: !195, size: 32, offset: 640)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !709, file: !708, line: 52, baseType: !150, size: 8, offset: 672)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !709, file: !708, line: 53, baseType: !150, size: 8, offset: 680)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !709, file: !708, line: 54, baseType: !150, size: 8, offset: 688)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !709, file: !708, line: 55, baseType: !332, size: 32, offset: 704)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !709, file: !708, line: 56, baseType: !332, size: 32, offset: 736)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !709, file: !708, line: 57, baseType: !195, size: 32, offset: 768)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !709, file: !708, line: 60, baseType: !195, size: 32, offset: 800)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !709, file: !708, line: 61, baseType: !739, size: 96, offset: 832)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 96, elements: !740)
!740 = !{!667}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !709, file: !708, line: 62, baseType: !739, size: 96, offset: 928)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !709, file: !708, line: 63, baseType: !739, size: 96, offset: 1024)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !709, file: !708, line: 64, baseType: !195, size: 32, offset: 1120)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !709, file: !708, line: 65, baseType: !195, size: 32, offset: 1152)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !709, file: !708, line: 66, baseType: !195, size: 32, offset: 1184)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !709, file: !708, line: 67, baseType: !747, size: 192, offset: 1216)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 192, elements: !740)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !709, file: !708, line: 68, baseType: !749, size: 256, offset: 1408)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 256, elements: !166)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !709, file: !708, line: 69, baseType: !749, size: 256, offset: 1664)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !709, file: !708, line: 70, baseType: !600, size: 64, offset: 1920)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !709, file: !708, line: 74, baseType: !749, size: 256, offset: 1984)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !709, file: !708, line: 75, baseType: !749, size: 256, offset: 2240)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !709, file: !708, line: 77, baseType: !755, size: 24576, align: 128, offset: 2560)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 24576, align: 128, elements: !756)
!756 = !{!190, !667}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !709, file: !708, line: 78, baseType: !758, size: 1024, offset: 27136)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 1024, elements: !189)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !709, file: !708, line: 79, baseType: !195, size: 32, offset: 28160)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !709, file: !708, line: 80, baseType: !761, size: 64, offset: 28224)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !709, file: !708, line: 83, baseType: !763, size: 64, offset: 28288)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !648, line: 24, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !146, line: 37, baseType: !766)
!766 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !709, file: !708, line: 84, baseType: !424, size: 64, offset: 28352)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !709, file: !708, line: 85, baseType: !769, size: 128, offset: 28416)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 128, elements: !153)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 32, elements: !153)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !709, file: !708, line: 86, baseType: !770, size: 64, offset: 28544)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !709, file: !708, line: 87, baseType: !774, size: 2176, offset: 28608)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 2176, elements: !775)
!775 = !{!154, !776}
!776 = !DISubrange(count: 17)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !709, file: !708, line: 92, baseType: !778, size: 20736, offset: 30784)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 20736, elements: !779)
!779 = !{!780, !780}
!780 = !DISubrange(count: 18)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !709, file: !708, line: 96, baseType: !782, size: 2176, offset: 51520)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 2176, elements: !775)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !709, file: !708, line: 97, baseType: !785, size: 128, offset: 53696)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 128, elements: !153)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !709, file: !708, line: 98, baseType: !336, size: 64, offset: 53824)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !709, file: !708, line: 99, baseType: !788, size: 1024, offset: 53888)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 1024, elements: !638)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !709, file: !708, line: 100, baseType: !771, size: 32, offset: 54912)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !709, file: !708, line: 105, baseType: !791, size: 10368, offset: 54944)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 10368, elements: !779)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !709, file: !708, line: 106, baseType: !791, size: 10368, offset: 65312)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !709, file: !708, line: 107, baseType: !195, size: 32, offset: 75680)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !709, file: !708, line: 108, baseType: !795, size: 576, offset: 75712)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 576, elements: !796)
!796 = !{!780}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !709, file: !708, line: 109, baseType: !798, size: 20736, offset: 76288)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 20736, elements: !779)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !709, file: !708, line: 110, baseType: !783, size: 64, offset: 97024)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !709, file: !708, line: 111, baseType: !783, size: 64, offset: 97088)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !709, file: !708, line: 112, baseType: !802, size: 64, offset: 97152)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !709, file: !708, line: 113, baseType: !802, size: 64, offset: 97216)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !709, file: !708, line: 114, baseType: !802, size: 64, offset: 97280)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !709, file: !708, line: 115, baseType: !195, size: 32, offset: 97344)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !709, file: !708, line: 116, baseType: !600, size: 64, offset: 97408)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !709, file: !708, line: 117, baseType: !600, size: 64, offset: 97472)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !709, file: !708, line: 118, baseType: !600, size: 64, offset: 97536)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !709, file: !708, line: 119, baseType: !195, size: 32, offset: 97600)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !709, file: !708, line: 120, baseType: !811, size: 576, offset: 97632)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 576, elements: !796)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !709, file: !708, line: 121, baseType: !160, size: 32, offset: 98208)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !709, file: !708, line: 122, baseType: !168, size: 64, offset: 98240)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !709, file: !708, line: 125, baseType: !815, size: 256, offset: 98304)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !234, line: 503, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !234, line: 496, size: 256, elements: !817)
!817 = !{!818, !820, !821, !822}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !816, file: !234, line: 498, baseType: !819, size: 64)
!819 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !816, file: !234, line: 499, baseType: !819, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !816, file: !234, line: 500, baseType: !819, size: 64, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !816, file: !234, line: 502, baseType: !819, size: 64, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !709, file: !708, line: 128, baseType: !824, size: 2008, offset: 98560)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 2008, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 251)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !709, file: !708, line: 129, baseType: !828, size: 8032, offset: 100576)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 8032, elements: !825)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !709, file: !708, line: 130, baseType: !830, size: 16064, offset: 108608)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 16064, elements: !825)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !709, file: !708, line: 131, baseType: !195, size: 32, offset: 124672)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !709, file: !708, line: 132, baseType: !195, size: 32, offset: 124704)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !709, file: !708, line: 135, baseType: !195, size: 32, offset: 124736)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !709, file: !708, line: 136, baseType: !195, size: 32, offset: 124768)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !709, file: !708, line: 137, baseType: !195, size: 32, offset: 124800)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !709, file: !708, line: 138, baseType: !195, size: 32, offset: 124832)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !709, file: !708, line: 139, baseType: !195, size: 32, offset: 124864)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !709, file: !708, line: 142, baseType: !332, size: 32, offset: 124896)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !709, file: !708, line: 143, baseType: !195, size: 32, offset: 124928)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !709, file: !708, line: 144, baseType: !195, size: 32, offset: 124960)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !709, file: !708, line: 145, baseType: !195, size: 32, offset: 124992)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !702, file: !139, line: 470, baseType: !843, size: 128, offset: 64)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 128, elements: !153)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !702, file: !139, line: 473, baseType: !705, size: 64, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !702, file: !139, line: 476, baseType: !846, size: 1152, offset: 256)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 1152, elements: !796)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !702, file: !139, line: 478, baseType: !195, size: 32, offset: 1408)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !702, file: !139, line: 480, baseType: !195, size: 32, offset: 1440)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !702, file: !139, line: 482, baseType: !195, size: 32, offset: 1472)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !702, file: !139, line: 483, baseType: !195, size: 32, offset: 1504)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !702, file: !139, line: 484, baseType: !195, size: 32, offset: 1536)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !702, file: !139, line: 485, baseType: !195, size: 32, offset: 1568)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !702, file: !139, line: 486, baseType: !195, size: 32, offset: 1600)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !702, file: !139, line: 487, baseType: !715, size: 64, offset: 1664)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !702, file: !139, line: 488, baseType: !715, size: 64, offset: 1728)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !702, file: !139, line: 489, baseType: !857, size: 128, offset: 1792)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, size: 128, elements: !153)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !702, file: !139, line: 490, baseType: !715, size: 64, offset: 1920)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !702, file: !139, line: 491, baseType: !715, size: 64, offset: 1984)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !702, file: !139, line: 492, baseType: !195, size: 32, offset: 2048)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !702, file: !139, line: 493, baseType: !195, size: 32, offset: 2080)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !235, file: !139, line: 497, baseType: !706, size: 64, offset: 117440)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !235, file: !139, line: 500, baseType: !706, size: 64, offset: 117504)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !235, file: !139, line: 503, baseType: !195, size: 32, offset: 117568)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !235, file: !139, line: 504, baseType: !866, size: 1216, offset: 117632)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 1216, elements: !867)
!867 = !{!868}
!868 = !DISubrange(count: 19)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !235, file: !139, line: 505, baseType: !195, size: 32, offset: 118848)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !235, file: !139, line: 506, baseType: !866, size: 1216, offset: 118912)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !235, file: !139, line: 507, baseType: !336, size: 64, offset: 120128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !235, file: !139, line: 510, baseType: !195, size: 32, offset: 120192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !235, file: !139, line: 511, baseType: !195, size: 32, offset: 120224)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !235, file: !139, line: 512, baseType: !715, size: 64, offset: 120256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !235, file: !139, line: 522, baseType: !876, size: 10624, offset: 120320)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !235, file: !139, line: 515, size: 10624, elements: !877)
!877 = !{!878, !880, !883, !886}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !876, file: !139, line: 517, baseType: !879, size: 256, align: 128)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 256, elements: !189)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !876, file: !139, line: 518, baseType: !881, size: 128, align: 128, offset: 256)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 128, elements: !882)
!882 = !{!154, !167}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !876, file: !139, line: 520, baseType: !884, size: 4096, align: 128, offset: 384)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 4096, elements: !885)
!885 = !{!167, !218}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !876, file: !139, line: 521, baseType: !887, size: 6144, align: 128, offset: 4480)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 6144, elements: !888)
!888 = !{!889, !190}
!889 = !DISubrange(count: 24)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !235, file: !139, line: 732, baseType: !891, size: 82688, offset: 130944)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !235, file: !139, line: 525, size: 82688, elements: !892)
!892 = !{!893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !920, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !938, !941, !945, !946, !947, !952, !953, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !1021, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1063, !1064, !1065, !1068, !1071, !1073, !1076, !1078, !1079}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !891, file: !139, line: 527, baseType: !195, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !891, file: !139, line: 530, baseType: !195, size: 32, offset: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !891, file: !139, line: 531, baseType: !195, size: 32, offset: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !891, file: !139, line: 532, baseType: !195, size: 32, offset: 96)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !891, file: !139, line: 535, baseType: !195, size: 32, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !891, file: !139, line: 536, baseType: !195, size: 32, offset: 160)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !891, file: !139, line: 537, baseType: !195, size: 32, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !891, file: !139, line: 538, baseType: !195, size: 32, offset: 224)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !891, file: !139, line: 539, baseType: !195, size: 32, offset: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !891, file: !139, line: 542, baseType: !195, size: 32, offset: 288)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !891, file: !139, line: 543, baseType: !195, size: 32, offset: 320)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !891, file: !139, line: 544, baseType: !195, size: 32, offset: 352)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !891, file: !139, line: 545, baseType: !195, size: 32, offset: 384)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !891, file: !139, line: 546, baseType: !195, size: 32, offset: 416)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !891, file: !139, line: 547, baseType: !195, size: 32, offset: 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !891, file: !139, line: 548, baseType: !195, size: 32, offset: 480)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !891, file: !139, line: 549, baseType: !195, size: 32, offset: 512)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !891, file: !139, line: 551, baseType: !195, size: 32, offset: 544)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !891, file: !139, line: 554, baseType: !336, size: 64, offset: 576)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !891, file: !139, line: 555, baseType: !336, size: 64, offset: 640)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !891, file: !139, line: 558, baseType: !336, size: 64, offset: 704)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !891, file: !139, line: 559, baseType: !336, size: 64, offset: 768)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !891, file: !139, line: 561, baseType: !336, size: 64, offset: 832)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !891, file: !139, line: 562, baseType: !336, size: 64, offset: 896)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !891, file: !139, line: 565, baseType: !7, size: 32, offset: 960)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !891, file: !139, line: 566, baseType: !919, size: 128, offset: 992)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !166)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !891, file: !139, line: 567, baseType: !921, size: 512, offset: 1120)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !189)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !891, file: !139, line: 568, baseType: !7, size: 32, offset: 1632)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !891, file: !139, line: 569, baseType: !7, size: 32, offset: 1664)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !891, file: !139, line: 570, baseType: !195, size: 32, offset: 1696)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !891, file: !139, line: 571, baseType: !195, size: 32, offset: 1728)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !891, file: !139, line: 572, baseType: !195, size: 32, offset: 1760)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !891, file: !139, line: 573, baseType: !195, size: 32, offset: 1792)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !891, file: !139, line: 574, baseType: !195, size: 32, offset: 1824)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !891, file: !139, line: 575, baseType: !195, size: 32, offset: 1856)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !891, file: !139, line: 576, baseType: !195, size: 32, offset: 1888)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !891, file: !139, line: 577, baseType: !195, size: 32, offset: 1920)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !891, file: !139, line: 578, baseType: !195, size: 32, offset: 1952)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !891, file: !139, line: 585, baseType: !763, size: 64, offset: 1984)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !891, file: !139, line: 586, baseType: !424, size: 64, offset: 2048)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !891, file: !139, line: 587, baseType: !763, size: 64, offset: 2112)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !891, file: !139, line: 588, baseType: !937, size: 64, offset: 2176)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !891, file: !139, line: 589, baseType: !939, size: 64, offset: 2240)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !764, size: 64, elements: !182)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !891, file: !139, line: 591, baseType: !942, size: 64, offset: 2304)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 192, elements: !944)
!944 = !{!889}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !891, file: !139, line: 592, baseType: !763, size: 64, offset: 2368)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !891, file: !139, line: 593, baseType: !769, size: 128, offset: 2432)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !891, file: !139, line: 594, baseType: !948, size: 128, offset: 2560)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 128, elements: !153)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 128, elements: !951)
!951 = !{!183, !154}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !891, file: !139, line: 595, baseType: !785, size: 128, offset: 2688)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !891, file: !139, line: 596, baseType: !954, size: 4096, offset: 2816)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 4096, elements: !955)
!955 = !{!154, !666}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !891, file: !139, line: 597, baseType: !763, size: 64, offset: 6912)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !891, file: !139, line: 598, baseType: !763, size: 64, offset: 6976)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !891, file: !139, line: 599, baseType: !600, size: 64, offset: 7040)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !891, file: !139, line: 603, baseType: !758, size: 1024, offset: 7104)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !891, file: !139, line: 606, baseType: !195, size: 32, offset: 8128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !891, file: !139, line: 607, baseType: !195, size: 32, offset: 8160)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !891, file: !139, line: 608, baseType: !165, size: 32, align: 32, offset: 8192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !891, file: !139, line: 609, baseType: !195, size: 32, offset: 8224)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !891, file: !139, line: 611, baseType: !195, size: 32, offset: 8256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !891, file: !139, line: 612, baseType: !195, size: 32, offset: 8288)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !891, file: !139, line: 614, baseType: !195, size: 32, offset: 8320)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !891, file: !139, line: 615, baseType: !195, size: 32, offset: 8352)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !891, file: !139, line: 621, baseType: !195, size: 32, offset: 8384)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !891, file: !139, line: 624, baseType: !195, size: 32, offset: 8416)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !891, file: !139, line: 626, baseType: !195, size: 32, offset: 8448)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !891, file: !139, line: 627, baseType: !195, size: 32, offset: 8480)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !891, file: !139, line: 671, baseType: !973, size: 60672, offset: 8576)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !891, file: !139, line: 629, size: 60672, elements: !974)
!974 = !{!975, !979, !983, !985, !986, !989, !993, !995, !996, !997, !998, !999, !1002, !1006, !1009, !1010, !1011, !1012, !1013, !1016, !1018, !1020}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !973, file: !139, line: 634, baseType: !976, size: 3072, align: 128)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 3072, elements: !977)
!977 = !{!978}
!978 = !DISubrange(count: 384)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !973, file: !139, line: 635, baseType: !980, size: 6912, align: 128, offset: 3072)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 6912, elements: !981)
!981 = !{!982}
!982 = !DISubrange(count: 864)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !973, file: !139, line: 638, baseType: !984, size: 2048, align: 128, offset: 9984)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 2048, elements: !476)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !973, file: !139, line: 639, baseType: !984, size: 2048, align: 128, offset: 12032)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !973, file: !139, line: 640, baseType: !987, size: 3072, align: 128, offset: 14080)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 3072, elements: !988)
!988 = !{!667, !218}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !973, file: !139, line: 641, baseType: !990, size: 3840, align: 128, offset: 17152)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 3840, elements: !991)
!991 = !{!992, !190}
!992 = !DISubrange(count: 15)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !973, file: !139, line: 642, baseType: !994, size: 128, offset: 20992)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 128, elements: !166)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !973, file: !139, line: 643, baseType: !994, size: 128, offset: 21120)
