; ModuleID = 'x264_src/encoder/ratecontrol.c'
source_filename = "x264_src/encoder/ratecontrol.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_level_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.ratecontrol_entry_t = type { i32, i32, i32, double, i32, i32, i32, i64, double, double, i32, i32, i32, i32, float, i8, [2 x i16], i16, [16 x i32], i32, i32, i32 }
%struct.x264_weight_t = type { [8 x i16], [8 x i16], i32, i32, i32, ptr, [8 x i8] }
%struct.x264_zone_t = type { i32, i32, i32, i32, float, ptr }
%struct.predictor_t = type { double, double, double, double }
%struct.x264_ratecontrol_t = type { i32, i32, i32, i32, double, double, double, double, i32, [5 x i32], ptr, i32, float, float, float, float, i32, double, double, double, double, double, ptr, i32, double, i32, double, double, double, double, double, double, double, double, double, double, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, double, [5 x double], i32, double, double, double, [5 x double], [5 x double], double, [2 x ptr], i32, float, double, double, double, double, ptr, [5 x [2 x %struct.predictor_t]], ptr, i32, i32, i32, ptr, ptr, i32, i32, double, double }

@.str = private unnamed_addr constant [57 x i8] c"MB-tree frametype %d doesn't match actual frametype %d.\0A\00", align 1, !dbg !0

!385 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2511, type: !99, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2511, type: !388, isLocal: true, isDefinition: true)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 200, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 25)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2517, type: !393, isLocal: true, isDefinition: true)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 19)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2544, type: !398, isLocal: true, isDefinition: true)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !399)
!399 = !{!400}
!400 = !DISubrange(count: 21)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2569, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 39)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2570, type: !408, isLocal: true, isDefinition: true)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 464, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 58)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2577, type: !413, isLocal: true, isDefinition: true)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 504, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 63)
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2579, type: !257, isLocal: true, isDefinition: true)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2584, type: !420, isLocal: true, isDefinition: true)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 536, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 67)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2586, type: !46, isLocal: true, isDefinition: true)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2589, type: !82, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2389, type: !429, isLocal: true, isDefinition: true)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 49)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 40, elements: !166)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !434)
!434 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!435 = !{i32 7, !"Dwarf Version", i32 5}
!436 = !{i32 2, !"Debug Info Version", i32 3}
!437 = !{i32 1, !"wchar_size", i32 4}
!438 = !{i32 8, !"PIC Level", i32 2}
!439 = !{i32 7, !"PIE Level", i32 2}
!440 = !{i32 7, !"uwtable", i32 2}
!441 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!442 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!443 = distinct !DISubprogram(name: "x264_adaptive_quant_frame", scope: !2, file: !2, line: 236, type: !444, scopeLine: 237, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !318, retainedNodes: !1864)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !446, !917}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !448, line: 46, baseType: !449)
!448 = !DIFile(filename: "x264_src/x264.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !321, line: 381, size: 266752, elements: !450)
!450 = !{!451, !616, !620, !621, !622, !623, !624, !625, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !760, !762, !788, !790, !791, !792, !796, !800, !801, !802, !809, !813, !814, !815, !820, !823, !824, !895, !912, !1068, !1069, !1070, !1071, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1093, !1276, !1443, !1498, !1501, !1503, !1505, !1506, !1509, !1514, !1523, !1524, !1532, !1534, !1539, !1614, !1696, !1740, !1762, !1811, !1840}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !449, file: !321, line: 384, baseType: !452, size: 5632)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !448, line: 376, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !448, line: 176, size: 5632, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !497, !502, !503, !504, !505, !509, !510, !522, !523, !524, !525, !526, !554, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !453, file: !448, line: 179, baseType: !322, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !453, file: !448, line: 180, baseType: !366, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !453, file: !448, line: 181, baseType: !366, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !453, file: !448, line: 182, baseType: !366, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !453, file: !448, line: 183, baseType: !366, size: 32, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !453, file: !448, line: 186, baseType: !366, size: 32, offset: 160)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !453, file: !448, line: 187, baseType: !366, size: 32, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !453, file: !448, line: 188, baseType: !366, size: 32, offset: 224)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !453, file: !448, line: 189, baseType: !366, size: 32, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !453, file: !448, line: 190, baseType: !366, size: 32, offset: 288)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !453, file: !448, line: 198, baseType: !366, size: 32, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !453, file: !448, line: 215, baseType: !467, size: 288, offset: 352)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !453, file: !448, line: 200, size: 288, elements: !468)
!468 = !{!469, !470, !471, !472, !473, !474, !475, !476, !477}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !467, file: !448, line: 203, baseType: !366, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !467, file: !448, line: 204, baseType: !366, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !467, file: !448, line: 206, baseType: !366, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !467, file: !448, line: 209, baseType: !366, size: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !467, file: !448, line: 210, baseType: !366, size: 32, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !467, file: !448, line: 211, baseType: !366, size: 32, offset: 160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !467, file: !448, line: 212, baseType: !366, size: 32, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !467, file: !448, line: 213, baseType: !366, size: 32, offset: 224)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !467, file: !448, line: 214, baseType: !366, size: 32, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !453, file: !448, line: 218, baseType: !366, size: 32, offset: 640)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !453, file: !448, line: 219, baseType: !366, size: 32, offset: 672)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !453, file: !448, line: 220, baseType: !366, size: 32, offset: 704)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !453, file: !448, line: 221, baseType: !366, size: 32, offset: 736)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !453, file: !448, line: 222, baseType: !366, size: 32, offset: 768)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !453, file: !448, line: 224, baseType: !366, size: 32, offset: 800)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !453, file: !448, line: 225, baseType: !366, size: 32, offset: 832)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !453, file: !448, line: 226, baseType: !366, size: 32, offset: 864)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !453, file: !448, line: 227, baseType: !366, size: 32, offset: 896)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !453, file: !448, line: 229, baseType: !366, size: 32, offset: 928)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !453, file: !448, line: 230, baseType: !366, size: 32, offset: 960)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !453, file: !448, line: 231, baseType: !366, size: 32, offset: 992)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !453, file: !448, line: 233, baseType: !366, size: 32, offset: 1024)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !453, file: !448, line: 234, baseType: !366, size: 32, offset: 1056)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !453, file: !448, line: 236, baseType: !366, size: 32, offset: 1088)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !453, file: !448, line: 237, baseType: !366, size: 32, offset: 1120)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !453, file: !448, line: 239, baseType: !366, size: 32, offset: 1152)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !453, file: !448, line: 240, baseType: !496, size: 64, offset: 1216)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !453, file: !448, line: 241, baseType: !498, size: 128, offset: 1280)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 128, elements: !83)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !376, line: 24, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !371, line: 38, baseType: !501)
!501 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !453, file: !448, line: 242, baseType: !498, size: 128, offset: 1408)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !453, file: !448, line: 243, baseType: !498, size: 128, offset: 1536)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !453, file: !448, line: 244, baseType: !498, size: 128, offset: 1664)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !453, file: !448, line: 245, baseType: !506, size: 512, offset: 1792)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 512, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !453, file: !448, line: 246, baseType: !506, size: 512, offset: 2304)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !453, file: !448, line: 249, baseType: !511, size: 64, offset: 2816)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !374, !366, !514, !515}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !517)
!517 = !{!518, !519, !520, !521}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !516, file: !2, baseType: !322, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !516, file: !2, baseType: !322, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !516, file: !2, baseType: !374, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !516, file: !2, baseType: !374, size: 64, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !453, file: !448, line: 250, baseType: !374, size: 64, offset: 2880)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !453, file: !448, line: 251, baseType: !366, size: 32, offset: 2944)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !453, file: !448, line: 252, baseType: !366, size: 32, offset: 2976)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !453, file: !448, line: 253, baseType: !496, size: 64, offset: 3008)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !453, file: !448, line: 287, baseType: !527, size: 800, offset: 3072)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !453, file: !448, line: 256, size: 800, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !552, !553}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !527, file: !448, line: 258, baseType: !322, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !527, file: !448, line: 259, baseType: !322, size: 32, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !527, file: !448, line: 261, baseType: !366, size: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !527, file: !448, line: 262, baseType: !366, size: 32, offset: 96)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !527, file: !448, line: 263, baseType: !366, size: 32, offset: 128)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !527, file: !448, line: 264, baseType: !366, size: 32, offset: 160)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !527, file: !448, line: 265, baseType: !366, size: 32, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !527, file: !448, line: 267, baseType: !366, size: 32, offset: 224)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !527, file: !448, line: 268, baseType: !366, size: 32, offset: 256)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !527, file: !448, line: 269, baseType: !366, size: 32, offset: 288)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !527, file: !448, line: 270, baseType: !366, size: 32, offset: 320)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !527, file: !448, line: 271, baseType: !366, size: 32, offset: 352)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !527, file: !448, line: 272, baseType: !366, size: 32, offset: 384)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !527, file: !448, line: 273, baseType: !366, size: 32, offset: 416)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !527, file: !448, line: 274, baseType: !366, size: 32, offset: 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !527, file: !448, line: 275, baseType: !366, size: 32, offset: 480)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !527, file: !448, line: 276, baseType: !366, size: 32, offset: 512)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !527, file: !448, line: 277, baseType: !366, size: 32, offset: 544)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !527, file: !448, line: 278, baseType: !367, size: 32, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !527, file: !448, line: 279, baseType: !367, size: 32, offset: 608)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !527, file: !448, line: 280, baseType: !366, size: 32, offset: 640)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !527, file: !448, line: 283, baseType: !551, size: 64, offset: 672)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 64, elements: !285)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !527, file: !448, line: 285, baseType: !366, size: 32, offset: 736)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !527, file: !448, line: 286, baseType: !366, size: 32, offset: 768)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !453, file: !448, line: 327, baseType: !555, size: 1152, offset: 3904)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !453, file: !448, line: 290, size: 1152, elements: !556)
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !594, !595}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !555, file: !448, line: 292, baseType: !366, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !555, file: !448, line: 294, baseType: !366, size: 32, offset: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !555, file: !448, line: 295, baseType: !366, size: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !555, file: !448, line: 296, baseType: !366, size: 32, offset: 96)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !555, file: !448, line: 297, baseType: !366, size: 32, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !555, file: !448, line: 299, baseType: !366, size: 32, offset: 160)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !555, file: !448, line: 300, baseType: !367, size: 32, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !555, file: !448, line: 301, baseType: !367, size: 32, offset: 224)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !555, file: !448, line: 302, baseType: !367, size: 32, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !555, file: !448, line: 303, baseType: !366, size: 32, offset: 288)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !555, file: !448, line: 304, baseType: !366, size: 32, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !555, file: !448, line: 305, baseType: !367, size: 32, offset: 352)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !555, file: !448, line: 306, baseType: !367, size: 32, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !555, file: !448, line: 307, baseType: !367, size: 32, offset: 416)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !555, file: !448, line: 309, baseType: !366, size: 32, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !555, file: !448, line: 310, baseType: !367, size: 32, offset: 480)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !555, file: !448, line: 311, baseType: !366, size: 32, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !555, file: !448, line: 312, baseType: !366, size: 32, offset: 544)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !555, file: !448, line: 315, baseType: !366, size: 32, offset: 576)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !555, file: !448, line: 316, baseType: !496, size: 64, offset: 640)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !555, file: !448, line: 317, baseType: !366, size: 32, offset: 704)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !555, file: !448, line: 318, baseType: !496, size: 64, offset: 768)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !555, file: !448, line: 321, baseType: !367, size: 32, offset: 832)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !555, file: !448, line: 322, baseType: !367, size: 32, offset: 864)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !555, file: !448, line: 323, baseType: !367, size: 32, offset: 896)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !555, file: !448, line: 324, baseType: !583, size: 64, offset: 960)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !448, line: 174, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !448, line: 167, size: 256, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !585, file: !448, line: 169, baseType: !366, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !585, file: !448, line: 169, baseType: !366, size: 32, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !585, file: !448, line: 170, baseType: !366, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !585, file: !448, line: 171, baseType: !366, size: 32, offset: 96)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !585, file: !448, line: 172, baseType: !367, size: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !585, file: !448, line: 173, baseType: !593, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !555, file: !448, line: 325, baseType: !366, size: 32, offset: 1024)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !555, file: !448, line: 326, baseType: !496, size: 64, offset: 1088)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !453, file: !448, line: 330, baseType: !366, size: 32, offset: 5056)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !453, file: !448, line: 331, baseType: !366, size: 32, offset: 5088)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !453, file: !448, line: 332, baseType: !366, size: 32, offset: 5120)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !453, file: !448, line: 334, baseType: !366, size: 32, offset: 5152)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !453, file: !448, line: 335, baseType: !366, size: 32, offset: 5184)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !453, file: !448, line: 336, baseType: !375, size: 32, offset: 5216)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !453, file: !448, line: 337, baseType: !375, size: 32, offset: 5248)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !453, file: !448, line: 338, baseType: !375, size: 32, offset: 5280)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !453, file: !448, line: 339, baseType: !375, size: 32, offset: 5312)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !453, file: !448, line: 340, baseType: !366, size: 32, offset: 5344)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !453, file: !448, line: 344, baseType: !366, size: 32, offset: 5376)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !453, file: !448, line: 356, baseType: !366, size: 32, offset: 5408)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !453, file: !448, line: 364, baseType: !366, size: 32, offset: 5440)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !453, file: !448, line: 367, baseType: !366, size: 32, offset: 5472)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !453, file: !448, line: 368, baseType: !366, size: 32, offset: 5504)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !453, file: !448, line: 369, baseType: !366, size: 32, offset: 5536)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !453, file: !448, line: 375, baseType: !613, size: 64, offset: 5568)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !374}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !449, file: !321, line: 386, baseType: !617, size: 8256, offset: 5632)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 8256, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 129)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !449, file: !321, line: 387, baseType: !366, size: 32, offset: 13888)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !449, file: !321, line: 388, baseType: !366, size: 32, offset: 13920)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !449, file: !321, line: 389, baseType: !366, size: 32, offset: 13952)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !449, file: !321, line: 390, baseType: !366, size: 32, offset: 13984)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !449, file: !321, line: 391, baseType: !366, size: 32, offset: 14016)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !449, file: !321, line: 402, baseType: !626, size: 576, offset: 14080)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !321, line: 394, size: 576, elements: !627)
!627 = !{!628, !629, !630, !640, !641, !642}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !626, file: !321, line: 396, baseType: !366, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !626, file: !321, line: 397, baseType: !366, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !626, file: !321, line: 398, baseType: !631, size: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !448, line: 604, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !448, line: 593, size: 192, elements: !634)
!634 = !{!635, !636, !637, !638}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !633, file: !448, line: 595, baseType: !366, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !633, file: !448, line: 596, baseType: !366, size: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !633, file: !448, line: 599, baseType: !366, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !633, file: !448, line: 603, baseType: !639, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !626, file: !321, line: 399, baseType: !366, size: 32, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !626, file: !321, line: 400, baseType: !639, size: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !626, file: !321, line: 401, baseType: !643, size: 320, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !644, line: 56, baseType: !645)
!644 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !644, line: 47, size: 320, elements: !646)
!646 = !{!647, !648, !649, !650, !653, !654}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !645, file: !644, line: 49, baseType: !639, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !645, file: !644, line: 50, baseType: !639, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !645, file: !644, line: 51, baseType: !639, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !645, file: !644, line: 53, baseType: !651, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !652, line: 87, baseType: !380)
!652 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !645, file: !644, line: 54, baseType: !366, size: 32, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !645, file: !644, line: 55, baseType: !366, size: 32, offset: 288)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !449, file: !321, line: 404, baseType: !639, size: 64, offset: 14656)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !449, file: !321, line: 405, baseType: !366, size: 32, offset: 14720)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !449, file: !321, line: 410, baseType: !366, size: 32, offset: 14752)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !449, file: !321, line: 411, baseType: !366, size: 32, offset: 14784)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !449, file: !321, line: 413, baseType: !366, size: 32, offset: 14816)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !449, file: !321, line: 415, baseType: !366, size: 32, offset: 14848)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !449, file: !321, line: 416, baseType: !366, size: 32, offset: 14880)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !449, file: !321, line: 418, baseType: !366, size: 32, offset: 14912)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !449, file: !321, line: 419, baseType: !366, size: 32, offset: 14944)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !449, file: !321, line: 420, baseType: !366, size: 32, offset: 14976)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !449, file: !321, line: 421, baseType: !366, size: 32, offset: 15008)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !449, file: !321, line: 422, baseType: !366, size: 32, offset: 15040)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !449, file: !321, line: 424, baseType: !366, size: 32, offset: 15072)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !449, file: !321, line: 425, baseType: !366, size: 32, offset: 15104)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !449, file: !321, line: 427, baseType: !366, size: 32, offset: 15136)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !449, file: !321, line: 430, baseType: !671, size: 10400, offset: 15168)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 10400, elements: !758)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !673, line: 154, baseType: !674)
!673 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !673, line: 52, size: 10400, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !693, !694, !695, !696, !697, !698, !699, !700, !701, !708, !709, !757}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !674, file: !673, line: 54, baseType: !366, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !674, file: !673, line: 56, baseType: !366, size: 32, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !674, file: !673, line: 57, baseType: !366, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !674, file: !673, line: 59, baseType: !366, size: 32, offset: 96)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !674, file: !673, line: 60, baseType: !366, size: 32, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !674, file: !673, line: 61, baseType: !366, size: 32, offset: 160)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !674, file: !673, line: 63, baseType: !366, size: 32, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !674, file: !673, line: 65, baseType: !366, size: 32, offset: 224)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !674, file: !673, line: 67, baseType: !366, size: 32, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !674, file: !673, line: 69, baseType: !366, size: 32, offset: 288)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !674, file: !673, line: 70, baseType: !366, size: 32, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !674, file: !673, line: 71, baseType: !366, size: 32, offset: 352)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !674, file: !673, line: 72, baseType: !366, size: 32, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !674, file: !673, line: 73, baseType: !690, size: 8192, offset: 416)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 8192, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !674, file: !673, line: 75, baseType: !366, size: 32, offset: 8608)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !674, file: !673, line: 76, baseType: !366, size: 32, offset: 8640)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !674, file: !673, line: 77, baseType: !366, size: 32, offset: 8672)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !674, file: !673, line: 78, baseType: !366, size: 32, offset: 8704)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !674, file: !673, line: 79, baseType: !366, size: 32, offset: 8736)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !674, file: !673, line: 80, baseType: !366, size: 32, offset: 8768)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !674, file: !673, line: 81, baseType: !366, size: 32, offset: 8800)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !674, file: !673, line: 83, baseType: !366, size: 32, offset: 8832)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !674, file: !673, line: 90, baseType: !702, size: 128, offset: 8864)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !674, file: !673, line: 84, size: 128, elements: !703)
!703 = !{!704, !705, !706, !707}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !702, file: !673, line: 86, baseType: !366, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !702, file: !673, line: 87, baseType: !366, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !702, file: !673, line: 88, baseType: !366, size: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !702, file: !673, line: 89, baseType: !366, size: 32, offset: 96)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !674, file: !673, line: 92, baseType: !366, size: 32, offset: 8992)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !674, file: !673, line: 150, baseType: !710, size: 1344, offset: 9024)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !674, file: !673, line: 93, size: 1344, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !748, !749, !750, !751, !752, !753, !754, !755, !756}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !710, file: !673, line: 95, baseType: !366, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !710, file: !673, line: 96, baseType: !366, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !710, file: !673, line: 97, baseType: !366, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !710, file: !673, line: 99, baseType: !366, size: 32, offset: 96)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !710, file: !673, line: 100, baseType: !366, size: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !710, file: !673, line: 102, baseType: !366, size: 32, offset: 160)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !710, file: !673, line: 103, baseType: !366, size: 32, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !710, file: !673, line: 104, baseType: !366, size: 32, offset: 224)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !710, file: !673, line: 105, baseType: !366, size: 32, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !710, file: !673, line: 106, baseType: !366, size: 32, offset: 288)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !710, file: !673, line: 107, baseType: !366, size: 32, offset: 320)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !710, file: !673, line: 108, baseType: !366, size: 32, offset: 352)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !710, file: !673, line: 110, baseType: !366, size: 32, offset: 384)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !710, file: !673, line: 111, baseType: !366, size: 32, offset: 416)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !710, file: !673, line: 112, baseType: !366, size: 32, offset: 448)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !710, file: !673, line: 114, baseType: !366, size: 32, offset: 480)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !710, file: !673, line: 115, baseType: !375, size: 32, offset: 512)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !710, file: !673, line: 116, baseType: !375, size: 32, offset: 544)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !710, file: !673, line: 117, baseType: !366, size: 32, offset: 576)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !710, file: !673, line: 119, baseType: !366, size: 32, offset: 608)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !710, file: !673, line: 120, baseType: !366, size: 32, offset: 640)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !710, file: !673, line: 137, baseType: !734, size: 384, offset: 672)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !710, file: !673, line: 122, size: 384, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !734, file: !673, line: 124, baseType: !366, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !734, file: !673, line: 125, baseType: !366, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !734, file: !673, line: 126, baseType: !366, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !734, file: !673, line: 127, baseType: !366, size: 32, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !734, file: !673, line: 128, baseType: !366, size: 32, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !734, file: !673, line: 129, baseType: !366, size: 32, offset: 160)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !734, file: !673, line: 130, baseType: !366, size: 32, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !734, file: !673, line: 131, baseType: !366, size: 32, offset: 224)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !734, file: !673, line: 133, baseType: !366, size: 32, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !734, file: !673, line: 134, baseType: !366, size: 32, offset: 288)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !734, file: !673, line: 135, baseType: !366, size: 32, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !734, file: !673, line: 136, baseType: !366, size: 32, offset: 352)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !710, file: !673, line: 139, baseType: !366, size: 32, offset: 1056)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !710, file: !673, line: 140, baseType: !366, size: 32, offset: 1088)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !710, file: !673, line: 141, baseType: !366, size: 32, offset: 1120)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !710, file: !673, line: 142, baseType: !366, size: 32, offset: 1152)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !710, file: !673, line: 143, baseType: !366, size: 32, offset: 1184)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !710, file: !673, line: 144, baseType: !366, size: 32, offset: 1216)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !710, file: !673, line: 145, baseType: !366, size: 32, offset: 1248)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !710, file: !673, line: 146, baseType: !366, size: 32, offset: 1280)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !710, file: !673, line: 147, baseType: !366, size: 32, offset: 1312)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !674, file: !673, line: 152, baseType: !366, size: 32, offset: 10368)
!758 = !{!759}
!759 = !DISubrange(count: 1)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !449, file: !321, line: 431, baseType: !761, size: 64, offset: 25600)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !449, file: !321, line: 432, baseType: !763, size: 960, offset: 25664)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !764, size: 960, elements: !758)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !673, line: 186, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !673, line: 156, size: 960, elements: !766)
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !765, file: !673, line: 158, baseType: !366, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !765, file: !673, line: 159, baseType: !366, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !765, file: !673, line: 161, baseType: !366, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !765, file: !673, line: 163, baseType: !366, size: 32, offset: 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !765, file: !673, line: 164, baseType: !366, size: 32, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !765, file: !673, line: 166, baseType: !366, size: 32, offset: 160)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !765, file: !673, line: 167, baseType: !366, size: 32, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !765, file: !673, line: 169, baseType: !366, size: 32, offset: 224)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !765, file: !673, line: 170, baseType: !366, size: 32, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !765, file: !673, line: 172, baseType: !366, size: 32, offset: 288)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !765, file: !673, line: 173, baseType: !366, size: 32, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !765, file: !673, line: 175, baseType: !366, size: 32, offset: 352)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !765, file: !673, line: 177, baseType: !366, size: 32, offset: 384)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !765, file: !673, line: 178, baseType: !366, size: 32, offset: 416)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !765, file: !673, line: 179, baseType: !366, size: 32, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !765, file: !673, line: 181, baseType: !366, size: 32, offset: 480)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !765, file: !673, line: 183, baseType: !366, size: 32, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !765, file: !673, line: 184, baseType: !785, size: 384, offset: 576)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !786, size: 384, elements: !228)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !499)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !449, file: !321, line: 433, baseType: !789, size: 64, offset: 26624)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !449, file: !321, line: 434, baseType: !366, size: 32, offset: 26688)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !449, file: !321, line: 437, baseType: !366, size: 32, offset: 26720)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !449, file: !321, line: 440, baseType: !793, size: 256, offset: 26752)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 256, elements: !219)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 512, elements: !83)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !449, file: !321, line: 441, baseType: !797, size: 128, offset: 27008)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 128, elements: !285)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 2048, elements: !507)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !449, file: !321, line: 443, baseType: !793, size: 256, offset: 27136)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !449, file: !321, line: 444, baseType: !797, size: 128, offset: 27392)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !449, file: !321, line: 446, baseType: !803, size: 256, offset: 27520)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !804, size: 256, elements: !219)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 256, elements: !83)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !376, line: 25, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !371, line: 40, baseType: !808)
!808 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !449, file: !321, line: 447, baseType: !810, size: 128, offset: 27776)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 128, elements: !285)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 1024, elements: !507)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !449, file: !321, line: 448, baseType: !803, size: 256, offset: 27904)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !449, file: !321, line: 449, baseType: !810, size: 128, offset: 28160)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !449, file: !321, line: 454, baseType: !816, size: 5888, offset: 28288)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 5888, elements: !818)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!818 = !{!819}
!819 = !DISubrange(count: 92)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !449, file: !321, line: 455, baseType: !821, size: 23552, offset: 34176)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 23552, elements: !822)
!822 = !{!819, !220}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !449, file: !321, line: 457, baseType: !786, size: 64, offset: 57728)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !449, file: !321, line: 460, baseType: !825, size: 53376, offset: 57856)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !321, line: 364, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 302, size: 53376, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !856, !879, !880, !881, !887, !888, !889, !890, !891, !892, !893, !894}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !826, file: !321, line: 304, baseType: !761, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !826, file: !321, line: 305, baseType: !789, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !826, file: !321, line: 307, baseType: !366, size: 32, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !826, file: !321, line: 308, baseType: !366, size: 32, offset: 160)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !826, file: !321, line: 309, baseType: !366, size: 32, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !826, file: !321, line: 311, baseType: !366, size: 32, offset: 224)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !826, file: !321, line: 313, baseType: !366, size: 32, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !826, file: !321, line: 315, baseType: !366, size: 32, offset: 288)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !826, file: !321, line: 316, baseType: !366, size: 32, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !826, file: !321, line: 317, baseType: !366, size: 32, offset: 352)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !826, file: !321, line: 319, baseType: !366, size: 32, offset: 384)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !826, file: !321, line: 321, baseType: !366, size: 32, offset: 416)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !826, file: !321, line: 322, baseType: !366, size: 32, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !826, file: !321, line: 324, baseType: !551, size: 64, offset: 480)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !826, file: !321, line: 325, baseType: !366, size: 32, offset: 544)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !826, file: !321, line: 327, baseType: !366, size: 32, offset: 576)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !826, file: !321, line: 329, baseType: !366, size: 32, offset: 608)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !826, file: !321, line: 330, baseType: !366, size: 32, offset: 640)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !826, file: !321, line: 331, baseType: !366, size: 32, offset: 672)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !826, file: !321, line: 333, baseType: !366, size: 32, offset: 704)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !826, file: !321, line: 334, baseType: !366, size: 32, offset: 736)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !826, file: !321, line: 339, baseType: !850, size: 2048, offset: 768)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 2048, elements: !855)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !826, file: !321, line: 335, size: 64, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !851, file: !321, line: 337, baseType: !366, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !851, file: !321, line: 338, baseType: !366, size: 32, offset: 32)
!855 = !{!286, !84}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !826, file: !321, line: 342, baseType: !857, size: 49152, align: 128, offset: 2816)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !858, size: 49152, align: 128, elements: !878)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !859, line: 36, baseType: !860, align: 128)
!859 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !859, line: 26, size: 512, elements: !861)
!861 = !{!862, !864, !865, !868, !869, !870}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !860, file: !859, line: 30, baseType: !863, size: 128, align: 128)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 128, elements: !63)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !860, file: !859, line: 31, baseType: !863, size: 128, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !860, file: !859, line: 32, baseType: !866, size: 32, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !369, line: 26, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !371, line: 41, baseType: !366)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !860, file: !859, line: 33, baseType: !866, size: 32, offset: 288)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !860, file: !859, line: 34, baseType: !866, size: 32, offset: 320)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !860, file: !859, line: 35, baseType: !871, size: 64, offset: 384)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !859, line: 25, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{null, !639, !366, !639, !366, !876, !366}
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !860)
!878 = !{!11, !69}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !826, file: !321, line: 344, baseType: !366, size: 32, offset: 51968)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !826, file: !321, line: 345, baseType: !366, size: 32, offset: 52000)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !826, file: !321, line: 350, baseType: !882, size: 1024, offset: 52032)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !883, size: 1024, elements: !83)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !826, file: !321, line: 346, size: 64, elements: !884)
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !883, file: !321, line: 348, baseType: !366, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !883, file: !321, line: 349, baseType: !366, size: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !826, file: !321, line: 352, baseType: !366, size: 32, offset: 53056)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !826, file: !321, line: 354, baseType: !366, size: 32, offset: 53088)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !826, file: !321, line: 355, baseType: !366, size: 32, offset: 53120)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !826, file: !321, line: 356, baseType: !366, size: 32, offset: 53152)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !826, file: !321, line: 357, baseType: !366, size: 32, offset: 53184)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !826, file: !321, line: 360, baseType: !366, size: 32, offset: 53216)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !826, file: !321, line: 361, baseType: !366, size: 32, offset: 53248)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !826, file: !321, line: 362, baseType: !366, size: 32, offset: 53280)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !449, file: !321, line: 463, baseType: !896, size: 4096, offset: 111232)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !897, line: 46, baseType: !898)
!897 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !897, line: 27, size: 4096, elements: !899)
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !898, file: !897, line: 30, baseType: !366, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !898, file: !897, line: 31, baseType: !366, size: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !898, file: !897, line: 34, baseType: !366, size: 32, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !898, file: !897, line: 35, baseType: !366, size: 32, offset: 96)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !898, file: !897, line: 37, baseType: !639, size: 64, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !898, file: !897, line: 38, baseType: !639, size: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !898, file: !897, line: 39, baseType: !639, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !898, file: !897, line: 42, baseType: !366, size: 32, align: 128, offset: 384)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !898, file: !897, line: 45, baseType: !909, size: 3680, offset: 416)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 3680, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 460)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !449, file: !321, line: 494, baseType: !913, size: 2112, offset: 115328)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !321, line: 465, size: 2112, elements: !914)
!914 = !{!915, !1048, !1050, !1051, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1064, !1065, !1066, !1067}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !913, file: !321, line: 468, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !919, line: 146, baseType: !920)
!919 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !919, line: 31, size: 125056, elements: !921)
!921 = !{!922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !949, !950, !951, !952, !953, !954, !956, !958, !959, !960, !961, !962, !965, !967, !968, !970, !974, !975, !979, !980, !983, !986, !989, !991, !992, !994, !995, !997, !998, !999, !1001, !1003, !1004, !1005, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1016, !1017, !1021, !1029, !1033, !1035, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !920, file: !919, line: 34, baseType: !366, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !920, file: !919, line: 35, baseType: !366, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !920, file: !919, line: 36, baseType: !366, size: 32, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !920, file: !919, line: 37, baseType: !378, size: 64, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !920, file: !919, line: 38, baseType: !378, size: 64, offset: 192)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !920, file: !919, line: 39, baseType: !366, size: 32, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !920, file: !919, line: 40, baseType: !366, size: 32, offset: 288)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !920, file: !919, line: 41, baseType: !366, size: 32, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !920, file: !919, line: 42, baseType: !366, size: 32, offset: 352)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !920, file: !919, line: 43, baseType: !932, size: 64, offset: 384)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !920, file: !919, line: 45, baseType: !366, size: 32, offset: 448)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !920, file: !919, line: 46, baseType: !366, size: 32, offset: 480)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !920, file: !919, line: 47, baseType: !366, size: 32, offset: 512)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !920, file: !919, line: 48, baseType: !366, size: 32, offset: 544)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !920, file: !919, line: 49, baseType: !366, size: 32, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !920, file: !919, line: 50, baseType: !366, size: 32, offset: 608)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !920, file: !919, line: 51, baseType: !366, size: 32, offset: 640)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !920, file: !919, line: 52, baseType: !499, size: 8, offset: 672)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !920, file: !919, line: 53, baseType: !499, size: 8, offset: 680)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !920, file: !919, line: 54, baseType: !499, size: 8, offset: 688)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !920, file: !919, line: 55, baseType: !367, size: 32, offset: 704)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !920, file: !919, line: 56, baseType: !367, size: 32, offset: 736)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !920, file: !919, line: 57, baseType: !366, size: 32, offset: 768)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !920, file: !919, line: 60, baseType: !366, size: 32, offset: 800)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !920, file: !919, line: 61, baseType: !948, size: 96, offset: 832)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 96, elements: !68)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !920, file: !919, line: 62, baseType: !948, size: 96, offset: 928)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !920, file: !919, line: 63, baseType: !948, size: 96, offset: 1024)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !920, file: !919, line: 64, baseType: !366, size: 32, offset: 1120)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !920, file: !919, line: 65, baseType: !366, size: 32, offset: 1152)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !920, file: !919, line: 66, baseType: !366, size: 32, offset: 1184)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !920, file: !919, line: 67, baseType: !955, size: 192, offset: 1216)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 192, elements: !68)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !920, file: !919, line: 68, baseType: !957, size: 256, offset: 1408)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 256, elements: !219)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !920, file: !919, line: 69, baseType: !957, size: 256, offset: 1664)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !920, file: !919, line: 70, baseType: !817, size: 64, offset: 1920)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !920, file: !919, line: 74, baseType: !957, size: 256, offset: 1984)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !920, file: !919, line: 75, baseType: !957, size: 256, offset: 2240)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !920, file: !919, line: 77, baseType: !963, size: 24576, align: 128, offset: 2560)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !858, size: 24576, align: 128, elements: !964)
!964 = !{!84, !69}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !920, file: !919, line: 78, baseType: !966, size: 1024, offset: 27136)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 1024, elements: !83)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !920, file: !919, line: 79, baseType: !366, size: 32, offset: 28160)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !920, file: !919, line: 80, baseType: !969, size: 64, offset: 28224)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !920, file: !919, line: 83, baseType: !971, size: 64, offset: 28288)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !369, line: 24, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !371, line: 37, baseType: !434)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !920, file: !919, line: 84, baseType: !639, size: 64, offset: 28352)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !920, file: !919, line: 85, baseType: !976, size: 128, offset: 28416)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 128, elements: !285)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 32, elements: !285)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !920, file: !919, line: 86, baseType: !977, size: 64, offset: 28544)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !920, file: !919, line: 87, baseType: !981, size: 2176, offset: 28608)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 2176, elements: !982)
!982 = !{!286, !148}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !920, file: !919, line: 92, baseType: !984, size: 20736, offset: 30784)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 20736, elements: !985)
!985 = !{!194, !194}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !920, file: !919, line: 96, baseType: !987, size: 2176, offset: 51520)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !988, size: 2176, elements: !982)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !920, file: !919, line: 97, baseType: !990, size: 128, offset: 53696)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 128, elements: !285)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !920, file: !919, line: 98, baseType: !551, size: 64, offset: 53824)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !920, file: !919, line: 99, baseType: !993, size: 1024, offset: 53888)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 1024, elements: !855)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !920, file: !919, line: 100, baseType: !978, size: 32, offset: 54912)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !920, file: !919, line: 105, baseType: !996, size: 10368, offset: 54944)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 10368, elements: !985)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !920, file: !919, line: 106, baseType: !996, size: 10368, offset: 65312)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !920, file: !919, line: 107, baseType: !366, size: 32, offset: 75680)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !920, file: !919, line: 108, baseType: !1000, size: 576, offset: 75712)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 576, elements: !193)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !920, file: !919, line: 109, baseType: !1002, size: 20736, offset: 76288)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !988, size: 20736, elements: !985)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !920, file: !919, line: 110, baseType: !988, size: 64, offset: 97024)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !920, file: !919, line: 111, baseType: !988, size: 64, offset: 97088)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !920, file: !919, line: 112, baseType: !1006, size: 64, offset: 97152)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !920, file: !919, line: 113, baseType: !1006, size: 64, offset: 97216)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !920, file: !919, line: 114, baseType: !1006, size: 64, offset: 97280)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !920, file: !919, line: 115, baseType: !366, size: 32, offset: 97344)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !920, file: !919, line: 116, baseType: !817, size: 64, offset: 97408)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !920, file: !919, line: 117, baseType: !817, size: 64, offset: 97472)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !920, file: !919, line: 118, baseType: !817, size: 64, offset: 97536)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !920, file: !919, line: 119, baseType: !366, size: 32, offset: 97600)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !920, file: !919, line: 120, baseType: !1015, size: 576, offset: 97632)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 576, elements: !193)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !920, file: !919, line: 121, baseType: !375, size: 32, offset: 98208)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !920, file: !919, line: 122, baseType: !1018, size: 64, offset: 98240)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !376, line: 27, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !371, line: 45, baseType: !1020)
!1020 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !920, file: !919, line: 125, baseType: !1022, size: 256, offset: 98304)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !448, line: 503, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !448, line: 496, size: 256, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !1023, file: !448, line: 498, baseType: !373, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !1023, file: !448, line: 499, baseType: !373, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !1023, file: !448, line: 500, baseType: !373, size: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !1023, file: !448, line: 502, baseType: !373, size: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !920, file: !919, line: 128, baseType: !1030, size: 2008, offset: 98560)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 2008, elements: !1031)
!1031 = !{!1032}
!1032 = !DISubrange(count: 251)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !920, file: !919, line: 129, baseType: !1034, size: 8032, offset: 100576)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 8032, elements: !1031)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !920, file: !919, line: 130, baseType: !1036, size: 16064, offset: 108608)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 16064, elements: !1031)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !920, file: !919, line: 131, baseType: !366, size: 32, offset: 124672)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !920, file: !919, line: 132, baseType: !366, size: 32, offset: 124704)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !920, file: !919, line: 135, baseType: !366, size: 32, offset: 124736)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !920, file: !919, line: 136, baseType: !366, size: 32, offset: 124768)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !920, file: !919, line: 137, baseType: !366, size: 32, offset: 124800)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !920, file: !919, line: 138, baseType: !366, size: 32, offset: 124832)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !920, file: !919, line: 139, baseType: !366, size: 32, offset: 124864)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !920, file: !919, line: 142, baseType: !367, size: 32, offset: 124896)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !920, file: !919, line: 143, baseType: !366, size: 32, offset: 124928)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !920, file: !919, line: 144, baseType: !366, size: 32, offset: 124960)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !920, file: !919, line: 145, baseType: !366, size: 32, offset: 124992)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !913, file: !321, line: 470, baseType: !1049, size: 128, offset: 64)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !916, size: 128, elements: !285)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !913, file: !321, line: 473, baseType: !916, size: 64, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !913, file: !321, line: 476, baseType: !1052, size: 1152, offset: 256)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 1152, elements: !193)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !913, file: !321, line: 478, baseType: !366, size: 32, offset: 1408)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !913, file: !321, line: 480, baseType: !366, size: 32, offset: 1440)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !913, file: !321, line: 482, baseType: !366, size: 32, offset: 1472)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !913, file: !321, line: 483, baseType: !366, size: 32, offset: 1504)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !913, file: !321, line: 484, baseType: !366, size: 32, offset: 1536)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !913, file: !321, line: 485, baseType: !366, size: 32, offset: 1568)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !913, file: !321, line: 486, baseType: !366, size: 32, offset: 1600)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !913, file: !321, line: 487, baseType: !378, size: 64, offset: 1664)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !913, file: !321, line: 488, baseType: !378, size: 64, offset: 1728)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !913, file: !321, line: 489, baseType: !1063, size: 128, offset: 1792)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 128, elements: !285)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !913, file: !321, line: 490, baseType: !378, size: 64, offset: 1920)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !913, file: !321, line: 491, baseType: !378, size: 64, offset: 1984)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !913, file: !321, line: 492, baseType: !366, size: 32, offset: 2048)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !913, file: !321, line: 493, baseType: !366, size: 32, offset: 2080)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !449, file: !321, line: 497, baseType: !917, size: 64, offset: 117440)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !449, file: !321, line: 500, baseType: !917, size: 64, offset: 117504)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !449, file: !321, line: 503, baseType: !366, size: 32, offset: 117568)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !449, file: !321, line: 504, baseType: !1072, size: 1216, offset: 117632)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 1216, elements: !394)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !449, file: !321, line: 505, baseType: !366, size: 32, offset: 118848)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !449, file: !321, line: 506, baseType: !1072, size: 1216, offset: 118912)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !449, file: !321, line: 507, baseType: !551, size: 64, offset: 120128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !449, file: !321, line: 510, baseType: !366, size: 32, offset: 120192)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !449, file: !321, line: 511, baseType: !366, size: 32, offset: 120224)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !449, file: !321, line: 512, baseType: !378, size: 64, offset: 120256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !449, file: !321, line: 522, baseType: !1080, size: 10624, offset: 120320)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !321, line: 515, size: 10624, elements: !1081)
!1081 = !{!1082, !1084, !1087, !1090}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !1080, file: !321, line: 517, baseType: !1083, size: 256, align: 128)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 256, elements: !83)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !1080, file: !321, line: 518, baseType: !1085, size: 128, align: 128, offset: 256)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 128, elements: !1086)
!1086 = !{!286, !220}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !1080, file: !321, line: 520, baseType: !1088, size: 4096, align: 128, offset: 384)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 4096, elements: !1089)
!1089 = !{!220, !508}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !1080, file: !321, line: 521, baseType: !1091, size: 6144, align: 128, offset: 4480)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 6144, elements: !1092)
!1092 = !{!43, !84}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !449, file: !321, line: 732, baseType: !1094, size: 82688, offset: 130944)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !321, line: 525, size: 82688, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1123, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1141, !1144, !1147, !1148, !1149, !1154, !1155, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1220, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1258, !1259, !1260, !1263, !1266, !1268, !1271, !1273, !1274}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !1094, file: !321, line: 527, baseType: !366, size: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !1094, file: !321, line: 530, baseType: !366, size: 32, offset: 32)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !1094, file: !321, line: 531, baseType: !366, size: 32, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !1094, file: !321, line: 532, baseType: !366, size: 32, offset: 96)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !1094, file: !321, line: 535, baseType: !366, size: 32, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !1094, file: !321, line: 536, baseType: !366, size: 32, offset: 160)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !1094, file: !321, line: 537, baseType: !366, size: 32, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !1094, file: !321, line: 538, baseType: !366, size: 32, offset: 224)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !1094, file: !321, line: 539, baseType: !366, size: 32, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !1094, file: !321, line: 542, baseType: !366, size: 32, offset: 288)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !1094, file: !321, line: 543, baseType: !366, size: 32, offset: 320)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !1094, file: !321, line: 544, baseType: !366, size: 32, offset: 352)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !1094, file: !321, line: 545, baseType: !366, size: 32, offset: 384)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !1094, file: !321, line: 546, baseType: !366, size: 32, offset: 416)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !1094, file: !321, line: 547, baseType: !366, size: 32, offset: 448)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !1094, file: !321, line: 548, baseType: !366, size: 32, offset: 480)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !1094, file: !321, line: 549, baseType: !366, size: 32, offset: 512)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !1094, file: !321, line: 551, baseType: !366, size: 32, offset: 544)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !1094, file: !321, line: 554, baseType: !551, size: 64, offset: 576)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !1094, file: !321, line: 555, baseType: !551, size: 64, offset: 640)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !1094, file: !321, line: 558, baseType: !551, size: 64, offset: 704)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !1094, file: !321, line: 559, baseType: !551, size: 64, offset: 768)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !1094, file: !321, line: 561, baseType: !551, size: 64, offset: 832)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !1094, file: !321, line: 562, baseType: !551, size: 64, offset: 896)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !1094, file: !321, line: 565, baseType: !322, size: 32, offset: 960)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !1094, file: !321, line: 566, baseType: !1122, size: 128, offset: 992)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 128, elements: !219)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !1094, file: !321, line: 567, baseType: !1124, size: 512, offset: 1120)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 512, elements: !83)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !1094, file: !321, line: 568, baseType: !322, size: 32, offset: 1632)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !1094, file: !321, line: 569, baseType: !322, size: 32, offset: 1664)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !1094, file: !321, line: 570, baseType: !366, size: 32, offset: 1696)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !1094, file: !321, line: 571, baseType: !366, size: 32, offset: 1728)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !1094, file: !321, line: 572, baseType: !366, size: 32, offset: 1760)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !1094, file: !321, line: 573, baseType: !366, size: 32, offset: 1792)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !1094, file: !321, line: 574, baseType: !366, size: 32, offset: 1824)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !1094, file: !321, line: 575, baseType: !366, size: 32, offset: 1856)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !1094, file: !321, line: 576, baseType: !366, size: 32, offset: 1888)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !1094, file: !321, line: 577, baseType: !366, size: 32, offset: 1920)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !1094, file: !321, line: 578, baseType: !366, size: 32, offset: 1952)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1094, file: !321, line: 585, baseType: !971, size: 64, offset: 1984)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !1094, file: !321, line: 586, baseType: !639, size: 64, offset: 2048)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !1094, file: !321, line: 587, baseType: !971, size: 64, offset: 2112)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !1094, file: !321, line: 588, baseType: !1140, size: 64, offset: 2176)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !1094, file: !321, line: 589, baseType: !1142, size: 64, offset: 2240)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 64, elements: !63)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !1094, file: !321, line: 591, baseType: !1145, size: 64, offset: 2304)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 192, elements: !42)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !1094, file: !321, line: 592, baseType: !971, size: 64, offset: 2368)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !1094, file: !321, line: 593, baseType: !976, size: 128, offset: 2432)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !1094, file: !321, line: 594, baseType: !1150, size: 128, offset: 2560)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1151, size: 128, elements: !285)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 128, elements: !1153)
!1153 = !{!64, !286}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !1094, file: !321, line: 595, baseType: !990, size: 128, offset: 2688)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !1094, file: !321, line: 596, baseType: !1156, size: 4096, offset: 2816)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 4096, elements: !1157)
!1157 = !{!286, !11}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !1094, file: !321, line: 597, baseType: !971, size: 64, offset: 6912)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !1094, file: !321, line: 598, baseType: !971, size: 64, offset: 6976)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !1094, file: !321, line: 599, baseType: !817, size: 64, offset: 7040)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !1094, file: !321, line: 603, baseType: !966, size: 1024, offset: 7104)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !1094, file: !321, line: 606, baseType: !366, size: 32, offset: 8128)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !1094, file: !321, line: 607, baseType: !366, size: 32, offset: 8160)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !1094, file: !321, line: 608, baseType: !1165, size: 32, align: 32, offset: 8192)
!1165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 32, elements: !219)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !1094, file: !321, line: 609, baseType: !366, size: 32, offset: 8224)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !1094, file: !321, line: 611, baseType: !366, size: 32, offset: 8256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !1094, file: !321, line: 612, baseType: !366, size: 32, offset: 8288)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !1094, file: !321, line: 614, baseType: !366, size: 32, offset: 8320)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !1094, file: !321, line: 615, baseType: !366, size: 32, offset: 8352)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !1094, file: !321, line: 621, baseType: !366, size: 32, offset: 8384)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !1094, file: !321, line: 624, baseType: !366, size: 32, offset: 8416)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !1094, file: !321, line: 626, baseType: !366, size: 32, offset: 8448)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !1094, file: !321, line: 627, baseType: !366, size: 32, offset: 8480)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !1094, file: !321, line: 671, baseType: !1176, size: 60672, offset: 8576)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1094, file: !321, line: 629, size: 60672, elements: !1177)
!1177 = !{!1178, !1182, !1186, !1188, !1189, !1192, !1195, !1197, !1198, !1199, !1200, !1201, !1204, !1206, !1208, !1209, !1210, !1211, !1212, !1215, !1217, !1219}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !1176, file: !321, line: 634, baseType: !1179, size: 3072, align: 128)
!1179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 3072, elements: !1180)
!1180 = !{!1181}
!1181 = !DISubrange(count: 384)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !1176, file: !321, line: 635, baseType: !1183, size: 6912, align: 128, offset: 3072)
!1183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 6912, elements: !1184)
!1184 = !{!1185}
!1185 = !DISubrange(count: 864)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !1176, file: !321, line: 638, baseType: !1187, size: 2048, align: 128, offset: 9984)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 2048, elements: !691)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !1176, file: !321, line: 639, baseType: !1187, size: 2048, align: 128, offset: 12032)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !1176, file: !321, line: 640, baseType: !1190, size: 3072, align: 128, offset: 14080)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 3072, elements: !1191)
!1191 = !{!69, !508}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !1176, file: !321, line: 641, baseType: !1193, size: 3840, align: 128, offset: 17152)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 3840, elements: !1194)
!1194 = !{!101, !84}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !1176, file: !321, line: 642, baseType: !1196, size: 128, offset: 20992)
