; ModuleID = 'ldecod_src/annexb.c'
source_filename = "ldecod_src/annexb.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@errortext = external global [300 x i8], align 16
@.str = private unnamed_addr constant [42 x i8] c"Memory allocation for Annex_B file failed\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [19 x i8] c"GetAnnexbNALU: Buf\00", align 1, !dbg !7
@.str.6 = private unnamed_addr constant [49 x i8] c"OpenAnnexBFile: tried to open Annex B file twice\00", align 1, !dbg !12
@.str.7 = private unnamed_addr constant [41 x i8] c"Cannot open Annex B ByteStream file '%s'\00", align 1, !dbg !17
@.str.8 = private unnamed_addr constant [42 x i8] c"OpenAnnexBFile: cannot allocate IO buffer\00", align 1, !dbg !22
@str.9 = private unnamed_addr constant [110 x i8] c"GetAnnexbNALU: The leading_zero_8bits syntax can only be present in the first byte stream NAL unit, return -1\00", align 1
@str.10 = private unnamed_addr constant [69 x i8] c"GetAnnexbNALU: no Start Code at the beginning of the NALU, return -1\00", align 1
@str.11 = private unnamed_addr constant [36 x i8] c"GetAnnexbNALU can't read start code\00", align 1

; Function Attrs: nounwind uwtable
define dso_local void @malloc_annex_b(ptr nocapture noundef %p_Vid) local_unnamed_addr #0 !dbg !141 {
entry:
    #dbg_value(ptr %p_Vid, !1340, !DIExpression(), !1341)

!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 312, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 49)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 316, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 328, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 41)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 324, type: !3, isLocal: true, isDefinition: true)
!24 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !90, globals: !112, splitDebugInlining: false, nameTableKind: None)
!25 = !{!26, !35, !41, !50, !57, !65, !84}
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 22, baseType: !28, size: 32, elements: !29)
!27 = !DIFile(filename: "ldecod_src/inc/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "fd6ca9e1c707932f749220576db72b57")
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30, !31, !32, !33, !34}
!30 = !DIEnumerator(name: "CF_UNKNOWN", value: -1)
!31 = !DIEnumerator(name: "YUV400", value: 0)
!32 = !DIEnumerator(name: "YUV420", value: 1)
!33 = !DIEnumerator(name: "YUV422", value: 2)
!34 = !DIEnumerator(name: "YUV444", value: 3)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 15, baseType: !28, size: 32, elements: !36)
!36 = !{!37, !38, !39, !40}
!37 = !DIEnumerator(name: "CM_UNKNOWN", value: -1)
!38 = !DIEnumerator(name: "CM_YUV", value: 0)
!39 = !DIEnumerator(name: "CM_RGB", value: 1)
!40 = !DIEnumerator(name: "CM_XYZ", value: 2)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !42, line: 25, baseType: !28, size: 32, elements: !43)
!42 = !DIFile(filename: "ldecod_src/inc/io_video.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1141c07f1801ad27d87214c419749431")
!43 = !{!44, !45, !46, !47, !48, !49}
!44 = !DIEnumerator(name: "VIDEO_UNKNOWN", value: -1)
!45 = !DIEnumerator(name: "VIDEO_YUV", value: 0)
!46 = !DIEnumerator(name: "VIDEO_RGB", value: 1)
!47 = !DIEnumerator(name: "VIDEO_XYZ", value: 2)
!48 = !DIEnumerator(name: "VIDEO_TIFF", value: 3)
!49 = !DIEnumerator(name: "VIDEO_AVI", value: 4)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 135, baseType: !52, size: 32, elements: !53)
!51 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!52 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!53 = !{!54, !55, !56}
!54 = !DIEnumerator(name: "FRAME", value: 0)
!55 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!56 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 22, baseType: !52, size: 32, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !64}
!59 = !DIEnumerator(name: "PLANE_Y", value: 0)
!60 = !DIEnumerator(name: "PLANE_U", value: 1)
!61 = !DIEnumerator(name: "PLANE_V", value: 2)
!62 = !DIEnumerator(name: "PLANE_G", value: 0)
!63 = !DIEnumerator(name: "PLANE_B", value: 1)
!64 = !DIEnumerator(name: "PLANE_R", value: 2)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 24, baseType: !52, size: 32, elements: !67)
!66 = !DIFile(filename: "ldecod_src/inc/nalucommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "f9e55677f5f79524218c8a7a94869788")
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83}
!68 = !DIEnumerator(name: "NALU_TYPE_SLICE", value: 1)
!69 = !DIEnumerator(name: "NALU_TYPE_DPA", value: 2)
!70 = !DIEnumerator(name: "NALU_TYPE_DPB", value: 3)
!71 = !DIEnumerator(name: "NALU_TYPE_DPC", value: 4)
!72 = !DIEnumerator(name: "NALU_TYPE_IDR", value: 5)
!73 = !DIEnumerator(name: "NALU_TYPE_SEI", value: 6)
!74 = !DIEnumerator(name: "NALU_TYPE_SPS", value: 7)
!75 = !DIEnumerator(name: "NALU_TYPE_PPS", value: 8)
!76 = !DIEnumerator(name: "NALU_TYPE_AUD", value: 9)
!77 = !DIEnumerator(name: "NALU_TYPE_EOSEQ", value: 10)
!78 = !DIEnumerator(name: "NALU_TYPE_EOSTREAM", value: 11)
!79 = !DIEnumerator(name: "NALU_TYPE_FILL", value: 12)
!80 = !DIEnumerator(name: "NALU_TYPE_PREFIX", value: 14)
!81 = !DIEnumerator(name: "NALU_TYPE_SUB_SPS", value: 15)
!82 = !DIEnumerator(name: "NALU_TYPE_SLC_EXT", value: 20)
!83 = !DIEnumerator(name: "NALU_TYPE_VDRD", value: 24)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 46, baseType: !52, size: 32, elements: !85)
!85 = !{!86, !87, !88, !89}
!86 = !DIEnumerator(name: "NALU_PRIORITY_HIGHEST", value: 3)
!87 = !DIEnumerator(name: "NALU_PRIORITY_HIGH", value: 2)
!88 = !DIEnumerator(name: "NALU_PRIORITY_LOW", value: 1)
!89 = !DIEnumerator(name: "NALU_PRIORITY_DISPOSABLE", value: 0)
!90 = !{!91, !109, !98, !110, !111}
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ANNEXB_t", file: !93, line: 29, baseType: !94)
!93 = !DIFile(filename: "ldecod_src/inc/annexb.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "a6a52094af5c5816464e8295d9d6ede7")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "annex_b_struct", file: !93, line: 17, size: 448, elements: !95)
!95 = !{!96, !97, !102, !103, !104, !105, !106, !107, !108}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "BitStreamFile", scope: !94, file: !93, line: 19, baseType: !28, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "iobuffer", scope: !94, file: !93, line: 20, baseType: !98, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !100, line: 21, baseType: !101)
!100 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!101 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "iobufferread", scope: !94, file: !93, line: 21, baseType: !98, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "bytesinbuffer", scope: !94, file: !93, line: 22, baseType: !28, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "is_eof", scope: !94, file: !93, line: 23, baseType: !28, size: 32, offset: 224)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "iIOBufferSize", scope: !94, file: !93, line: 24, baseType: !28, size: 32, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "IsFirstByteStreamNALU", scope: !94, file: !93, line: 26, baseType: !28, size: 32, offset: 288)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "nextstartcodebytes", scope: !94, file: !93, line: 27, baseType: !28, size: 32, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "Buf", scope: !94, file: !93, line: 28, baseType: !98, size: 64, offset: 384)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "NalRefIdc", file: !66, line: 51, baseType: !84)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "NaluType", file: !66, line: 43, baseType: !65)
!112 = !{!0, !7, !113, !118, !123, !128, !12, !17, !130, !22}
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(scope: null, file: !2, line: 182, type: !115, isLocal: true, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 296, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 37)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(scope: null, file: !2, line: 189, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 560, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 70)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(scope: null, file: !2, line: 208, type: !125, isLocal: true, isDefinition: true)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 888, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 111)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(scope: null, file: !2, line: 266, type: !3, isLocal: true, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression(DW_OP_constu, 524288, DW_OP_stack_value))
!131 = distinct !DIGlobalVariable(name: "IOBUFFERSIZE", scope: !24, file: !2, line: 20, type: !132, isLocal: true, isDefinition: true)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!133 = !{i32 7, !"Dwarf Version", i32 5}
!134 = !{i32 2, !"Debug Info Version", i32 3}
!135 = !{i32 1, !"wchar_size", i32 4}
!136 = !{i32 8, !"PIC Level", i32 2}
!137 = !{i32 7, !"PIE Level", i32 2}
!138 = !{i32 7, !"uwtable", i32 2}
!139 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!140 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!141 = distinct !DISubprogram(name: "malloc_annex_b", scope: !2, file: !2, line: 22, type: !142, scopeLine: 23, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !24, retainedNodes: !1339)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !144}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !146, line: 836, baseType: !147)
!146 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !146, line: 566, size: 6855040, elements: !148)
!148 = !{!149, !234, !287, !391, !393, !395, !453, !455, !456, !457, !458, !459, !462, !482, !494, !495, !496, !497, !498, !499, !1070, !1071, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1081, !1084, !1085, !1087, !1088, !1089, !1090, !1091, !1093, !1094, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1218, !1219, !1221, !1222, !1225, !1228, !1229, !1230, !1234, !1236, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1248, !1251, !1252, !1253, !1254, !1257, !1262, !1266, !1270, !1274, !1275, !1279, !1280, !1284, !1285, !1289, !1310, !1311, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !147, file: !146, line: 568, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !146, line: 850, size: 32128, elements: !152)
!152 = !{!153, !157, !158, !159, !160, !161, !162, !163, !164, !165, !195, !196, !197, !198, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !151, file: !146, line: 852, baseType: !154, size: 2040)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 255)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !151, file: !146, line: 853, baseType: !154, size: 2040, offset: 2040)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !151, file: !146, line: 854, baseType: !154, size: 2040, offset: 4080)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !151, file: !146, line: 856, baseType: !28, size: 32, offset: 6144)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !151, file: !146, line: 857, baseType: !28, size: 32, offset: 6176)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !151, file: !146, line: 858, baseType: !28, size: 32, offset: 6208)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !151, file: !146, line: 859, baseType: !28, size: 32, offset: 6240)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !151, file: !146, line: 860, baseType: !28, size: 32, offset: 6272)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !151, file: !146, line: 861, baseType: !28, size: 32, offset: 6304)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !151, file: !146, line: 864, baseType: !166, size: 1088, offset: 6336)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !27, line: 52, baseType: !167)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !27, line: 30, size: 1088, elements: !168)
!168 = !{!169, !171, !173, !175, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !167, file: !27, line: 32, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !27, line: 28, baseType: !26)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !167, file: !27, line: 33, baseType: !172, size: 32, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !27, line: 20, baseType: !35)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !167, file: !27, line: 34, baseType: !174, size: 64, offset: 64)
!174 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !167, file: !27, line: 35, baseType: !176, size: 96, offset: 128)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 96, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 3)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !167, file: !27, line: 36, baseType: !176, size: 96, offset: 224)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !167, file: !27, line: 37, baseType: !28, size: 32, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !167, file: !27, line: 38, baseType: !28, size: 32, offset: 352)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !167, file: !27, line: 39, baseType: !28, size: 32, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !167, file: !27, line: 40, baseType: !28, size: 32, offset: 416)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !167, file: !27, line: 41, baseType: !28, size: 32, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !167, file: !27, line: 42, baseType: !28, size: 32, offset: 480)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !167, file: !27, line: 43, baseType: !28, size: 32, offset: 512)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !167, file: !27, line: 44, baseType: !28, size: 32, offset: 544)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !167, file: !27, line: 45, baseType: !176, size: 96, offset: 576)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !167, file: !27, line: 46, baseType: !28, size: 32, offset: 672)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !167, file: !27, line: 47, baseType: !176, size: 96, offset: 704)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !167, file: !27, line: 48, baseType: !176, size: 96, offset: 800)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !167, file: !27, line: 49, baseType: !176, size: 96, offset: 896)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !167, file: !27, line: 50, baseType: !28, size: 32, offset: 992)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !167, file: !27, line: 51, baseType: !28, size: 32, offset: 1024)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !151, file: !146, line: 865, baseType: !166, size: 1088, offset: 7424)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !151, file: !146, line: 867, baseType: !28, size: 32, offset: 8512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !151, file: !146, line: 868, baseType: !28, size: 32, offset: 8544)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !151, file: !146, line: 869, baseType: !199, size: 7744, offset: 8576)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !42, line: 60, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !42, line: 34, size: 7744, elements: !201)
!201 = !{!202, !203, !204, !205, !206, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !200, file: !42, line: 37, baseType: !154, size: 2040)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !200, file: !42, line: 38, baseType: !154, size: 2040, offset: 2040)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !200, file: !42, line: 39, baseType: !154, size: 2040, offset: 4080)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !200, file: !42, line: 40, baseType: !28, size: 32, offset: 6144)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !200, file: !42, line: 41, baseType: !207, size: 32, offset: 6176)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !42, line: 32, baseType: !41)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !200, file: !42, line: 42, baseType: !166, size: 1088, offset: 6208)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !200, file: !42, line: 43, baseType: !28, size: 32, offset: 7296)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !200, file: !42, line: 44, baseType: !28, size: 32, offset: 7328)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !200, file: !42, line: 45, baseType: !28, size: 32, offset: 7360)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !200, file: !42, line: 46, baseType: !28, size: 32, offset: 7392)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !200, file: !42, line: 47, baseType: !28, size: 32, offset: 7424)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !200, file: !42, line: 48, baseType: !28, size: 32, offset: 7456)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !200, file: !42, line: 49, baseType: !28, size: 32, offset: 7488)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !200, file: !42, line: 50, baseType: !28, size: 32, offset: 7520)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !200, file: !42, line: 51, baseType: !28, size: 32, offset: 7552)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !200, file: !42, line: 52, baseType: !28, size: 32, offset: 7584)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !200, file: !42, line: 53, baseType: !28, size: 32, offset: 7616)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !200, file: !42, line: 56, baseType: !221, size: 64, offset: 7680)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !151, file: !146, line: 870, baseType: !199, size: 7744, offset: 16320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !151, file: !146, line: 871, baseType: !199, size: 7744, offset: 24064)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !151, file: !146, line: 873, baseType: !28, size: 32, offset: 31808)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !151, file: !146, line: 884, baseType: !28, size: 32, offset: 31840)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !151, file: !146, line: 885, baseType: !28, size: 32, offset: 31872)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !151, file: !146, line: 886, baseType: !28, size: 32, offset: 31904)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !151, file: !146, line: 890, baseType: !28, size: 32, offset: 31936)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !151, file: !146, line: 893, baseType: !28, size: 32, offset: 31968)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !151, file: !146, line: 894, baseType: !28, size: 32, offset: 32000)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !151, file: !146, line: 895, baseType: !28, size: 32, offset: 32032)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !151, file: !146, line: 897, baseType: !28, size: 32, offset: 32064)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !151, file: !146, line: 899, baseType: !28, size: 32, offset: 32096)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !147, file: !146, line: 569, baseType: !235, size: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !237, line: 138, baseType: !238)
!237 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 94, size: 17728, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !250, !255, !259, !262, !263, !264, !265, !266, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !238, file: !237, line: 96, baseType: !28, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !238, file: !237, line: 97, baseType: !52, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !238, file: !237, line: 98, baseType: !52, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !238, file: !237, line: 99, baseType: !28, size: 32, offset: 96)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !238, file: !237, line: 100, baseType: !28, size: 32, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !238, file: !237, line: 102, baseType: !28, size: 32, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !238, file: !237, line: 103, baseType: !247, size: 384, offset: 192)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 384, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 12)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !238, file: !237, line: 104, baseType: !251, size: 3072, offset: 576)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 3072, elements: !252)
!252 = !{!253, !254}
!253 = !DISubrange(count: 6)
!254 = !DISubrange(count: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !238, file: !237, line: 105, baseType: !256, size: 12288, offset: 3648)
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 12288, elements: !257)
!257 = !{!253, !258}
!258 = !DISubrange(count: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !238, file: !237, line: 106, baseType: !260, size: 192, offset: 15936)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 192, elements: !261)
!261 = !{!253}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !238, file: !237, line: 107, baseType: !260, size: 192, offset: 16128)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !238, file: !237, line: 110, baseType: !28, size: 32, offset: 16320)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !238, file: !237, line: 111, baseType: !52, size: 32, offset: 16352)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !238, file: !237, line: 112, baseType: !52, size: 32, offset: 16384)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !238, file: !237, line: 114, baseType: !267, size: 256, offset: 16416)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 256, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !238, file: !237, line: 116, baseType: !267, size: 256, offset: 16672)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !238, file: !237, line: 117, baseType: !267, size: 256, offset: 16928)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !238, file: !237, line: 119, baseType: !28, size: 32, offset: 17184)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !238, file: !237, line: 120, baseType: !52, size: 32, offset: 17216)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !238, file: !237, line: 122, baseType: !52, size: 32, offset: 17248)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !238, file: !237, line: 123, baseType: !98, size: 64, offset: 17280)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !238, file: !237, line: 125, baseType: !28, size: 32, offset: 17344)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !238, file: !237, line: 126, baseType: !28, size: 32, offset: 17376)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !238, file: !237, line: 127, baseType: !28, size: 32, offset: 17408)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !238, file: !237, line: 128, baseType: !52, size: 32, offset: 17440)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !238, file: !237, line: 129, baseType: !28, size: 32, offset: 17472)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !238, file: !237, line: 130, baseType: !28, size: 32, offset: 17504)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !238, file: !237, line: 131, baseType: !28, size: 32, offset: 17536)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !238, file: !237, line: 133, baseType: !28, size: 32, offset: 17568)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !238, file: !237, line: 135, baseType: !28, size: 32, offset: 17600)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !238, file: !237, line: 136, baseType: !28, size: 32, offset: 17632)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !238, file: !237, line: 137, baseType: !28, size: 32, offset: 17664)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !147, file: !146, line: 570, baseType: !288, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !237, line: 197, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 142, size: 33024, elements: !291)
!291 = !{!292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !389, !390}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !290, file: !237, line: 144, baseType: !28, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !290, file: !237, line: 146, baseType: !52, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !290, file: !237, line: 147, baseType: !28, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !290, file: !237, line: 148, baseType: !28, size: 32, offset: 96)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !290, file: !237, line: 149, baseType: !28, size: 32, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !290, file: !237, line: 150, baseType: !28, size: 32, offset: 160)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !290, file: !237, line: 152, baseType: !28, size: 32, offset: 192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !290, file: !237, line: 154, baseType: !52, size: 32, offset: 224)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !290, file: !237, line: 155, baseType: !52, size: 32, offset: 256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !290, file: !237, line: 156, baseType: !52, size: 32, offset: 288)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !290, file: !237, line: 158, baseType: !28, size: 32, offset: 320)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !290, file: !237, line: 159, baseType: !247, size: 384, offset: 352)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !290, file: !237, line: 160, baseType: !251, size: 3072, offset: 736)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !290, file: !237, line: 161, baseType: !256, size: 12288, offset: 3808)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !290, file: !237, line: 162, baseType: !260, size: 192, offset: 16096)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !290, file: !237, line: 163, baseType: !260, size: 192, offset: 16288)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !290, file: !237, line: 165, baseType: !52, size: 32, offset: 16480)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !290, file: !237, line: 166, baseType: !52, size: 32, offset: 16512)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !290, file: !237, line: 167, baseType: !52, size: 32, offset: 16544)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !290, file: !237, line: 168, baseType: !52, size: 32, offset: 16576)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !290, file: !237, line: 170, baseType: !52, size: 32, offset: 16608)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !290, file: !237, line: 172, baseType: !28, size: 32, offset: 16640)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !290, file: !237, line: 173, baseType: !28, size: 32, offset: 16672)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !290, file: !237, line: 174, baseType: !28, size: 32, offset: 16704)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !290, file: !237, line: 175, baseType: !52, size: 32, offset: 16736)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !290, file: !237, line: 177, baseType: !318, size: 8192, offset: 16768)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8192, elements: !319)
!319 = !{!320}
!320 = !DISubrange(count: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !290, file: !237, line: 178, baseType: !52, size: 32, offset: 24960)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !290, file: !237, line: 179, baseType: !28, size: 32, offset: 24992)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !290, file: !237, line: 180, baseType: !52, size: 32, offset: 25024)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !290, file: !237, line: 181, baseType: !52, size: 32, offset: 25056)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !290, file: !237, line: 182, baseType: !28, size: 32, offset: 25088)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !290, file: !237, line: 184, baseType: !28, size: 32, offset: 25120)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !290, file: !237, line: 185, baseType: !28, size: 32, offset: 25152)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !290, file: !237, line: 186, baseType: !28, size: 32, offset: 25184)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !290, file: !237, line: 187, baseType: !52, size: 32, offset: 25216)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !290, file: !237, line: 188, baseType: !52, size: 32, offset: 25248)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !290, file: !237, line: 189, baseType: !52, size: 32, offset: 25280)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !290, file: !237, line: 190, baseType: !52, size: 32, offset: 25312)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !290, file: !237, line: 191, baseType: !28, size: 32, offset: 25344)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !290, file: !237, line: 192, baseType: !335, size: 7584, offset: 25376)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !237, line: 90, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 53, size: 7584, elements: !337)
!337 = !{!338, !339, !340, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !336, file: !237, line: 55, baseType: !28, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !336, file: !237, line: 56, baseType: !52, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !336, file: !237, line: 57, baseType: !341, size: 16, offset: 64)
!341 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !336, file: !237, line: 58, baseType: !341, size: 16, offset: 80)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !336, file: !237, line: 59, baseType: !28, size: 32, offset: 96)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !336, file: !237, line: 60, baseType: !28, size: 32, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !336, file: !237, line: 61, baseType: !28, size: 32, offset: 160)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !336, file: !237, line: 62, baseType: !52, size: 32, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !336, file: !237, line: 63, baseType: !28, size: 32, offset: 224)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !336, file: !237, line: 64, baseType: !28, size: 32, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !336, file: !237, line: 65, baseType: !52, size: 32, offset: 288)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !336, file: !237, line: 66, baseType: !52, size: 32, offset: 320)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !336, file: !237, line: 67, baseType: !52, size: 32, offset: 352)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !336, file: !237, line: 68, baseType: !28, size: 32, offset: 384)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !336, file: !237, line: 69, baseType: !52, size: 32, offset: 416)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !336, file: !237, line: 70, baseType: !52, size: 32, offset: 448)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !336, file: !237, line: 71, baseType: !28, size: 32, offset: 480)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !336, file: !237, line: 72, baseType: !52, size: 32, offset: 512)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !336, file: !237, line: 73, baseType: !52, size: 32, offset: 544)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !336, file: !237, line: 74, baseType: !28, size: 32, offset: 576)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !336, file: !237, line: 75, baseType: !28, size: 32, offset: 608)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !336, file: !237, line: 76, baseType: !361, size: 3296, offset: 640)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !237, line: 50, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 38, size: 3296, elements: !363)
!363 = !{!364, !365, !366, !367, !371, !372, !373, !374, !375, !376}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !362, file: !237, line: 40, baseType: !52, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !362, file: !237, line: 41, baseType: !52, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !362, file: !237, line: 42, baseType: !52, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !362, file: !237, line: 43, baseType: !368, size: 1024, offset: 96)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 1024, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !362, file: !237, line: 44, baseType: !368, size: 1024, offset: 1120)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !362, file: !237, line: 45, baseType: !368, size: 1024, offset: 2144)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !362, file: !237, line: 46, baseType: !52, size: 32, offset: 3168)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !362, file: !237, line: 47, baseType: !52, size: 32, offset: 3200)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !362, file: !237, line: 48, baseType: !52, size: 32, offset: 3232)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !362, file: !237, line: 49, baseType: !52, size: 32, offset: 3264)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !336, file: !237, line: 77, baseType: !28, size: 32, offset: 3936)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !336, file: !237, line: 78, baseType: !361, size: 3296, offset: 3968)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !336, file: !237, line: 80, baseType: !28, size: 32, offset: 7264)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !336, file: !237, line: 81, baseType: !28, size: 32, offset: 7296)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !336, file: !237, line: 82, baseType: !28, size: 32, offset: 7328)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !336, file: !237, line: 83, baseType: !28, size: 32, offset: 7360)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !336, file: !237, line: 84, baseType: !52, size: 32, offset: 7392)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !336, file: !237, line: 85, baseType: !52, size: 32, offset: 7424)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !336, file: !237, line: 86, baseType: !52, size: 32, offset: 7456)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !336, file: !237, line: 87, baseType: !52, size: 32, offset: 7488)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !336, file: !237, line: 88, baseType: !52, size: 32, offset: 7520)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !336, file: !237, line: 89, baseType: !52, size: 32, offset: 7552)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !290, file: !237, line: 193, baseType: !52, size: 32, offset: 32960)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !290, file: !237, line: 195, baseType: !28, size: 32, offset: 32992)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !147, file: !146, line: 571, baseType: !392, size: 1056768, offset: 192)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 1056768, elements: !369)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !147, file: !146, line: 572, baseType: !394, size: 4538368, offset: 1056960)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 4538368, elements: !319)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !147, file: !146, line: 575, baseType: !396, size: 64, offset: 5595328)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !237, line: 256, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 228, size: 37312, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !420, !421, !422, !423}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !398, file: !237, line: 230, baseType: !289, size: 33024)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !398, file: !237, line: 232, baseType: !52, size: 32, offset: 33024)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !398, file: !237, line: 233, baseType: !28, size: 32, offset: 33056)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !398, file: !237, line: 234, baseType: !221, size: 64, offset: 33088)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !398, file: !237, line: 235, baseType: !221, size: 64, offset: 33152)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !398, file: !237, line: 236, baseType: !406, size: 64, offset: 33216)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !398, file: !237, line: 237, baseType: !221, size: 64, offset: 33280)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !398, file: !237, line: 238, baseType: !406, size: 64, offset: 33344)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !398, file: !237, line: 240, baseType: !221, size: 64, offset: 33408)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !398, file: !237, line: 241, baseType: !406, size: 64, offset: 33472)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !398, file: !237, line: 242, baseType: !221, size: 64, offset: 33536)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !398, file: !237, line: 243, baseType: !406, size: 64, offset: 33600)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !398, file: !237, line: 245, baseType: !28, size: 32, offset: 33664)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !398, file: !237, line: 246, baseType: !221, size: 64, offset: 33728)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !398, file: !237, line: 247, baseType: !221, size: 64, offset: 33792)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !398, file: !237, line: 248, baseType: !406, size: 64, offset: 33856)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !398, file: !237, line: 249, baseType: !406, size: 64, offset: 33920)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !398, file: !237, line: 250, baseType: !419, size: 64, offset: 33984)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !398, file: !237, line: 251, baseType: !406, size: 64, offset: 34048)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !398, file: !237, line: 253, baseType: !52, size: 32, offset: 34112)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !398, file: !237, line: 254, baseType: !28, size: 32, offset: 34144)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !398, file: !237, line: 255, baseType: !424, size: 3136, offset: 34176)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !237, line: 226, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !237, line: 200, size: 3136, elements: !426)
!426 = !{!427, !428, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !446, !447, !449, !450, !451, !452}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !425, file: !237, line: 202, baseType: !28, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !425, file: !237, line: 203, baseType: !429, size: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !425, file: !237, line: 204, baseType: !221, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !425, file: !237, line: 205, baseType: !406, size: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !425, file: !237, line: 206, baseType: !429, size: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !425, file: !237, line: 207, baseType: !221, size: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !425, file: !237, line: 208, baseType: !221, size: 64, offset: 384)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !425, file: !237, line: 209, baseType: !429, size: 64, offset: 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !425, file: !237, line: 210, baseType: !429, size: 64, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !425, file: !237, line: 211, baseType: !429, size: 64, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !425, file: !237, line: 212, baseType: !429, size: 64, offset: 640)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !425, file: !237, line: 213, baseType: !429, size: 64, offset: 704)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !425, file: !237, line: 216, baseType: !430, size: 8, offset: 768)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !425, file: !237, line: 217, baseType: !430, size: 8, offset: 776)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !425, file: !237, line: 218, baseType: !430, size: 8, offset: 784)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !425, file: !237, line: 219, baseType: !445, size: 1024, offset: 800)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 1024, elements: !369)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !425, file: !237, line: 220, baseType: !445, size: 1024, offset: 1824)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !425, file: !237, line: 221, baseType: !448, size: 256, offset: 2848)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 256, elements: !369)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !425, file: !237, line: 222, baseType: !430, size: 8, offset: 3104)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !425, file: !237, line: 223, baseType: !430, size: 8, offset: 3112)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !425, file: !237, line: 224, baseType: !430, size: 8, offset: 3120)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !425, file: !237, line: 225, baseType: !430, size: 8, offset: 3128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !147, file: !146, line: 577, baseType: !454, size: 1193984, offset: 5595392)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 1193984, elements: !369)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !147, file: !146, line: 578, baseType: !28, size: 32, offset: 6789376)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !147, file: !146, line: 579, baseType: !28, size: 32, offset: 6789408)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !147, file: !146, line: 580, baseType: !28, size: 32, offset: 6789440)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !147, file: !146, line: 581, baseType: !28, size: 32, offset: 6789472)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !147, file: !146, line: 584, baseType: !460, size: 64, offset: 6789504)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !146, line: 584, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !147, file: !146, line: 586, baseType: !463, size: 64, offset: 6789568)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !146, line: 902, size: 416, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !475, !476, !477, !478, !479, !480, !481}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !464, file: !146, line: 904, baseType: !52, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !464, file: !146, line: 905, baseType: !52, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !464, file: !146, line: 906, baseType: !28, size: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !464, file: !146, line: 907, baseType: !52, size: 32, offset: 96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !464, file: !146, line: 908, baseType: !28, size: 32, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !464, file: !146, line: 909, baseType: !472, size: 64, offset: 160)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 2)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !464, file: !146, line: 910, baseType: !99, size: 8, offset: 224)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !464, file: !146, line: 911, baseType: !99, size: 8, offset: 232)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !464, file: !146, line: 912, baseType: !28, size: 32, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !464, file: !146, line: 913, baseType: !28, size: 32, offset: 288)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !464, file: !146, line: 915, baseType: !28, size: 32, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !464, file: !146, line: 916, baseType: !28, size: 32, offset: 352)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !464, file: !146, line: 917, baseType: !28, size: 32, offset: 384)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !147, file: !146, line: 587, baseType: !483, size: 64, offset: 6789632)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !146, line: 839, size: 512, elements: !485)
!485 = !{!486, !487, !490, !491, !492, !493}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !484, file: !146, line: 841, baseType: !28, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !484, file: !146, line: 842, baseType: !488, size: 96, offset: 32)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 96, elements: !177)
!489 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !484, file: !146, line: 843, baseType: !488, size: 96, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !484, file: !146, line: 844, baseType: !488, size: 96, offset: 224)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !484, file: !146, line: 845, baseType: !488, size: 96, offset: 320)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !484, file: !146, line: 846, baseType: !488, size: 96, offset: 416)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !147, file: !146, line: 588, baseType: !28, size: 32, offset: 6789696)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !147, file: !146, line: 591, baseType: !52, size: 32, offset: 6789728)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !147, file: !146, line: 592, baseType: !28, size: 32, offset: 6789760)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !147, file: !146, line: 593, baseType: !28, size: 32, offset: 6789792)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !147, file: !146, line: 594, baseType: !28, size: 32, offset: 6789824)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !147, file: !146, line: 595, baseType: !500, size: 64, offset: 6789888)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !146, line: 542, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !146, line: 341, size: 109184, elements: !504)
!504 = !{!505, !507, !508, !509, !510, !511, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !733, !735, !898, !927, !954, !957, !958, !960, !961, !962, !963, !964, !965, !966, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !993, !994, !995, !996, !997, !998, !1001, !1002, !1005, !1006, !1008, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1021, !1022, !1023, !1024, !1025, !1028, !1029, !1030, !1034, !1038, !1042, !1046, !1050, !1051, !1052, !1053, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1067, !1068}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !503, file: !146, line: 343, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !503, file: !146, line: 344, baseType: !150, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !503, file: !146, line: 345, baseType: !235, size: 64, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !503, file: !146, line: 346, baseType: !288, size: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "svc_extension_flag", scope: !503, file: !146, line: 347, baseType: !28, size: 32, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !503, file: !146, line: 350, baseType: !512, size: 64, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !514, line: 186, size: 33408, elements: !515)
!514 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!515 = !{!516, !517, !520, !667, !668, !669, !670, !671, !672, !673, !674, !675, !679, !680, !681}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !513, file: !514, line: 188, baseType: !144, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !513, file: !514, line: 189, baseType: !518, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !146, line: 900, baseType: !151)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !513, file: !514, line: 190, baseType: !521, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !514, line: 182, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !514, line: 152, size: 768, elements: !525)
!525 = !{!526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !662, !663, !664, !665, !666}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !524, file: !514, line: 154, baseType: !28, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !524, file: !514, line: 155, baseType: !28, size: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !524, file: !514, line: 156, baseType: !28, size: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !524, file: !514, line: 157, baseType: !28, size: 32, offset: 96)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !524, file: !514, line: 159, baseType: !28, size: 32, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !524, file: !514, line: 161, baseType: !52, size: 32, offset: 160)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !524, file: !514, line: 162, baseType: !52, size: 32, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !524, file: !514, line: 164, baseType: !28, size: 32, offset: 224)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !524, file: !514, line: 165, baseType: !28, size: 32, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !524, file: !514, line: 166, baseType: !28, size: 32, offset: 288)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !524, file: !514, line: 167, baseType: !28, size: 32, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !524, file: !514, line: 170, baseType: !28, size: 32, offset: 352)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !524, file: !514, line: 172, baseType: !539, size: 64, offset: 384)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !514, line: 138, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !514, line: 46, size: 3328, elements: !542)
!542 = !{!543, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !582, !584, !585, !602, !604, !608, !610, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !541, file: !514, line: 48, baseType: !544, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !51, line: 140, baseType: !50)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !541, file: !514, line: 50, baseType: !28, size: 32, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !541, file: !514, line: 51, baseType: !28, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !541, file: !514, line: 52, baseType: !28, size: 32, offset: 96)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !541, file: !514, line: 53, baseType: !28, size: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !541, file: !514, line: 54, baseType: !52, size: 32, offset: 160)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !541, file: !514, line: 55, baseType: !52, size: 32, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !541, file: !514, line: 57, baseType: !28, size: 32, offset: 224)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !541, file: !514, line: 58, baseType: !28, size: 32, offset: 256)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !541, file: !514, line: 59, baseType: !28, size: 32, offset: 288)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !541, file: !514, line: 61, baseType: !99, size: 8, offset: 320)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !541, file: !514, line: 62, baseType: !28, size: 32, offset: 352)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !541, file: !514, line: 63, baseType: !28, size: 32, offset: 384)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !541, file: !514, line: 64, baseType: !28, size: 32, offset: 416)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !541, file: !514, line: 65, baseType: !28, size: 32, offset: 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !541, file: !514, line: 67, baseType: !560, size: 16, offset: 480)
!560 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !541, file: !514, line: 69, baseType: !28, size: 32, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !541, file: !514, line: 69, baseType: !28, size: 32, offset: 544)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !541, file: !514, line: 69, baseType: !28, size: 32, offset: 576)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !541, file: !514, line: 69, baseType: !28, size: 32, offset: 608)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !541, file: !514, line: 70, baseType: !28, size: 32, offset: 640)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !541, file: !514, line: 70, baseType: !28, size: 32, offset: 672)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !541, file: !514, line: 70, baseType: !28, size: 32, offset: 704)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !541, file: !514, line: 70, baseType: !28, size: 32, offset: 736)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !541, file: !514, line: 71, baseType: !28, size: 32, offset: 768)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !541, file: !514, line: 72, baseType: !28, size: 32, offset: 800)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !541, file: !514, line: 73, baseType: !52, size: 32, offset: 832)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !541, file: !514, line: 74, baseType: !52, size: 32, offset: 864)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !541, file: !514, line: 75, baseType: !28, size: 32, offset: 896)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !541, file: !514, line: 75, baseType: !28, size: 32, offset: 928)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !541, file: !514, line: 76, baseType: !28, size: 32, offset: 960)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !541, file: !514, line: 76, baseType: !28, size: 32, offset: 992)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !541, file: !514, line: 79, baseType: !578, size: 64, offset: 1024)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !100, line: 41, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !100, line: 23, baseType: !341)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !541, file: !514, line: 80, baseType: !583, size: 64, offset: 1088)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !541, file: !514, line: 81, baseType: !583, size: 64, offset: 1152)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !541, file: !514, line: 84, baseType: !586, size: 64, offset: 1216)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !514, line: 36, size: 256, elements: !589)
!589 = !{!590, !593, !600}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !588, file: !514, line: 38, baseType: !591, size: 128)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 128, elements: !473)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !588, file: !514, line: 39, baseType: !594, size: 64, offset: 128)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 64, elements: !473)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !146, line: 104, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 100, size: 32, elements: !597)
!597 = !{!598, !599}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !596, file: !146, line: 102, baseType: !560, size: 16)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !596, file: !146, line: 103, baseType: !560, size: 16, offset: 16)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !588, file: !514, line: 40, baseType: !601, size: 16, offset: 192)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 16, elements: !473)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !541, file: !514, line: 85, baseType: !603, size: 192, offset: 1280)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 192, elements: !177)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !541, file: !514, line: 87, baseType: !605, size: 64, offset: 1472)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !514, line: 29, size: 64, elements: !606)
!606 = !{!607}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !605, file: !514, line: 31, baseType: !98, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !541, file: !514, line: 88, baseType: !609, size: 192, offset: 1536)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 192, elements: !177)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !541, file: !514, line: 90, baseType: !611, size: 64, offset: 1728)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !541, file: !514, line: 92, baseType: !592, size: 64, offset: 1792)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !541, file: !514, line: 93, baseType: !592, size: 64, offset: 1856)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !541, file: !514, line: 94, baseType: !592, size: 64, offset: 1920)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !541, file: !514, line: 96, baseType: !28, size: 32, offset: 1984)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !541, file: !514, line: 97, baseType: !28, size: 32, offset: 2016)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !541, file: !514, line: 98, baseType: !28, size: 32, offset: 2048)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !541, file: !514, line: 99, baseType: !28, size: 32, offset: 2080)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !541, file: !514, line: 100, baseType: !28, size: 32, offset: 2112)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !541, file: !514, line: 102, baseType: !28, size: 32, offset: 2144)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !541, file: !514, line: 103, baseType: !28, size: 32, offset: 2176)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !541, file: !514, line: 104, baseType: !28, size: 32, offset: 2208)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !541, file: !514, line: 105, baseType: !28, size: 32, offset: 2240)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !541, file: !514, line: 106, baseType: !28, size: 32, offset: 2272)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !541, file: !514, line: 107, baseType: !28, size: 32, offset: 2304)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !541, file: !514, line: 108, baseType: !28, size: 32, offset: 2336)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !541, file: !514, line: 109, baseType: !28, size: 32, offset: 2368)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !541, file: !514, line: 110, baseType: !472, size: 64, offset: 2400)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !541, file: !514, line: 111, baseType: !28, size: 32, offset: 2464)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !541, file: !514, line: 112, baseType: !632, size: 64, offset: 2496)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !146, line: 194, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !146, line: 186, size: 256, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !634, file: !146, line: 188, baseType: !28, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !634, file: !146, line: 189, baseType: !28, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !634, file: !146, line: 190, baseType: !28, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !634, file: !146, line: 191, baseType: !28, size: 32, offset: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !634, file: !146, line: 192, baseType: !28, size: 32, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !634, file: !146, line: 193, baseType: !642, size: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !541, file: !514, line: 115, baseType: !28, size: 32, offset: 2560)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !541, file: !514, line: 118, baseType: !28, size: 32, offset: 2592)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !541, file: !514, line: 119, baseType: !28, size: 32, offset: 2624)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !541, file: !514, line: 120, baseType: !28, size: 32, offset: 2656)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !541, file: !514, line: 121, baseType: !579, size: 64, offset: 2688)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !541, file: !514, line: 124, baseType: !28, size: 32, offset: 2752)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !541, file: !514, line: 125, baseType: !28, size: 32, offset: 2784)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !541, file: !514, line: 126, baseType: !28, size: 32, offset: 2816)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !541, file: !514, line: 128, baseType: !28, size: 32, offset: 2848)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !541, file: !514, line: 129, baseType: !28, size: 32, offset: 2880)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !541, file: !514, line: 130, baseType: !28, size: 32, offset: 2912)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !541, file: !514, line: 131, baseType: !28, size: 32, offset: 2944)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !541, file: !514, line: 132, baseType: !578, size: 64, offset: 3008)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !541, file: !514, line: 133, baseType: !28, size: 32, offset: 3072)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !541, file: !514, line: 134, baseType: !28, size: 32, offset: 3104)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !541, file: !514, line: 136, baseType: !601, size: 16, offset: 3136)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !541, file: !514, line: 137, baseType: !660, size: 128, offset: 3200)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 128, elements: !473)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !524, file: !514, line: 173, baseType: !539, size: 64, offset: 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !524, file: !514, line: 174, baseType: !539, size: 64, offset: 512)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !524, file: !514, line: 177, baseType: !28, size: 32, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !524, file: !514, line: 178, baseType: !472, size: 64, offset: 608)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !524, file: !514, line: 179, baseType: !472, size: 64, offset: 672)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ref", scope: !513, file: !514, line: 191, baseType: !521, size: 64, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ltref", scope: !513, file: !514, line: 192, baseType: !521, size: 64, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !513, file: !514, line: 193, baseType: !52, size: 32, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !513, file: !514, line: 194, baseType: !52, size: 32, offset: 352)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frames_in_buffer", scope: !513, file: !514, line: 195, baseType: !52, size: 32, offset: 384)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ltref_frames_in_buffer", scope: !513, file: !514, line: 196, baseType: !52, size: 32, offset: 416)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_poc", scope: !513, file: !514, line: 197, baseType: !28, size: 32, offset: 448)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_view_id", scope: !513, file: !514, line: 199, baseType: !28, size: 32, offset: 480)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_pic_idx", scope: !513, file: !514, line: 200, baseType: !676, size: 32768, offset: 512)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32768, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 1024)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "init_done", scope: !513, file: !514, line: 205, baseType: !28, size: 32, offset: 33280)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !513, file: !514, line: 206, baseType: !28, size: 32, offset: 33312)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "last_picture", scope: !513, file: !514, line: 208, baseType: !522, size: 64, offset: 33344)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !503, file: !146, line: 353, baseType: !28, size: 32, offset: 384)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !503, file: !146, line: 354, baseType: !28, size: 32, offset: 416)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !503, file: !146, line: 355, baseType: !28, size: 32, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "Transform8x8Mode", scope: !503, file: !146, line: 356, baseType: !28, size: 32, offset: 480)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "is_not_independent", scope: !503, file: !146, line: 357, baseType: !28, size: 32, offset: 512)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "toppoc", scope: !503, file: !146, line: 359, baseType: !28, size: 32, offset: 544)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "bottompoc", scope: !503, file: !146, line: 360, baseType: !28, size: 32, offset: 576)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "framepoc", scope: !503, file: !146, line: 361, baseType: !28, size: 32, offset: 608)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !503, file: !146, line: 365, baseType: !52, size: 32, offset: 640)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !503, file: !146, line: 366, baseType: !28, size: 32, offset: 672)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !503, file: !146, line: 368, baseType: !472, size: 64, offset: 704)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntMsb", scope: !503, file: !146, line: 372, baseType: !28, size: 32, offset: 768)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "AbsFrameNum", scope: !503, file: !146, line: 378, baseType: !52, size: 32, offset: 800)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !503, file: !146, line: 379, baseType: !28, size: 32, offset: 832)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "current_mb_nr", scope: !503, file: !146, line: 387, baseType: !52, size: 32, offset: 864)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !503, file: !146, line: 388, baseType: !52, size: 32, offset: 896)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "current_slice_nr", scope: !503, file: !146, line: 389, baseType: !560, size: 16, offset: 928)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "cod_counter", scope: !503, file: !146, line: 396, baseType: !28, size: 32, offset: 960)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "allrefzero", scope: !503, file: !146, line: 397, baseType: !28, size: 32, offset: 992)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !503, file: !146, line: 400, baseType: !28, size: 32, offset: 1024)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !503, file: !146, line: 401, baseType: !28, size: 32, offset: 1056)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_active", scope: !503, file: !146, line: 402, baseType: !472, size: 64, offset: 1088)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !503, file: !146, line: 406, baseType: !28, size: 32, offset: 1152)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !503, file: !146, line: 407, baseType: !28, size: 32, offset: 1184)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !503, file: !146, line: 408, baseType: !28, size: 32, offset: 1216)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "qs", scope: !503, file: !146, line: 409, baseType: !28, size: 32, offset: 1248)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qs_delta", scope: !503, file: !146, line: 410, baseType: !28, size: 32, offset: 1280)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !503, file: !146, line: 411, baseType: !28, size: 32, offset: 1312)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "model_number", scope: !503, file: !146, line: 412, baseType: !28, size: 32, offset: 1344)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !503, file: !146, line: 413, baseType: !52, size: 32, offset: 1376)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !503, file: !146, line: 414, baseType: !52, size: 32, offset: 1408)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !503, file: !146, line: 415, baseType: !99, size: 8, offset: 1440)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !503, file: !146, line: 416, baseType: !544, size: 32, offset: 1472)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !503, file: !146, line: 417, baseType: !28, size: 32, offset: 1504)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "end_mb_nr_plus1", scope: !503, file: !146, line: 418, baseType: !28, size: 32, offset: 1536)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !503, file: !146, line: 419, baseType: !28, size: 32, offset: 1568)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dp_mode", scope: !503, file: !146, line: 420, baseType: !28, size: 32, offset: 1600)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "current_header", scope: !503, file: !146, line: 421, baseType: !28, size: 32, offset: 1632)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "next_header", scope: !503, file: !146, line: 422, baseType: !28, size: 32, offset: 1664)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "last_dquant", scope: !503, file: !146, line: 423, baseType: !28, size: 32, offset: 1696)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "colour_plane_id", scope: !503, file: !146, line: 426, baseType: !28, size: 32, offset: 1728)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !503, file: !146, line: 427, baseType: !28, size: 32, offset: 1760)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "sp_switch", scope: !503, file: !146, line: 428, baseType: !28, size: 32, offset: 1792)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !503, file: !146, line: 429, baseType: !28, size: 32, offset: 1824)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_slice_ref_idx", scope: !503, file: !146, line: 430, baseType: !28, size: 32, offset: 1856)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !503, file: !146, line: 431, baseType: !28, size: 32, offset: 1888)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !503, file: !146, line: 432, baseType: !28, size: 32, offset: 1920)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !503, file: !146, line: 433, baseType: !28, size: 32, offset: 1952)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !503, file: !146, line: 434, baseType: !632, size: 64, offset: 1984)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !503, file: !146, line: 436, baseType: !732, size: 48, offset: 2048)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 48, elements: !261)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !503, file: !146, line: 437, baseType: !734, size: 384, offset: 2112)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 384, elements: !261)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !503, file: !146, line: 440, baseType: !736, size: 64, offset: 2496)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !146, line: 324, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !146, line: 314, size: 384, elements: !739)
!739 = !{!740, !751, !760}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !738, file: !146, line: 317, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !146, line: 47, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream", file: !146, line: 300, size: 256, elements: !744)
!744 = !{!745, !746, !747, !748, !749, !750}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "read_len", scope: !743, file: !146, line: 303, baseType: !28, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !743, file: !146, line: 304, baseType: !28, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bitoffset", scope: !743, file: !146, line: 306, baseType: !28, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_length", scope: !743, file: !146, line: 307, baseType: !28, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !743, file: !146, line: 309, baseType: !98, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !743, file: !146, line: 310, baseType: !28, size: 32, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "de_cabac", scope: !738, file: !146, line: 318, baseType: !752, size: 256, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !146, line: 95, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 88, size: 256, elements: !754)
!754 = !{!755, !756, !757, !758, !759}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !753, file: !146, line: 90, baseType: !52, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !753, file: !146, line: 91, baseType: !52, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !753, file: !146, line: 92, baseType: !28, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !753, file: !146, line: 93, baseType: !98, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !753, file: !146, line: 94, baseType: !221, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "readSyntaxElement", scope: !738, file: !146, line: 320, baseType: !761, size: 64, offset: 320)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!28, !764, !896, !894}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !146, line: 273, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !146, line: 197, size: 3840, elements: !767)
!767 = !{!768, !770, !771, !772, !773, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !802, !803, !804, !805, !806, !810, !811, !820, !821, !822, !823, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !849, !850, !865, !871, !895}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !766, file: !146, line: 199, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !766, file: !146, line: 200, baseType: !506, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !766, file: !146, line: 201, baseType: !150, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrX", scope: !766, file: !146, line: 202, baseType: !28, size: 32, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !766, file: !146, line: 203, baseType: !774, size: 32, offset: 224)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockPos", file: !146, line: 112, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 108, size: 32, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !775, file: !146, line: 110, baseType: !560, size: 16)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !775, file: !146, line: 111, baseType: !560, size: 16, offset: 16)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !766, file: !146, line: 204, baseType: !28, size: 32, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !766, file: !146, line: 205, baseType: !28, size: 32, offset: 288)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "block_y_aff", scope: !766, file: !146, line: 206, baseType: !28, size: 32, offset: 320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !766, file: !146, line: 207, baseType: !28, size: 32, offset: 352)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !766, file: !146, line: 208, baseType: !28, size: 32, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !766, file: !146, line: 209, baseType: !28, size: 32, offset: 416)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !766, file: !146, line: 210, baseType: !28, size: 32, offset: 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !766, file: !146, line: 212, baseType: !28, size: 32, offset: 480)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !766, file: !146, line: 213, baseType: !28, size: 32, offset: 512)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !766, file: !146, line: 215, baseType: !28, size: 32, offset: 544)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "qpc", scope: !766, file: !146, line: 216, baseType: !472, size: 64, offset: 576)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "qp_scaled", scope: !766, file: !146, line: 217, baseType: !176, size: 96, offset: 640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "is_lossless", scope: !766, file: !146, line: 218, baseType: !28, size: 32, offset: 736)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !766, file: !146, line: 219, baseType: !28, size: 32, offset: 768)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !766, file: !146, line: 220, baseType: !28, size: 32, offset: 800)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !766, file: !146, line: 221, baseType: !28, size: 32, offset: 832)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !766, file: !146, line: 223, baseType: !560, size: 16, offset: 864)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !766, file: !146, line: 224, baseType: !430, size: 8, offset: 880)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "dpl_flag", scope: !766, file: !146, line: 225, baseType: !430, size: 8, offset: 888)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "delta_quant", scope: !766, file: !146, line: 226, baseType: !560, size: 16, offset: 896)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "list_offset", scope: !766, file: !146, line: 227, baseType: !560, size: 16, offset: 912)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mb_up", scope: !766, file: !146, line: 229, baseType: !801, size: 64, offset: 960)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "mb_left", scope: !766, file: !146, line: 230, baseType: !801, size: 64, offset: 1024)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "mbup", scope: !766, file: !146, line: 232, baseType: !801, size: 64, offset: 1088)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mbleft", scope: !766, file: !146, line: 233, baseType: !801, size: 64, offset: 1152)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !766, file: !146, line: 236, baseType: !560, size: 16, offset: 1216)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !766, file: !146, line: 237, baseType: !807, size: 1024, offset: 1232)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 1024, elements: !808)
!808 = !{!474, !809, !809, !474}
!809 = !DISubrange(count: 4)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !766, file: !146, line: 239, baseType: !28, size: 32, offset: 2272)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !766, file: !146, line: 240, baseType: !812, size: 192, offset: 2304)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 192, elements: !177)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !814, line: 103, baseType: !815)
!814 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !816, line: 27, baseType: !817)
!816 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !818, line: 44, baseType: !819)
!818 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!819 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !766, file: !146, line: 241, baseType: !812, size: 192, offset: 2496)
