; ModuleID = 'ldecod_src/cabac.c'
source_filename = "ldecod_src/cabac.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.pix_pos = type { i32, i32, i16, i16, i16, i16 }
%struct.macroblock = type { ptr, ptr, ptr, i32, %struct.BlockPos, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], [3 x i32], i32, i32, i32, i32, i16, i8, i8, i16, i16, ptr, ptr, ptr, ptr, i16, [2 x [4 x [4 x [2 x i16]]]], i32, [3 x i64], [3 x i64], [3 x i64], i32, [4 x i8], [4 x i8], i8, i8, i8, i16, i16, i16, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, i8 }
%struct.BlockPos = type { i16, i16 }
%struct.BiContextType = type { i16, i8, i8 }
%struct.pic_motion_params = type { [2 x ptr], [2 x %struct.MotionVector], [2 x i8] }
%struct.MotionVector = type { i16, i16 }

@.str = private unnamed_addr constant [37 x i8] c"create_contexts_MotionInfo: deco_ctx\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [38 x i8] c"create_contexts_TextureInfo: deco_ctx\00", align 1, !dbg !7

!32 = !DIFile(filename: "ldecod_src/inc/io_video.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1141c07f1801ad27d87214c419749431")
!33 = !{!34, !35, !36, !37, !38, !39}
!34 = !DIEnumerator(name: "VIDEO_UNKNOWN", value: -1)
!35 = !DIEnumerator(name: "VIDEO_YUV", value: 0)
!36 = !DIEnumerator(name: "VIDEO_RGB", value: 1)
!37 = !DIEnumerator(name: "VIDEO_XYZ", value: 2)
!38 = !DIEnumerator(name: "VIDEO_TIFF", value: 3)
!39 = !DIEnumerator(name: "VIDEO_AVI", value: 4)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 135, baseType: !42, size: 32, elements: !43)
!41 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!42 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!43 = !{!44, !45, !46}
!44 = !DIEnumerator(name: "FRAME", value: 0)
!45 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!46 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 22, baseType: !42, size: 32, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54}
!49 = !DIEnumerator(name: "PLANE_Y", value: 0)
!50 = !DIEnumerator(name: "PLANE_U", value: 1)
!51 = !DIEnumerator(name: "PLANE_V", value: 2)
!52 = !DIEnumerator(name: "PLANE_G", value: 0)
!53 = !DIEnumerator(name: "PLANE_B", value: 1)
!54 = !DIEnumerator(name: "PLANE_R", value: 2)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 166, baseType: !42, size: 32, elements: !56)
!56 = !{!57, !58}
!57 = !DIEnumerator(name: "IS_LUMA", value: 0)
!58 = !DIEnumerator(name: "IS_CHROMA", value: 1)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 142, baseType: !42, size: 32, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !66}
!61 = !DIEnumerator(name: "P_SLICE", value: 0)
!62 = !DIEnumerator(name: "B_SLICE", value: 1)
!63 = !DIEnumerator(name: "I_SLICE", value: 2)
!64 = !DIEnumerator(name: "SP_SLICE", value: 3)
!65 = !DIEnumerator(name: "SI_SLICE", value: 4)
!66 = !DIEnumerator(name: "NUM_SLICE_TYPES", value: 5)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 117, baseType: !42, size: 32, elements: !69)
!68 = !DIFile(filename: "ldecod_src/inc/defines.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "f06de374c735b286d10ba4ea0c8c0a5d")
!69 = !{!70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!70 = !DIEnumerator(name: "PSKIP", value: 0)
!71 = !DIEnumerator(name: "BSKIP_DIRECT", value: 0)
!72 = !DIEnumerator(name: "P16x16", value: 1)
!73 = !DIEnumerator(name: "P16x8", value: 2)
!74 = !DIEnumerator(name: "P8x16", value: 3)
!75 = !DIEnumerator(name: "SMB8x8", value: 4)
!76 = !DIEnumerator(name: "SMB8x4", value: 5)
!77 = !DIEnumerator(name: "SMB4x8", value: 6)
!78 = !DIEnumerator(name: "SMB4x4", value: 7)
!79 = !DIEnumerator(name: "P8x8", value: 8)
!80 = !DIEnumerator(name: "I4MB", value: 9)
!81 = !DIEnumerator(name: "I16MB", value: 10)
!82 = !DIEnumerator(name: "IBLOCK", value: 11)
!83 = !DIEnumerator(name: "SI4MB", value: 12)
!84 = !DIEnumerator(name: "I8MB", value: 13)
!85 = !DIEnumerator(name: "IPCM", value: 14)
!86 = !DIEnumerator(name: "MAXMODE", value: 15)
!87 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 160, baseType: !42, size: 32, elements: !88)
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110}
!89 = !DIEnumerator(name: "LUMA_16DC", value: 0)
!90 = !DIEnumerator(name: "LUMA_16AC", value: 1)
!91 = !DIEnumerator(name: "LUMA_8x8", value: 2)
!92 = !DIEnumerator(name: "LUMA_8x4", value: 3)
!93 = !DIEnumerator(name: "LUMA_4x8", value: 4)
!94 = !DIEnumerator(name: "LUMA_4x4", value: 5)
!95 = !DIEnumerator(name: "CHROMA_DC", value: 6)
!96 = !DIEnumerator(name: "CHROMA_AC", value: 7)
!97 = !DIEnumerator(name: "CHROMA_DC_2x4", value: 8)
!98 = !DIEnumerator(name: "CHROMA_DC_4x4", value: 9)
!99 = !DIEnumerator(name: "CB_16DC", value: 10)
!100 = !DIEnumerator(name: "CB_16AC", value: 11)
!101 = !DIEnumerator(name: "CB_8x8", value: 12)
!102 = !DIEnumerator(name: "CB_8x4", value: 13)
!103 = !DIEnumerator(name: "CB_4x8", value: 14)
!104 = !DIEnumerator(name: "CB_4x4", value: 15)
!105 = !DIEnumerator(name: "CR_16DC", value: 16)
!106 = !DIEnumerator(name: "CR_16AC", value: 17)
!107 = !DIEnumerator(name: "CR_8x8", value: 18)
!108 = !DIEnumerator(name: "CR_8x4", value: 19)
!109 = !DIEnumerator(name: "CR_4x8", value: 20)
!110 = !DIEnumerator(name: "CR_4x4", value: 21)
!111 = !{!112, !150, !151, !179, !192, !194, !18, !42}
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !114, line: 153, baseType: !115)
!114 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 145, size: 2912, elements: !116)
!116 = !{!117, !132, !137, !141, !145, !149}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !115, file: !114, line: 147, baseType: !118, size: 1056)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 1056, elements: !129)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !114, line: 122, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 117, size: 32, elements: !121)
!121 = !{!122, !126, !128}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !120, file: !114, line: 119, baseType: !123, size: 16)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !124, line: 23, baseType: !125)
!124 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!125 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !120, file: !114, line: 120, baseType: !127, size: 8, offset: 16)
!127 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !120, file: !114, line: 121, baseType: !127, size: 8, offset: 24)
!129 = !{!130, !131}
!130 = !DISubrange(count: 3)
!131 = !DISubrange(count: 11)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !115, file: !114, line: 148, baseType: !133, size: 576, offset: 1056)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 576, elements: !134)
!134 = !{!135, !136}
!135 = !DISubrange(count: 2)
!136 = !DISubrange(count: 9)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !115, file: !114, line: 149, baseType: !138, size: 640, offset: 1632)
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 640, elements: !139)
!139 = !{!135, !140}
!140 = !DISubrange(count: 10)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !115, file: !114, line: 150, baseType: !142, size: 384, offset: 2272)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 384, elements: !143)
!143 = !{!135, !144}
!144 = !DISubrange(count: 6)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !115, file: !114, line: 151, baseType: !146, size: 128, offset: 2656)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 128, elements: !147)
!147 = !{!148}
!148 = !DISubrange(count: 4)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !115, file: !114, line: 152, baseType: !146, size: 128, offset: 2784)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !114, line: 175, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 164, size: 52768, elements: !154)
!154 = !{!155, !158, !161, !162, !165, !169, !173, !174, !178}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !153, file: !114, line: 166, baseType: !156, size: 96)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 96, elements: !157)
!157 = !{!130}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !153, file: !114, line: 167, baseType: !159, size: 64, offset: 96)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 64, elements: !160)
!160 = !{!135}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !153, file: !114, line: 168, baseType: !146, size: 128, offset: 160)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !153, file: !114, line: 169, baseType: !163, size: 384, offset: 288)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 384, elements: !164)
!164 = !{!130, !148}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !153, file: !114, line: 170, baseType: !166, size: 2816, offset: 672)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 2816, elements: !167)
!167 = !{!168, !148}
!168 = !DISubrange(count: 22)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !153, file: !114, line: 171, baseType: !170, size: 21120, offset: 3488)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 21120, elements: !171)
!171 = !{!135, !168, !172}
!172 = !DISubrange(count: 15)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !153, file: !114, line: 172, baseType: !170, size: 21120, offset: 24608)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !153, file: !114, line: 173, baseType: !175, size: 3520, offset: 45728)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 3520, elements: !176)
!176 = !{!168, !177}
!177 = !DISubrange(count: 5)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !153, file: !114, line: 174, baseType: !175, size: 3520, offset: 49248)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironmentPtr", file: !114, line: 97, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !114, line: 95, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 88, size: 256, elements: !183)
!183 = !{!184, !185, !186, !187, !190}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !182, file: !114, line: 90, baseType: !42, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !182, file: !114, line: 91, baseType: !42, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !182, file: !114, line: 92, baseType: !18, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !182, file: !114, line: 93, baseType: !188, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !124, line: 21, baseType: !127)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !182, file: !114, line: 94, baseType: !191, size: 64, offset: 192)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextTypePtr", file: !114, line: 124, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !195, line: 103, baseType: !196)
!195 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !197, line: 27, baseType: !198)
!197 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !199, line: 44, baseType: !200)
!199 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!200 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!201 = !{!0, !7, !202, !212, !12, !218, !223, !228, !233, !238, !240, !242, !244, !246, !248, !250, !252, !254, !256, !258, !260, !262, !264, !266, !268, !270, !272, !274, !276}
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "INT_BITS", scope: !204, file: !205, line: 118, type: !211, isLocal: true, isDefinition: true)
!204 = distinct !DISubprogram(name: "iabs", scope: !205, file: !205, line: 116, type: !206, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !208)
!205 = !DIFile(filename: "ldecod_src/inc/ifunctions.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "279401589ed56df99e287ad9e5fc564b")
!206 = !DISubroutineType(types: !207)
!207 = !{!18, !18}
!208 = !{!209, !210}
!209 = !DILocalVariable(name: "x", arg: 1, scope: !204, file: !205, line: 116, type: !18)
!210 = !DILocalVariable(name: "y", scope: !204, file: !205, line: 119, type: !18)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "type2ctx_bcbp", scope: !14, file: !2, line: 29, type: !214, isLocal: true, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 352, elements: !217)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!216 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!217 = !{!168}
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "pos2ctx_map_int", scope: !14, file: !2, line: 1897, type: !220, isLocal: true, isDefinition: true)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 1408, elements: !217)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "pos2ctx_map4x4", scope: !14, file: !2, line: 1877, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 128, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 16)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "pos2ctx_map8x8i", scope: !14, file: !2, line: 1889, type: !230, isLocal: true, isDefinition: true)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 512, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 64)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "pos2ctx_map8x4i", scope: !14, file: !2, line: 1893, type: !235, isLocal: true, isDefinition: true)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 256, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 32)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "pos2ctx_map4x8i", scope: !14, file: !2, line: 1895, type: !235, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "pos2ctx_map2x4c", scope: !14, file: !2, line: 1878, type: !225, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "pos2ctx_map4x4c", scope: !14, file: !2, line: 1879, type: !225, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "pos2ctx_map", scope: !14, file: !2, line: 1880, type: !220, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "pos2ctx_map8x8", scope: !14, file: !2, line: 1871, type: !230, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "pos2ctx_map8x4", scope: !14, file: !2, line: 1875, type: !235, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "type2ctx_map", scope: !14, file: !2, line: 30, type: !214, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "type2ctx_last", scope: !14, file: !2, line: 31, type: !214, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "maxpos", scope: !14, file: !2, line: 27, type: !214, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "c1isdc", scope: !14, file: !2, line: 28, type: !214, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "pos2ctx_last", scope: !14, file: !2, line: 1916, type: !220, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "pos2ctx_last4x4", scope: !14, file: !2, line: 1913, type: !225, isLocal: true, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "pos2ctx_last8x8", scope: !14, file: !2, line: 1906, type: !230, isLocal: true, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "pos2ctx_last8x4", scope: !14, file: !2, line: 1910, type: !235, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "pos2ctx_last2x4c", scope: !14, file: !2, line: 1914, type: !225, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "pos2ctx_last4x4c", scope: !14, file: !2, line: 1915, type: !225, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "type2ctx_one", scope: !14, file: !2, line: 32, type: !214, isLocal: true, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "type2ctx_abs", scope: !14, file: !2, line: 33, type: !214, isLocal: true, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "max_c2", scope: !14, file: !2, line: 34, type: !214, isLocal: true, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "assignSE2partition", scope: !14, file: !278, line: 103, type: !279, isLocal: true, isDefinition: true)
!278 = !DIFile(filename: "ldecod_src/inc/elements.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "655df3b60bdcd53a79db33d4ea16f27b")
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !222, size: 320, elements: !280)
!280 = !{!135, !281}
!281 = !DISubrange(count: 20)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 4096, elements: !231)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !195, line: 104, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !286, line: 27, baseType: !287)
!286 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !199, line: 45, baseType: !288)
!288 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!289 = !{i32 7, !"Dwarf Version", i32 5}
!290 = !{i32 2, !"Debug Info Version", i32 3}
!291 = !{i32 1, !"wchar_size", i32 4}
!292 = !{i32 8, !"PIC Level", i32 2}
!293 = !{i32 7, !"PIE Level", i32 2}
!294 = !{i32 7, !"uwtable", i32 2}
!295 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!296 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!297 = distinct !DISubprogram(name: "CheckAvailabilityOfNeighborsCABAC", scope: !2, file: !2, line: 45, type: !298, scopeLine: 46, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !1387)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !114, line: 273, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !114, line: 197, size: 3840, elements: !303)
!303 = !{!304, !1303, !1304, !1305, !1306, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1335, !1336, !1337, !1338, !1339, !1342, !1343, !1345, !1346, !1347, !1348, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1372, !1373, !1378, !1382, !1386}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !302, file: !114, line: 199, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !114, line: 341, size: 109184, elements: !307)
!307 = !{!308, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1146, !1148, !1191, !1192, !1193, !1196, !1197, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1231, !1232, !1233, !1234, !1235, !1236, !1239, !1240, !1243, !1244, !1246, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1258, !1259, !1260, !1261, !1262, !1264, !1265, !1266, !1270, !1272, !1276, !1280, !1284, !1285, !1286, !1287, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !306, file: !114, line: 343, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !114, line: 566, size: 6855040, elements: !311)
!311 = !{!312, !394, !444, !545, !547, !549, !607, !609, !610, !611, !612, !613, !616, !634, !646, !647, !648, !649, !650, !651, !655, !656, !658, !659, !660, !661, !662, !663, !665, !667, !670, !671, !673, !674, !675, !676, !677, !679, !680, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !794, !795, !796, !797, !798, !799, !800, !801, !802, !804, !805, !806, !946, !950, !951, !953, !954, !957, !960, !961, !962, !965, !968, !971, !972, !973, !974, !975, !976, !1002, !1003, !1005, !1008, !1009, !1010, !1011, !1014, !1019, !1033, !1037, !1041, !1042, !1047, !1048, !1052, !1053, !1057, !1078, !1079, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !310, file: !114, line: 568, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !114, line: 850, size: 32128, elements: !315)
!315 = !{!316, !320, !321, !322, !323, !324, !325, !326, !327, !328, !356, !357, !358, !359, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !314, file: !114, line: 852, baseType: !317, size: 2040)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 255)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !314, file: !114, line: 853, baseType: !317, size: 2040, offset: 2040)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !314, file: !114, line: 854, baseType: !317, size: 2040, offset: 4080)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !314, file: !114, line: 856, baseType: !18, size: 32, offset: 6144)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !314, file: !114, line: 857, baseType: !18, size: 32, offset: 6176)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !314, file: !114, line: 858, baseType: !18, size: 32, offset: 6208)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !314, file: !114, line: 859, baseType: !18, size: 32, offset: 6240)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !314, file: !114, line: 860, baseType: !18, size: 32, offset: 6272)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !314, file: !114, line: 861, baseType: !18, size: 32, offset: 6304)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !314, file: !114, line: 864, baseType: !329, size: 1088, offset: 6336)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !17, line: 52, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !17, line: 30, size: 1088, elements: !331)
!331 = !{!332, !334, !336, !338, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !330, file: !17, line: 32, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !17, line: 28, baseType: !16)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !330, file: !17, line: 33, baseType: !335, size: 32, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !17, line: 20, baseType: !25)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !330, file: !17, line: 34, baseType: !337, size: 64, offset: 64)
!337 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !330, file: !17, line: 35, baseType: !339, size: 96, offset: 128)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 96, elements: !157)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !330, file: !17, line: 36, baseType: !339, size: 96, offset: 224)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !330, file: !17, line: 37, baseType: !18, size: 32, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !330, file: !17, line: 38, baseType: !18, size: 32, offset: 352)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !330, file: !17, line: 39, baseType: !18, size: 32, offset: 384)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !330, file: !17, line: 40, baseType: !18, size: 32, offset: 416)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !330, file: !17, line: 41, baseType: !18, size: 32, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !330, file: !17, line: 42, baseType: !18, size: 32, offset: 480)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !330, file: !17, line: 43, baseType: !18, size: 32, offset: 512)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !330, file: !17, line: 44, baseType: !18, size: 32, offset: 544)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !330, file: !17, line: 45, baseType: !339, size: 96, offset: 576)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !330, file: !17, line: 46, baseType: !18, size: 32, offset: 672)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !330, file: !17, line: 47, baseType: !339, size: 96, offset: 704)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !330, file: !17, line: 48, baseType: !339, size: 96, offset: 800)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !330, file: !17, line: 49, baseType: !339, size: 96, offset: 896)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !330, file: !17, line: 50, baseType: !18, size: 32, offset: 992)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !330, file: !17, line: 51, baseType: !18, size: 32, offset: 1024)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !314, file: !114, line: 865, baseType: !329, size: 1088, offset: 7424)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !314, file: !114, line: 867, baseType: !18, size: 32, offset: 8512)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !314, file: !114, line: 868, baseType: !18, size: 32, offset: 8544)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !314, file: !114, line: 869, baseType: !360, size: 7744, offset: 8576)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !32, line: 60, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !32, line: 34, size: 7744, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !361, file: !32, line: 37, baseType: !317, size: 2040)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !361, file: !32, line: 38, baseType: !317, size: 2040, offset: 2040)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !361, file: !32, line: 39, baseType: !317, size: 2040, offset: 4080)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !361, file: !32, line: 40, baseType: !18, size: 32, offset: 6144)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !361, file: !32, line: 41, baseType: !368, size: 32, offset: 6176)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !32, line: 32, baseType: !31)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !361, file: !32, line: 42, baseType: !329, size: 1088, offset: 6208)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !361, file: !32, line: 43, baseType: !18, size: 32, offset: 7296)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !361, file: !32, line: 44, baseType: !18, size: 32, offset: 7328)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !361, file: !32, line: 45, baseType: !18, size: 32, offset: 7360)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !361, file: !32, line: 46, baseType: !18, size: 32, offset: 7392)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !361, file: !32, line: 47, baseType: !18, size: 32, offset: 7424)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !361, file: !32, line: 48, baseType: !18, size: 32, offset: 7456)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !361, file: !32, line: 49, baseType: !18, size: 32, offset: 7488)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !361, file: !32, line: 50, baseType: !18, size: 32, offset: 7520)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !361, file: !32, line: 51, baseType: !18, size: 32, offset: 7552)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !361, file: !32, line: 52, baseType: !18, size: 32, offset: 7584)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !361, file: !32, line: 53, baseType: !18, size: 32, offset: 7616)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !361, file: !32, line: 56, baseType: !191, size: 64, offset: 7680)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !314, file: !114, line: 870, baseType: !360, size: 7744, offset: 16320)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !314, file: !114, line: 871, baseType: !360, size: 7744, offset: 24064)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !314, file: !114, line: 873, baseType: !18, size: 32, offset: 31808)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !314, file: !114, line: 884, baseType: !18, size: 32, offset: 31840)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !314, file: !114, line: 885, baseType: !18, size: 32, offset: 31872)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !314, file: !114, line: 886, baseType: !18, size: 32, offset: 31904)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !314, file: !114, line: 890, baseType: !18, size: 32, offset: 31936)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !314, file: !114, line: 893, baseType: !18, size: 32, offset: 31968)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !314, file: !114, line: 894, baseType: !18, size: 32, offset: 32000)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !314, file: !114, line: 895, baseType: !18, size: 32, offset: 32032)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !314, file: !114, line: 897, baseType: !18, size: 32, offset: 32064)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !314, file: !114, line: 899, baseType: !18, size: 32, offset: 32096)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !310, file: !114, line: 569, baseType: !395, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !397, line: 138, baseType: !398)
!397 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 94, size: 17728, elements: !399)
!399 = !{!400, !401, !402, !403, !404, !405, !406, !410, !413, !416, !419, !420, !421, !422, !423, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !398, file: !397, line: 96, baseType: !18, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !398, file: !397, line: 97, baseType: !42, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !398, file: !397, line: 98, baseType: !42, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !398, file: !397, line: 99, baseType: !18, size: 32, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !398, file: !397, line: 100, baseType: !18, size: 32, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !398, file: !397, line: 102, baseType: !18, size: 32, offset: 160)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !398, file: !397, line: 103, baseType: !407, size: 384, offset: 192)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 384, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 12)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !398, file: !397, line: 104, baseType: !411, size: 3072, offset: 576)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 3072, elements: !412)
!412 = !{!144, !227}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !398, file: !397, line: 105, baseType: !414, size: 12288, offset: 3648)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 12288, elements: !415)
!415 = !{!144, !232}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !398, file: !397, line: 106, baseType: !417, size: 192, offset: 15936)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 192, elements: !418)
!418 = !{!144}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !398, file: !397, line: 107, baseType: !417, size: 192, offset: 16128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !398, file: !397, line: 110, baseType: !18, size: 32, offset: 16320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !398, file: !397, line: 111, baseType: !42, size: 32, offset: 16352)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !398, file: !397, line: 112, baseType: !42, size: 32, offset: 16384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !398, file: !397, line: 114, baseType: !424, size: 256, offset: 16416)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 256, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 8)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !398, file: !397, line: 116, baseType: !424, size: 256, offset: 16672)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !398, file: !397, line: 117, baseType: !424, size: 256, offset: 16928)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !398, file: !397, line: 119, baseType: !18, size: 32, offset: 17184)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !398, file: !397, line: 120, baseType: !42, size: 32, offset: 17216)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !398, file: !397, line: 122, baseType: !42, size: 32, offset: 17248)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !398, file: !397, line: 123, baseType: !188, size: 64, offset: 17280)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !398, file: !397, line: 125, baseType: !18, size: 32, offset: 17344)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !398, file: !397, line: 126, baseType: !18, size: 32, offset: 17376)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !398, file: !397, line: 127, baseType: !18, size: 32, offset: 17408)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !398, file: !397, line: 128, baseType: !42, size: 32, offset: 17440)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !398, file: !397, line: 129, baseType: !18, size: 32, offset: 17472)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !398, file: !397, line: 130, baseType: !18, size: 32, offset: 17504)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !398, file: !397, line: 131, baseType: !18, size: 32, offset: 17536)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !398, file: !397, line: 133, baseType: !18, size: 32, offset: 17568)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !398, file: !397, line: 135, baseType: !18, size: 32, offset: 17600)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !398, file: !397, line: 136, baseType: !18, size: 32, offset: 17632)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !398, file: !397, line: 137, baseType: !18, size: 32, offset: 17664)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !310, file: !114, line: 570, baseType: !445, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !397, line: 197, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 142, size: 33024, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !543, !544}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !447, file: !397, line: 144, baseType: !18, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !447, file: !397, line: 146, baseType: !42, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !447, file: !397, line: 147, baseType: !18, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !447, file: !397, line: 148, baseType: !18, size: 32, offset: 96)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !447, file: !397, line: 149, baseType: !18, size: 32, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !447, file: !397, line: 150, baseType: !18, size: 32, offset: 160)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !447, file: !397, line: 152, baseType: !18, size: 32, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !447, file: !397, line: 154, baseType: !42, size: 32, offset: 224)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !447, file: !397, line: 155, baseType: !42, size: 32, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !447, file: !397, line: 156, baseType: !42, size: 32, offset: 288)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !447, file: !397, line: 158, baseType: !18, size: 32, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !447, file: !397, line: 159, baseType: !407, size: 384, offset: 352)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !447, file: !397, line: 160, baseType: !411, size: 3072, offset: 736)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !447, file: !397, line: 161, baseType: !414, size: 12288, offset: 3808)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !447, file: !397, line: 162, baseType: !417, size: 192, offset: 16096)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !447, file: !397, line: 163, baseType: !417, size: 192, offset: 16288)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !447, file: !397, line: 165, baseType: !42, size: 32, offset: 16480)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !447, file: !397, line: 166, baseType: !42, size: 32, offset: 16512)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !447, file: !397, line: 167, baseType: !42, size: 32, offset: 16544)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !447, file: !397, line: 168, baseType: !42, size: 32, offset: 16576)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !447, file: !397, line: 170, baseType: !42, size: 32, offset: 16608)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !447, file: !397, line: 172, baseType: !18, size: 32, offset: 16640)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !447, file: !397, line: 173, baseType: !18, size: 32, offset: 16672)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !447, file: !397, line: 174, baseType: !18, size: 32, offset: 16704)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !447, file: !397, line: 175, baseType: !42, size: 32, offset: 16736)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !447, file: !397, line: 177, baseType: !475, size: 8192, offset: 16768)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8192, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !447, file: !397, line: 178, baseType: !42, size: 32, offset: 24960)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !447, file: !397, line: 179, baseType: !18, size: 32, offset: 24992)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !447, file: !397, line: 180, baseType: !42, size: 32, offset: 25024)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !447, file: !397, line: 181, baseType: !42, size: 32, offset: 25056)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !447, file: !397, line: 182, baseType: !18, size: 32, offset: 25088)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !447, file: !397, line: 184, baseType: !18, size: 32, offset: 25120)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !447, file: !397, line: 185, baseType: !18, size: 32, offset: 25152)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !447, file: !397, line: 186, baseType: !18, size: 32, offset: 25184)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !447, file: !397, line: 187, baseType: !42, size: 32, offset: 25216)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !447, file: !397, line: 188, baseType: !42, size: 32, offset: 25248)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !447, file: !397, line: 189, baseType: !42, size: 32, offset: 25280)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !447, file: !397, line: 190, baseType: !42, size: 32, offset: 25312)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !447, file: !397, line: 191, baseType: !18, size: 32, offset: 25344)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !447, file: !397, line: 192, baseType: !492, size: 7584, offset: 25376)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !397, line: 90, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 53, size: 7584, elements: !494)
!494 = !{!495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !493, file: !397, line: 55, baseType: !18, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !493, file: !397, line: 56, baseType: !42, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !493, file: !397, line: 57, baseType: !125, size: 16, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !493, file: !397, line: 58, baseType: !125, size: 16, offset: 80)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !493, file: !397, line: 59, baseType: !18, size: 32, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !493, file: !397, line: 60, baseType: !18, size: 32, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !493, file: !397, line: 61, baseType: !18, size: 32, offset: 160)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !493, file: !397, line: 62, baseType: !42, size: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !493, file: !397, line: 63, baseType: !18, size: 32, offset: 224)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !493, file: !397, line: 64, baseType: !18, size: 32, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !493, file: !397, line: 65, baseType: !42, size: 32, offset: 288)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !493, file: !397, line: 66, baseType: !42, size: 32, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !493, file: !397, line: 67, baseType: !42, size: 32, offset: 352)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !493, file: !397, line: 68, baseType: !18, size: 32, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !493, file: !397, line: 69, baseType: !42, size: 32, offset: 416)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !493, file: !397, line: 70, baseType: !42, size: 32, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !493, file: !397, line: 71, baseType: !18, size: 32, offset: 480)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !493, file: !397, line: 72, baseType: !42, size: 32, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !493, file: !397, line: 73, baseType: !42, size: 32, offset: 544)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !493, file: !397, line: 74, baseType: !18, size: 32, offset: 576)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !493, file: !397, line: 75, baseType: !18, size: 32, offset: 608)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !493, file: !397, line: 76, baseType: !517, size: 3296, offset: 640)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !397, line: 50, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 38, size: 3296, elements: !519)
!519 = !{!520, !521, !522, !523, !525, !526, !527, !528, !529, !530}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !518, file: !397, line: 40, baseType: !42, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !518, file: !397, line: 41, baseType: !42, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !518, file: !397, line: 42, baseType: !42, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !518, file: !397, line: 43, baseType: !524, size: 1024, offset: 96)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 1024, elements: !236)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !518, file: !397, line: 44, baseType: !524, size: 1024, offset: 1120)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !518, file: !397, line: 45, baseType: !524, size: 1024, offset: 2144)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !518, file: !397, line: 46, baseType: !42, size: 32, offset: 3168)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !518, file: !397, line: 47, baseType: !42, size: 32, offset: 3200)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !518, file: !397, line: 48, baseType: !42, size: 32, offset: 3232)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !518, file: !397, line: 49, baseType: !42, size: 32, offset: 3264)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !493, file: !397, line: 77, baseType: !18, size: 32, offset: 3936)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !493, file: !397, line: 78, baseType: !517, size: 3296, offset: 3968)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !493, file: !397, line: 80, baseType: !18, size: 32, offset: 7264)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !493, file: !397, line: 81, baseType: !18, size: 32, offset: 7296)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !493, file: !397, line: 82, baseType: !18, size: 32, offset: 7328)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !493, file: !397, line: 83, baseType: !18, size: 32, offset: 7360)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !493, file: !397, line: 84, baseType: !42, size: 32, offset: 7392)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !493, file: !397, line: 85, baseType: !42, size: 32, offset: 7424)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !493, file: !397, line: 86, baseType: !42, size: 32, offset: 7456)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !493, file: !397, line: 87, baseType: !42, size: 32, offset: 7488)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !493, file: !397, line: 88, baseType: !42, size: 32, offset: 7520)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !493, file: !397, line: 89, baseType: !42, size: 32, offset: 7552)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !447, file: !397, line: 193, baseType: !42, size: 32, offset: 32960)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !447, file: !397, line: 195, baseType: !18, size: 32, offset: 32992)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !310, file: !114, line: 571, baseType: !546, size: 1056768, offset: 192)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 1056768, elements: !236)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !310, file: !114, line: 572, baseType: !548, size: 4538368, offset: 1056960)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 4538368, elements: !476)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !310, file: !114, line: 575, baseType: !550, size: 64, offset: 5595328)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !397, line: 256, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !397, line: 228, size: 37312, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !559, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !574, !575, !576, !577}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !552, file: !397, line: 230, baseType: !446, size: 33024)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !552, file: !397, line: 232, baseType: !42, size: 32, offset: 33024)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !552, file: !397, line: 233, baseType: !18, size: 32, offset: 33056)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !552, file: !397, line: 234, baseType: !191, size: 64, offset: 33088)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !552, file: !397, line: 235, baseType: !191, size: 64, offset: 33152)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !552, file: !397, line: 236, baseType: !560, size: 64, offset: 33216)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !552, file: !397, line: 237, baseType: !191, size: 64, offset: 33280)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !552, file: !397, line: 238, baseType: !560, size: 64, offset: 33344)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !552, file: !397, line: 240, baseType: !191, size: 64, offset: 33408)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !552, file: !397, line: 241, baseType: !560, size: 64, offset: 33472)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !552, file: !397, line: 242, baseType: !191, size: 64, offset: 33536)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !552, file: !397, line: 243, baseType: !560, size: 64, offset: 33600)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !552, file: !397, line: 245, baseType: !18, size: 32, offset: 33664)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !552, file: !397, line: 246, baseType: !191, size: 64, offset: 33728)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !552, file: !397, line: 247, baseType: !191, size: 64, offset: 33792)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !552, file: !397, line: 248, baseType: !560, size: 64, offset: 33856)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !552, file: !397, line: 249, baseType: !560, size: 64, offset: 33920)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !552, file: !397, line: 250, baseType: !573, size: 64, offset: 33984)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !552, file: !397, line: 251, baseType: !560, size: 64, offset: 34048)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !552, file: !397, line: 253, baseType: !42, size: 32, offset: 34112)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !552, file: !397, line: 254, baseType: !18, size: 32, offset: 34144)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !552, file: !397, line: 255, baseType: !578, size: 3136, offset: 34176)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !397, line: 226, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !397, line: 200, size: 3136, elements: !580)
!580 = !{!581, !582, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !600, !601, !603, !604, !605, !606}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !579, file: !397, line: 202, baseType: !18, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !579, file: !397, line: 203, baseType: !583, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !579, file: !397, line: 204, baseType: !191, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !579, file: !397, line: 205, baseType: !560, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !579, file: !397, line: 206, baseType: !583, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !579, file: !397, line: 207, baseType: !191, size: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !579, file: !397, line: 208, baseType: !191, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !579, file: !397, line: 209, baseType: !583, size: 64, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !579, file: !397, line: 210, baseType: !583, size: 64, offset: 512)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !579, file: !397, line: 211, baseType: !583, size: 64, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !579, file: !397, line: 212, baseType: !583, size: 64, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !579, file: !397, line: 213, baseType: !583, size: 64, offset: 704)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !579, file: !397, line: 216, baseType: !584, size: 8, offset: 768)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !579, file: !397, line: 217, baseType: !584, size: 8, offset: 776)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !579, file: !397, line: 218, baseType: !584, size: 8, offset: 784)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !579, file: !397, line: 219, baseType: !599, size: 1024, offset: 800)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 1024, elements: !236)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !579, file: !397, line: 220, baseType: !599, size: 1024, offset: 1824)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !579, file: !397, line: 221, baseType: !602, size: 256, offset: 2848)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 256, elements: !236)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !579, file: !397, line: 222, baseType: !584, size: 8, offset: 3104)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !579, file: !397, line: 223, baseType: !584, size: 8, offset: 3112)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !579, file: !397, line: 224, baseType: !584, size: 8, offset: 3120)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !579, file: !397, line: 225, baseType: !584, size: 8, offset: 3128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !310, file: !114, line: 577, baseType: !608, size: 1193984, offset: 5595392)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 1193984, elements: !236)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !310, file: !114, line: 578, baseType: !18, size: 32, offset: 6789376)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !310, file: !114, line: 579, baseType: !18, size: 32, offset: 6789408)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !310, file: !114, line: 580, baseType: !18, size: 32, offset: 6789440)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !310, file: !114, line: 581, baseType: !18, size: 32, offset: 6789472)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !310, file: !114, line: 584, baseType: !614, size: 64, offset: 6789504)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !114, line: 584, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !310, file: !114, line: 586, baseType: !617, size: 64, offset: 6789568)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !114, line: 902, size: 416, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625, !627, !628, !629, !630, !631, !632, !633}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !618, file: !114, line: 904, baseType: !42, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !618, file: !114, line: 905, baseType: !42, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !618, file: !114, line: 906, baseType: !18, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !618, file: !114, line: 907, baseType: !42, size: 32, offset: 96)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !618, file: !114, line: 908, baseType: !18, size: 32, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !618, file: !114, line: 909, baseType: !626, size: 64, offset: 160)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, elements: !160)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !618, file: !114, line: 910, baseType: !189, size: 8, offset: 224)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !618, file: !114, line: 911, baseType: !189, size: 8, offset: 232)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !618, file: !114, line: 912, baseType: !18, size: 32, offset: 256)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !618, file: !114, line: 913, baseType: !18, size: 32, offset: 288)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !618, file: !114, line: 915, baseType: !18, size: 32, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !618, file: !114, line: 916, baseType: !18, size: 32, offset: 352)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !618, file: !114, line: 917, baseType: !18, size: 32, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !310, file: !114, line: 587, baseType: !635, size: 64, offset: 6789632)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !114, line: 839, size: 512, elements: !637)
!637 = !{!638, !639, !642, !643, !644, !645}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !636, file: !114, line: 841, baseType: !18, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !636, file: !114, line: 842, baseType: !640, size: 96, offset: 32)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 96, elements: !157)
!641 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !636, file: !114, line: 843, baseType: !640, size: 96, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !636, file: !114, line: 844, baseType: !640, size: 96, offset: 224)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !636, file: !114, line: 845, baseType: !640, size: 96, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !636, file: !114, line: 846, baseType: !640, size: 96, offset: 416)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !310, file: !114, line: 588, baseType: !18, size: 32, offset: 6789696)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !310, file: !114, line: 591, baseType: !42, size: 32, offset: 6789728)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !310, file: !114, line: 592, baseType: !18, size: 32, offset: 6789760)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !310, file: !114, line: 593, baseType: !18, size: 32, offset: 6789792)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !310, file: !114, line: 594, baseType: !18, size: 32, offset: 6789824)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !310, file: !114, line: 595, baseType: !652, size: 64, offset: 6789888)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !114, line: 542, baseType: !306)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !310, file: !114, line: 596, baseType: !583, size: 64, offset: 6789952)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block_JV", scope: !310, file: !114, line: 597, baseType: !657, size: 192, offset: 6790016)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 192, elements: !157)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !310, file: !114, line: 601, baseType: !18, size: 32, offset: 6790208)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !310, file: !114, line: 602, baseType: !18, size: 32, offset: 6790240)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !310, file: !114, line: 603, baseType: !18, size: 32, offset: 6790272)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !310, file: !114, line: 604, baseType: !18, size: 32, offset: 6790304)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !310, file: !114, line: 605, baseType: !18, size: 32, offset: 6790336)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !310, file: !114, line: 607, baseType: !664, size: 64, offset: 6790400)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode_JV", scope: !310, file: !114, line: 608, baseType: !666, size: 192, offset: 6790464)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 192, elements: !157)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !310, file: !114, line: 609, baseType: !668, size: 64, offset: 6790656)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "siblock", scope: !310, file: !114, line: 610, baseType: !560, size: 64, offset: 6790720)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "siblock_JV", scope: !310, file: !114, line: 611, baseType: !672, size: 192, offset: 6790784)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 192, elements: !157)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "newframe", scope: !310, file: !114, line: 613, baseType: !18, size: 32, offset: 6790976)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !310, file: !114, line: 614, baseType: !18, size: 32, offset: 6791008)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "pNextSlice", scope: !310, file: !114, line: 617, baseType: !653, size: 64, offset: 6791040)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !310, file: !114, line: 618, baseType: !300, size: 64, offset: 6791104)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data_JV", scope: !310, file: !114, line: 619, baseType: !678, size: 192, offset: 6791168)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 192, elements: !157)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaArrayType", scope: !310, file: !114, line: 621, baseType: !18, size: 32, offset: 6791360)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_head", scope: !310, file: !114, line: 626, baseType: !681, size: 64, offset: 6791424)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !114, line: 626, flags: DIFlagFwdDecl)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_end", scope: !310, file: !114, line: 627, baseType: !681, size: 64, offset: 6791488)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !310, file: !114, line: 629, baseType: !42, size: 32, offset: 6791552)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "non_conforming_stream", scope: !310, file: !114, line: 630, baseType: !18, size: 32, offset: 6791584)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntMsb", scope: !310, file: !114, line: 634, baseType: !18, size: 32, offset: 6791616)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntLsb", scope: !310, file: !114, line: 635, baseType: !42, size: 32, offset: 6791648)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedPicOrderCnt", scope: !310, file: !114, line: 638, baseType: !18, size: 32, offset: 6791680)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntCycleCnt", scope: !310, file: !114, line: 638, baseType: !18, size: 32, offset: 6791712)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumInPicOrderCntCycle", scope: !310, file: !114, line: 638, baseType: !18, size: 32, offset: 6791744)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNum", scope: !310, file: !114, line: 639, baseType: !42, size: 32, offset: 6791776)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumOffset", scope: !310, file: !114, line: 639, baseType: !42, size: 32, offset: 6791808)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDeltaPerPicOrderCntCycle", scope: !310, file: !114, line: 640, baseType: !18, size: 32, offset: 6791840)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !310, file: !114, line: 641, baseType: !18, size: 32, offset: 6791872)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNumOffset", scope: !310, file: !114, line: 642, baseType: !18, size: 32, offset: 6791904)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFrameNum", scope: !310, file: !114, line: 645, baseType: !18, size: 32, offset: 6791936)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !310, file: !114, line: 647, baseType: !42, size: 32, offset: 6791968)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !310, file: !114, line: 648, baseType: !42, size: 32, offset: 6792000)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !310, file: !114, line: 649, baseType: !42, size: 32, offset: 6792032)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !310, file: !114, line: 650, baseType: !42, size: 32, offset: 6792064)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !310, file: !114, line: 651, baseType: !42, size: 32, offset: 6792096)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !310, file: !114, line: 652, baseType: !42, size: 32, offset: 6792128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "oldFrameSizeInMbs", scope: !310, file: !114, line: 653, baseType: !42, size: 32, offset: 6792160)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !310, file: !114, line: 655, baseType: !18, size: 32, offset: 6792192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !310, file: !114, line: 657, baseType: !18, size: 32, offset: 6792224)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !310, file: !114, line: 658, baseType: !18, size: 32, offset: 6792256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_bitsize_on_disk", scope: !310, file: !114, line: 661, baseType: !18, size: 32, offset: 6792288)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !310, file: !114, line: 662, baseType: !216, size: 16, offset: 6792320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !310, file: !114, line: 663, baseType: !216, size: 16, offset: 6792336)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_scale", scope: !310, file: !114, line: 664, baseType: !626, size: 64, offset: 6792352)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !310, file: !114, line: 665, baseType: !18, size: 32, offset: 6792416)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !310, file: !114, line: 666, baseType: !18, size: 32, offset: 6792448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value_comp", scope: !310, file: !114, line: 667, baseType: !714, size: 96, offset: 6792480)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 96, elements: !157)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "max_pel_value_comp", scope: !310, file: !114, line: 668, baseType: !339, size: 96, offset: 6792576)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !310, file: !114, line: 670, baseType: !18, size: 32, offset: 6792672)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !310, file: !114, line: 671, baseType: !18, size: 32, offset: 6792704)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !310, file: !114, line: 672, baseType: !18, size: 32, offset: 6792736)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !310, file: !114, line: 673, baseType: !18, size: 32, offset: 6792768)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "num_uv_blocks", scope: !310, file: !114, line: 674, baseType: !18, size: 32, offset: 6792800)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !310, file: !114, line: 675, baseType: !18, size: 32, offset: 6792832)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !310, file: !114, line: 676, baseType: !18, size: 32, offset: 6792864)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !310, file: !114, line: 677, baseType: !18, size: 32, offset: 6792896)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x_blk", scope: !310, file: !114, line: 678, baseType: !18, size: 32, offset: 6792928)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y_blk", scope: !310, file: !114, line: 679, baseType: !18, size: 32, offset: 6792960)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !310, file: !114, line: 680, baseType: !727, size: 192, offset: 6792992)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 192, elements: !728)
!728 = !{!130, !135}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_blk", scope: !310, file: !114, line: 681, baseType: !727, size: 192, offset: 6793184)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_shift", scope: !310, file: !114, line: 682, baseType: !727, size: 192, offset: 6793376)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_x", scope: !310, file: !114, line: 683, baseType: !18, size: 32, offset: 6793568)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_y", scope: !310, file: !114, line: 684, baseType: !18, size: 32, offset: 6793600)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_x", scope: !310, file: !114, line: 685, baseType: !18, size: 32, offset: 6793632)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_y", scope: !310, file: !114, line: 686, baseType: !18, size: 32, offset: 6793664)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "total_scale", scope: !310, file: !114, line: 687, baseType: !18, size: 32, offset: 6793696)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "max_vmv_r", scope: !310, file: !114, line: 689, baseType: !18, size: 32, offset: 6793728)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "idr_psnr_number", scope: !310, file: !114, line: 692, baseType: !18, size: 32, offset: 6793760)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "psnr_number", scope: !310, file: !114, line: 693, baseType: !18, size: 32, offset: 6793792)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "last_ref_pic_poc", scope: !310, file: !114, line: 700, baseType: !18, size: 32, offset: 6793824)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !310, file: !114, line: 701, baseType: !18, size: 32, offset: 6793856)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !310, file: !114, line: 702, baseType: !18, size: 32, offset: 6793888)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !310, file: !114, line: 703, baseType: !18, size: 32, offset: 6793920)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "earlier_missing_poc", scope: !310, file: !114, line: 704, baseType: !18, size: 32, offset: 6793952)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_conceal", scope: !310, file: !114, line: 705, baseType: !42, size: 32, offset: 6793984)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "IDR_concealment_flag", scope: !310, file: !114, line: 706, baseType: !18, size: 32, offset: 6794016)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_slice_type", scope: !310, file: !114, line: 707, baseType: !18, size: 32, offset: 6794048)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point", scope: !310, file: !114, line: 710, baseType: !18, size: 32, offset: 6794080)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point_found", scope: !310, file: !114, line: 711, baseType: !18, size: 32, offset: 6794112)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_cnt", scope: !310, file: !114, line: 712, baseType: !18, size: 32, offset: 6794144)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_num", scope: !310, file: !114, line: 713, baseType: !18, size: 32, offset: 6794176)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_poc", scope: !310, file: !114, line: 714, baseType: !18, size: 32, offset: 6794208)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !310, file: !114, line: 716, baseType: !18, size: 32, offset: 6794240)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !310, file: !114, line: 717, baseType: !18, size: 32, offset: 6794272)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !310, file: !114, line: 719, baseType: !188, size: 64, offset: 6794304)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !310, file: !114, line: 720, baseType: !188, size: 64, offset: 6794368)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "imgData", scope: !310, file: !114, line: 722, baseType: !757, size: 2560, offset: 6794432)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageData", file: !758, line: 38, baseType: !759)
!758 = !DIFile(filename: "ldecod_src/inc/io_image.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "8caef624e6f5391b0c6ab2984e7f77c6")
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "image_data", file: !758, line: 20, size: 2560, elements: !760)
!760 = !{!761, !762, !767, !768, !769, !773, !774, !775, !776, !777}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !759, file: !758, line: 22, baseType: !329, size: 1088)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "frm_data", scope: !759, file: !758, line: 24, baseType: !763, size: 192, offset: 1088)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !764, size: 192, elements: !157)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !124, line: 41, baseType: !123)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "top_data", scope: !759, file: !758, line: 25, baseType: !763, size: 192, offset: 1280)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "bot_data", scope: !759, file: !758, line: 26, baseType: !763, size: 192, offset: 1472)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "frm_uint16", scope: !759, file: !758, line: 31, baseType: !770, size: 192, offset: 1664)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 192, elements: !157)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "top_uint16", scope: !759, file: !758, line: 32, baseType: !770, size: 192, offset: 1856)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "bot_uint16", scope: !759, file: !758, line: 33, baseType: !770, size: 192, offset: 2048)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "frm_stride", scope: !759, file: !758, line: 35, baseType: !339, size: 96, offset: 2240)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "top_stride", scope: !759, file: !758, line: 36, baseType: !339, size: 96, offset: 2336)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "bot_stride", scope: !759, file: !758, line: 37, baseType: !339, size: 96, offset: 2432)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "imgData0", scope: !310, file: !114, line: 723, baseType: !757, size: 2560, offset: 6796992)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "imgData1", scope: !310, file: !114, line: 724, baseType: !757, size: 2560, offset: 6799552)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "imgData2", scope: !310, file: !114, line: 725, baseType: !757, size: 2560, offset: 6802112)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "imgData32", scope: !310, file: !114, line: 728, baseType: !757, size: 2560, offset: 6804672)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "imgData4", scope: !310, file: !114, line: 729, baseType: !757, size: 2560, offset: 6807232)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "imgData5", scope: !310, file: !114, line: 730, baseType: !757, size: 2560, offset: 6809792)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "imgData6", scope: !310, file: !114, line: 731, baseType: !757, size: 2560, offset: 6812352)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "previous_frame_num", scope: !310, file: !114, line: 735, baseType: !42, size: 32, offset: 6814912)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "Is_primary_correct", scope: !310, file: !114, line: 737, baseType: !18, size: 32, offset: 6814944)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "Is_redundant_correct", scope: !310, file: !114, line: 738, baseType: !18, size: 32, offset: 6814976)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "tot_time", scope: !310, file: !114, line: 741, baseType: !194, size: 64, offset: 6815040)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "p_out", scope: !310, file: !114, line: 744, baseType: !18, size: 32, offset: 6815104)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "p_out_mvc", scope: !310, file: !114, line: 746, baseType: !791, size: 32768, offset: 6815136)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 32768, elements: !792)
!792 = !{!793}
!793 = !DISubrange(count: 1024)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "p_ref", scope: !310, file: !114, line: 748, baseType: !18, size: 32, offset: 6847904)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessUnitExists", scope: !310, file: !114, line: 751, baseType: !18, size: 32, offset: 6847936)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "NALUCount", scope: !310, file: !114, line: 752, baseType: !18, size: 32, offset: 6847968)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Bframe_ctr", scope: !310, file: !114, line: 755, baseType: !18, size: 32, offset: 6848000)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "frame_no", scope: !310, file: !114, line: 756, baseType: !18, size: 32, offset: 6848032)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "g_nFrame", scope: !310, file: !114, line: 758, baseType: !18, size: 32, offset: 6848064)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "global_init_done", scope: !310, file: !114, line: 759, baseType: !18, size: 32, offset: 6848096)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ref", scope: !310, file: !114, line: 762, baseType: !764, size: 64, offset: 6848128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV_ref", scope: !310, file: !114, line: 763, baseType: !803, size: 64, offset: 6848192)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "qp_per_matrix", scope: !310, file: !114, line: 765, baseType: !191, size: 64, offset: 6848256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "qp_rem_matrix", scope: !310, file: !114, line: 766, baseType: !191, size: 64, offset: 6848320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "last_out_fs", scope: !310, file: !114, line: 768, baseType: !807, size: 64, offset: 6848384)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !809, line: 152, size: 768, elements: !810)
!809 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !941, !942, !943, !944, !945}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !808, file: !809, line: 154, baseType: !18, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !808, file: !809, line: 155, baseType: !18, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !808, file: !809, line: 156, baseType: !18, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !808, file: !809, line: 157, baseType: !18, size: 32, offset: 96)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !808, file: !809, line: 159, baseType: !18, size: 32, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !808, file: !809, line: 161, baseType: !42, size: 32, offset: 160)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !808, file: !809, line: 162, baseType: !42, size: 32, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !808, file: !809, line: 164, baseType: !18, size: 32, offset: 224)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !808, file: !809, line: 165, baseType: !18, size: 32, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !808, file: !809, line: 166, baseType: !18, size: 32, offset: 288)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !808, file: !809, line: 167, baseType: !18, size: 32, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !808, file: !809, line: 170, baseType: !18, size: 32, offset: 352)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !808, file: !809, line: 172, baseType: !824, size: 64, offset: 384)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !809, line: 138, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !809, line: 46, size: 3328, elements: !827)
!827 = !{!828, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !881, !883, !887, !889, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !826, file: !809, line: 48, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !41, line: 140, baseType: !40)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !826, file: !809, line: 50, baseType: !18, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !826, file: !809, line: 51, baseType: !18, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !826, file: !809, line: 52, baseType: !18, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !826, file: !809, line: 53, baseType: !18, size: 32, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !826, file: !809, line: 54, baseType: !42, size: 32, offset: 160)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !826, file: !809, line: 55, baseType: !42, size: 32, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !826, file: !809, line: 57, baseType: !18, size: 32, offset: 224)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !826, file: !809, line: 58, baseType: !18, size: 32, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !826, file: !809, line: 59, baseType: !18, size: 32, offset: 288)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !826, file: !809, line: 61, baseType: !189, size: 8, offset: 320)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !826, file: !809, line: 62, baseType: !18, size: 32, offset: 352)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !826, file: !809, line: 63, baseType: !18, size: 32, offset: 384)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !826, file: !809, line: 64, baseType: !18, size: 32, offset: 416)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !826, file: !809, line: 65, baseType: !18, size: 32, offset: 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !826, file: !809, line: 67, baseType: !216, size: 16, offset: 480)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !826, file: !809, line: 69, baseType: !18, size: 32, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !826, file: !809, line: 69, baseType: !18, size: 32, offset: 544)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !826, file: !809, line: 69, baseType: !18, size: 32, offset: 576)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !826, file: !809, line: 69, baseType: !18, size: 32, offset: 608)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !826, file: !809, line: 70, baseType: !18, size: 32, offset: 640)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !826, file: !809, line: 70, baseType: !18, size: 32, offset: 672)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !826, file: !809, line: 70, baseType: !18, size: 32, offset: 704)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !826, file: !809, line: 70, baseType: !18, size: 32, offset: 736)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !826, file: !809, line: 71, baseType: !18, size: 32, offset: 768)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !826, file: !809, line: 72, baseType: !18, size: 32, offset: 800)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !826, file: !809, line: 73, baseType: !42, size: 32, offset: 832)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !826, file: !809, line: 74, baseType: !42, size: 32, offset: 864)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !826, file: !809, line: 75, baseType: !18, size: 32, offset: 896)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !826, file: !809, line: 75, baseType: !18, size: 32, offset: 928)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !826, file: !809, line: 76, baseType: !18, size: 32, offset: 960)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !826, file: !809, line: 76, baseType: !18, size: 32, offset: 992)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !826, file: !809, line: 79, baseType: !764, size: 64, offset: 1024)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !826, file: !809, line: 80, baseType: !803, size: 64, offset: 1088)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !826, file: !809, line: 81, baseType: !803, size: 64, offset: 1152)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !826, file: !809, line: 84, baseType: !865, size: 64, offset: 1216)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
