; ModuleID = 'ldecod_src/config_common.c'
source_filename = "ldecod_src/config_common.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.inp_par = type { [255 x i8], [255 x i8], [255 x i8], i32, i32, i32, i32, i32, i32, %struct.frame_format, %struct.frame_format, i32, i32, %struct.video_data_file, %struct.video_data_file, %struct.video_data_file, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.frame_format = type { i32, i32, double, [3 x i32], [3 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [3 x i32], i32, [3 x i32], [3 x i32], [3 x i32], i32, i32 }
%struct.video_data_file = type { [255 x i8], [255 x i8], [255 x i8], i32, i32, %struct.frame_format, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr }
%struct.Mapping = type { ptr, ptr, i32, double, i32, double, double, i32 }

@.str = private unnamed_addr constant [2 x i8] c"r\00", align 1, !dbg !0
@errortext = external global [300 x i8], align 16
@.str.1 = private unnamed_addr constant [35 x i8] c"Cannot open configuration file %s.\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [39 x i8] c"Cannot fseek in configuration file %s.\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [71 x i8] c"Unreasonable Filesize %ld reported by ftell for configuration file %s.\00", align 1, !dbg !17

!62 = !DIFile(filename: "ldecod_src/inc/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "fd6ca9e1c707932f749220576db72b57")
!63 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!64 = !{!65, !66, !67, !68, !69}
!65 = !DIEnumerator(name: "CF_UNKNOWN", value: -1)
!66 = !DIEnumerator(name: "YUV400", value: 0)
!67 = !DIEnumerator(name: "YUV420", value: 1)
!68 = !DIEnumerator(name: "YUV422", value: 2)
!69 = !DIEnumerator(name: "YUV444", value: 3)
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !62, line: 15, baseType: !63, size: 32, elements: !71)
!71 = !{!72, !73, !74, !75}
!72 = !DIEnumerator(name: "CM_UNKNOWN", value: -1)
!73 = !DIEnumerator(name: "CM_YUV", value: 0)
!74 = !DIEnumerator(name: "CM_RGB", value: 1)
!75 = !DIEnumerator(name: "CM_XYZ", value: 2)
!76 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !77, line: 25, baseType: !63, size: 32, elements: !78)
!77 = !DIFile(filename: "ldecod_src/inc/io_video.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1141c07f1801ad27d87214c419749431")
!78 = !{!79, !80, !81, !82, !83, !84}
!79 = !DIEnumerator(name: "VIDEO_UNKNOWN", value: -1)
!80 = !DIEnumerator(name: "VIDEO_YUV", value: 0)
!81 = !DIEnumerator(name: "VIDEO_RGB", value: 1)
!82 = !DIEnumerator(name: "VIDEO_XYZ", value: 2)
!83 = !DIEnumerator(name: "VIDEO_TIFF", value: 3)
!84 = !DIEnumerator(name: "VIDEO_AVI", value: 4)
!85 = !{!86, !87, !88, !89, !90, !63}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!87 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!92 = !{!0, !7, !12, !17, !22, !27, !93, !32, !37, !42, !95, !47, !52, !97, !102, !107, !112, !114, !119, !124, !129, !131, !57}
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(scope: null, file: !2, line: 231, type: !3, isLocal: true, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(scope: null, file: !2, line: 248, type: !3, isLocal: true, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(scope: null, file: !2, line: 341, type: !99, isLocal: true, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 720, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 90)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(scope: null, file: !2, line: 350, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 752, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 94)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(scope: null, file: !2, line: 361, type: !109, isLocal: true, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 736, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 92)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(scope: null, file: !2, line: 369, type: !104, isLocal: true, isDefinition: true)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(scope: null, file: !2, line: 410, type: !116, isLocal: true, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 448, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 56)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(scope: null, file: !2, line: 411, type: !121, isLocal: true, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 40)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(scope: null, file: !2, line: 416, type: !126, isLocal: true, isDefinition: true)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 19)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(scope: null, file: !2, line: 418, type: !126, isLocal: true, isDefinition: true)
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(scope: null, file: !2, line: 420, type: !133, isLocal: true, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 21)
!136 = !DIFile(filename: "ldecod_src/inc/configfile.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "23faa11f5f7f05b8e96bfb34b9b764b7")
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !138, line: 900, baseType: !139)
!138 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !138, line: 850, size: 32128, elements: !140)
!140 = !{!141, !145, !146, !147, !148, !149, !150, !151, !152, !153, !180, !181, !182, !183, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !139, file: !138, line: 852, baseType: !142, size: 2040)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 255)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !139, file: !138, line: 853, baseType: !142, size: 2040, offset: 2040)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !139, file: !138, line: 854, baseType: !142, size: 2040, offset: 4080)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !139, file: !138, line: 856, baseType: !63, size: 32, offset: 6144)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !139, file: !138, line: 857, baseType: !63, size: 32, offset: 6176)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !139, file: !138, line: 858, baseType: !63, size: 32, offset: 6208)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !139, file: !138, line: 859, baseType: !63, size: 32, offset: 6240)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !139, file: !138, line: 860, baseType: !63, size: 32, offset: 6272)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !139, file: !138, line: 861, baseType: !63, size: 32, offset: 6304)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !139, file: !138, line: 864, baseType: !154, size: 1088, offset: 6336)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !62, line: 52, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !62, line: 30, size: 1088, elements: !156)
!156 = !{!157, !159, !161, !162, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !155, file: !62, line: 32, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !62, line: 28, baseType: !61)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !155, file: !62, line: 33, baseType: !160, size: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !62, line: 20, baseType: !70)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !155, file: !62, line: 34, baseType: !91, size: 64, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !155, file: !62, line: 35, baseType: !163, size: 96, offset: 128)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 96, elements: !40)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !155, file: !62, line: 36, baseType: !163, size: 96, offset: 224)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !155, file: !62, line: 37, baseType: !63, size: 32, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !155, file: !62, line: 38, baseType: !63, size: 32, offset: 352)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !155, file: !62, line: 39, baseType: !63, size: 32, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !155, file: !62, line: 40, baseType: !63, size: 32, offset: 416)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !155, file: !62, line: 41, baseType: !63, size: 32, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !155, file: !62, line: 42, baseType: !63, size: 32, offset: 480)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !155, file: !62, line: 43, baseType: !63, size: 32, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !155, file: !62, line: 44, baseType: !63, size: 32, offset: 544)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !155, file: !62, line: 45, baseType: !163, size: 96, offset: 576)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !155, file: !62, line: 46, baseType: !63, size: 32, offset: 672)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !155, file: !62, line: 47, baseType: !163, size: 96, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !155, file: !62, line: 48, baseType: !163, size: 96, offset: 800)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !155, file: !62, line: 49, baseType: !163, size: 96, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !155, file: !62, line: 50, baseType: !63, size: 32, offset: 992)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !155, file: !62, line: 51, baseType: !63, size: 32, offset: 1024)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !139, file: !138, line: 865, baseType: !154, size: 1088, offset: 7424)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !139, file: !138, line: 867, baseType: !63, size: 32, offset: 8512)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !139, file: !138, line: 868, baseType: !63, size: 32, offset: 8544)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !139, file: !138, line: 869, baseType: !184, size: 7744, offset: 8576)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !77, line: 60, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !77, line: 34, size: 7744, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !185, file: !77, line: 37, baseType: !142, size: 2040)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !185, file: !77, line: 38, baseType: !142, size: 2040, offset: 2040)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !185, file: !77, line: 39, baseType: !142, size: 2040, offset: 4080)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !185, file: !77, line: 40, baseType: !63, size: 32, offset: 6144)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !185, file: !77, line: 41, baseType: !192, size: 32, offset: 6176)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !77, line: 32, baseType: !76)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !185, file: !77, line: 42, baseType: !154, size: 1088, offset: 6208)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !185, file: !77, line: 43, baseType: !63, size: 32, offset: 7296)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !185, file: !77, line: 44, baseType: !63, size: 32, offset: 7328)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !185, file: !77, line: 45, baseType: !63, size: 32, offset: 7360)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !185, file: !77, line: 46, baseType: !63, size: 32, offset: 7392)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !185, file: !77, line: 47, baseType: !63, size: 32, offset: 7424)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !185, file: !77, line: 48, baseType: !63, size: 32, offset: 7456)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !185, file: !77, line: 49, baseType: !63, size: 32, offset: 7488)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !185, file: !77, line: 50, baseType: !63, size: 32, offset: 7520)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !185, file: !77, line: 51, baseType: !63, size: 32, offset: 7552)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !185, file: !77, line: 52, baseType: !63, size: 32, offset: 7584)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !185, file: !77, line: 53, baseType: !63, size: 32, offset: 7616)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !185, file: !77, line: 56, baseType: !88, size: 64, offset: 7680)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !139, file: !138, line: 870, baseType: !184, size: 7744, offset: 16320)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !139, file: !138, line: 871, baseType: !184, size: 7744, offset: 24064)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !139, file: !138, line: 873, baseType: !63, size: 32, offset: 31808)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !139, file: !138, line: 884, baseType: !63, size: 32, offset: 31840)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !139, file: !138, line: 885, baseType: !63, size: 32, offset: 31872)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !139, file: !138, line: 886, baseType: !63, size: 32, offset: 31904)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !139, file: !138, line: 890, baseType: !63, size: 32, offset: 31936)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !139, file: !138, line: 893, baseType: !63, size: 32, offset: 31968)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !139, file: !138, line: 894, baseType: !63, size: 32, offset: 32000)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !139, file: !138, line: 895, baseType: !63, size: 32, offset: 32032)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !139, file: !138, line: 897, baseType: !63, size: 32, offset: 32064)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !139, file: !138, line: 899, baseType: !63, size: 32, offset: 32096)
!218 = !{i32 7, !"Dwarf Version", i32 5}
!219 = !{i32 2, !"Debug Info Version", i32 3}
!220 = !{i32 1, !"wchar_size", i32 4}
!221 = !{i32 8, !"PIC Level", i32 2}
!222 = !{i32 7, !"PIE Level", i32 2}
!223 = !{i32 7, !"uwtable", i32 2}
!224 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!225 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!226 = distinct !DISubprogram(name: "GetConfigFileContent", scope: !2, file: !2, line: 91, type: !227, scopeLine: 92, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !229)
!227 = !DISubroutineType(types: !228)
!228 = !{!89, !89}
!229 = !{!230, !231, !232, !291}
!230 = !DILocalVariable(name: "Filename", arg: 1, scope: !226, file: !2, line: 91, type: !89)
!231 = !DILocalVariable(name: "FileSize", scope: !226, file: !2, line: 93, type: !87)
!232 = !DILocalVariable(name: "f", scope: !226, file: !2, line: 94, type: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !235, line: 7, baseType: !236)
!235 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !237, line: 49, size: 1728, elements: !238)
!237 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!238 = !{!239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !254, !256, !257, !258, !261, !263, !265, !269, !272, !274, !277, !280, !281, !282, !286, !287}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !236, file: !237, line: 51, baseType: !63, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !236, file: !237, line: 54, baseType: !89, size: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !236, file: !237, line: 55, baseType: !89, size: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !236, file: !237, line: 56, baseType: !89, size: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !236, file: !237, line: 57, baseType: !89, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !236, file: !237, line: 58, baseType: !89, size: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !236, file: !237, line: 59, baseType: !89, size: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !236, file: !237, line: 60, baseType: !89, size: 64, offset: 448)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !236, file: !237, line: 61, baseType: !89, size: 64, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !236, file: !237, line: 64, baseType: !89, size: 64, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !236, file: !237, line: 65, baseType: !89, size: 64, offset: 640)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !236, file: !237, line: 66, baseType: !89, size: 64, offset: 704)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !236, file: !237, line: 68, baseType: !252, size: 64, offset: 768)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !237, line: 36, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !236, file: !237, line: 70, baseType: !255, size: 64, offset: 832)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !236, file: !237, line: 72, baseType: !63, size: 32, offset: 896)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !236, file: !237, line: 73, baseType: !63, size: 32, offset: 928)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !236, file: !237, line: 74, baseType: !259, size: 64, offset: 960)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !260, line: 152, baseType: !87)
!260 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !236, file: !237, line: 77, baseType: !262, size: 16, offset: 1024)
!262 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !236, file: !237, line: 78, baseType: !264, size: 8, offset: 1040)
!264 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !236, file: !237, line: 79, baseType: !266, size: 8, offset: 1048)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 1)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !236, file: !237, line: 81, baseType: !270, size: 64, offset: 1088)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !237, line: 43, baseType: null)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !236, file: !237, line: 89, baseType: !273, size: 64, offset: 1152)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !260, line: 153, baseType: !87)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !236, file: !237, line: 91, baseType: !275, size: 64, offset: 1216)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !237, line: 37, flags: DIFlagFwdDecl)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !236, file: !237, line: 92, baseType: !278, size: 64, offset: 1280)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !237, line: 38, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !236, file: !237, line: 93, baseType: !255, size: 64, offset: 1344)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !236, file: !237, line: 94, baseType: !86, size: 64, offset: 1408)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !236, file: !237, line: 95, baseType: !283, size: 64, offset: 1472)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !284, line: 18, baseType: !285)
!284 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!285 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !236, file: !237, line: 96, baseType: !63, size: 32, offset: 1536)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !236, file: !237, line: 98, baseType: !288, size: 160, offset: 1568)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 20)
!291 = !DILocalVariable(name: "buf", scope: !226, file: !2, line: 95, type: !89)
!292 = !DILocation(line: 0, scope: !226)
!293 = !DILocation(line: 97, column: 20, scope: !294)
!294 = distinct !DILexicalBlock(scope: !226, file: !2, line: 97, column: 7)
!295 = !DILocation(line: 97, column: 12, scope: !294)
!296 = !DILocation(line: 97, column: 7, scope: !226)
!297 = !DILocation(line: 99, column: 7, scope: !298)
!298 = distinct !DILexicalBlock(scope: !294, file: !2, line: 98, column: 3)
!299 = !DILocation(line: 100, column: 7, scope: !298)
!300 = !DILocation(line: 103, column: 12, scope: !301)
!301 = distinct !DILexicalBlock(scope: !226, file: !2, line: 103, column: 7)
!302 = !DILocation(line: 103, column: 9, scope: !301)
!303 = !DILocation(line: 103, column: 7, scope: !226)
!304 = !DILocation(line: 105, column: 5, scope: !305)
!305 = distinct !DILexicalBlock(scope: !301, file: !2, line: 104, column: 3)
!306 = !DILocation(line: 106, column: 5, scope: !305)
!307 = !DILocation(line: 109, column: 14, scope: !226)
!308 = !DILocation(line: 110, column: 20, scope: !309)
!309 = distinct !DILexicalBlock(scope: !226, file: !2, line: 110, column: 7)
!310 = !DILocation(line: 112, column: 5, scope: !311)
!311 = distinct !DILexicalBlock(scope: !309, file: !2, line: 111, column: 3)
!312 = !DILocation(line: 113, column: 5, scope: !311)
!313 = !DILocation(line: 115, column: 12, scope: !314)
!314 = distinct !DILexicalBlock(scope: !226, file: !2, line: 115, column: 7)
!315 = !DILocation(line: 115, column: 9, scope: !314)
!316 = !DILocation(line: 115, column: 7, scope: !226)
!317 = !DILocation(line: 117, column: 5, scope: !318)
!318 = distinct !DILexicalBlock(scope: !314, file: !2, line: 116, column: 3)
!319 = !DILocation(line: 118, column: 5, scope: !318)
!320 = !DILocation(line: 121, column: 31, scope: !321)
!321 = distinct !DILexicalBlock(scope: !226, file: !2, line: 121, column: 7)
!322 = !DILocation(line: 121, column: 14, scope: !321)
!323 = !DILocation(line: 121, column: 36, scope: !321)
!324 = !DILocation(line: 121, column: 7, scope: !226)
!325 = !DILocation(line: 121, column: 44, scope: !321)
!326 = !DILocation(line: 127, column: 21, scope: !226)
!327 = !DILocation(line: 128, column: 3, scope: !226)
!328 = !DILocation(line: 128, column: 17, scope: !226)
!329 = !DILocation(line: 131, column: 3, scope: !226)
!330 = !DILocation(line: 132, column: 3, scope: !226)
!331 = !DILocation(line: 133, column: 1, scope: !226)
!332 = !DISubprogram(name: "fopen", scope: !333, file: !333, line: 258, type: !334, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!333 = !DIFile(filename: "/usr/include/stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "f31eefcc3f15835fc5a4023a625cf609")
!334 = !DISubroutineType(types: !335)
!335 = !{!233, !336, !336}
!336 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!339 = !DISubprogram(name: "snprintf", scope: !333, file: !333, line: 378, type: !340, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!340 = !DISubroutineType(types: !341)
!341 = !{!63, !342, !283, !336, null}
!342 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !89)
!343 = !DISubprogram(name: "fseek", scope: !333, file: !333, line: 713, type: !344, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!344 = !DISubroutineType(types: !345)
!345 = !{!63, !233, !87, !63}
!346 = !DISubprogram(name: "ftell", scope: !333, file: !333, line: 718, type: !347, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!347 = !DISubroutineType(types: !348)
!348 = !{!87, !233}
!349 = !DISubprogram(name: "malloc", scope: !350, file: !350, line: 540, type: !351, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!350 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!351 = !DISubroutineType(types: !352)
!352 = !{!86, !283}
!353 = !DISubprogram(name: "no_mem_exit", scope: !354, file: !354, line: 180, type: !355, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!354 = !DIFile(filename: "ldecod_src/inc/memalloc.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "88776e97a131c37d03036121c7c9e0ac")
!355 = !DISubroutineType(types: !356)
!356 = !{null, !89}
!357 = !DISubprogram(name: "fread", scope: !333, file: !333, line: 675, type: !358, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!358 = !DISubroutineType(types: !359)
!359 = !{!285, !360, !283, !283, !361}
!360 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !86)
!361 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !233)
!362 = !DISubprogram(name: "fclose", scope: !333, file: !333, line: 178, type: !363, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!363 = !DISubroutineType(types: !364)
!364 = !{!63, !233}
!365 = distinct !DISubprogram(name: "ParseContent", scope: !2, file: !2, line: 152, type: !366, scopeLine: 153, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !382)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !368, !369, !89, !63}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mapping", file: !371, line: 28, baseType: !372)
!371 = !DIFile(filename: "ldecod_src/inc/config_common.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "fd4f7fd23ee5c729db940751b9f760f9")
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !371, line: 19, size: 512, elements: !373)
!373 = !{!374, !375, !376, !377, !378, !379, !380, !381}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "TokenName", scope: !372, file: !371, line: 20, baseType: !89, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Place", scope: !372, file: !371, line: 21, baseType: !86, size: 64, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !372, file: !371, line: 22, baseType: !63, size: 32, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "Default", scope: !372, file: !371, line: 23, baseType: !91, size: 64, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "param_limits", scope: !372, file: !371, line: 24, baseType: !63, size: 32, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "min_limit", scope: !372, file: !371, line: 25, baseType: !91, size: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "max_limit", scope: !372, file: !371, line: 26, baseType: !91, size: 64, offset: 384)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "char_size", scope: !372, file: !371, line: 27, baseType: !63, size: 32, offset: 448)
!382 = !{!383, !384, !385, !386, !387, !391, !392, !393, !394, !395, !396, !397, !398, !399}
!383 = !DILocalVariable(name: "p_Inp", arg: 1, scope: !365, file: !2, line: 152, type: !368)
!384 = !DILocalVariable(name: "Map", arg: 2, scope: !365, file: !2, line: 152, type: !369)
!385 = !DILocalVariable(name: "buf", arg: 3, scope: !365, file: !2, line: 152, type: !89)
!386 = !DILocalVariable(name: "bufsize", arg: 4, scope: !365, file: !2, line: 152, type: !63)
!387 = !DILocalVariable(name: "items", scope: !365, file: !2, line: 154, type: !388)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 640000, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 10000)
!391 = !DILocalVariable(name: "MapIdx", scope: !365, file: !2, line: 155, type: !63)
!392 = !DILocalVariable(name: "item", scope: !365, file: !2, line: 156, type: !63)
!393 = !DILocalVariable(name: "InString", scope: !365, file: !2, line: 157, type: !63)
!394 = !DILocalVariable(name: "InItem", scope: !365, file: !2, line: 157, type: !63)
!395 = !DILocalVariable(name: "p", scope: !365, file: !2, line: 158, type: !89)
!396 = !DILocalVariable(name: "bufend", scope: !365, file: !2, line: 159, type: !89)
!397 = !DILocalVariable(name: "IntContent", scope: !365, file: !2, line: 160, type: !63)
!398 = !DILocalVariable(name: "DoubleContent", scope: !365, file: !2, line: 161, type: !91)
!399 = !DILocalVariable(name: "i", scope: !365, file: !2, line: 162, type: !63)
!400 = distinct !DIAssignID()
!401 = !DILocation(line: 0, scope: !365)
!402 = distinct !DIAssignID()
!403 = distinct !DIAssignID()
!404 = !DILocation(line: 154, column: 3, scope: !365)
!405 = !DILocation(line: 154, column: 9, scope: !365)
!406 = distinct !DIAssignID()
!407 = !DILocation(line: 159, column: 19, scope: !365)
!408 = !DILocation(line: 160, column: 3, scope: !365)
!409 = !DILocation(line: 161, column: 3, scope: !365)
!410 = !DILocation(line: 167, column: 12, scope: !365)
!411 = !DILocation(line: 167, column: 3, scope: !365)
!412 = !DILocation(line: 169, column: 13, scope: !413)
!413 = distinct !DILexicalBlock(scope: !365, file: !2, line: 168, column: 3)
!414 = !DILocation(line: 169, column: 5, scope: !413)
!415 = !DILocation(line: 172, column: 7, scope: !416)
!416 = distinct !DILexicalBlock(scope: !413, file: !2, line: 170, column: 5)
!417 = !DILocation(line: 173, column: 7, scope: !416)
!418 = !DILocation(line: 175, column: 10, scope: !416)
!419 = !DILocation(line: 176, column: 7, scope: !416)
!420 = !DILocation(line: 176, column: 14, scope: !416)
!421 = !DILocation(line: 176, column: 17, scope: !416)
!422 = !DILocation(line: 176, column: 25, scope: !416)
!423 = !DILocation(line: 177, column: 9, scope: !416)
!424 = distinct !{!424, !419, !425}
!425 = !DILocation(line: 177, column: 11, scope: !416)
!426 = !DILocation(line: 184, column: 9, scope: !416)
!427 = !DILocation(line: 184, column: 11, scope: !416)
!428 = !DILocation(line: 185, column: 7, scope: !416)
!429 = !DILocation(line: 188, column: 11, scope: !430)
!430 = distinct !DILexicalBlock(scope: !416, file: !2, line: 188, column: 11)
!431 = !DILocation(line: 0, scope: !430)
!432 = !DILocation(line: 188, column: 11, scope: !416)
!433 = !DILocation(line: 192, column: 14, scope: !434)
!434 = distinct !DILexicalBlock(scope: !430, file: !2, line: 191, column: 7)
!435 = !DILocation(line: 198, column: 9, scope: !416)
!436 = !DILocation(line: 198, column: 12, scope: !416)
!437 = !DILocation(line: 199, column: 12, scope: !438)
!438 = distinct !DILexicalBlock(scope: !416, file: !2, line: 199, column: 11)
!439 = !DILocation(line: 199, column: 11, scope: !416)
!440 = !DILocation(line: 201, column: 19, scope: !441)
!441 = distinct !DILexicalBlock(scope: !438, file: !2, line: 200, column: 7)
!442 = !DILocation(line: 201, column: 9, scope: !441)
!443 = !DILocation(line: 201, column: 23, scope: !441)
