; ModuleID = 'ldecod_src/configfile.c'
source_filename = "ldecod_src/configfile.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.inp_par = type { [255 x i8], [255 x i8], [255 x i8], i32, i32, i32, i32, i32, i32, %struct.frame_format, %struct.frame_format, i32, i32, %struct.video_data_file, %struct.video_data_file, %struct.video_data_file, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.frame_format = type { i32, i32, double, [3 x i32], [3 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [3 x i32], i32, [3 x i32], [3 x i32], [3 x i32], i32, i32 }
%struct.video_data_file = type { [255 x i8], [255 x i8], [255 x i8], i32, i32, %struct.frame_format, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr }
%struct.Mapping = type { ptr, ptr, i32, double, i32, double, double, i32 }

@.str = private unnamed_addr constant [10 x i8] c"InputFile\00", align 1, !dbg !0
@cfgparams = dso_local global %struct.inp_par zeroinitializer, align 8, !dbg !7
@.str.1 = private unnamed_addr constant [11 x i8] c"OutputFile\00", align 1, !dbg !39
@.str.2 = private unnamed_addr constant [8 x i8] c"RefFile\00", align 1, !dbg !44
@.str.3 = private unnamed_addr constant [8 x i8] c"WriteUV\00", align 1, !dbg !49
@.str.4 = private unnamed_addr constant [11 x i8] c"FileFormat\00", align 1, !dbg !51
@.str.5 = private unnamed_addr constant [10 x i8] c"RefOffset\00", align 1, !dbg !53

!16 = !DIEnumerator(name: "CF_UNKNOWN", value: -1)
!17 = !DIEnumerator(name: "YUV400", value: 0)
!18 = !DIEnumerator(name: "YUV420", value: 1)
!19 = !DIEnumerator(name: "YUV422", value: 2)
!20 = !DIEnumerator(name: "YUV444", value: 3)
!21 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !13, line: 15, baseType: !14, size: 32, elements: !22)
!22 = !{!23, !24, !25, !26}
!23 = !DIEnumerator(name: "CM_UNKNOWN", value: -1)
!24 = !DIEnumerator(name: "CM_YUV", value: 0)
!25 = !DIEnumerator(name: "CM_RGB", value: 1)
!26 = !DIEnumerator(name: "CM_XYZ", value: 2)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 25, baseType: !14, size: 32, elements: !29)
!28 = !DIFile(filename: "ldecod_src/inc/io_video.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1141c07f1801ad27d87214c419749431")
!29 = !{!30, !31, !32, !33, !34, !35}
!30 = !DIEnumerator(name: "VIDEO_UNKNOWN", value: -1)
!31 = !DIEnumerator(name: "VIDEO_YUV", value: 0)
!32 = !DIEnumerator(name: "VIDEO_RGB", value: 1)
!33 = !DIEnumerator(name: "VIDEO_XYZ", value: 2)
!34 = !DIEnumerator(name: "VIDEO_TIFF", value: 3)
!35 = !DIEnumerator(name: "VIDEO_AVI", value: 4)
!36 = !{!37, !14}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!38 = !{!0, !39, !44, !49, !51, !53, !55, !60, !65, !70, !72, !77, !79, !84, !86, !91, !108, !113, !115, !120, !125, !127, !132, !134, !139, !141, !146, !148, !150, !155, !157, !159, !161, !163, !165, !167, !169, !171, !173, !175, !177, !179, !181, !183, !185, !190, !195, !200, !7, !202}
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(scope: null, file: !2, line: 31, type: !41, isLocal: true, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 88, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 11)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(scope: null, file: !2, line: 32, type: !46, isLocal: true, isDefinition: true)
!46 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !47)
!47 = !{!48}
!48 = !DISubrange(count: 8)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(scope: null, file: !2, line: 33, type: !46, isLocal: true, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(scope: null, file: !2, line: 34, type: !41, isLocal: true, isDefinition: true)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(scope: null, file: !2, line: 35, type: !3, isLocal: true, isDefinition: true)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(scope: null, file: !2, line: 36, type: !57, isLocal: true, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 9)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !62, isLocal: true, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 136, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 17)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(scope: null, file: !2, line: 44, type: !67, isLocal: true, isDefinition: true)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 12)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(scope: null, file: !2, line: 45, type: !3, isLocal: true, isDefinition: true)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(scope: null, file: !2, line: 46, type: !74, isLocal: true, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 56, elements: !75)
!75 = !{!76}
!76 = !DISubrange(count: 7)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(scope: null, file: !2, line: 47, type: !74, isLocal: true, isDefinition: true)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !81, isLocal: true, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 184, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 23)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(scope: null, file: !2, line: 49, type: !3, isLocal: true, isDefinition: true)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(scope: null, file: !2, line: 51, type: !88, isLocal: true, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 16)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "Map", scope: !9, file: !2, line: 29, type: !93, isLocal: false, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 8192, elements: !89)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mapping", file: !95, line: 28, baseType: !96)
!95 = !DIFile(filename: "ldecod_src/inc/config_common.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "fd4f7fd23ee5c729db940751b9f760f9")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 19, size: 512, elements: !97)
!97 = !{!98, !100, !101, !102, !104, !105, !106, !107}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "TokenName", scope: !96, file: !95, line: 20, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "Place", scope: !96, file: !95, line: 21, baseType: !37, size: 64, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !96, file: !95, line: 22, baseType: !14, size: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "Default", scope: !96, file: !95, line: 23, baseType: !103, size: 64, offset: 192)
!103 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "param_limits", scope: !96, file: !95, line: 24, baseType: !14, size: 32, offset: 256)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "min_limit", scope: !96, file: !95, line: 25, baseType: !103, size: 64, offset: 320)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max_limit", scope: !96, file: !95, line: 26, baseType: !103, size: 64, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "char_size", scope: !96, file: !95, line: 27, baseType: !14, size: 32, offset: 448)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(scope: null, file: !10, line: 79, type: !110, isLocal: true, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 6456, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 807)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(scope: null, file: !10, line: 135, type: !67, isLocal: true, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(scope: null, file: !10, line: 139, type: !117, isLocal: true, isDefinition: true)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 3)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(scope: null, file: !10, line: 144, type: !122, isLocal: true, isDefinition: true)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 15)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(scope: null, file: !10, line: 149, type: !117, isLocal: true, isDefinition: true)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(scope: null, file: !10, line: 157, type: !129, isLocal: true, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 31)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(scope: null, file: !10, line: 165, type: !117, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(scope: null, file: !10, line: 167, type: !136, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 5)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(scope: null, file: !10, line: 180, type: !81, isLocal: true, isDefinition: true)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(scope: null, file: !10, line: 186, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 2)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(scope: null, file: !10, line: 199, type: !117, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(scope: null, file: !10, line: 199, type: !117, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(scope: null, file: !10, line: 204, type: !152, isLocal: true, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 22)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(scope: null, file: !10, line: 210, type: !117, isLocal: true, isDefinition: true)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(scope: null, file: !10, line: 210, type: !117, isLocal: true, isDefinition: true)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(scope: null, file: !10, line: 215, type: !117, isLocal: true, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(scope: null, file: !10, line: 215, type: !117, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(scope: null, file: !10, line: 220, type: !117, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(scope: null, file: !10, line: 220, type: !117, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(scope: null, file: !10, line: 225, type: !117, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(scope: null, file: !10, line: 225, type: !117, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(scope: null, file: !10, line: 230, type: !117, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(scope: null, file: !10, line: 230, type: !117, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(scope: null, file: !10, line: 232, type: !117, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(scope: null, file: !10, line: 236, type: !136, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(scope: null, file: !10, line: 236, type: !136, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(scope: null, file: !10, line: 242, type: !117, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(scope: null, file: !10, line: 242, type: !117, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(scope: null, file: !10, line: 257, type: !187, isLocal: true, isDefinition: true)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 152, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 19)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(scope: null, file: !10, line: 280, type: !192, isLocal: true, isDefinition: true)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 33)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(scope: null, file: !10, line: 287, type: !197, isLocal: true, isDefinition: true)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 632, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 79)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(scope: null, file: !10, line: 297, type: !187, isLocal: true, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(scope: null, file: !10, line: 113, type: !204, isLocal: true, isDefinition: true)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 42)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !208, line: 900, baseType: !209)
!208 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !208, line: 850, size: 32128, elements: !210)
!210 = !{!211, !215, !216, !217, !218, !219, !220, !221, !222, !223, !250, !251, !252, !253, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !209, file: !208, line: 852, baseType: !212, size: 2040)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 255)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !209, file: !208, line: 853, baseType: !212, size: 2040, offset: 2040)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !209, file: !208, line: 854, baseType: !212, size: 2040, offset: 4080)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !209, file: !208, line: 856, baseType: !14, size: 32, offset: 6144)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !209, file: !208, line: 857, baseType: !14, size: 32, offset: 6176)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !209, file: !208, line: 858, baseType: !14, size: 32, offset: 6208)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !209, file: !208, line: 859, baseType: !14, size: 32, offset: 6240)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !209, file: !208, line: 860, baseType: !14, size: 32, offset: 6272)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !209, file: !208, line: 861, baseType: !14, size: 32, offset: 6304)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !209, file: !208, line: 864, baseType: !224, size: 1088, offset: 6336)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !13, line: 52, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !13, line: 30, size: 1088, elements: !226)
!226 = !{!227, !229, !231, !232, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !225, file: !13, line: 32, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !13, line: 28, baseType: !12)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !225, file: !13, line: 33, baseType: !230, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !13, line: 20, baseType: !21)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !225, file: !13, line: 34, baseType: !103, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !225, file: !13, line: 35, baseType: !233, size: 96, offset: 128)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 96, elements: !118)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !225, file: !13, line: 36, baseType: !233, size: 96, offset: 224)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !225, file: !13, line: 37, baseType: !14, size: 32, offset: 320)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !225, file: !13, line: 38, baseType: !14, size: 32, offset: 352)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !225, file: !13, line: 39, baseType: !14, size: 32, offset: 384)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !225, file: !13, line: 40, baseType: !14, size: 32, offset: 416)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !225, file: !13, line: 41, baseType: !14, size: 32, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !225, file: !13, line: 42, baseType: !14, size: 32, offset: 480)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !225, file: !13, line: 43, baseType: !14, size: 32, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !225, file: !13, line: 44, baseType: !14, size: 32, offset: 544)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !225, file: !13, line: 45, baseType: !233, size: 96, offset: 576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !225, file: !13, line: 46, baseType: !14, size: 32, offset: 672)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !225, file: !13, line: 47, baseType: !233, size: 96, offset: 704)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !225, file: !13, line: 48, baseType: !233, size: 96, offset: 800)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !225, file: !13, line: 49, baseType: !233, size: 96, offset: 896)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !225, file: !13, line: 50, baseType: !14, size: 32, offset: 992)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !225, file: !13, line: 51, baseType: !14, size: 32, offset: 1024)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !209, file: !208, line: 865, baseType: !224, size: 1088, offset: 7424)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !209, file: !208, line: 867, baseType: !14, size: 32, offset: 8512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !209, file: !208, line: 868, baseType: !14, size: 32, offset: 8544)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !209, file: !208, line: 869, baseType: !254, size: 7744, offset: 8576)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !28, line: 60, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !28, line: 34, size: 7744, elements: !256)
!256 = !{!257, !258, !259, !260, !261, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !255, file: !28, line: 37, baseType: !212, size: 2040)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !255, file: !28, line: 38, baseType: !212, size: 2040, offset: 2040)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !255, file: !28, line: 39, baseType: !212, size: 2040, offset: 4080)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !255, file: !28, line: 40, baseType: !14, size: 32, offset: 6144)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !255, file: !28, line: 41, baseType: !262, size: 32, offset: 6176)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !28, line: 32, baseType: !27)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !255, file: !28, line: 42, baseType: !224, size: 1088, offset: 6208)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !255, file: !28, line: 43, baseType: !14, size: 32, offset: 7296)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !255, file: !28, line: 44, baseType: !14, size: 32, offset: 7328)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !255, file: !28, line: 45, baseType: !14, size: 32, offset: 7360)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !255, file: !28, line: 46, baseType: !14, size: 32, offset: 7392)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !255, file: !28, line: 47, baseType: !14, size: 32, offset: 7424)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !255, file: !28, line: 48, baseType: !14, size: 32, offset: 7456)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !255, file: !28, line: 49, baseType: !14, size: 32, offset: 7488)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !255, file: !28, line: 50, baseType: !14, size: 32, offset: 7520)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !255, file: !28, line: 51, baseType: !14, size: 32, offset: 7552)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !255, file: !28, line: 52, baseType: !14, size: 32, offset: 7584)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !255, file: !28, line: 53, baseType: !14, size: 32, offset: 7616)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !255, file: !28, line: 56, baseType: !276, size: 64, offset: 7680)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !209, file: !208, line: 870, baseType: !254, size: 7744, offset: 16320)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !209, file: !208, line: 871, baseType: !254, size: 7744, offset: 24064)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !209, file: !208, line: 873, baseType: !14, size: 32, offset: 31808)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !209, file: !208, line: 884, baseType: !14, size: 32, offset: 31840)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !209, file: !208, line: 885, baseType: !14, size: 32, offset: 31872)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !209, file: !208, line: 886, baseType: !14, size: 32, offset: 31904)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !209, file: !208, line: 890, baseType: !14, size: 32, offset: 31936)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !209, file: !208, line: 893, baseType: !14, size: 32, offset: 31968)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !209, file: !208, line: 894, baseType: !14, size: 32, offset: 32000)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !209, file: !208, line: 895, baseType: !14, size: 32, offset: 32032)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !209, file: !208, line: 897, baseType: !14, size: 32, offset: 32064)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !209, file: !208, line: 899, baseType: !14, size: 32, offset: 32096)
!289 = !{i32 7, !"Dwarf Version", i32 5}
!290 = !{i32 2, !"Debug Info Version", i32 3}
!291 = !{i32 1, !"wchar_size", i32 4}
!292 = !{i32 8, !"PIC Level", i32 2}
!293 = !{i32 7, !"PIE Level", i32 2}
!294 = !{i32 7, !"uwtable", i32 2}
!295 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!296 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!297 = distinct !DISubprogram(name: "JMDecHelpExit", scope: !10, file: !10, line: 77, type: !298, scopeLine: 78, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9)
!298 = !DISubroutineType(types: !299)
!299 = !{null}
!300 = !DILocation(line: 79, column: 12, scope: !297)
!301 = !DILocation(line: 79, column: 3, scope: !297)
!302 = !DILocation(line: 99, column: 3, scope: !297)
!303 = !DISubprogram(name: "exit", scope: !304, file: !304, line: 624, type: !305, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!304 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!305 = !DISubroutineType(types: !306)
!306 = !{null, !14}
!307 = distinct !DISubprogram(name: "ParseCommand", scope: !10, file: !10, line: 131, type: !308, scopeLine: 132, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !312)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !310, !14, !311}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !333}
!313 = !DILocalVariable(name: "p_Inp", arg: 1, scope: !307, file: !10, line: 131, type: !310)
!314 = !DILocalVariable(name: "ac", arg: 2, scope: !307, file: !10, line: 131, type: !14)
!315 = !DILocalVariable(name: "av", arg: 3, scope: !307, file: !10, line: 131, type: !311)
!316 = !DILocalVariable(name: "content", scope: !307, file: !10, line: 133, type: !99)
!317 = !DILocalVariable(name: "CLcount", scope: !307, file: !10, line: 134, type: !14)
!318 = !DILocalVariable(name: "ContentLen", scope: !307, file: !10, line: 134, type: !14)
!319 = !DILocalVariable(name: "NumberParams", scope: !307, file: !10, line: 134, type: !14)
!320 = !DILocalVariable(name: "filename", scope: !307, file: !10, line: 135, type: !99)
!321 = !DILocalVariable(name: "source", scope: !322, file: !10, line: 264, type: !99)
!322 = distinct !DILexicalBlock(scope: !323, file: !10, line: 263, column: 7)
!323 = distinct !DILexicalBlock(scope: !324, file: !10, line: 243, column: 5)
!324 = distinct !DILexicalBlock(scope: !325, file: !10, line: 242, column: 14)
!325 = distinct !DILexicalBlock(scope: !326, file: !10, line: 236, column: 14)
!326 = distinct !DILexicalBlock(scope: !327, file: !10, line: 230, column: 14)
!327 = distinct !DILexicalBlock(scope: !328, file: !10, line: 225, column: 14)
!328 = distinct !DILexicalBlock(scope: !329, file: !10, line: 220, column: 14)
!329 = distinct !DILexicalBlock(scope: !330, file: !10, line: 215, column: 14)
!330 = distinct !DILexicalBlock(scope: !331, file: !10, line: 210, column: 14)
!331 = distinct !DILexicalBlock(scope: !332, file: !10, line: 199, column: 9)
!332 = distinct !DILexicalBlock(scope: !307, file: !10, line: 193, column: 3)
!333 = !DILocalVariable(name: "destin", scope: !322, file: !10, line: 265, type: !99)
!334 = !DILocation(line: 0, scope: !307)
!335 = !DILocation(line: 137, column: 9, scope: !336)
!336 = distinct !DILexicalBlock(scope: !307, file: !10, line: 137, column: 7)
!337 = !DILocation(line: 137, column: 7, scope: !307)
!338 = !DILocation(line: 139, column: 23, scope: !339)
!339 = distinct !DILexicalBlock(scope: !340, file: !10, line: 139, column: 9)
