; ModuleID = 'ldecod_src/context_ini.c'
source_filename = "ldecod_src/context_ini.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BiContextType = type { i16, i8, i8 }

@INIT_MB_TYPE_I = internal constant [1 x [3 x [11 x [2 x i8]]]] [[3 x [11 x [2 x i8]]] [[11 x [2 x i8]] [[2 x i8] c"\14\F1", [2 x i8] c"\026", [2 x i8] c"\03J", [2 x i8] c"\00@", [2 x i8] c"\E4\7F", [2 x i8] c"\E9h", [2 x i8] c"\FA5", [2 x i8] c"\FF6", [2 x i8] c"\073", [2 x i8] c"\00@", [2 x i8] c"\00@"], [11 x [2 x i8]] [[2 x i8] c"\14\F1", [2 x i8] c"\026", [2 x i8] c"\03J", [2 x i8] c"\14\F1", [2 x i8] c"\026", [2 x i8] c"\03J", [2 x i8] c"\E4\7F", [2 x i8] c"\E9h", [2 x i8] c"\FA5", [2 x i8] c"\FF6", [2 x i8] c"\073"], [11 x [2 x i8]] [[2 x i8] c"\00@", [2 x i8] c"\00@", [2 x i8] c"\00@", [2 x i8] c"\00@", [2 x i8] c"\00@", [2 x i8] c"\00@", [2 x i8] c"\00@", [2 x i8] c"\00@", [2 x i8] c"\00@", [2 x i8] c"\00@", [2 x i8] c"\00@"]]], align 16, !dbg !0

!163 = distinct !DIGlobalVariable(name: "INIT_MAP_P", scope: !2, file: !55, line: 443, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 15840, elements: !165)
!165 = !{!84, !99, !104, !61}
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "INIT_FLD_MAP_P", scope: !2, file: !55, line: 895, type: !168, isLocal: true, isDefinition: true)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 5760, elements: !169)
!169 = !{!84, !109, !104, !61}
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "INIT_FLD_LAST_P", scope: !2, file: !55, line: 951, type: !168, isLocal: true, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "INIT_LAST_P", scope: !2, file: !55, line: 559, type: !164, isLocal: true, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "INIT_ONE_P", scope: !2, file: !55, line: 675, type: !176, isLocal: true, isDefinition: true)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 5280, elements: !177)
!177 = !{!84, !99, !118, !61}
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "INIT_ABS_P", scope: !2, file: !55, line: 791, type: !176, isLocal: true, isDefinition: true)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 528, elements: !181)
!181 = !{!60, !84, !125, !61}
!182 = !{i32 7, !"Dwarf Version", i32 5}
!183 = !{i32 2, !"Debug Info Version", i32 3}
!184 = !{i32 1, !"wchar_size", i32 4}
!185 = !{i32 8, !"PIC Level", i32 2}
!186 = !{i32 7, !"PIE Level", i32 2}
!187 = !{i32 7, !"uwtable", i32 2}
!188 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!189 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!190 = distinct !DISubprogram(name: "init_contexts", scope: !3, file: !3, line: 62, type: !191, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1229)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !195, line: 542, baseType: !196)
!195 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !195, line: 341, size: 109184, elements: !197)
!197 = !{!198, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1057, !1059, !1062, !1065, !1091, !1115, !1118, !1119, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1154, !1155, !1156, !1157, !1158, !1159, !1162, !1163, !1166, !1167, !1169, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1182, !1183, !1184, !1185, !1186, !1188, !1189, !1190, !1194, !1198, !1202, !1206, !1210, !1211, !1212, !1213, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !196, file: !195, line: 343, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !195, line: 566, size: 6855040, elements: !201)
!201 = !{!202, !287, !342, !446, !448, !450, !507, !509, !510, !511, !512, !513, !516, !535, !547, !548, !549, !550, !551, !552, !554, !555, !557, !558, !559, !560, !561, !562, !564, !566, !569, !570, !572, !573, !574, !575, !744, !746, !747, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !862, !863, !864, !865, !866, !867, !868, !869, !870, !872, !873, !874, !877, !881, !884, !886, !887, !890, !893, !894, !895, !899, !902, !905, !906, !907, !908, !909, !910, !913, !914, !916, !919, !920, !921, !922, !925, !930, !934, !939, !943, !944, !948, !949, !953, !954, !958, !979, !980, !983, !984, !985, !986, !987, !988, !989, !990}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !200, file: !195, line: 568, baseType: !203, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !195, line: 850, size: 32128, elements: !205)
!205 = !{!206, !211, !212, !213, !214, !215, !216, !217, !218, !219, !248, !249, !250, !251, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !204, file: !195, line: 852, baseType: !207, size: 2040)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 2040, elements: !209)
!208 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!209 = !{!210}
!210 = !DISubrange(count: 255)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !204, file: !195, line: 853, baseType: !207, size: 2040, offset: 2040)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !204, file: !195, line: 854, baseType: !207, size: 2040, offset: 4080)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !204, file: !195, line: 856, baseType: !7, size: 32, offset: 6144)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !204, file: !195, line: 857, baseType: !7, size: 32, offset: 6176)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !204, file: !195, line: 858, baseType: !7, size: 32, offset: 6208)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !204, file: !195, line: 859, baseType: !7, size: 32, offset: 6240)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !204, file: !195, line: 860, baseType: !7, size: 32, offset: 6272)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !204, file: !195, line: 861, baseType: !7, size: 32, offset: 6304)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !204, file: !195, line: 864, baseType: !220, size: 1088, offset: 6336)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !6, line: 52, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !6, line: 30, size: 1088, elements: !222)
!222 = !{!223, !225, !227, !229, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !221, file: !6, line: 32, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !6, line: 28, baseType: !5)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !221, file: !6, line: 33, baseType: !226, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !6, line: 20, baseType: !14)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !221, file: !6, line: 34, baseType: !228, size: 64, offset: 64)
!228 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !221, file: !6, line: 35, baseType: !230, size: 96, offset: 128)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !231)
!231 = !{!84}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !221, file: !6, line: 36, baseType: !230, size: 96, offset: 224)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !221, file: !6, line: 37, baseType: !7, size: 32, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !221, file: !6, line: 38, baseType: !7, size: 32, offset: 352)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !221, file: !6, line: 39, baseType: !7, size: 32, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !221, file: !6, line: 40, baseType: !7, size: 32, offset: 416)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !221, file: !6, line: 41, baseType: !7, size: 32, offset: 448)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !221, file: !6, line: 42, baseType: !7, size: 32, offset: 480)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !221, file: !6, line: 43, baseType: !7, size: 32, offset: 512)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !221, file: !6, line: 44, baseType: !7, size: 32, offset: 544)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !221, file: !6, line: 45, baseType: !230, size: 96, offset: 576)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !221, file: !6, line: 46, baseType: !7, size: 32, offset: 672)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !221, file: !6, line: 47, baseType: !230, size: 96, offset: 704)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !221, file: !6, line: 48, baseType: !230, size: 96, offset: 800)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !221, file: !6, line: 49, baseType: !230, size: 96, offset: 896)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !221, file: !6, line: 50, baseType: !7, size: 32, offset: 992)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !221, file: !6, line: 51, baseType: !7, size: 32, offset: 1024)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !204, file: !195, line: 865, baseType: !220, size: 1088, offset: 7424)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !204, file: !195, line: 867, baseType: !7, size: 32, offset: 8512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !204, file: !195, line: 868, baseType: !7, size: 32, offset: 8544)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !204, file: !195, line: 869, baseType: !252, size: 7744, offset: 8576)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !21, line: 60, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !21, line: 34, size: 7744, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !253, file: !21, line: 37, baseType: !207, size: 2040)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !253, file: !21, line: 38, baseType: !207, size: 2040, offset: 2040)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !253, file: !21, line: 39, baseType: !207, size: 2040, offset: 4080)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !253, file: !21, line: 40, baseType: !7, size: 32, offset: 6144)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !253, file: !21, line: 41, baseType: !260, size: 32, offset: 6176)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !21, line: 32, baseType: !20)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !253, file: !21, line: 42, baseType: !220, size: 1088, offset: 6208)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !253, file: !21, line: 43, baseType: !7, size: 32, offset: 7296)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !253, file: !21, line: 44, baseType: !7, size: 32, offset: 7328)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !253, file: !21, line: 45, baseType: !7, size: 32, offset: 7360)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !253, file: !21, line: 46, baseType: !7, size: 32, offset: 7392)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !253, file: !21, line: 47, baseType: !7, size: 32, offset: 7424)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !253, file: !21, line: 48, baseType: !7, size: 32, offset: 7456)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !253, file: !21, line: 49, baseType: !7, size: 32, offset: 7488)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !253, file: !21, line: 50, baseType: !7, size: 32, offset: 7520)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !253, file: !21, line: 51, baseType: !7, size: 32, offset: 7552)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !253, file: !21, line: 52, baseType: !7, size: 32, offset: 7584)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !253, file: !21, line: 53, baseType: !7, size: 32, offset: 7616)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !253, file: !21, line: 56, baseType: !274, size: 64, offset: 7680)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !204, file: !195, line: 870, baseType: !252, size: 7744, offset: 16320)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !204, file: !195, line: 871, baseType: !252, size: 7744, offset: 24064)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !204, file: !195, line: 873, baseType: !7, size: 32, offset: 31808)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !204, file: !195, line: 884, baseType: !7, size: 32, offset: 31840)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !204, file: !195, line: 885, baseType: !7, size: 32, offset: 31872)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !204, file: !195, line: 886, baseType: !7, size: 32, offset: 31904)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !204, file: !195, line: 890, baseType: !7, size: 32, offset: 31936)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !204, file: !195, line: 893, baseType: !7, size: 32, offset: 31968)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !204, file: !195, line: 894, baseType: !7, size: 32, offset: 32000)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !204, file: !195, line: 895, baseType: !7, size: 32, offset: 32032)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !204, file: !195, line: 897, baseType: !7, size: 32, offset: 32064)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !204, file: !195, line: 899, baseType: !7, size: 32, offset: 32096)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !200, file: !195, line: 569, baseType: !288, size: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !290, line: 138, baseType: !291)
!290 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 94, size: 17728, elements: !292)
!292 = !{!293, !294, !295, !296, !297, !298, !299, !303, !307, !311, !314, !315, !316, !317, !318, !321, !322, !323, !324, !325, !326, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !291, file: !290, line: 96, baseType: !7, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !291, file: !290, line: 97, baseType: !31, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !291, file: !290, line: 98, baseType: !31, size: 32, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !291, file: !290, line: 99, baseType: !7, size: 32, offset: 96)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !291, file: !290, line: 100, baseType: !7, size: 32, offset: 128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !291, file: !290, line: 102, baseType: !7, size: 32, offset: 160)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !291, file: !290, line: 103, baseType: !300, size: 384, offset: 192)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 384, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 12)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !291, file: !290, line: 104, baseType: !304, size: 3072, offset: 576)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3072, elements: !305)
!305 = !{!72, !306}
!306 = !DISubrange(count: 16)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !291, file: !290, line: 105, baseType: !308, size: 12288, offset: 3648)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 12288, elements: !309)
!309 = !{!72, !310}
!310 = !DISubrange(count: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !291, file: !290, line: 106, baseType: !312, size: 192, offset: 15936)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !313)
!313 = !{!72}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !291, file: !290, line: 107, baseType: !312, size: 192, offset: 16128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !291, file: !290, line: 110, baseType: !7, size: 32, offset: 16320)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !291, file: !290, line: 111, baseType: !31, size: 32, offset: 16352)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !291, file: !290, line: 112, baseType: !31, size: 32, offset: 16384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !291, file: !290, line: 114, baseType: !319, size: 256, offset: 16416)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 256, elements: !320)
!320 = !{!109}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !291, file: !290, line: 116, baseType: !319, size: 256, offset: 16672)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !291, file: !290, line: 117, baseType: !319, size: 256, offset: 16928)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !291, file: !290, line: 119, baseType: !7, size: 32, offset: 17184)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !291, file: !290, line: 120, baseType: !31, size: 32, offset: 17216)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !291, file: !290, line: 122, baseType: !31, size: 32, offset: 17248)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !291, file: !290, line: 123, baseType: !327, size: 64, offset: 17280)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !329, line: 21, baseType: !330)
!329 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!330 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !291, file: !290, line: 125, baseType: !7, size: 32, offset: 17344)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !291, file: !290, line: 126, baseType: !7, size: 32, offset: 17376)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !291, file: !290, line: 127, baseType: !7, size: 32, offset: 17408)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !291, file: !290, line: 128, baseType: !31, size: 32, offset: 17440)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !291, file: !290, line: 129, baseType: !7, size: 32, offset: 17472)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !291, file: !290, line: 130, baseType: !7, size: 32, offset: 17504)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !291, file: !290, line: 131, baseType: !7, size: 32, offset: 17536)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !291, file: !290, line: 133, baseType: !7, size: 32, offset: 17568)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !291, file: !290, line: 135, baseType: !7, size: 32, offset: 17600)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !291, file: !290, line: 136, baseType: !7, size: 32, offset: 17632)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !291, file: !290, line: 137, baseType: !7, size: 32, offset: 17664)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !200, file: !195, line: 570, baseType: !343, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !290, line: 197, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 142, size: 33024, elements: !346)
!346 = !{!347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !444, !445}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !345, file: !290, line: 144, baseType: !7, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !345, file: !290, line: 146, baseType: !31, size: 32, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !345, file: !290, line: 147, baseType: !7, size: 32, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !345, file: !290, line: 148, baseType: !7, size: 32, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !345, file: !290, line: 149, baseType: !7, size: 32, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !345, file: !290, line: 150, baseType: !7, size: 32, offset: 160)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !345, file: !290, line: 152, baseType: !7, size: 32, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !345, file: !290, line: 154, baseType: !31, size: 32, offset: 224)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !345, file: !290, line: 155, baseType: !31, size: 32, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !345, file: !290, line: 156, baseType: !31, size: 32, offset: 288)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !345, file: !290, line: 158, baseType: !7, size: 32, offset: 320)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !345, file: !290, line: 159, baseType: !300, size: 384, offset: 352)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !345, file: !290, line: 160, baseType: !304, size: 3072, offset: 736)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !345, file: !290, line: 161, baseType: !308, size: 12288, offset: 3808)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !345, file: !290, line: 162, baseType: !312, size: 192, offset: 16096)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !345, file: !290, line: 163, baseType: !312, size: 192, offset: 16288)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !345, file: !290, line: 165, baseType: !31, size: 32, offset: 16480)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !345, file: !290, line: 166, baseType: !31, size: 32, offset: 16512)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !345, file: !290, line: 167, baseType: !31, size: 32, offset: 16544)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !345, file: !290, line: 168, baseType: !31, size: 32, offset: 16576)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !345, file: !290, line: 170, baseType: !31, size: 32, offset: 16608)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !345, file: !290, line: 172, baseType: !7, size: 32, offset: 16640)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !345, file: !290, line: 173, baseType: !7, size: 32, offset: 16672)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !345, file: !290, line: 174, baseType: !7, size: 32, offset: 16704)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !345, file: !290, line: 175, baseType: !31, size: 32, offset: 16736)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !345, file: !290, line: 177, baseType: !373, size: 8192, offset: 16768)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !345, file: !290, line: 178, baseType: !31, size: 32, offset: 24960)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !345, file: !290, line: 179, baseType: !7, size: 32, offset: 24992)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !345, file: !290, line: 180, baseType: !31, size: 32, offset: 25024)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !345, file: !290, line: 181, baseType: !31, size: 32, offset: 25056)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !345, file: !290, line: 182, baseType: !7, size: 32, offset: 25088)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !345, file: !290, line: 184, baseType: !7, size: 32, offset: 25120)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !345, file: !290, line: 185, baseType: !7, size: 32, offset: 25152)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !345, file: !290, line: 186, baseType: !7, size: 32, offset: 25184)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !345, file: !290, line: 187, baseType: !31, size: 32, offset: 25216)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !345, file: !290, line: 188, baseType: !31, size: 32, offset: 25248)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !345, file: !290, line: 189, baseType: !31, size: 32, offset: 25280)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !345, file: !290, line: 190, baseType: !31, size: 32, offset: 25312)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !345, file: !290, line: 191, baseType: !7, size: 32, offset: 25344)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !345, file: !290, line: 192, baseType: !390, size: 7584, offset: 25376)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !290, line: 90, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 53, size: 7584, elements: !392)
!392 = !{!393, !394, !395, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !391, file: !290, line: 55, baseType: !7, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !391, file: !290, line: 56, baseType: !31, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !391, file: !290, line: 57, baseType: !396, size: 16, offset: 64)
!396 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !391, file: !290, line: 58, baseType: !396, size: 16, offset: 80)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !391, file: !290, line: 59, baseType: !7, size: 32, offset: 96)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !391, file: !290, line: 60, baseType: !7, size: 32, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !391, file: !290, line: 61, baseType: !7, size: 32, offset: 160)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !391, file: !290, line: 62, baseType: !31, size: 32, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !391, file: !290, line: 63, baseType: !7, size: 32, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !391, file: !290, line: 64, baseType: !7, size: 32, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !391, file: !290, line: 65, baseType: !31, size: 32, offset: 288)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !391, file: !290, line: 66, baseType: !31, size: 32, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !391, file: !290, line: 67, baseType: !31, size: 32, offset: 352)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !391, file: !290, line: 68, baseType: !7, size: 32, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !391, file: !290, line: 69, baseType: !31, size: 32, offset: 416)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !391, file: !290, line: 70, baseType: !31, size: 32, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !391, file: !290, line: 71, baseType: !7, size: 32, offset: 480)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !391, file: !290, line: 72, baseType: !31, size: 32, offset: 512)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !391, file: !290, line: 73, baseType: !31, size: 32, offset: 544)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !391, file: !290, line: 74, baseType: !7, size: 32, offset: 576)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !391, file: !290, line: 75, baseType: !7, size: 32, offset: 608)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !391, file: !290, line: 76, baseType: !416, size: 3296, offset: 640)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !290, line: 50, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 38, size: 3296, elements: !418)
!418 = !{!419, !420, !421, !422, !426, !427, !428, !429, !430, !431}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !417, file: !290, line: 40, baseType: !31, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !417, file: !290, line: 41, baseType: !31, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !417, file: !290, line: 42, baseType: !31, size: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !417, file: !290, line: 43, baseType: !423, size: 1024, offset: 96)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1024, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !417, file: !290, line: 44, baseType: !423, size: 1024, offset: 1120)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !417, file: !290, line: 45, baseType: !423, size: 1024, offset: 2144)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !417, file: !290, line: 46, baseType: !31, size: 32, offset: 3168)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !417, file: !290, line: 47, baseType: !31, size: 32, offset: 3200)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !417, file: !290, line: 48, baseType: !31, size: 32, offset: 3232)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !417, file: !290, line: 49, baseType: !31, size: 32, offset: 3264)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !391, file: !290, line: 77, baseType: !7, size: 32, offset: 3936)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !391, file: !290, line: 78, baseType: !416, size: 3296, offset: 3968)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !391, file: !290, line: 80, baseType: !7, size: 32, offset: 7264)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !391, file: !290, line: 81, baseType: !7, size: 32, offset: 7296)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !391, file: !290, line: 82, baseType: !7, size: 32, offset: 7328)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !391, file: !290, line: 83, baseType: !7, size: 32, offset: 7360)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !391, file: !290, line: 84, baseType: !31, size: 32, offset: 7392)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !391, file: !290, line: 85, baseType: !31, size: 32, offset: 7424)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !391, file: !290, line: 86, baseType: !31, size: 32, offset: 7456)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !391, file: !290, line: 87, baseType: !31, size: 32, offset: 7488)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !391, file: !290, line: 88, baseType: !31, size: 32, offset: 7520)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !391, file: !290, line: 89, baseType: !31, size: 32, offset: 7552)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !345, file: !290, line: 193, baseType: !31, size: 32, offset: 32960)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !345, file: !290, line: 195, baseType: !7, size: 32, offset: 32992)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !200, file: !195, line: 571, baseType: !447, size: 1056768, offset: 192)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 1056768, elements: !424)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !200, file: !195, line: 572, baseType: !449, size: 4538368, offset: 1056960)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !289, size: 4538368, elements: !374)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !200, file: !195, line: 575, baseType: !451, size: 64, offset: 5595328)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !290, line: 256, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !290, line: 228, size: 37312, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !475, !476, !477, !478}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !453, file: !290, line: 230, baseType: !344, size: 33024)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !453, file: !290, line: 232, baseType: !31, size: 32, offset: 33024)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !453, file: !290, line: 233, baseType: !7, size: 32, offset: 33056)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !453, file: !290, line: 234, baseType: !274, size: 64, offset: 33088)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !453, file: !290, line: 235, baseType: !274, size: 64, offset: 33152)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !453, file: !290, line: 236, baseType: !461, size: 64, offset: 33216)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !453, file: !290, line: 237, baseType: !274, size: 64, offset: 33280)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !453, file: !290, line: 238, baseType: !461, size: 64, offset: 33344)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !453, file: !290, line: 240, baseType: !274, size: 64, offset: 33408)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !453, file: !290, line: 241, baseType: !461, size: 64, offset: 33472)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !453, file: !290, line: 242, baseType: !274, size: 64, offset: 33536)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !453, file: !290, line: 243, baseType: !461, size: 64, offset: 33600)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !453, file: !290, line: 245, baseType: !7, size: 32, offset: 33664)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !453, file: !290, line: 246, baseType: !274, size: 64, offset: 33728)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !453, file: !290, line: 247, baseType: !274, size: 64, offset: 33792)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !453, file: !290, line: 248, baseType: !461, size: 64, offset: 33856)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !453, file: !290, line: 249, baseType: !461, size: 64, offset: 33920)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !453, file: !290, line: 250, baseType: !474, size: 64, offset: 33984)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !453, file: !290, line: 251, baseType: !461, size: 64, offset: 34048)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !453, file: !290, line: 253, baseType: !31, size: 32, offset: 34112)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !453, file: !290, line: 254, baseType: !7, size: 32, offset: 34144)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !453, file: !290, line: 255, baseType: !479, size: 3136, offset: 34176)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !290, line: 226, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !290, line: 200, size: 3136, elements: !481)
!481 = !{!482, !483, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !500, !501, !503, !504, !505, !506}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !480, file: !290, line: 202, baseType: !7, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !480, file: !290, line: 203, baseType: !484, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !480, file: !290, line: 204, baseType: !274, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !480, file: !290, line: 205, baseType: !461, size: 64, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !480, file: !290, line: 206, baseType: !484, size: 64, offset: 256)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !480, file: !290, line: 207, baseType: !274, size: 64, offset: 320)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !480, file: !290, line: 208, baseType: !274, size: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !480, file: !290, line: 209, baseType: !484, size: 64, offset: 448)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !480, file: !290, line: 210, baseType: !484, size: 64, offset: 512)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !480, file: !290, line: 211, baseType: !484, size: 64, offset: 576)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !480, file: !290, line: 212, baseType: !484, size: 64, offset: 640)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !480, file: !290, line: 213, baseType: !484, size: 64, offset: 704)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !480, file: !290, line: 216, baseType: !58, size: 8, offset: 768)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !480, file: !290, line: 217, baseType: !58, size: 8, offset: 776)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !480, file: !290, line: 218, baseType: !58, size: 8, offset: 784)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !480, file: !290, line: 219, baseType: !499, size: 1024, offset: 800)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !424)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !480, file: !290, line: 220, baseType: !499, size: 1024, offset: 1824)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !480, file: !290, line: 221, baseType: !502, size: 256, offset: 2848)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 256, elements: !424)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !480, file: !290, line: 222, baseType: !58, size: 8, offset: 3104)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !480, file: !290, line: 223, baseType: !58, size: 8, offset: 3112)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !480, file: !290, line: 224, baseType: !58, size: 8, offset: 3120)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !480, file: !290, line: 225, baseType: !58, size: 8, offset: 3128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !200, file: !195, line: 577, baseType: !508, size: 1193984, offset: 5595392)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 1193984, elements: !424)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !200, file: !195, line: 578, baseType: !7, size: 32, offset: 6789376)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !200, file: !195, line: 579, baseType: !7, size: 32, offset: 6789408)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !200, file: !195, line: 580, baseType: !7, size: 32, offset: 6789440)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !200, file: !195, line: 581, baseType: !7, size: 32, offset: 6789472)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !200, file: !195, line: 584, baseType: !514, size: 64, offset: 6789504)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !195, line: 584, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !200, file: !195, line: 586, baseType: !517, size: 64, offset: 6789568)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !195, line: 902, size: 416, elements: !519)
!519 = !{!520, !521, !522, !523, !524, !525, !528, !529, !530, !531, !532, !533, !534}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !518, file: !195, line: 904, baseType: !31, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !518, file: !195, line: 905, baseType: !31, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !518, file: !195, line: 906, baseType: !7, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !518, file: !195, line: 907, baseType: !31, size: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !518, file: !195, line: 908, baseType: !7, size: 32, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !518, file: !195, line: 909, baseType: !526, size: 64, offset: 160)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !527)
!527 = !{!61}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !518, file: !195, line: 910, baseType: !328, size: 8, offset: 224)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !518, file: !195, line: 911, baseType: !328, size: 8, offset: 232)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !518, file: !195, line: 912, baseType: !7, size: 32, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !518, file: !195, line: 913, baseType: !7, size: 32, offset: 288)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !518, file: !195, line: 915, baseType: !7, size: 32, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !518, file: !195, line: 916, baseType: !7, size: 32, offset: 352)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !518, file: !195, line: 917, baseType: !7, size: 32, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !200, file: !195, line: 587, baseType: !536, size: 64, offset: 6789632)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !195, line: 839, size: 512, elements: !538)
!538 = !{!539, !540, !543, !544, !545, !546}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !537, file: !195, line: 841, baseType: !7, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !537, file: !195, line: 842, baseType: !541, size: 96, offset: 32)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 96, elements: !231)
!542 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !537, file: !195, line: 843, baseType: !541, size: 96, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !537, file: !195, line: 844, baseType: !541, size: 96, offset: 224)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !537, file: !195, line: 845, baseType: !541, size: 96, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !537, file: !195, line: 846, baseType: !541, size: 96, offset: 416)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !200, file: !195, line: 588, baseType: !7, size: 32, offset: 6789696)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !200, file: !195, line: 591, baseType: !31, size: 32, offset: 6789728)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !200, file: !195, line: 592, baseType: !7, size: 32, offset: 6789760)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !200, file: !195, line: 593, baseType: !7, size: 32, offset: 6789792)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !200, file: !195, line: 594, baseType: !7, size: 32, offset: 6789824)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !200, file: !195, line: 595, baseType: !553, size: 64, offset: 6789888)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !200, file: !195, line: 596, baseType: !484, size: 64, offset: 6789952)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block_JV", scope: !200, file: !195, line: 597, baseType: !556, size: 192, offset: 6790016)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 192, elements: !231)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !200, file: !195, line: 601, baseType: !7, size: 32, offset: 6790208)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !200, file: !195, line: 602, baseType: !7, size: 32, offset: 6790240)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !200, file: !195, line: 603, baseType: !7, size: 32, offset: 6790272)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !200, file: !195, line: 604, baseType: !7, size: 32, offset: 6790304)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !200, file: !195, line: 605, baseType: !7, size: 32, offset: 6790336)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !200, file: !195, line: 607, baseType: !563, size: 64, offset: 6790400)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode_JV", scope: !200, file: !195, line: 608, baseType: !565, size: 192, offset: 6790464)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 192, elements: !231)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !200, file: !195, line: 609, baseType: !567, size: 64, offset: 6790656)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "siblock", scope: !200, file: !195, line: 610, baseType: !461, size: 64, offset: 6790720)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "siblock_JV", scope: !200, file: !195, line: 611, baseType: !571, size: 192, offset: 6790784)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 192, elements: !231)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "newframe", scope: !200, file: !195, line: 613, baseType: !7, size: 32, offset: 6790976)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !200, file: !195, line: 614, baseType: !7, size: 32, offset: 6791008)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "pNextSlice", scope: !200, file: !195, line: 617, baseType: !193, size: 64, offset: 6791040)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !200, file: !195, line: 618, baseType: !576, size: 64, offset: 6791104)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !195, line: 273, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !195, line: 197, size: 3840, elements: !579)
!579 = !{!580, !582, !583, !584, !585, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !615, !616, !617, !618, !619, !622, !623, !632, !633, !634, !635, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !661, !662, !685, !699, !743}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !578, file: !195, line: 199, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !578, file: !195, line: 200, baseType: !199, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !578, file: !195, line: 201, baseType: !203, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrX", scope: !578, file: !195, line: 202, baseType: !7, size: 32, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !578, file: !195, line: 203, baseType: !586, size: 32, offset: 224)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockPos", file: !195, line: 112, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 108, size: 32, elements: !588)
!588 = !{!589, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !587, file: !195, line: 110, baseType: !590, size: 16)
!590 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !587, file: !195, line: 111, baseType: !590, size: 16, offset: 16)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !578, file: !195, line: 204, baseType: !7, size: 32, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !578, file: !195, line: 205, baseType: !7, size: 32, offset: 288)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "block_y_aff", scope: !578, file: !195, line: 206, baseType: !7, size: 32, offset: 320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !578, file: !195, line: 207, baseType: !7, size: 32, offset: 352)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !578, file: !195, line: 208, baseType: !7, size: 32, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !578, file: !195, line: 209, baseType: !7, size: 32, offset: 416)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !578, file: !195, line: 210, baseType: !7, size: 32, offset: 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !578, file: !195, line: 212, baseType: !7, size: 32, offset: 480)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !578, file: !195, line: 213, baseType: !7, size: 32, offset: 512)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !578, file: !195, line: 215, baseType: !7, size: 32, offset: 544)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "qpc", scope: !578, file: !195, line: 216, baseType: !526, size: 64, offset: 576)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "qp_scaled", scope: !578, file: !195, line: 217, baseType: !230, size: 96, offset: 640)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "is_lossless", scope: !578, file: !195, line: 218, baseType: !7, size: 32, offset: 736)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !578, file: !195, line: 219, baseType: !7, size: 32, offset: 768)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !578, file: !195, line: 220, baseType: !7, size: 32, offset: 800)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !578, file: !195, line: 221, baseType: !7, size: 32, offset: 832)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !578, file: !195, line: 223, baseType: !590, size: 16, offset: 864)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !578, file: !195, line: 224, baseType: !58, size: 8, offset: 880)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dpl_flag", scope: !578, file: !195, line: 225, baseType: !58, size: 8, offset: 888)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "delta_quant", scope: !578, file: !195, line: 226, baseType: !590, size: 16, offset: 896)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "list_offset", scope: !578, file: !195, line: 227, baseType: !590, size: 16, offset: 912)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mb_up", scope: !578, file: !195, line: 229, baseType: !614, size: 64, offset: 960)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mb_left", scope: !578, file: !195, line: 230, baseType: !614, size: 64, offset: 1024)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mbup", scope: !578, file: !195, line: 232, baseType: !614, size: 64, offset: 1088)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "mbleft", scope: !578, file: !195, line: 233, baseType: !614, size: 64, offset: 1152)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !578, file: !195, line: 236, baseType: !590, size: 16, offset: 1216)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !578, file: !195, line: 237, baseType: !620, size: 1024, offset: 1232)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 1024, elements: !621)
!621 = !{!61, !77, !77, !61}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !578, file: !195, line: 239, baseType: !7, size: 32, offset: 2272)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !578, file: !195, line: 240, baseType: !624, size: 192, offset: 2304)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !625, size: 192, elements: !231)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !626, line: 103, baseType: !627)
!626 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !628, line: 27, baseType: !629)
!628 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !630, line: 44, baseType: !631)
!630 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!631 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !578, file: !195, line: 241, baseType: !624, size: 192, offset: 2496)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits_8x8", scope: !578, file: !195, line: 242, baseType: !624, size: 192, offset: 2688)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "i16mode", scope: !578, file: !195, line: 244, baseType: !7, size: 32, offset: 2880)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !578, file: !195, line: 245, baseType: !636, size: 32, offset: 2912)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !637)
!637 = !{!77}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !578, file: !195, line: 246, baseType: !636, size: 32, offset: 2944)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ipmode_DPCM", scope: !578, file: !195, line: 247, baseType: !58, size: 8, offset: 2976)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !578, file: !195, line: 248, baseType: !58, size: 8, offset: 2984)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !578, file: !195, line: 249, baseType: !58, size: 8, offset: 2992)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "DFDisableIdc", scope: !578, file: !195, line: 250, baseType: !590, size: 16, offset: 3008)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "DFAlphaC0Offset", scope: !578, file: !195, line: 251, baseType: !590, size: 16, offset: 3024)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "DFBetaOffset", scope: !578, file: !195, line: 252, baseType: !590, size: 16, offset: 3040)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !578, file: !195, line: 254, baseType: !7, size: 32, offset: 3072)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !578, file: !195, line: 256, baseType: !7, size: 32, offset: 3104)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !578, file: !195, line: 256, baseType: !7, size: 32, offset: 3136)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !578, file: !195, line: 256, baseType: !7, size: 32, offset: 3168)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !578, file: !195, line: 256, baseType: !7, size: 32, offset: 3200)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !578, file: !195, line: 257, baseType: !7, size: 32, offset: 3232)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !578, file: !195, line: 257, baseType: !7, size: 32, offset: 3264)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !578, file: !195, line: 257, baseType: !7, size: 32, offset: 3296)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !578, file: !195, line: 257, baseType: !7, size: 32, offset: 3328)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !578, file: !195, line: 259, baseType: !7, size: 32, offset: 3360)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !578, file: !195, line: 260, baseType: !7, size: 32, offset: 3392)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_4x4", scope: !578, file: !195, line: 262, baseType: !657, size: 64, offset: 3456)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !614, !660, !7, !7}
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorPlane", file: !30, line: 32, baseType: !29)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_8x8", scope: !578, file: !195, line: 263, baseType: !657, size: 64, offset: 3520)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "GetMVPredictor", scope: !578, file: !195, line: 265, baseType: !663, size: 64, offset: 3584)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !614, !666, !676, !590, !682, !7, !7, !7, !7, !7}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !195, line: 85, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !195, line: 77, size: 128, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !668, file: !195, line: 79, baseType: !7, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !668, file: !195, line: 80, baseType: !7, size: 32, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !668, file: !195, line: 81, baseType: !590, size: 16, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !668, file: !195, line: 82, baseType: !590, size: 16, offset: 80)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !668, file: !195, line: 83, baseType: !590, size: 16, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !668, file: !195, line: 84, baseType: !590, size: 16, offset: 112)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !195, line: 104, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 100, size: 32, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !678, file: !195, line: 102, baseType: !590, size: 16)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !678, file: !195, line: 103, baseType: !590, size: 16, offset: 16)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !195, line: 53, flags: DIFlagFwdDecl)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "read_and_store_CBP_block_bit", scope: !578, file: !195, line: 268, baseType: !686, size: 64, offset: 3648)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{!7, !614, !689, !7}
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironmentPtr", file: !195, line: 97, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !195, line: 95, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !195, line: 88, size: 256, elements: !693)
!693 = !{!694, !695, !696, !697, !698}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !692, file: !195, line: 90, baseType: !31, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !692, file: !195, line: 91, baseType: !31, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !692, file: !195, line: 92, baseType: !7, size: 32, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !692, file: !195, line: 93, baseType: !327, size: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !692, file: !195, line: 94, baseType: !274, size: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "readRefPictureIdx", scope: !578, file: !195, line: 269, baseType: !700, size: 64, offset: 3712)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DISubroutineType(types: !702)
!702 = !{!58, !614, !703, !722, !58, !7}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !195, line: 276, size: 384, elements: !705)
!705 = !{!706, !707, !708, !709, !710, !711, !712, !713, !714, !718}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !704, file: !195, line: 278, baseType: !7, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !704, file: !195, line: 279, baseType: !7, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !704, file: !195, line: 280, baseType: !7, size: 32, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !704, file: !195, line: 281, baseType: !7, size: 32, offset: 96)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !704, file: !195, line: 282, baseType: !7, size: 32, offset: 128)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !704, file: !195, line: 283, baseType: !31, size: 32, offset: 160)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !704, file: !195, line: 284, baseType: !7, size: 32, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !704, file: !195, line: 285, baseType: !7, size: 32, offset: 224)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !704, file: !195, line: 293, baseType: !715, size: 64, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !7, !7, !274, !274}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !704, file: !195, line: 295, baseType: !719, size: 64, offset: 320)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !576, !703, !689}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !195, line: 314, size: 384, elements: !724)
!724 = !{!725, !736, !737}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !723, file: !195, line: 317, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !195, line: 47, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream", file: !195, line: 300, size: 256, elements: !729)
!729 = !{!730, !731, !732, !733, !734, !735}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "read_len", scope: !728, file: !195, line: 303, baseType: !7, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !728, file: !195, line: 304, baseType: !7, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bitoffset", scope: !728, file: !195, line: 306, baseType: !7, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_length", scope: !728, file: !195, line: 307, baseType: !7, size: 32, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !728, file: !195, line: 309, baseType: !327, size: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !728, file: !195, line: 310, baseType: !7, size: 32, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "de_cabac", scope: !723, file: !195, line: 318, baseType: !691, size: 256, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "readSyntaxElement", scope: !723, file: !195, line: 320, baseType: !738, size: 64, offset: 320)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!7, !576, !741, !722}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !195, line: 296, baseType: !704)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mixedModeEdgeFlag", scope: !578, file: !195, line: 272, baseType: !328, size: 8, offset: 3776)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data_JV", scope: !200, file: !195, line: 619, baseType: !745, size: 192, offset: 6791168)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 192, elements: !231)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaArrayType", scope: !200, file: !195, line: 621, baseType: !7, size: 32, offset: 6791360)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_head", scope: !200, file: !195, line: 626, baseType: !748, size: 64, offset: 6791424)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !195, line: 626, flags: DIFlagFwdDecl)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_end", scope: !200, file: !195, line: 627, baseType: !748, size: 64, offset: 6791488)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !200, file: !195, line: 629, baseType: !31, size: 32, offset: 6791552)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "non_conforming_stream", scope: !200, file: !195, line: 630, baseType: !7, size: 32, offset: 6791584)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntMsb", scope: !200, file: !195, line: 634, baseType: !7, size: 32, offset: 6791616)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntLsb", scope: !200, file: !195, line: 635, baseType: !31, size: 32, offset: 6791648)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedPicOrderCnt", scope: !200, file: !195, line: 638, baseType: !7, size: 32, offset: 6791680)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntCycleCnt", scope: !200, file: !195, line: 638, baseType: !7, size: 32, offset: 6791712)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumInPicOrderCntCycle", scope: !200, file: !195, line: 638, baseType: !7, size: 32, offset: 6791744)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNum", scope: !200, file: !195, line: 639, baseType: !31, size: 32, offset: 6791776)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumOffset", scope: !200, file: !195, line: 639, baseType: !31, size: 32, offset: 6791808)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDeltaPerPicOrderCntCycle", scope: !200, file: !195, line: 640, baseType: !7, size: 32, offset: 6791840)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !200, file: !195, line: 641, baseType: !7, size: 32, offset: 6791872)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNumOffset", scope: !200, file: !195, line: 642, baseType: !7, size: 32, offset: 6791904)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFrameNum", scope: !200, file: !195, line: 645, baseType: !7, size: 32, offset: 6791936)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !200, file: !195, line: 647, baseType: !31, size: 32, offset: 6791968)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !200, file: !195, line: 648, baseType: !31, size: 32, offset: 6792000)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !200, file: !195, line: 649, baseType: !31, size: 32, offset: 6792032)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !200, file: !195, line: 650, baseType: !31, size: 32, offset: 6792064)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !200, file: !195, line: 651, baseType: !31, size: 32, offset: 6792096)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !200, file: !195, line: 652, baseType: !31, size: 32, offset: 6792128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "oldFrameSizeInMbs", scope: !200, file: !195, line: 653, baseType: !31, size: 32, offset: 6792160)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !200, file: !195, line: 655, baseType: !7, size: 32, offset: 6792192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !200, file: !195, line: 657, baseType: !7, size: 32, offset: 6792224)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !200, file: !195, line: 658, baseType: !7, size: 32, offset: 6792256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_bitsize_on_disk", scope: !200, file: !195, line: 661, baseType: !7, size: 32, offset: 6792288)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !200, file: !195, line: 662, baseType: !590, size: 16, offset: 6792320)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !200, file: !195, line: 663, baseType: !590, size: 16, offset: 6792336)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_scale", scope: !200, file: !195, line: 664, baseType: !526, size: 64, offset: 6792352)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !200, file: !195, line: 665, baseType: !7, size: 32, offset: 6792416)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !200, file: !195, line: 666, baseType: !7, size: 32, offset: 6792448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value_comp", scope: !200, file: !195, line: 667, baseType: !781, size: 96, offset: 6792480)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 96, elements: !231)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "max_pel_value_comp", scope: !200, file: !195, line: 668, baseType: !230, size: 96, offset: 6792576)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !200, file: !195, line: 670, baseType: !7, size: 32, offset: 6792672)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !200, file: !195, line: 671, baseType: !7, size: 32, offset: 6792704)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !200, file: !195, line: 672, baseType: !7, size: 32, offset: 6792736)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !200, file: !195, line: 673, baseType: !7, size: 32, offset: 6792768)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "num_uv_blocks", scope: !200, file: !195, line: 674, baseType: !7, size: 32, offset: 6792800)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !200, file: !195, line: 675, baseType: !7, size: 32, offset: 6792832)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !200, file: !195, line: 676, baseType: !7, size: 32, offset: 6792864)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !200, file: !195, line: 677, baseType: !7, size: 32, offset: 6792896)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x_blk", scope: !200, file: !195, line: 678, baseType: !7, size: 32, offset: 6792928)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y_blk", scope: !200, file: !195, line: 679, baseType: !7, size: 32, offset: 6792960)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !200, file: !195, line: 680, baseType: !794, size: 192, offset: 6792992)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !795)
!795 = !{!84, !61}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_blk", scope: !200, file: !195, line: 681, baseType: !794, size: 192, offset: 6793184)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_shift", scope: !200, file: !195, line: 682, baseType: !794, size: 192, offset: 6793376)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_x", scope: !200, file: !195, line: 683, baseType: !7, size: 32, offset: 6793568)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_y", scope: !200, file: !195, line: 684, baseType: !7, size: 32, offset: 6793600)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_x", scope: !200, file: !195, line: 685, baseType: !7, size: 32, offset: 6793632)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_y", scope: !200, file: !195, line: 686, baseType: !7, size: 32, offset: 6793664)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "total_scale", scope: !200, file: !195, line: 687, baseType: !7, size: 32, offset: 6793696)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "max_vmv_r", scope: !200, file: !195, line: 689, baseType: !7, size: 32, offset: 6793728)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "idr_psnr_number", scope: !200, file: !195, line: 692, baseType: !7, size: 32, offset: 6793760)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "psnr_number", scope: !200, file: !195, line: 693, baseType: !7, size: 32, offset: 6793792)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "last_ref_pic_poc", scope: !200, file: !195, line: 700, baseType: !7, size: 32, offset: 6793824)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !200, file: !195, line: 701, baseType: !7, size: 32, offset: 6793856)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !200, file: !195, line: 702, baseType: !7, size: 32, offset: 6793888)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !200, file: !195, line: 703, baseType: !7, size: 32, offset: 6793920)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "earlier_missing_poc", scope: !200, file: !195, line: 704, baseType: !7, size: 32, offset: 6793952)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_conceal", scope: !200, file: !195, line: 705, baseType: !31, size: 32, offset: 6793984)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "IDR_concealment_flag", scope: !200, file: !195, line: 706, baseType: !7, size: 32, offset: 6794016)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_slice_type", scope: !200, file: !195, line: 707, baseType: !7, size: 32, offset: 6794048)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point", scope: !200, file: !195, line: 710, baseType: !7, size: 32, offset: 6794080)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point_found", scope: !200, file: !195, line: 711, baseType: !7, size: 32, offset: 6794112)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_cnt", scope: !200, file: !195, line: 712, baseType: !7, size: 32, offset: 6794144)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_num", scope: !200, file: !195, line: 713, baseType: !7, size: 32, offset: 6794176)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_poc", scope: !200, file: !195, line: 714, baseType: !7, size: 32, offset: 6794208)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !200, file: !195, line: 716, baseType: !7, size: 32, offset: 6794240)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !200, file: !195, line: 717, baseType: !7, size: 32, offset: 6794272)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !200, file: !195, line: 719, baseType: !327, size: 64, offset: 6794304)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !200, file: !195, line: 720, baseType: !327, size: 64, offset: 6794368)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "imgData", scope: !200, file: !195, line: 722, baseType: !824, size: 2560, offset: 6794432)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageData", file: !825, line: 38, baseType: !826)
!825 = !DIFile(filename: "ldecod_src/inc/io_image.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "8caef624e6f5391b0c6ab2984e7f77c6")
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "image_data", file: !825, line: 20, size: 2560, elements: !827)
!827 = !{!828, !829, !835, !836, !837, !841, !842, !843, !844, !845}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !826, file: !825, line: 22, baseType: !220, size: 1088)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "frm_data", scope: !826, file: !825, line: 24, baseType: !830, size: 192, offset: 1088)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, size: 192, elements: !231)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !329, line: 41, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !329, line: 23, baseType: !396)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "top_data", scope: !826, file: !825, line: 25, baseType: !830, size: 192, offset: 1280)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "bot_data", scope: !826, file: !825, line: 26, baseType: !830, size: 192, offset: 1472)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "frm_uint16", scope: !826, file: !825, line: 31, baseType: !838, size: 192, offset: 1664)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !839, size: 192, elements: !231)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "top_uint16", scope: !826, file: !825, line: 32, baseType: !838, size: 192, offset: 1856)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "bot_uint16", scope: !826, file: !825, line: 33, baseType: !838, size: 192, offset: 2048)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "frm_stride", scope: !826, file: !825, line: 35, baseType: !230, size: 96, offset: 2240)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "top_stride", scope: !826, file: !825, line: 36, baseType: !230, size: 96, offset: 2336)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "bot_stride", scope: !826, file: !825, line: 37, baseType: !230, size: 96, offset: 2432)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "imgData0", scope: !200, file: !195, line: 723, baseType: !824, size: 2560, offset: 6796992)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "imgData1", scope: !200, file: !195, line: 724, baseType: !824, size: 2560, offset: 6799552)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "imgData2", scope: !200, file: !195, line: 725, baseType: !824, size: 2560, offset: 6802112)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "imgData32", scope: !200, file: !195, line: 728, baseType: !824, size: 2560, offset: 6804672)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "imgData4", scope: !200, file: !195, line: 729, baseType: !824, size: 2560, offset: 6807232)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "imgData5", scope: !200, file: !195, line: 730, baseType: !824, size: 2560, offset: 6809792)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "imgData6", scope: !200, file: !195, line: 731, baseType: !824, size: 2560, offset: 6812352)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "previous_frame_num", scope: !200, file: !195, line: 735, baseType: !31, size: 32, offset: 6814912)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "Is_primary_correct", scope: !200, file: !195, line: 737, baseType: !7, size: 32, offset: 6814944)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Is_redundant_correct", scope: !200, file: !195, line: 738, baseType: !7, size: 32, offset: 6814976)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tot_time", scope: !200, file: !195, line: 741, baseType: !625, size: 64, offset: 6815040)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "p_out", scope: !200, file: !195, line: 744, baseType: !7, size: 32, offset: 6815104)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "p_out_mvc", scope: !200, file: !195, line: 746, baseType: !859, size: 32768, offset: 6815136)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32768, elements: !860)
!860 = !{!861}
!861 = !DISubrange(count: 1024)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "p_ref", scope: !200, file: !195, line: 748, baseType: !7, size: 32, offset: 6847904)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessUnitExists", scope: !200, file: !195, line: 751, baseType: !7, size: 32, offset: 6847936)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "NALUCount", scope: !200, file: !195, line: 752, baseType: !7, size: 32, offset: 6847968)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "Bframe_ctr", scope: !200, file: !195, line: 755, baseType: !7, size: 32, offset: 6848000)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "frame_no", scope: !200, file: !195, line: 756, baseType: !7, size: 32, offset: 6848032)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "g_nFrame", scope: !200, file: !195, line: 758, baseType: !7, size: 32, offset: 6848064)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "global_init_done", scope: !200, file: !195, line: 759, baseType: !7, size: 32, offset: 6848096)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ref", scope: !200, file: !195, line: 762, baseType: !831, size: 64, offset: 6848128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV_ref", scope: !200, file: !195, line: 763, baseType: !871, size: 64, offset: 6848192)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "qp_per_matrix", scope: !200, file: !195, line: 765, baseType: !274, size: 64, offset: 6848256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "qp_rem_matrix", scope: !200, file: !195, line: 766, baseType: !274, size: 64, offset: 6848320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "last_out_fs", scope: !200, file: !195, line: 768, baseType: !875, size: 64, offset: 6848384)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !195, line: 514, flags: DIFlagFwdDecl)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "pocs_in_dpb", scope: !200, file: !195, line: 769, baseType: !878, size: 3200, offset: 6848448)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3200, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 100)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture", scope: !200, file: !195, line: 771, baseType: !882, size: 64, offset: 6851648)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !195, line: 141, flags: DIFlagFwdDecl)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture_JV", scope: !200, file: !195, line: 772, baseType: !885, size: 192, offset: 6851712)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 192, elements: !231)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "no_reference_picture", scope: !200, file: !195, line: 773, baseType: !882, size: 64, offset: 6851904)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "erc_object_list", scope: !200, file: !195, line: 776, baseType: !888, size: 64, offset: 6851968)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "object_buffer", file: !195, line: 776, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "erc_errorVar", scope: !200, file: !195, line: 777, baseType: !891, size: 64, offset: 6852032)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DICompositeType(tag: DW_TAG_structure_type, name: "ercVariables_s", file: !195, line: 777, flags: DIFlagFwdDecl)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "erc_mvperMB", scope: !200, file: !195, line: 779, baseType: !7, size: 32, offset: 6852096)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "erc_img", scope: !200, file: !195, line: 780, baseType: !199, size: 64, offset: 6852160)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ec_flag", scope: !200, file: !195, line: 781, baseType: !896, size: 640, offset: 6852224)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 640, elements: !897)
!897 = !{!898}
!898 = !DISubrange(count: 20)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "annex_b", scope: !200, file: !195, line: 783, baseType: !900, size: 64, offset: 6852864)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "annex_b_struct", file: !195, line: 783, flags: DIFlagFwdDecl)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "bitsfile", scope: !200, file: !195, line: 784, baseType: !903, size: 64, offset: 6852928)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "sBitsFile", file: !195, line: 784, flags: DIFlagFwdDecl)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "out_buffer", scope: !200, file: !195, line: 786, baseType: !875, size: 64, offset: 6852992)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output", scope: !200, file: !195, line: 788, baseType: !882, size: 64, offset: 6853056)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output_state", scope: !200, file: !195, line: 789, baseType: !7, size: 32, offset: 6853120)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_flag", scope: !200, file: !195, line: 790, baseType: !7, size: 32, offset: 6853152)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "BitStreamFile", scope: !200, file: !195, line: 792, baseType: !7, size: 32, offset: 6853184)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !200, file: !195, line: 794, baseType: !911, size: 64, offset: 6853248)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !195, line: 350, flags: DIFlagFwdDecl)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb_legacy", scope: !200, file: !195, line: 795, baseType: !911, size: 64, offset: 6853312)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb_layer", scope: !200, file: !195, line: 796, baseType: !915, size: 128, offset: 6853376)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 128, elements: !527)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "cslice_type", scope: !200, file: !195, line: 800, baseType: !917, size: 72, offset: 6853504)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 72, elements: !918)
!918 = !{!62}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "MbToSliceGroupMap", scope: !200, file: !195, line: 802, baseType: !274, size: 64, offset: 6853632)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "MapUnitToSliceGroupMap", scope: !200, file: !195, line: 803, baseType: !274, size: 64, offset: 6853696)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSliceGroups", scope: !200, file: !195, line: 804, baseType: !7, size: 32, offset: 6853760)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "seiToneMapping", scope: !200, file: !195, line: 807, baseType: !923, size: 64, offset: 6853824)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DICompositeType(tag: DW_TAG_structure_type, name: "tone_mapping_struct_s", file: !195, line: 807, flags: DIFlagFwdDecl)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "buf2img", scope: !200, file: !195, line: 810, baseType: !926, size: 64, offset: 6853888)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !831, !929, !7, !7, !7, !7, !7, !7}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "getNeighbour", scope: !200, file: !195, line: 811, baseType: !931, size: 64, offset: 6853952)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{null, !576, !7, !7, !274, !666}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "get_mb_block_pos", scope: !200, file: !195, line: 812, baseType: !935, size: 64, offset: 6854016)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !7, !938, !938}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "GetStrengthVer", scope: !200, file: !195, line: 813, baseType: !940, size: 64, offset: 6854080)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !327, !576, !7, !7, !882}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "GetStrengthHor", scope: !200, file: !195, line: 814, baseType: !940, size: 64, offset: 6854144)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "EdgeLoopLumaVer", scope: !200, file: !195, line: 815, baseType: !945, size: 64, offset: 6854208)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{null, !660, !831, !327, !576, !7, !882}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "EdgeLoopLumaHor", scope: !200, file: !195, line: 816, baseType: !945, size: 64, offset: 6854272)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "EdgeLoopChromaVer", scope: !200, file: !195, line: 817, baseType: !950, size: 64, offset: 6854336)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !831, !327, !576, !7, !7, !882}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "EdgeLoopChromaHor", scope: !200, file: !195, line: 818, baseType: !950, size: 64, offset: 6854400)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "img2buf", scope: !200, file: !195, line: 819, baseType: !955, size: 64, offset: 6854464)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !831, !929, !7, !7, !7, !7, !7, !7, !7, !7}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "pDecOuputPic", scope: !200, file: !195, line: 821, baseType: !959, size: 64, offset: 6854528)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodedPicList", file: !195, line: 561, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decodedpic_t", file: !195, line: 544, size: 640, elements: !962)
!962 = !{!963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "bValid", scope: !961, file: !195, line: 546, baseType: !7, size: 32)
