; ModuleID = 'ldecod_src/erc_api.c'
source_filename = "ldecod_src/erc_api.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ercSegment_s = type { i16, i16, i8 }

@.str = private unnamed_addr constant [25 x i8] c"ercInit: erc_object_list\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [18 x i8] c"ercOpen: errorVar\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [29 x i8] c"ercReset: errorVar->segments\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [31 x i8] c"ercReset: errorVar->yCondition\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [40 x i8] c"ercReset: errorVar->prevFrameYCondition\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [31 x i8] c"ercReset: errorVar->uCondition\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [31 x i8] c"ercReset: errorVar->vCondition\00", align 1, !dbg !29

; Function Attrs: nounwind uwtable
define dso_local void @ercInit(ptr nocapture noundef %p_Vid, i32 noundef %pic_sizex, i32 noundef %pic_sizey, i32 noundef %flag) local_unnamed_addr #0 !dbg !124 {
entry:
    #dbg_value(ptr %p_Vid, !1304, !DIExpression(), !1308)
    #dbg_value(i32 %pic_sizex, !1305, !DIExpression(), !1308)
    #dbg_value(i32 %pic_sizey, !1306, !DIExpression(), !1308)
    #dbg_value(i32 %flag, !1307, !DIExpression(), !1308)

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 33, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "ldecod_src/erc_api.c", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "075226c332d2e09c07e96a75f8b59424")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 25)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 55, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 18)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 112, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 29)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 117, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 31)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 119, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 40)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 121, type: !19, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(scope: null, file: !2, line: 123, type: !19, isLocal: true, isDefinition: true)
!31 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !32, retainedTypes: !72, globals: !115, splitDebugInlining: false, nameTableKind: None)
!32 = !{!33, !42, !48, !57, !64}
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 22, baseType: !35, size: 32, elements: !36)
!34 = !DIFile(filename: "ldecod_src/inc/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "fd6ca9e1c707932f749220576db72b57")
!35 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIEnumerator(name: "CF_UNKNOWN", value: -1)
!38 = !DIEnumerator(name: "YUV400", value: 0)
!39 = !DIEnumerator(name: "YUV420", value: 1)
!40 = !DIEnumerator(name: "YUV422", value: 2)
!41 = !DIEnumerator(name: "YUV444", value: 3)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 15, baseType: !35, size: 32, elements: !43)
!43 = !{!44, !45, !46, !47}
!44 = !DIEnumerator(name: "CM_UNKNOWN", value: -1)
!45 = !DIEnumerator(name: "CM_YUV", value: 0)
!46 = !DIEnumerator(name: "CM_RGB", value: 1)
!47 = !DIEnumerator(name: "CM_XYZ", value: 2)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 25, baseType: !35, size: 32, elements: !50)
!49 = !DIFile(filename: "ldecod_src/inc/io_video.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1141c07f1801ad27d87214c419749431")
!50 = !{!51, !52, !53, !54, !55, !56}
!51 = !DIEnumerator(name: "VIDEO_UNKNOWN", value: -1)
!52 = !DIEnumerator(name: "VIDEO_YUV", value: 0)
!53 = !DIEnumerator(name: "VIDEO_RGB", value: 1)
!54 = !DIEnumerator(name: "VIDEO_XYZ", value: 2)
!55 = !DIEnumerator(name: "VIDEO_TIFF", value: 3)
!56 = !DIEnumerator(name: "VIDEO_AVI", value: 4)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !58, line: 135, baseType: !59, size: 32, elements: !60)
!58 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!59 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!60 = !{!61, !62, !63}
!61 = !DIEnumerator(name: "FRAME", value: 0)
!62 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!63 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !58, line: 22, baseType: !59, size: 32, elements: !65)
!65 = !{!66, !67, !68, !69, !70, !71}
!66 = !DIEnumerator(name: "PLANE_Y", value: 0)
!67 = !DIEnumerator(name: "PLANE_U", value: 1)
!68 = !DIEnumerator(name: "PLANE_V", value: 2)
!69 = !DIEnumerator(name: "PLANE_G", value: 0)
!70 = !DIEnumerator(name: "PLANE_B", value: 1)
!71 = !DIEnumerator(name: "PLANE_R", value: 2)
!72 = !{!73, !88, !89, !102, !97, !107}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "objectBuffer_t", file: !75, line: 49, baseType: !76)
!75 = !DIFile(filename: "ldecod_src/inc/erc_globals.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c27fab662deb7c381592b003d3b76fc7")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_buffer", file: !75, line: 42, size: 192, elements: !77)
!77 = !{!78, !82, !83, !84}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "regionMode", scope: !76, file: !75, line: 44, baseType: !79, size: 8)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !80, line: 21, baseType: !81)
!80 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!81 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "xMin", scope: !76, file: !75, line: 45, baseType: !35, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "yMin", scope: !76, file: !75, line: 46, baseType: !35, size: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !76, file: !75, line: 47, baseType: !85, size: 96, offset: 96)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 96, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 3)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ercVariables_t", file: !91, line: 108, baseType: !92)
!91 = !DIFile(filename: "ldecod_src/inc/erc_api.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "9f38a583d5066807e951e2b61474101e")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ercVariables_s", file: !91, line: 79, size: 576, elements: !93)
!93 = !{!94, !95, !96, !99, !100, !101, !110, !111, !112, !113, !114}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "nOfMBs", scope: !92, file: !91, line: 82, baseType: !35, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "nOfSegments", scope: !92, file: !91, line: 84, baseType: !35, size: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "yCondition", scope: !92, file: !91, line: 87, baseType: !97, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "uCondition", scope: !92, file: !91, line: 89, baseType: !97, size: 64, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "vCondition", scope: !92, file: !91, line: 91, baseType: !97, size: 64, offset: 192)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "segments", scope: !92, file: !91, line: 94, baseType: !102, size: 64, offset: 256)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ercSegment_t", file: !91, line: 76, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ercSegment_s", file: !91, line: 71, size: 48, elements: !105)
!105 = !{!106, !108, !109}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "startMBPos", scope: !104, file: !91, line: 73, baseType: !107, size: 16)
!107 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "endMBPos", scope: !104, file: !91, line: 74, baseType: !107, size: 16, offset: 16)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "fCorrupted", scope: !104, file: !91, line: 75, baseType: !98, size: 8, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "currSegment", scope: !92, file: !91, line: 95, baseType: !35, size: 32, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "prevFrameYCondition", scope: !92, file: !91, line: 98, baseType: !97, size: 64, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "currSegmentCorrupted", scope: !92, file: !91, line: 101, baseType: !35, size: 32, offset: 448)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "nOfCorruptedSegments", scope: !92, file: !91, line: 103, baseType: !35, size: 32, offset: 480)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "concealment", scope: !92, file: !91, line: 106, baseType: !35, size: 32, offset: 512)
!115 = !{!0, !7, !12, !17, !22, !27, !29}
!116 = !{i32 7, !"Dwarf Version", i32 5}
!117 = !{i32 2, !"Debug Info Version", i32 3}
!118 = !{i32 1, !"wchar_size", i32 4}
!119 = !{i32 8, !"PIC Level", i32 2}
!120 = !{i32 7, !"PIE Level", i32 2}
!121 = !{i32 7, !"uwtable", i32 2}
!122 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!123 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!124 = distinct !DISubprogram(name: "ercInit", scope: !2, file: !2, line: 29, type: !125, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !31, retainedNodes: !1303)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !127, !35, !35, !35}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !129, line: 836, baseType: !130)
!129 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !129, line: 566, size: 6855040, elements: !131)
!131 = !{!132, !214, !268, !372, !374, !376, !432, !434, !435, !436, !437, !438, !441, !461, !473, !474, !475, !476, !477, !478, !1048, !1049, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1059, !1062, !1063, !1065, !1066, !1067, !1068, !1069, !1071, !1072, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1200, !1201, !1203, !1204, !1206, !1208, !1209, !1210, !1214, !1217, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1229, !1232, !1233, !1234, !1235, !1238, !1243, !1247, !1251, !1255, !1256, !1260, !1261, !1265, !1266, !1270, !1291, !1292, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !130, file: !129, line: 568, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !129, line: 850, size: 32128, elements: !135)
!135 = !{!136, !140, !141, !142, !143, !144, !145, !146, !147, !148, !175, !176, !177, !178, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !134, file: !129, line: 852, baseType: !137, size: 2040)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 255)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !134, file: !129, line: 853, baseType: !137, size: 2040, offset: 2040)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !134, file: !129, line: 854, baseType: !137, size: 2040, offset: 4080)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !134, file: !129, line: 856, baseType: !35, size: 32, offset: 6144)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !134, file: !129, line: 857, baseType: !35, size: 32, offset: 6176)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !134, file: !129, line: 858, baseType: !35, size: 32, offset: 6208)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !134, file: !129, line: 859, baseType: !35, size: 32, offset: 6240)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !134, file: !129, line: 860, baseType: !35, size: 32, offset: 6272)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !134, file: !129, line: 861, baseType: !35, size: 32, offset: 6304)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !134, file: !129, line: 864, baseType: !149, size: 1088, offset: 6336)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !34, line: 52, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !34, line: 30, size: 1088, elements: !151)
!151 = !{!152, !154, !156, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !150, file: !34, line: 32, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !34, line: 28, baseType: !33)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !150, file: !34, line: 33, baseType: !155, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !34, line: 20, baseType: !42)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !150, file: !34, line: 34, baseType: !157, size: 64, offset: 64)
!157 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !150, file: !34, line: 35, baseType: !85, size: 96, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !150, file: !34, line: 36, baseType: !85, size: 96, offset: 224)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !150, file: !34, line: 37, baseType: !35, size: 32, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !150, file: !34, line: 38, baseType: !35, size: 32, offset: 352)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !150, file: !34, line: 39, baseType: !35, size: 32, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !150, file: !34, line: 40, baseType: !35, size: 32, offset: 416)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !150, file: !34, line: 41, baseType: !35, size: 32, offset: 448)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !150, file: !34, line: 42, baseType: !35, size: 32, offset: 480)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !150, file: !34, line: 43, baseType: !35, size: 32, offset: 512)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !150, file: !34, line: 44, baseType: !35, size: 32, offset: 544)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !150, file: !34, line: 45, baseType: !85, size: 96, offset: 576)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !150, file: !34, line: 46, baseType: !35, size: 32, offset: 672)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !150, file: !34, line: 47, baseType: !85, size: 96, offset: 704)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !150, file: !34, line: 48, baseType: !85, size: 96, offset: 800)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !150, file: !34, line: 49, baseType: !85, size: 96, offset: 896)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !150, file: !34, line: 50, baseType: !35, size: 32, offset: 992)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !150, file: !34, line: 51, baseType: !35, size: 32, offset: 1024)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !134, file: !129, line: 865, baseType: !149, size: 1088, offset: 7424)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !134, file: !129, line: 867, baseType: !35, size: 32, offset: 8512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !134, file: !129, line: 868, baseType: !35, size: 32, offset: 8544)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !134, file: !129, line: 869, baseType: !179, size: 7744, offset: 8576)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !49, line: 60, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !49, line: 34, size: 7744, elements: !181)
!181 = !{!182, !183, !184, !185, !186, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !180, file: !49, line: 37, baseType: !137, size: 2040)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !180, file: !49, line: 38, baseType: !137, size: 2040, offset: 2040)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !180, file: !49, line: 39, baseType: !137, size: 2040, offset: 4080)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !180, file: !49, line: 40, baseType: !35, size: 32, offset: 6144)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !180, file: !49, line: 41, baseType: !187, size: 32, offset: 6176)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !49, line: 32, baseType: !48)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !180, file: !49, line: 42, baseType: !149, size: 1088, offset: 6208)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !180, file: !49, line: 43, baseType: !35, size: 32, offset: 7296)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !180, file: !49, line: 44, baseType: !35, size: 32, offset: 7328)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !180, file: !49, line: 45, baseType: !35, size: 32, offset: 7360)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !180, file: !49, line: 46, baseType: !35, size: 32, offset: 7392)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !180, file: !49, line: 47, baseType: !35, size: 32, offset: 7424)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !180, file: !49, line: 48, baseType: !35, size: 32, offset: 7456)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !180, file: !49, line: 49, baseType: !35, size: 32, offset: 7488)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !180, file: !49, line: 50, baseType: !35, size: 32, offset: 7520)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !180, file: !49, line: 51, baseType: !35, size: 32, offset: 7552)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !180, file: !49, line: 52, baseType: !35, size: 32, offset: 7584)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !180, file: !49, line: 53, baseType: !35, size: 32, offset: 7616)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !180, file: !49, line: 56, baseType: !201, size: 64, offset: 7680)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !134, file: !129, line: 870, baseType: !179, size: 7744, offset: 16320)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !134, file: !129, line: 871, baseType: !179, size: 7744, offset: 24064)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !134, file: !129, line: 873, baseType: !35, size: 32, offset: 31808)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !134, file: !129, line: 884, baseType: !35, size: 32, offset: 31840)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !134, file: !129, line: 885, baseType: !35, size: 32, offset: 31872)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !134, file: !129, line: 886, baseType: !35, size: 32, offset: 31904)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !134, file: !129, line: 890, baseType: !35, size: 32, offset: 31936)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !134, file: !129, line: 893, baseType: !35, size: 32, offset: 31968)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !134, file: !129, line: 894, baseType: !35, size: 32, offset: 32000)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !134, file: !129, line: 895, baseType: !35, size: 32, offset: 32032)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !134, file: !129, line: 897, baseType: !35, size: 32, offset: 32064)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !134, file: !129, line: 899, baseType: !35, size: 32, offset: 32096)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !130, file: !129, line: 569, baseType: !215, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !217, line: 138, baseType: !218)
!217 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 94, size: 17728, elements: !219)
!219 = !{!220, !221, !222, !223, !224, !225, !226, !230, !235, !239, !242, !243, !244, !245, !246, !250, !251, !252, !253, !254, !255, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !218, file: !217, line: 96, baseType: !35, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !218, file: !217, line: 97, baseType: !59, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !218, file: !217, line: 98, baseType: !59, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !218, file: !217, line: 99, baseType: !35, size: 32, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !218, file: !217, line: 100, baseType: !35, size: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !218, file: !217, line: 102, baseType: !35, size: 32, offset: 160)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !218, file: !217, line: 103, baseType: !227, size: 384, offset: 192)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 384, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 12)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !218, file: !217, line: 104, baseType: !231, size: 3072, offset: 576)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 3072, elements: !232)
!232 = !{!233, !234}
!233 = !DISubrange(count: 6)
!234 = !DISubrange(count: 16)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !218, file: !217, line: 105, baseType: !236, size: 12288, offset: 3648)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 12288, elements: !237)
!237 = !{!233, !238}
!238 = !DISubrange(count: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !218, file: !217, line: 106, baseType: !240, size: 192, offset: 15936)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 192, elements: !241)
!241 = !{!233}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !218, file: !217, line: 107, baseType: !240, size: 192, offset: 16128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !218, file: !217, line: 110, baseType: !35, size: 32, offset: 16320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !218, file: !217, line: 111, baseType: !59, size: 32, offset: 16352)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !218, file: !217, line: 112, baseType: !59, size: 32, offset: 16384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !218, file: !217, line: 114, baseType: !247, size: 256, offset: 16416)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 256, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 8)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !218, file: !217, line: 116, baseType: !247, size: 256, offset: 16672)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !218, file: !217, line: 117, baseType: !247, size: 256, offset: 16928)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !218, file: !217, line: 119, baseType: !35, size: 32, offset: 17184)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !218, file: !217, line: 120, baseType: !59, size: 32, offset: 17216)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !218, file: !217, line: 122, baseType: !59, size: 32, offset: 17248)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !218, file: !217, line: 123, baseType: !256, size: 64, offset: 17280)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !218, file: !217, line: 125, baseType: !35, size: 32, offset: 17344)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !218, file: !217, line: 126, baseType: !35, size: 32, offset: 17376)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !218, file: !217, line: 127, baseType: !35, size: 32, offset: 17408)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !218, file: !217, line: 128, baseType: !59, size: 32, offset: 17440)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !218, file: !217, line: 129, baseType: !35, size: 32, offset: 17472)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !218, file: !217, line: 130, baseType: !35, size: 32, offset: 17504)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !218, file: !217, line: 131, baseType: !35, size: 32, offset: 17536)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !218, file: !217, line: 133, baseType: !35, size: 32, offset: 17568)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !218, file: !217, line: 135, baseType: !35, size: 32, offset: 17600)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !218, file: !217, line: 136, baseType: !35, size: 32, offset: 17632)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !218, file: !217, line: 137, baseType: !35, size: 32, offset: 17664)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !130, file: !129, line: 570, baseType: !269, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !217, line: 197, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 142, size: 33024, elements: !272)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !370, !371}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !271, file: !217, line: 144, baseType: !35, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !271, file: !217, line: 146, baseType: !59, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !271, file: !217, line: 147, baseType: !35, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !271, file: !217, line: 148, baseType: !35, size: 32, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !271, file: !217, line: 149, baseType: !35, size: 32, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !271, file: !217, line: 150, baseType: !35, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !271, file: !217, line: 152, baseType: !35, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !271, file: !217, line: 154, baseType: !59, size: 32, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !271, file: !217, line: 155, baseType: !59, size: 32, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !271, file: !217, line: 156, baseType: !59, size: 32, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !271, file: !217, line: 158, baseType: !35, size: 32, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !271, file: !217, line: 159, baseType: !227, size: 384, offset: 352)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !271, file: !217, line: 160, baseType: !231, size: 3072, offset: 736)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !271, file: !217, line: 161, baseType: !236, size: 12288, offset: 3808)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !271, file: !217, line: 162, baseType: !240, size: 192, offset: 16096)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !271, file: !217, line: 163, baseType: !240, size: 192, offset: 16288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !271, file: !217, line: 165, baseType: !59, size: 32, offset: 16480)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !271, file: !217, line: 166, baseType: !59, size: 32, offset: 16512)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !271, file: !217, line: 167, baseType: !59, size: 32, offset: 16544)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !271, file: !217, line: 168, baseType: !59, size: 32, offset: 16576)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !271, file: !217, line: 170, baseType: !59, size: 32, offset: 16608)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !271, file: !217, line: 172, baseType: !35, size: 32, offset: 16640)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !271, file: !217, line: 173, baseType: !35, size: 32, offset: 16672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !271, file: !217, line: 174, baseType: !35, size: 32, offset: 16704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !271, file: !217, line: 175, baseType: !59, size: 32, offset: 16736)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !271, file: !217, line: 177, baseType: !299, size: 8192, offset: 16768)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 8192, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !271, file: !217, line: 178, baseType: !59, size: 32, offset: 24960)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !271, file: !217, line: 179, baseType: !35, size: 32, offset: 24992)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !271, file: !217, line: 180, baseType: !59, size: 32, offset: 25024)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !271, file: !217, line: 181, baseType: !59, size: 32, offset: 25056)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !271, file: !217, line: 182, baseType: !35, size: 32, offset: 25088)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !271, file: !217, line: 184, baseType: !35, size: 32, offset: 25120)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !271, file: !217, line: 185, baseType: !35, size: 32, offset: 25152)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !271, file: !217, line: 186, baseType: !35, size: 32, offset: 25184)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !271, file: !217, line: 187, baseType: !59, size: 32, offset: 25216)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !271, file: !217, line: 188, baseType: !59, size: 32, offset: 25248)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !271, file: !217, line: 189, baseType: !59, size: 32, offset: 25280)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !271, file: !217, line: 190, baseType: !59, size: 32, offset: 25312)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !271, file: !217, line: 191, baseType: !35, size: 32, offset: 25344)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !271, file: !217, line: 192, baseType: !316, size: 7584, offset: 25376)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !217, line: 90, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 53, size: 7584, elements: !318)
!318 = !{!319, !320, !321, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !317, file: !217, line: 55, baseType: !35, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !317, file: !217, line: 56, baseType: !59, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !317, file: !217, line: 57, baseType: !322, size: 16, offset: 64)
!322 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !317, file: !217, line: 58, baseType: !322, size: 16, offset: 80)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !317, file: !217, line: 59, baseType: !35, size: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !317, file: !217, line: 60, baseType: !35, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !317, file: !217, line: 61, baseType: !35, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !317, file: !217, line: 62, baseType: !59, size: 32, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !317, file: !217, line: 63, baseType: !35, size: 32, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !317, file: !217, line: 64, baseType: !35, size: 32, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !317, file: !217, line: 65, baseType: !59, size: 32, offset: 288)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !317, file: !217, line: 66, baseType: !59, size: 32, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !317, file: !217, line: 67, baseType: !59, size: 32, offset: 352)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !317, file: !217, line: 68, baseType: !35, size: 32, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !317, file: !217, line: 69, baseType: !59, size: 32, offset: 416)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !317, file: !217, line: 70, baseType: !59, size: 32, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !317, file: !217, line: 71, baseType: !35, size: 32, offset: 480)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !317, file: !217, line: 72, baseType: !59, size: 32, offset: 512)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !317, file: !217, line: 73, baseType: !59, size: 32, offset: 544)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !317, file: !217, line: 74, baseType: !35, size: 32, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !317, file: !217, line: 75, baseType: !35, size: 32, offset: 608)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !317, file: !217, line: 76, baseType: !342, size: 3296, offset: 640)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !217, line: 50, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 38, size: 3296, elements: !344)
!344 = !{!345, !346, !347, !348, !352, !353, !354, !355, !356, !357}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !343, file: !217, line: 40, baseType: !59, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !343, file: !217, line: 41, baseType: !59, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !343, file: !217, line: 42, baseType: !59, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !343, file: !217, line: 43, baseType: !349, size: 1024, offset: 96)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 1024, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !343, file: !217, line: 44, baseType: !349, size: 1024, offset: 1120)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !343, file: !217, line: 45, baseType: !349, size: 1024, offset: 2144)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !343, file: !217, line: 46, baseType: !59, size: 32, offset: 3168)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !343, file: !217, line: 47, baseType: !59, size: 32, offset: 3200)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !343, file: !217, line: 48, baseType: !59, size: 32, offset: 3232)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !343, file: !217, line: 49, baseType: !59, size: 32, offset: 3264)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !317, file: !217, line: 77, baseType: !35, size: 32, offset: 3936)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !317, file: !217, line: 78, baseType: !342, size: 3296, offset: 3968)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !317, file: !217, line: 80, baseType: !35, size: 32, offset: 7264)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !317, file: !217, line: 81, baseType: !35, size: 32, offset: 7296)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !317, file: !217, line: 82, baseType: !35, size: 32, offset: 7328)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !317, file: !217, line: 83, baseType: !35, size: 32, offset: 7360)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !317, file: !217, line: 84, baseType: !59, size: 32, offset: 7392)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !317, file: !217, line: 85, baseType: !59, size: 32, offset: 7424)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !317, file: !217, line: 86, baseType: !59, size: 32, offset: 7456)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !317, file: !217, line: 87, baseType: !59, size: 32, offset: 7488)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !317, file: !217, line: 88, baseType: !59, size: 32, offset: 7520)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !317, file: !217, line: 89, baseType: !59, size: 32, offset: 7552)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !271, file: !217, line: 193, baseType: !59, size: 32, offset: 32960)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !271, file: !217, line: 195, baseType: !35, size: 32, offset: 32992)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !130, file: !129, line: 571, baseType: !373, size: 1056768, offset: 192)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 1056768, elements: !350)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !130, file: !129, line: 572, baseType: !375, size: 4538368, offset: 1056960)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 4538368, elements: !300)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !130, file: !129, line: 575, baseType: !377, size: 64, offset: 5595328)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !217, line: 256, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !217, line: 228, size: 37312, elements: !380)
!380 = !{!381, !382, !383, !384, !385, !386, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !401, !402, !403, !404}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !379, file: !217, line: 230, baseType: !270, size: 33024)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !379, file: !217, line: 232, baseType: !59, size: 32, offset: 33024)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !379, file: !217, line: 233, baseType: !35, size: 32, offset: 33056)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !379, file: !217, line: 234, baseType: !201, size: 64, offset: 33088)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !379, file: !217, line: 235, baseType: !201, size: 64, offset: 33152)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !379, file: !217, line: 236, baseType: !387, size: 64, offset: 33216)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !379, file: !217, line: 237, baseType: !201, size: 64, offset: 33280)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !379, file: !217, line: 238, baseType: !387, size: 64, offset: 33344)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !379, file: !217, line: 240, baseType: !201, size: 64, offset: 33408)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !379, file: !217, line: 241, baseType: !387, size: 64, offset: 33472)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !379, file: !217, line: 242, baseType: !201, size: 64, offset: 33536)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !379, file: !217, line: 243, baseType: !387, size: 64, offset: 33600)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !379, file: !217, line: 245, baseType: !35, size: 32, offset: 33664)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !379, file: !217, line: 246, baseType: !201, size: 64, offset: 33728)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !379, file: !217, line: 247, baseType: !201, size: 64, offset: 33792)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !379, file: !217, line: 248, baseType: !387, size: 64, offset: 33856)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !379, file: !217, line: 249, baseType: !387, size: 64, offset: 33920)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !379, file: !217, line: 250, baseType: !400, size: 64, offset: 33984)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !379, file: !217, line: 251, baseType: !387, size: 64, offset: 34048)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !379, file: !217, line: 253, baseType: !59, size: 32, offset: 34112)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !379, file: !217, line: 254, baseType: !35, size: 32, offset: 34144)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !379, file: !217, line: 255, baseType: !405, size: 3136, offset: 34176)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !217, line: 226, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !217, line: 200, size: 3136, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !425, !426, !428, !429, !430, !431}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !406, file: !217, line: 202, baseType: !35, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !406, file: !217, line: 203, baseType: !97, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !406, file: !217, line: 204, baseType: !201, size: 64, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !406, file: !217, line: 205, baseType: !387, size: 64, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !406, file: !217, line: 206, baseType: !97, size: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !406, file: !217, line: 207, baseType: !201, size: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !406, file: !217, line: 208, baseType: !201, size: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !406, file: !217, line: 209, baseType: !97, size: 64, offset: 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !406, file: !217, line: 210, baseType: !97, size: 64, offset: 512)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !406, file: !217, line: 211, baseType: !97, size: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !406, file: !217, line: 212, baseType: !97, size: 64, offset: 640)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !406, file: !217, line: 213, baseType: !97, size: 64, offset: 704)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !406, file: !217, line: 216, baseType: !98, size: 8, offset: 768)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !406, file: !217, line: 217, baseType: !98, size: 8, offset: 776)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !406, file: !217, line: 218, baseType: !98, size: 8, offset: 784)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !406, file: !217, line: 219, baseType: !424, size: 1024, offset: 800)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 1024, elements: !350)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !406, file: !217, line: 220, baseType: !424, size: 1024, offset: 1824)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !406, file: !217, line: 221, baseType: !427, size: 256, offset: 2848)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 256, elements: !350)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !406, file: !217, line: 222, baseType: !98, size: 8, offset: 3104)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !406, file: !217, line: 223, baseType: !98, size: 8, offset: 3112)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !406, file: !217, line: 224, baseType: !98, size: 8, offset: 3120)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !406, file: !217, line: 225, baseType: !98, size: 8, offset: 3128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !130, file: !129, line: 577, baseType: !433, size: 1193984, offset: 5595392)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 1193984, elements: !350)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !130, file: !129, line: 578, baseType: !35, size: 32, offset: 6789376)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !130, file: !129, line: 579, baseType: !35, size: 32, offset: 6789408)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !130, file: !129, line: 580, baseType: !35, size: 32, offset: 6789440)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !130, file: !129, line: 581, baseType: !35, size: 32, offset: 6789472)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !130, file: !129, line: 584, baseType: !439, size: 64, offset: 6789504)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !129, line: 584, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !130, file: !129, line: 586, baseType: !442, size: 64, offset: 6789568)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !129, line: 902, size: 416, elements: !444)
!444 = !{!445, !446, !447, !448, !449, !450, !454, !455, !456, !457, !458, !459, !460}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !443, file: !129, line: 904, baseType: !59, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !443, file: !129, line: 905, baseType: !59, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !443, file: !129, line: 906, baseType: !35, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !443, file: !129, line: 907, baseType: !59, size: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !443, file: !129, line: 908, baseType: !35, size: 32, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !443, file: !129, line: 909, baseType: !451, size: 64, offset: 160)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 2)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !443, file: !129, line: 910, baseType: !79, size: 8, offset: 224)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !443, file: !129, line: 911, baseType: !79, size: 8, offset: 232)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !443, file: !129, line: 912, baseType: !35, size: 32, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !443, file: !129, line: 913, baseType: !35, size: 32, offset: 288)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !443, file: !129, line: 915, baseType: !35, size: 32, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !443, file: !129, line: 916, baseType: !35, size: 32, offset: 352)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !443, file: !129, line: 917, baseType: !35, size: 32, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !130, file: !129, line: 587, baseType: !462, size: 64, offset: 6789632)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !129, line: 839, size: 512, elements: !464)
!464 = !{!465, !466, !469, !470, !471, !472}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !463, file: !129, line: 841, baseType: !35, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !463, file: !129, line: 842, baseType: !467, size: 96, offset: 32)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 96, elements: !86)
!468 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !463, file: !129, line: 843, baseType: !467, size: 96, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !463, file: !129, line: 844, baseType: !467, size: 96, offset: 224)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !463, file: !129, line: 845, baseType: !467, size: 96, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !463, file: !129, line: 846, baseType: !467, size: 96, offset: 416)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !130, file: !129, line: 588, baseType: !35, size: 32, offset: 6789696)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !130, file: !129, line: 591, baseType: !59, size: 32, offset: 6789728)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !130, file: !129, line: 592, baseType: !35, size: 32, offset: 6789760)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !130, file: !129, line: 593, baseType: !35, size: 32, offset: 6789792)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !130, file: !129, line: 594, baseType: !35, size: 32, offset: 6789824)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !130, file: !129, line: 595, baseType: !479, size: 64, offset: 6789888)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !129, line: 542, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !129, line: 341, size: 109184, elements: !483)
!483 = !{!484, !486, !487, !488, !489, !490, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !711, !713, !876, !905, !932, !935, !936, !938, !939, !940, !941, !942, !943, !944, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !971, !972, !973, !974, !975, !976, !979, !980, !983, !984, !986, !989, !990, !991, !992, !993, !994, !995, !996, !997, !999, !1000, !1001, !1002, !1003, !1006, !1007, !1008, !1012, !1016, !1020, !1024, !1028, !1029, !1030, !1031, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1045, !1046}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !482, file: !129, line: 343, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !482, file: !129, line: 344, baseType: !133, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !482, file: !129, line: 345, baseType: !215, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !482, file: !129, line: 346, baseType: !269, size: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "svc_extension_flag", scope: !482, file: !129, line: 347, baseType: !35, size: 32, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !482, file: !129, line: 350, baseType: !491, size: 64, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !493, line: 186, size: 33408, elements: !494)
!493 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!494 = !{!495, !496, !499, !645, !646, !647, !648, !649, !650, !651, !652, !653, !657, !658, !659}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !492, file: !493, line: 188, baseType: !127, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !492, file: !493, line: 189, baseType: !497, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !129, line: 900, baseType: !134)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !492, file: !493, line: 190, baseType: !500, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !493, line: 182, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !493, line: 152, size: 768, elements: !504)
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !640, !641, !642, !643, !644}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !503, file: !493, line: 154, baseType: !35, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !503, file: !493, line: 155, baseType: !35, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !503, file: !493, line: 156, baseType: !35, size: 32, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !503, file: !493, line: 157, baseType: !35, size: 32, offset: 96)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !503, file: !493, line: 159, baseType: !35, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !503, file: !493, line: 161, baseType: !59, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !503, file: !493, line: 162, baseType: !59, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !503, file: !493, line: 164, baseType: !35, size: 32, offset: 224)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !503, file: !493, line: 165, baseType: !35, size: 32, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !503, file: !493, line: 166, baseType: !35, size: 32, offset: 288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !503, file: !493, line: 167, baseType: !35, size: 32, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !503, file: !493, line: 170, baseType: !35, size: 32, offset: 352)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !503, file: !493, line: 172, baseType: !518, size: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !493, line: 138, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !493, line: 46, size: 3328, elements: !521)
!521 = !{!522, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !560, !562, !563, !580, !582, !586, !588, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !520, file: !493, line: 48, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !58, line: 140, baseType: !57)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !520, file: !493, line: 50, baseType: !35, size: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !520, file: !493, line: 51, baseType: !35, size: 32, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !520, file: !493, line: 52, baseType: !35, size: 32, offset: 96)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !520, file: !493, line: 53, baseType: !35, size: 32, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !520, file: !493, line: 54, baseType: !59, size: 32, offset: 160)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !520, file: !493, line: 55, baseType: !59, size: 32, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !520, file: !493, line: 57, baseType: !35, size: 32, offset: 224)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !520, file: !493, line: 58, baseType: !35, size: 32, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !520, file: !493, line: 59, baseType: !35, size: 32, offset: 288)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !520, file: !493, line: 61, baseType: !79, size: 8, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !520, file: !493, line: 62, baseType: !35, size: 32, offset: 352)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !520, file: !493, line: 63, baseType: !35, size: 32, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !520, file: !493, line: 64, baseType: !35, size: 32, offset: 416)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !520, file: !493, line: 65, baseType: !35, size: 32, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !520, file: !493, line: 67, baseType: !107, size: 16, offset: 480)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !520, file: !493, line: 69, baseType: !35, size: 32, offset: 512)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !520, file: !493, line: 69, baseType: !35, size: 32, offset: 544)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !520, file: !493, line: 69, baseType: !35, size: 32, offset: 576)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !520, file: !493, line: 69, baseType: !35, size: 32, offset: 608)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !520, file: !493, line: 70, baseType: !35, size: 32, offset: 640)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !520, file: !493, line: 70, baseType: !35, size: 32, offset: 672)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !520, file: !493, line: 70, baseType: !35, size: 32, offset: 704)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !520, file: !493, line: 70, baseType: !35, size: 32, offset: 736)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !520, file: !493, line: 71, baseType: !35, size: 32, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !520, file: !493, line: 72, baseType: !35, size: 32, offset: 800)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !520, file: !493, line: 73, baseType: !59, size: 32, offset: 832)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !520, file: !493, line: 74, baseType: !59, size: 32, offset: 864)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !520, file: !493, line: 75, baseType: !35, size: 32, offset: 896)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !520, file: !493, line: 75, baseType: !35, size: 32, offset: 928)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !520, file: !493, line: 76, baseType: !35, size: 32, offset: 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !520, file: !493, line: 76, baseType: !35, size: 32, offset: 992)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !520, file: !493, line: 79, baseType: !556, size: 64, offset: 1024)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !80, line: 41, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !80, line: 23, baseType: !322)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !520, file: !493, line: 80, baseType: !561, size: 64, offset: 1088)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !520, file: !493, line: 81, baseType: !561, size: 64, offset: 1152)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !520, file: !493, line: 84, baseType: !564, size: 64, offset: 1216)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !493, line: 36, size: 256, elements: !567)
!567 = !{!568, !571, !578}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !566, file: !493, line: 38, baseType: !569, size: 128)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 128, elements: !452)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !566, file: !493, line: 39, baseType: !572, size: 64, offset: 128)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 64, elements: !452)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !129, line: 104, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 100, size: 32, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !574, file: !129, line: 102, baseType: !107, size: 16)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !574, file: !129, line: 103, baseType: !107, size: 16, offset: 16)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !566, file: !493, line: 40, baseType: !579, size: 16, offset: 192)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 16, elements: !452)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !520, file: !493, line: 85, baseType: !581, size: 192, offset: 1280)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 192, elements: !86)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !520, file: !493, line: 87, baseType: !583, size: 64, offset: 1472)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !493, line: 29, size: 64, elements: !584)
!584 = !{!585}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !583, file: !493, line: 31, baseType: !256, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !520, file: !493, line: 88, baseType: !587, size: 192, offset: 1536)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 192, elements: !86)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !520, file: !493, line: 90, baseType: !589, size: 64, offset: 1728)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !520, file: !493, line: 92, baseType: !570, size: 64, offset: 1792)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !520, file: !493, line: 93, baseType: !570, size: 64, offset: 1856)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !520, file: !493, line: 94, baseType: !570, size: 64, offset: 1920)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !520, file: !493, line: 96, baseType: !35, size: 32, offset: 1984)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !520, file: !493, line: 97, baseType: !35, size: 32, offset: 2016)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !520, file: !493, line: 98, baseType: !35, size: 32, offset: 2048)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !520, file: !493, line: 99, baseType: !35, size: 32, offset: 2080)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !520, file: !493, line: 100, baseType: !35, size: 32, offset: 2112)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !520, file: !493, line: 102, baseType: !35, size: 32, offset: 2144)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !520, file: !493, line: 103, baseType: !35, size: 32, offset: 2176)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !520, file: !493, line: 104, baseType: !35, size: 32, offset: 2208)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !520, file: !493, line: 105, baseType: !35, size: 32, offset: 2240)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !520, file: !493, line: 106, baseType: !35, size: 32, offset: 2272)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !520, file: !493, line: 107, baseType: !35, size: 32, offset: 2304)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !520, file: !493, line: 108, baseType: !35, size: 32, offset: 2336)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !520, file: !493, line: 109, baseType: !35, size: 32, offset: 2368)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !520, file: !493, line: 110, baseType: !451, size: 64, offset: 2400)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !520, file: !493, line: 111, baseType: !35, size: 32, offset: 2464)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !520, file: !493, line: 112, baseType: !610, size: 64, offset: 2496)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !129, line: 194, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !129, line: 186, size: 256, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !612, file: !129, line: 188, baseType: !35, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !612, file: !129, line: 189, baseType: !35, size: 32, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !612, file: !129, line: 190, baseType: !35, size: 32, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !612, file: !129, line: 191, baseType: !35, size: 32, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !612, file: !129, line: 192, baseType: !35, size: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !612, file: !129, line: 193, baseType: !620, size: 64, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !520, file: !493, line: 115, baseType: !35, size: 32, offset: 2560)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !520, file: !493, line: 118, baseType: !35, size: 32, offset: 2592)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !520, file: !493, line: 119, baseType: !35, size: 32, offset: 2624)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !520, file: !493, line: 120, baseType: !35, size: 32, offset: 2656)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !520, file: !493, line: 121, baseType: !557, size: 64, offset: 2688)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !520, file: !493, line: 124, baseType: !35, size: 32, offset: 2752)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !520, file: !493, line: 125, baseType: !35, size: 32, offset: 2784)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !520, file: !493, line: 126, baseType: !35, size: 32, offset: 2816)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !520, file: !493, line: 128, baseType: !35, size: 32, offset: 2848)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !520, file: !493, line: 129, baseType: !35, size: 32, offset: 2880)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !520, file: !493, line: 130, baseType: !35, size: 32, offset: 2912)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !520, file: !493, line: 131, baseType: !35, size: 32, offset: 2944)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !520, file: !493, line: 132, baseType: !556, size: 64, offset: 3008)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !520, file: !493, line: 133, baseType: !35, size: 32, offset: 3072)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !520, file: !493, line: 134, baseType: !35, size: 32, offset: 3104)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !520, file: !493, line: 136, baseType: !579, size: 16, offset: 3136)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !520, file: !493, line: 137, baseType: !638, size: 128, offset: 3200)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 128, elements: !452)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !503, file: !493, line: 173, baseType: !518, size: 64, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !503, file: !493, line: 174, baseType: !518, size: 64, offset: 512)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !503, file: !493, line: 177, baseType: !35, size: 32, offset: 576)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !503, file: !493, line: 178, baseType: !451, size: 64, offset: 608)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !503, file: !493, line: 179, baseType: !451, size: 64, offset: 672)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ref", scope: !492, file: !493, line: 191, baseType: !500, size: 64, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ltref", scope: !492, file: !493, line: 192, baseType: !500, size: 64, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !492, file: !493, line: 193, baseType: !59, size: 32, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !492, file: !493, line: 194, baseType: !59, size: 32, offset: 352)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frames_in_buffer", scope: !492, file: !493, line: 195, baseType: !59, size: 32, offset: 384)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ltref_frames_in_buffer", scope: !492, file: !493, line: 196, baseType: !59, size: 32, offset: 416)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_poc", scope: !492, file: !493, line: 197, baseType: !35, size: 32, offset: 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_view_id", scope: !492, file: !493, line: 199, baseType: !35, size: 32, offset: 480)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_pic_idx", scope: !492, file: !493, line: 200, baseType: !654, size: 32768, offset: 512)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32768, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 1024)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "init_done", scope: !492, file: !493, line: 205, baseType: !35, size: 32, offset: 33280)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !492, file: !493, line: 206, baseType: !35, size: 32, offset: 33312)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "last_picture", scope: !492, file: !493, line: 208, baseType: !501, size: 64, offset: 33344)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !482, file: !129, line: 353, baseType: !35, size: 32, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !482, file: !129, line: 354, baseType: !35, size: 32, offset: 416)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !482, file: !129, line: 355, baseType: !35, size: 32, offset: 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Transform8x8Mode", scope: !482, file: !129, line: 356, baseType: !35, size: 32, offset: 480)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "is_not_independent", scope: !482, file: !129, line: 357, baseType: !35, size: 32, offset: 512)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "toppoc", scope: !482, file: !129, line: 359, baseType: !35, size: 32, offset: 544)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bottompoc", scope: !482, file: !129, line: 360, baseType: !35, size: 32, offset: 576)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "framepoc", scope: !482, file: !129, line: 361, baseType: !35, size: 32, offset: 608)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !482, file: !129, line: 365, baseType: !59, size: 32, offset: 640)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !482, file: !129, line: 366, baseType: !35, size: 32, offset: 672)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !482, file: !129, line: 368, baseType: !451, size: 64, offset: 704)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntMsb", scope: !482, file: !129, line: 372, baseType: !35, size: 32, offset: 768)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "AbsFrameNum", scope: !482, file: !129, line: 378, baseType: !59, size: 32, offset: 800)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !482, file: !129, line: 379, baseType: !35, size: 32, offset: 832)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "current_mb_nr", scope: !482, file: !129, line: 387, baseType: !59, size: 32, offset: 864)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !482, file: !129, line: 388, baseType: !59, size: 32, offset: 896)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "current_slice_nr", scope: !482, file: !129, line: 389, baseType: !107, size: 16, offset: 928)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "cod_counter", scope: !482, file: !129, line: 396, baseType: !35, size: 32, offset: 960)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "allrefzero", scope: !482, file: !129, line: 397, baseType: !35, size: 32, offset: 992)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !482, file: !129, line: 400, baseType: !35, size: 32, offset: 1024)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !482, file: !129, line: 401, baseType: !35, size: 32, offset: 1056)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_active", scope: !482, file: !129, line: 402, baseType: !451, size: 64, offset: 1088)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !482, file: !129, line: 406, baseType: !35, size: 32, offset: 1152)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !482, file: !129, line: 407, baseType: !35, size: 32, offset: 1184)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !482, file: !129, line: 408, baseType: !35, size: 32, offset: 1216)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "qs", scope: !482, file: !129, line: 409, baseType: !35, size: 32, offset: 1248)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qs_delta", scope: !482, file: !129, line: 410, baseType: !35, size: 32, offset: 1280)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !482, file: !129, line: 411, baseType: !35, size: 32, offset: 1312)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "model_number", scope: !482, file: !129, line: 412, baseType: !35, size: 32, offset: 1344)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !482, file: !129, line: 413, baseType: !59, size: 32, offset: 1376)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !482, file: !129, line: 414, baseType: !59, size: 32, offset: 1408)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !482, file: !129, line: 415, baseType: !79, size: 8, offset: 1440)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !482, file: !129, line: 416, baseType: !523, size: 32, offset: 1472)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !482, file: !129, line: 417, baseType: !35, size: 32, offset: 1504)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "end_mb_nr_plus1", scope: !482, file: !129, line: 418, baseType: !35, size: 32, offset: 1536)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !482, file: !129, line: 419, baseType: !35, size: 32, offset: 1568)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dp_mode", scope: !482, file: !129, line: 420, baseType: !35, size: 32, offset: 1600)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "current_header", scope: !482, file: !129, line: 421, baseType: !35, size: 32, offset: 1632)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "next_header", scope: !482, file: !129, line: 422, baseType: !35, size: 32, offset: 1664)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "last_dquant", scope: !482, file: !129, line: 423, baseType: !35, size: 32, offset: 1696)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "colour_plane_id", scope: !482, file: !129, line: 426, baseType: !35, size: 32, offset: 1728)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !482, file: !129, line: 427, baseType: !35, size: 32, offset: 1760)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "sp_switch", scope: !482, file: !129, line: 428, baseType: !35, size: 32, offset: 1792)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !482, file: !129, line: 429, baseType: !35, size: 32, offset: 1824)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_slice_ref_idx", scope: !482, file: !129, line: 430, baseType: !35, size: 32, offset: 1856)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !482, file: !129, line: 431, baseType: !35, size: 32, offset: 1888)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !482, file: !129, line: 432, baseType: !35, size: 32, offset: 1920)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !482, file: !129, line: 433, baseType: !35, size: 32, offset: 1952)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !482, file: !129, line: 434, baseType: !610, size: 64, offset: 1984)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !482, file: !129, line: 436, baseType: !710, size: 48, offset: 2048)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 48, elements: !241)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !482, file: !129, line: 437, baseType: !712, size: 384, offset: 2112)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 384, elements: !241)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !482, file: !129, line: 440, baseType: !714, size: 64, offset: 2496)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !129, line: 324, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !129, line: 314, size: 384, elements: !717)
!717 = !{!718, !729, !738}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !716, file: !129, line: 317, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !129, line: 47, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream", file: !129, line: 300, size: 256, elements: !722)
!722 = !{!723, !724, !725, !726, !727, !728}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "read_len", scope: !721, file: !129, line: 303, baseType: !35, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !721, file: !129, line: 304, baseType: !35, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bitoffset", scope: !721, file: !129, line: 306, baseType: !35, size: 32, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_length", scope: !721, file: !129, line: 307, baseType: !35, size: 32, offset: 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !721, file: !129, line: 309, baseType: !256, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !721, file: !129, line: 310, baseType: !35, size: 32, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "de_cabac", scope: !716, file: !129, line: 318, baseType: !730, size: 256, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !129, line: 95, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 88, size: 256, elements: !732)
!732 = !{!733, !734, !735, !736, !737}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !731, file: !129, line: 90, baseType: !59, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !731, file: !129, line: 91, baseType: !59, size: 32, offset: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !731, file: !129, line: 92, baseType: !35, size: 32, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !731, file: !129, line: 93, baseType: !256, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !731, file: !129, line: 94, baseType: !201, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "readSyntaxElement", scope: !716, file: !129, line: 320, baseType: !739, size: 64, offset: 320)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = !DISubroutineType(types: !741)
!741 = !{!35, !742, !874, !872}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !129, line: 273, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !129, line: 197, size: 3840, elements: !745)
!745 = !{!746, !748, !749, !750, !751, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !780, !781, !782, !783, !784, !788, !789, !798, !799, !800, !801, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !827, !828, !843, !849, !873}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !744, file: !129, line: 199, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !744, file: !129, line: 200, baseType: !485, size: 64, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !744, file: !129, line: 201, baseType: !133, size: 64, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrX", scope: !744, file: !129, line: 202, baseType: !35, size: 32, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !744, file: !129, line: 203, baseType: !752, size: 32, offset: 224)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockPos", file: !129, line: 112, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 108, size: 32, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !753, file: !129, line: 110, baseType: !107, size: 16)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !753, file: !129, line: 111, baseType: !107, size: 16, offset: 16)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !744, file: !129, line: 204, baseType: !35, size: 32, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !744, file: !129, line: 205, baseType: !35, size: 32, offset: 288)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "block_y_aff", scope: !744, file: !129, line: 206, baseType: !35, size: 32, offset: 320)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !744, file: !129, line: 207, baseType: !35, size: 32, offset: 352)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !744, file: !129, line: 208, baseType: !35, size: 32, offset: 384)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !744, file: !129, line: 209, baseType: !35, size: 32, offset: 416)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !744, file: !129, line: 210, baseType: !35, size: 32, offset: 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !744, file: !129, line: 212, baseType: !35, size: 32, offset: 480)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !744, file: !129, line: 213, baseType: !35, size: 32, offset: 512)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !744, file: !129, line: 215, baseType: !35, size: 32, offset: 544)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "qpc", scope: !744, file: !129, line: 216, baseType: !451, size: 64, offset: 576)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "qp_scaled", scope: !744, file: !129, line: 217, baseType: !85, size: 96, offset: 640)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "is_lossless", scope: !744, file: !129, line: 218, baseType: !35, size: 32, offset: 736)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !744, file: !129, line: 219, baseType: !35, size: 32, offset: 768)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !744, file: !129, line: 220, baseType: !35, size: 32, offset: 800)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !744, file: !129, line: 221, baseType: !35, size: 32, offset: 832)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !744, file: !129, line: 223, baseType: !107, size: 16, offset: 864)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !744, file: !129, line: 224, baseType: !98, size: 8, offset: 880)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "dpl_flag", scope: !744, file: !129, line: 225, baseType: !98, size: 8, offset: 888)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "delta_quant", scope: !744, file: !129, line: 226, baseType: !107, size: 16, offset: 896)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "list_offset", scope: !744, file: !129, line: 227, baseType: !107, size: 16, offset: 912)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mb_up", scope: !744, file: !129, line: 229, baseType: !779, size: 64, offset: 960)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "mb_left", scope: !744, file: !129, line: 230, baseType: !779, size: 64, offset: 1024)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "mbup", scope: !744, file: !129, line: 232, baseType: !779, size: 64, offset: 1088)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "mbleft", scope: !744, file: !129, line: 233, baseType: !779, size: 64, offset: 1152)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !744, file: !129, line: 236, baseType: !107, size: 16, offset: 1216)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !744, file: !129, line: 237, baseType: !785, size: 1024, offset: 1232)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 1024, elements: !786)
!786 = !{!453, !787, !787, !453}
!787 = !DISubrange(count: 4)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !744, file: !129, line: 239, baseType: !35, size: 32, offset: 2272)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !744, file: !129, line: 240, baseType: !790, size: 192, offset: 2304)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 192, elements: !86)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !792, line: 103, baseType: !793)
!792 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !794, line: 27, baseType: !795)
!794 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !796, line: 44, baseType: !797)
!796 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!797 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !744, file: !129, line: 241, baseType: !790, size: 192, offset: 2496)
