; ModuleID = 'ldecod_src/erc_do_p.c'
source_filename = "ldecod_src/erc_do_p.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.object_buffer = type { i8, i32, i32, [3 x i32] }
%struct.pic_motion_params = type { [2 x ptr], [2 x %struct.MotionVector], [2 x i8] }
%struct.MotionVector = type { i16, i16 }
%struct.macroblock = type { ptr, ptr, ptr, i32, %struct.BlockPos, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], [3 x i32], i32, i32, i32, i32, i16, i8, i8, i16, i16, ptr, ptr, ptr, ptr, i16, [2 x [4 x [4 x [2 x i16]]]], i32, [3 x i64], [3 x i64], [3 x i64], i32, [4 x i8], [4 x i8], i8, i8, i8, i16, i16, i16, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, i8 }
%struct.BlockPos = type { i16, i16 }
%struct.frame_store = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, i32, [2 x i32], [2 x i32] }

@.str = private unnamed_addr constant [29 x i8] c"ercConcealInterFrame: predMB\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [16 x i8] c"Missing POC=%d\0A\00", align 1, !dbg !7
@uv_div = internal unnamed_addr constant [2 x [4 x i32]] [[4 x i32] [i32 0, i32 1, i32 1, i32 0], [4 x i32] [i32 0, i32 1, i32 0, i32 0]], align 16, !dbg !12

!19 = !{!20, !21, !22, !23, !24}
!20 = !DIEnumerator(name: "CF_UNKNOWN", value: -1)
!21 = !DIEnumerator(name: "YUV400", value: 0)
!22 = !DIEnumerator(name: "YUV420", value: 1)
!23 = !DIEnumerator(name: "YUV422", value: 2)
!24 = !DIEnumerator(name: "YUV444", value: 3)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 15, baseType: !18, size: 32, elements: !26)
!26 = !{!27, !28, !29, !30}
!27 = !DIEnumerator(name: "CM_UNKNOWN", value: -1)
!28 = !DIEnumerator(name: "CM_YUV", value: 0)
!29 = !DIEnumerator(name: "CM_RGB", value: 1)
!30 = !DIEnumerator(name: "CM_XYZ", value: 2)
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !32, line: 25, baseType: !18, size: 32, elements: !33)
!32 = !DIFile(filename: "ldecod_src/inc/io_video.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1141c07f1801ad27d87214c419749431")
!33 = !{!34, !35, !36, !37, !38, !39}
!34 = !DIEnumerator(name: "VIDEO_UNKNOWN", value: -1)
!35 = !DIEnumerator(name: "VIDEO_YUV", value: 0)
!36 = !DIEnumerator(name: "VIDEO_RGB", value: 1)
!37 = !DIEnumerator(name: "VIDEO_XYZ", value: 2)
!38 = !DIEnumerator(name: "VIDEO_TIFF", value: 3)
!39 = !DIEnumerator(name: "VIDEO_AVI", value: 4)
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 135, baseType: !42, size: 32, elements: !43)
!41 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!42 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!43 = !{!44, !45, !46}
!44 = !DIEnumerator(name: "FRAME", value: 0)
!45 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!46 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 22, baseType: !42, size: 32, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54}
!49 = !DIEnumerator(name: "PLANE_Y", value: 0)
!50 = !DIEnumerator(name: "PLANE_U", value: 1)
!51 = !DIEnumerator(name: "PLANE_V", value: 2)
!52 = !DIEnumerator(name: "PLANE_G", value: 0)
!53 = !DIEnumerator(name: "PLANE_B", value: 1)
!54 = !DIEnumerator(name: "PLANE_R", value: 2)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 142, baseType: !42, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61, !62}
!57 = !DIEnumerator(name: "P_SLICE", value: 0)
!58 = !DIEnumerator(name: "B_SLICE", value: 1)
!59 = !DIEnumerator(name: "I_SLICE", value: 2)
!60 = !DIEnumerator(name: "SP_SLICE", value: 3)
!61 = !DIEnumerator(name: "SI_SLICE", value: 4)
!62 = !DIEnumerator(name: "NUM_SLICE_TYPES", value: 5)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 65, baseType: !42, size: 32, elements: !65)
!64 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!65 = !{!66, !67, !68}
!66 = !DIEnumerator(name: "LumaComp", value: 0)
!67 = !DIEnumerator(name: "CrComp", value: 1)
!68 = !DIEnumerator(name: "CbComp", value: 2)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 34, baseType: !42, size: 32, elements: !70)
!70 = !{!71, !72, !73, !74, !75}
!71 = !DIEnumerator(name: "LIST_0", value: 0)
!72 = !DIEnumerator(name: "LIST_1", value: 1)
!73 = !DIEnumerator(name: "BI_PRED", value: 2)
!74 = !DIEnumerator(name: "BI_PRED_L0", value: 3)
!75 = !DIEnumerator(name: "BI_PRED_L1", value: 4)
!76 = !{!77, !82, !18, !83, !84, !85, !86, !78, !221}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !79, line: 41, baseType: !80)
!79 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !79, line: 23, baseType: !81)
!81 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!83 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!84 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !88, line: 136, size: 192, elements: !89)
!88 = !DIFile(filename: "ldecod_src/inc/erc_api.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "9f38a583d5066807e951e2b61474101e")
!89 = !{!90, !219, !220}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !87, file: !88, line: 137, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !93, line: 138, baseType: !94)
!93 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !93, line: 46, size: 3328, elements: !95)
!95 = !{!96, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !133, !135, !136, !155, !159, !164, !166, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !187, !188, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !94, file: !93, line: 48, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !41, line: 140, baseType: !40)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !94, file: !93, line: 50, baseType: !18, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !94, file: !93, line: 51, baseType: !18, size: 32, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !94, file: !93, line: 52, baseType: !18, size: 32, offset: 96)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !94, file: !93, line: 53, baseType: !18, size: 32, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !94, file: !93, line: 54, baseType: !42, size: 32, offset: 160)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !94, file: !93, line: 55, baseType: !42, size: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !94, file: !93, line: 57, baseType: !18, size: 32, offset: 224)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !94, file: !93, line: 58, baseType: !18, size: 32, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !94, file: !93, line: 59, baseType: !18, size: 32, offset: 288)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !94, file: !93, line: 61, baseType: !108, size: 8, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !79, line: 21, baseType: !109)
!109 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !94, file: !93, line: 62, baseType: !18, size: 32, offset: 352)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !94, file: !93, line: 63, baseType: !18, size: 32, offset: 384)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !94, file: !93, line: 64, baseType: !18, size: 32, offset: 416)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !94, file: !93, line: 65, baseType: !18, size: 32, offset: 448)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !94, file: !93, line: 67, baseType: !84, size: 16, offset: 480)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !94, file: !93, line: 69, baseType: !18, size: 32, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !94, file: !93, line: 69, baseType: !18, size: 32, offset: 544)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !94, file: !93, line: 69, baseType: !18, size: 32, offset: 576)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !94, file: !93, line: 69, baseType: !18, size: 32, offset: 608)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !94, file: !93, line: 70, baseType: !18, size: 32, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !94, file: !93, line: 70, baseType: !18, size: 32, offset: 672)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !94, file: !93, line: 70, baseType: !18, size: 32, offset: 704)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !94, file: !93, line: 70, baseType: !18, size: 32, offset: 736)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !94, file: !93, line: 71, baseType: !18, size: 32, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !94, file: !93, line: 72, baseType: !18, size: 32, offset: 800)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !94, file: !93, line: 73, baseType: !42, size: 32, offset: 832)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !94, file: !93, line: 74, baseType: !42, size: 32, offset: 864)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !94, file: !93, line: 75, baseType: !18, size: 32, offset: 896)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !94, file: !93, line: 75, baseType: !18, size: 32, offset: 928)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !94, file: !93, line: 76, baseType: !18, size: 32, offset: 960)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !94, file: !93, line: 76, baseType: !18, size: 32, offset: 992)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !94, file: !93, line: 79, baseType: !132, size: 64, offset: 1024)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !94, file: !93, line: 80, baseType: !134, size: 64, offset: 1088)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !94, file: !93, line: 81, baseType: !134, size: 64, offset: 1152)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !94, file: !93, line: 84, baseType: !137, size: 64, offset: 1216)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !93, line: 36, size: 256, elements: !140)
!140 = !{!141, !146, !153}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !139, file: !93, line: 38, baseType: !142, size: 128)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 128, elements: !144)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!144 = !{!145}
!145 = !DISubrange(count: 2)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !139, file: !93, line: 39, baseType: !147, size: 64, offset: 128)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 64, elements: !144)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !64, line: 104, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 100, size: 32, elements: !150)
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !149, file: !64, line: 102, baseType: !84, size: 16)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !149, file: !64, line: 103, baseType: !84, size: 16, offset: 16)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !139, file: !93, line: 40, baseType: !154, size: 16, offset: 192)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 16, elements: !144)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !94, file: !93, line: 85, baseType: !156, size: 192, offset: 1280)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 192, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 3)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !94, file: !93, line: 87, baseType: !160, size: 64, offset: 1472)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !93, line: 29, size: 64, elements: !161)
!161 = !{!162}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !160, file: !93, line: 31, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !94, file: !93, line: 88, baseType: !165, size: 192, offset: 1536)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 192, elements: !157)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !94, file: !93, line: 90, baseType: !167, size: 64, offset: 1728)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !94, file: !93, line: 92, baseType: !143, size: 64, offset: 1792)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !94, file: !93, line: 93, baseType: !143, size: 64, offset: 1856)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !94, file: !93, line: 94, baseType: !143, size: 64, offset: 1920)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !94, file: !93, line: 96, baseType: !18, size: 32, offset: 1984)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !94, file: !93, line: 97, baseType: !18, size: 32, offset: 2016)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !94, file: !93, line: 98, baseType: !18, size: 32, offset: 2048)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !94, file: !93, line: 99, baseType: !18, size: 32, offset: 2080)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !94, file: !93, line: 100, baseType: !18, size: 32, offset: 2112)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !94, file: !93, line: 102, baseType: !18, size: 32, offset: 2144)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !94, file: !93, line: 103, baseType: !18, size: 32, offset: 2176)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !94, file: !93, line: 104, baseType: !18, size: 32, offset: 2208)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !94, file: !93, line: 105, baseType: !18, size: 32, offset: 2240)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !94, file: !93, line: 106, baseType: !18, size: 32, offset: 2272)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !94, file: !93, line: 107, baseType: !18, size: 32, offset: 2304)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !94, file: !93, line: 108, baseType: !18, size: 32, offset: 2336)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !94, file: !93, line: 109, baseType: !18, size: 32, offset: 2368)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !94, file: !93, line: 110, baseType: !186, size: 64, offset: 2400)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, elements: !144)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !94, file: !93, line: 111, baseType: !18, size: 32, offset: 2464)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !94, file: !93, line: 112, baseType: !189, size: 64, offset: 2496)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !64, line: 194, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !64, line: 186, size: 256, elements: !192)
!192 = !{!193, !194, !195, !196, !197, !198}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !191, file: !64, line: 188, baseType: !18, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !191, file: !64, line: 189, baseType: !18, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !191, file: !64, line: 190, baseType: !18, size: 32, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !191, file: !64, line: 191, baseType: !18, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !191, file: !64, line: 192, baseType: !18, size: 32, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !191, file: !64, line: 193, baseType: !199, size: 64, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !94, file: !93, line: 115, baseType: !18, size: 32, offset: 2560)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !94, file: !93, line: 118, baseType: !18, size: 32, offset: 2592)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !94, file: !93, line: 119, baseType: !18, size: 32, offset: 2624)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !94, file: !93, line: 120, baseType: !18, size: 32, offset: 2656)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !94, file: !93, line: 121, baseType: !77, size: 64, offset: 2688)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !94, file: !93, line: 124, baseType: !18, size: 32, offset: 2752)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !94, file: !93, line: 125, baseType: !18, size: 32, offset: 2784)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !94, file: !93, line: 126, baseType: !18, size: 32, offset: 2816)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !94, file: !93, line: 128, baseType: !18, size: 32, offset: 2848)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !94, file: !93, line: 129, baseType: !18, size: 32, offset: 2880)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !94, file: !93, line: 130, baseType: !18, size: 32, offset: 2912)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !94, file: !93, line: 131, baseType: !18, size: 32, offset: 2944)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !94, file: !93, line: 132, baseType: !132, size: 64, offset: 3008)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !94, file: !93, line: 133, baseType: !18, size: 32, offset: 3072)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !94, file: !93, line: 134, baseType: !18, size: 32, offset: 3104)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !94, file: !93, line: 136, baseType: !154, size: 16, offset: 3136)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !94, file: !93, line: 137, baseType: !217, size: 128, offset: 3200)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 128, elements: !144)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "missingpocs", scope: !87, file: !88, line: 138, baseType: !18, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !87, file: !88, line: 139, baseType: !86, size: 64, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!222 = !{!0, !7, !12, !223, !231, !233}
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "subblk_offset_y", scope: !14, file: !225, line: 69, type: !226, isLocal: true, isDefinition: true)
!225 = !DIFile(filename: "ldecod_src/inc/block.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e90b7727b4f0f4492b5dc2d8d9d6a429")
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 768, elements: !228)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!228 = !{!158, !229, !230}
!229 = !DISubrange(count: 8)
!230 = !DISubrange(count: 4)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "subblk_offset_x", scope: !14, file: !225, line: 34, type: !226, isLocal: true, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "INT_BITS", scope: !235, file: !236, line: 118, type: !242, isLocal: true, isDefinition: true)
!235 = distinct !DISubprogram(name: "iabs", scope: !236, file: !236, line: 116, type: !237, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !239)
!236 = !DIFile(filename: "ldecod_src/inc/ifunctions.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "279401589ed56df99e287ad9e5fc564b")
!237 = !DISubroutineType(types: !238)
!238 = !{!18, !18}
!239 = !{!240, !241}
!240 = !DILocalVariable(name: "x", arg: 1, scope: !235, file: !236, line: 116, type: !18)
!241 = !DILocalVariable(name: "y", scope: !235, file: !236, line: 119, type: !18)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 256, elements: !244)
!244 = !{!145, !230}
!245 = !{i32 7, !"Dwarf Version", i32 5}
!246 = !{i32 2, !"Debug Info Version", i32 3}
!247 = !{i32 1, !"wchar_size", i32 4}
!248 = !{i32 8, !"PIC Level", i32 2}
!249 = !{i32 7, !"PIE Level", i32 2}
!250 = !{i32 7, !"uwtable", i32 2}
!251 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!252 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!253 = distinct !DISubprogram(name: "ercConcealInterFrame", scope: !2, file: !2, line: 74, type: !254, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !1333)
!254 = !DISubroutineType(types: !255)
!255 = !{!18, !256, !1329, !18, !18, !1331, !18}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "frame", file: !258, line: 39, baseType: !259)
!258 = !DIFile(filename: "ldecod_src/inc/erc_globals.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c27fab662deb7c381592b003d3b76fc7")
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_s", file: !258, line: 33, size: 256, elements: !260)
!260 = !{!261, !1326, !1327, !1328}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !259, file: !258, line: 35, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !64, line: 836, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !64, line: 566, size: 6855040, elements: !265)
!265 = !{!266, !348, !399, !502, !504, !506, !563, !565, !566, !567, !568, !569, !572, !589, !601, !602, !603, !604, !605, !606, !1051, !1052, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1062, !1065, !1066, !1068, !1069, !1070, !1071, !1072, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1197, !1198, !1200, !1201, !1209, !1231, !1232, !1233, !1237, !1240, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1252, !1255, !1256, !1257, !1258, !1261, !1266, !1270, !1274, !1278, !1279, !1283, !1284, !1288, !1289, !1293, !1314, !1315, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !264, file: !64, line: 568, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !64, line: 850, size: 32128, elements: !269)
!269 = !{!270, !274, !275, !276, !277, !278, !279, !280, !281, !282, !310, !311, !312, !313, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !268, file: !64, line: 852, baseType: !271, size: 2040)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 255)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !268, file: !64, line: 853, baseType: !271, size: 2040, offset: 2040)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !268, file: !64, line: 854, baseType: !271, size: 2040, offset: 4080)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !268, file: !64, line: 856, baseType: !18, size: 32, offset: 6144)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !268, file: !64, line: 857, baseType: !18, size: 32, offset: 6176)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !268, file: !64, line: 858, baseType: !18, size: 32, offset: 6208)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !268, file: !64, line: 859, baseType: !18, size: 32, offset: 6240)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !268, file: !64, line: 860, baseType: !18, size: 32, offset: 6272)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !268, file: !64, line: 861, baseType: !18, size: 32, offset: 6304)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !268, file: !64, line: 864, baseType: !283, size: 1088, offset: 6336)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !17, line: 52, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !17, line: 30, size: 1088, elements: !285)
!285 = !{!286, !288, !290, !292, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !284, file: !17, line: 32, baseType: !287, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !17, line: 28, baseType: !16)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !284, file: !17, line: 33, baseType: !289, size: 32, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !17, line: 20, baseType: !25)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !284, file: !17, line: 34, baseType: !291, size: 64, offset: 64)
!291 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !284, file: !17, line: 35, baseType: !293, size: 96, offset: 128)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 96, elements: !157)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !284, file: !17, line: 36, baseType: !293, size: 96, offset: 224)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !284, file: !17, line: 37, baseType: !18, size: 32, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !284, file: !17, line: 38, baseType: !18, size: 32, offset: 352)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !284, file: !17, line: 39, baseType: !18, size: 32, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !284, file: !17, line: 40, baseType: !18, size: 32, offset: 416)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !284, file: !17, line: 41, baseType: !18, size: 32, offset: 448)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !284, file: !17, line: 42, baseType: !18, size: 32, offset: 480)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !284, file: !17, line: 43, baseType: !18, size: 32, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !284, file: !17, line: 44, baseType: !18, size: 32, offset: 544)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !284, file: !17, line: 45, baseType: !293, size: 96, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !284, file: !17, line: 46, baseType: !18, size: 32, offset: 672)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !284, file: !17, line: 47, baseType: !293, size: 96, offset: 704)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !284, file: !17, line: 48, baseType: !293, size: 96, offset: 800)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !284, file: !17, line: 49, baseType: !293, size: 96, offset: 896)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !284, file: !17, line: 50, baseType: !18, size: 32, offset: 992)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !284, file: !17, line: 51, baseType: !18, size: 32, offset: 1024)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !268, file: !64, line: 865, baseType: !283, size: 1088, offset: 7424)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !268, file: !64, line: 867, baseType: !18, size: 32, offset: 8512)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !268, file: !64, line: 868, baseType: !18, size: 32, offset: 8544)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !268, file: !64, line: 869, baseType: !314, size: 7744, offset: 8576)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !32, line: 60, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !32, line: 34, size: 7744, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !315, file: !32, line: 37, baseType: !271, size: 2040)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !315, file: !32, line: 38, baseType: !271, size: 2040, offset: 2040)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !315, file: !32, line: 39, baseType: !271, size: 2040, offset: 4080)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !315, file: !32, line: 40, baseType: !18, size: 32, offset: 6144)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !315, file: !32, line: 41, baseType: !322, size: 32, offset: 6176)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !32, line: 32, baseType: !31)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !315, file: !32, line: 42, baseType: !283, size: 1088, offset: 6208)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !315, file: !32, line: 43, baseType: !18, size: 32, offset: 7296)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !315, file: !32, line: 44, baseType: !18, size: 32, offset: 7328)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !315, file: !32, line: 45, baseType: !18, size: 32, offset: 7360)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !315, file: !32, line: 46, baseType: !18, size: 32, offset: 7392)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !315, file: !32, line: 47, baseType: !18, size: 32, offset: 7424)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !315, file: !32, line: 48, baseType: !18, size: 32, offset: 7456)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !315, file: !32, line: 49, baseType: !18, size: 32, offset: 7488)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !315, file: !32, line: 50, baseType: !18, size: 32, offset: 7520)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !315, file: !32, line: 51, baseType: !18, size: 32, offset: 7552)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !315, file: !32, line: 52, baseType: !18, size: 32, offset: 7584)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !315, file: !32, line: 53, baseType: !18, size: 32, offset: 7616)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !315, file: !32, line: 56, baseType: !85, size: 64, offset: 7680)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !268, file: !64, line: 870, baseType: !314, size: 7744, offset: 16320)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !268, file: !64, line: 871, baseType: !314, size: 7744, offset: 24064)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !268, file: !64, line: 873, baseType: !18, size: 32, offset: 31808)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !268, file: !64, line: 884, baseType: !18, size: 32, offset: 31840)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !268, file: !64, line: 885, baseType: !18, size: 32, offset: 31872)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !268, file: !64, line: 886, baseType: !18, size: 32, offset: 31904)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !268, file: !64, line: 890, baseType: !18, size: 32, offset: 31936)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !268, file: !64, line: 893, baseType: !18, size: 32, offset: 31968)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !268, file: !64, line: 894, baseType: !18, size: 32, offset: 32000)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !268, file: !64, line: 895, baseType: !18, size: 32, offset: 32032)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !268, file: !64, line: 897, baseType: !18, size: 32, offset: 32064)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !268, file: !64, line: 899, baseType: !18, size: 32, offset: 32096)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !264, file: !64, line: 569, baseType: !349, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !351, line: 138, baseType: !352)
!351 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 94, size: 17728, elements: !353)
!353 = !{!354, !355, !356, !357, !358, !359, !360, !364, !368, !372, !375, !376, !377, !378, !379, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !352, file: !351, line: 96, baseType: !18, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !352, file: !351, line: 97, baseType: !42, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !352, file: !351, line: 98, baseType: !42, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !352, file: !351, line: 99, baseType: !18, size: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !352, file: !351, line: 100, baseType: !18, size: 32, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !352, file: !351, line: 102, baseType: !18, size: 32, offset: 160)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !352, file: !351, line: 103, baseType: !361, size: 384, offset: 192)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 384, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 12)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !352, file: !351, line: 104, baseType: !365, size: 3072, offset: 576)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 3072, elements: !366)
!366 = !{!367, !11}
!367 = !DISubrange(count: 6)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !352, file: !351, line: 105, baseType: !369, size: 12288, offset: 3648)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 12288, elements: !370)
!370 = !{!367, !371}
!371 = !DISubrange(count: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !352, file: !351, line: 106, baseType: !373, size: 192, offset: 15936)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 192, elements: !374)
!374 = !{!367}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !352, file: !351, line: 107, baseType: !373, size: 192, offset: 16128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !352, file: !351, line: 110, baseType: !18, size: 32, offset: 16320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !352, file: !351, line: 111, baseType: !42, size: 32, offset: 16352)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !352, file: !351, line: 112, baseType: !42, size: 32, offset: 16384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !352, file: !351, line: 114, baseType: !380, size: 256, offset: 16416)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 256, elements: !381)
!381 = !{!229}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !352, file: !351, line: 116, baseType: !380, size: 256, offset: 16672)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !352, file: !351, line: 117, baseType: !380, size: 256, offset: 16928)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !352, file: !351, line: 119, baseType: !18, size: 32, offset: 17184)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !352, file: !351, line: 120, baseType: !42, size: 32, offset: 17216)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !352, file: !351, line: 122, baseType: !42, size: 32, offset: 17248)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !352, file: !351, line: 123, baseType: !163, size: 64, offset: 17280)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !352, file: !351, line: 125, baseType: !18, size: 32, offset: 17344)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !352, file: !351, line: 126, baseType: !18, size: 32, offset: 17376)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !352, file: !351, line: 127, baseType: !18, size: 32, offset: 17408)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !352, file: !351, line: 128, baseType: !42, size: 32, offset: 17440)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !352, file: !351, line: 129, baseType: !18, size: 32, offset: 17472)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !352, file: !351, line: 130, baseType: !18, size: 32, offset: 17504)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !352, file: !351, line: 131, baseType: !18, size: 32, offset: 17536)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !352, file: !351, line: 133, baseType: !18, size: 32, offset: 17568)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !352, file: !351, line: 135, baseType: !18, size: 32, offset: 17600)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !352, file: !351, line: 136, baseType: !18, size: 32, offset: 17632)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !352, file: !351, line: 137, baseType: !18, size: 32, offset: 17664)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !264, file: !64, line: 570, baseType: !400, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !351, line: 197, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 142, size: 33024, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !500, !501}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !402, file: !351, line: 144, baseType: !18, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !402, file: !351, line: 146, baseType: !42, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !402, file: !351, line: 147, baseType: !18, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !402, file: !351, line: 148, baseType: !18, size: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !402, file: !351, line: 149, baseType: !18, size: 32, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !402, file: !351, line: 150, baseType: !18, size: 32, offset: 160)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !402, file: !351, line: 152, baseType: !18, size: 32, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !402, file: !351, line: 154, baseType: !42, size: 32, offset: 224)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !402, file: !351, line: 155, baseType: !42, size: 32, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !402, file: !351, line: 156, baseType: !42, size: 32, offset: 288)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !402, file: !351, line: 158, baseType: !18, size: 32, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !402, file: !351, line: 159, baseType: !361, size: 384, offset: 352)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !402, file: !351, line: 160, baseType: !365, size: 3072, offset: 736)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !402, file: !351, line: 161, baseType: !369, size: 12288, offset: 3808)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !402, file: !351, line: 162, baseType: !373, size: 192, offset: 16096)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !402, file: !351, line: 163, baseType: !373, size: 192, offset: 16288)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !402, file: !351, line: 165, baseType: !42, size: 32, offset: 16480)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !402, file: !351, line: 166, baseType: !42, size: 32, offset: 16512)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !402, file: !351, line: 167, baseType: !42, size: 32, offset: 16544)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !402, file: !351, line: 168, baseType: !42, size: 32, offset: 16576)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !402, file: !351, line: 170, baseType: !42, size: 32, offset: 16608)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !402, file: !351, line: 172, baseType: !18, size: 32, offset: 16640)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !402, file: !351, line: 173, baseType: !18, size: 32, offset: 16672)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !402, file: !351, line: 174, baseType: !18, size: 32, offset: 16704)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !402, file: !351, line: 175, baseType: !42, size: 32, offset: 16736)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !402, file: !351, line: 177, baseType: !430, size: 8192, offset: 16768)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8192, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !402, file: !351, line: 178, baseType: !42, size: 32, offset: 24960)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !402, file: !351, line: 179, baseType: !18, size: 32, offset: 24992)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !402, file: !351, line: 180, baseType: !42, size: 32, offset: 25024)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !402, file: !351, line: 181, baseType: !42, size: 32, offset: 25056)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !402, file: !351, line: 182, baseType: !18, size: 32, offset: 25088)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !402, file: !351, line: 184, baseType: !18, size: 32, offset: 25120)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !402, file: !351, line: 185, baseType: !18, size: 32, offset: 25152)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !402, file: !351, line: 186, baseType: !18, size: 32, offset: 25184)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !402, file: !351, line: 187, baseType: !42, size: 32, offset: 25216)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !402, file: !351, line: 188, baseType: !42, size: 32, offset: 25248)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !402, file: !351, line: 189, baseType: !42, size: 32, offset: 25280)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !402, file: !351, line: 190, baseType: !42, size: 32, offset: 25312)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !402, file: !351, line: 191, baseType: !18, size: 32, offset: 25344)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !402, file: !351, line: 192, baseType: !447, size: 7584, offset: 25376)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !351, line: 90, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 53, size: 7584, elements: !449)
!449 = !{!450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !448, file: !351, line: 55, baseType: !18, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !448, file: !351, line: 56, baseType: !42, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !448, file: !351, line: 57, baseType: !81, size: 16, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !448, file: !351, line: 58, baseType: !81, size: 16, offset: 80)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !448, file: !351, line: 59, baseType: !18, size: 32, offset: 96)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !448, file: !351, line: 60, baseType: !18, size: 32, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !448, file: !351, line: 61, baseType: !18, size: 32, offset: 160)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !448, file: !351, line: 62, baseType: !42, size: 32, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !448, file: !351, line: 63, baseType: !18, size: 32, offset: 224)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !448, file: !351, line: 64, baseType: !18, size: 32, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !448, file: !351, line: 65, baseType: !42, size: 32, offset: 288)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !448, file: !351, line: 66, baseType: !42, size: 32, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !448, file: !351, line: 67, baseType: !42, size: 32, offset: 352)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !448, file: !351, line: 68, baseType: !18, size: 32, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !448, file: !351, line: 69, baseType: !42, size: 32, offset: 416)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !448, file: !351, line: 70, baseType: !42, size: 32, offset: 448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !448, file: !351, line: 71, baseType: !18, size: 32, offset: 480)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !448, file: !351, line: 72, baseType: !42, size: 32, offset: 512)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !448, file: !351, line: 73, baseType: !42, size: 32, offset: 544)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !448, file: !351, line: 74, baseType: !18, size: 32, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !448, file: !351, line: 75, baseType: !18, size: 32, offset: 608)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !448, file: !351, line: 76, baseType: !472, size: 3296, offset: 640)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !351, line: 50, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 38, size: 3296, elements: !474)
!474 = !{!475, !476, !477, !478, !482, !483, !484, !485, !486, !487}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !473, file: !351, line: 40, baseType: !42, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !473, file: !351, line: 41, baseType: !42, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !473, file: !351, line: 42, baseType: !42, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !473, file: !351, line: 43, baseType: !479, size: 1024, offset: 96)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 1024, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !473, file: !351, line: 44, baseType: !479, size: 1024, offset: 1120)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !473, file: !351, line: 45, baseType: !479, size: 1024, offset: 2144)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !473, file: !351, line: 46, baseType: !42, size: 32, offset: 3168)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !473, file: !351, line: 47, baseType: !42, size: 32, offset: 3200)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !473, file: !351, line: 48, baseType: !42, size: 32, offset: 3232)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !473, file: !351, line: 49, baseType: !42, size: 32, offset: 3264)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !448, file: !351, line: 77, baseType: !18, size: 32, offset: 3936)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !448, file: !351, line: 78, baseType: !472, size: 3296, offset: 3968)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !448, file: !351, line: 80, baseType: !18, size: 32, offset: 7264)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !448, file: !351, line: 81, baseType: !18, size: 32, offset: 7296)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !448, file: !351, line: 82, baseType: !18, size: 32, offset: 7328)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !448, file: !351, line: 83, baseType: !18, size: 32, offset: 7360)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !448, file: !351, line: 84, baseType: !42, size: 32, offset: 7392)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !448, file: !351, line: 85, baseType: !42, size: 32, offset: 7424)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !448, file: !351, line: 86, baseType: !42, size: 32, offset: 7456)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !448, file: !351, line: 87, baseType: !42, size: 32, offset: 7488)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !448, file: !351, line: 88, baseType: !42, size: 32, offset: 7520)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !448, file: !351, line: 89, baseType: !42, size: 32, offset: 7552)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !402, file: !351, line: 193, baseType: !42, size: 32, offset: 32960)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !402, file: !351, line: 195, baseType: !18, size: 32, offset: 32992)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !264, file: !64, line: 571, baseType: !503, size: 1056768, offset: 192)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 1056768, elements: !480)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !264, file: !64, line: 572, baseType: !505, size: 4538368, offset: 1056960)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 4538368, elements: !431)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !264, file: !64, line: 575, baseType: !507, size: 64, offset: 5595328)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !351, line: 256, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !351, line: 228, size: 37312, elements: !510)
!510 = !{!511, !512, !513, !514, !515, !516, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !531, !532, !533, !534}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !509, file: !351, line: 230, baseType: !401, size: 33024)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !509, file: !351, line: 232, baseType: !42, size: 32, offset: 33024)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !509, file: !351, line: 233, baseType: !18, size: 32, offset: 33056)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !509, file: !351, line: 234, baseType: !85, size: 64, offset: 33088)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !509, file: !351, line: 235, baseType: !85, size: 64, offset: 33152)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !509, file: !351, line: 236, baseType: !517, size: 64, offset: 33216)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !509, file: !351, line: 237, baseType: !85, size: 64, offset: 33280)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !509, file: !351, line: 238, baseType: !517, size: 64, offset: 33344)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !509, file: !351, line: 240, baseType: !85, size: 64, offset: 33408)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !509, file: !351, line: 241, baseType: !517, size: 64, offset: 33472)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !509, file: !351, line: 242, baseType: !85, size: 64, offset: 33536)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !509, file: !351, line: 243, baseType: !517, size: 64, offset: 33600)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !509, file: !351, line: 245, baseType: !18, size: 32, offset: 33664)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !509, file: !351, line: 246, baseType: !85, size: 64, offset: 33728)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !509, file: !351, line: 247, baseType: !85, size: 64, offset: 33792)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !509, file: !351, line: 248, baseType: !517, size: 64, offset: 33856)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !509, file: !351, line: 249, baseType: !517, size: 64, offset: 33920)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !509, file: !351, line: 250, baseType: !530, size: 64, offset: 33984)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !509, file: !351, line: 251, baseType: !517, size: 64, offset: 34048)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !509, file: !351, line: 253, baseType: !42, size: 32, offset: 34112)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !509, file: !351, line: 254, baseType: !18, size: 32, offset: 34144)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !509, file: !351, line: 255, baseType: !535, size: 3136, offset: 34176)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !351, line: 226, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !351, line: 200, size: 3136, elements: !537)
!537 = !{!538, !539, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !556, !557, !559, !560, !561, !562}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !536, file: !351, line: 202, baseType: !18, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !536, file: !351, line: 203, baseType: !540, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !536, file: !351, line: 204, baseType: !85, size: 64, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !536, file: !351, line: 205, baseType: !517, size: 64, offset: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !536, file: !351, line: 206, baseType: !540, size: 64, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !536, file: !351, line: 207, baseType: !85, size: 64, offset: 320)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !536, file: !351, line: 208, baseType: !85, size: 64, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !536, file: !351, line: 209, baseType: !540, size: 64, offset: 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !536, file: !351, line: 210, baseType: !540, size: 64, offset: 512)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !536, file: !351, line: 211, baseType: !540, size: 64, offset: 576)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !536, file: !351, line: 212, baseType: !540, size: 64, offset: 640)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !536, file: !351, line: 213, baseType: !540, size: 64, offset: 704)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !536, file: !351, line: 216, baseType: !83, size: 8, offset: 768)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !536, file: !351, line: 217, baseType: !83, size: 8, offset: 776)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !536, file: !351, line: 218, baseType: !83, size: 8, offset: 784)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !536, file: !351, line: 219, baseType: !555, size: 1024, offset: 800)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 1024, elements: !480)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !536, file: !351, line: 220, baseType: !555, size: 1024, offset: 1824)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !536, file: !351, line: 221, baseType: !558, size: 256, offset: 2848)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 256, elements: !480)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !536, file: !351, line: 222, baseType: !83, size: 8, offset: 3104)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !536, file: !351, line: 223, baseType: !83, size: 8, offset: 3112)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !536, file: !351, line: 224, baseType: !83, size: 8, offset: 3120)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !536, file: !351, line: 225, baseType: !83, size: 8, offset: 3128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !264, file: !64, line: 577, baseType: !564, size: 1193984, offset: 5595392)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 1193984, elements: !480)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !264, file: !64, line: 578, baseType: !18, size: 32, offset: 6789376)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !264, file: !64, line: 579, baseType: !18, size: 32, offset: 6789408)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !264, file: !64, line: 580, baseType: !18, size: 32, offset: 6789440)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !264, file: !64, line: 581, baseType: !18, size: 32, offset: 6789472)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !264, file: !64, line: 584, baseType: !570, size: 64, offset: 6789504)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !64, line: 584, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !264, file: !64, line: 586, baseType: !573, size: 64, offset: 6789568)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !64, line: 902, size: 416, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !574, file: !64, line: 904, baseType: !42, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !574, file: !64, line: 905, baseType: !42, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !574, file: !64, line: 906, baseType: !18, size: 32, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !574, file: !64, line: 907, baseType: !42, size: 32, offset: 96)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !574, file: !64, line: 908, baseType: !18, size: 32, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !574, file: !64, line: 909, baseType: !186, size: 64, offset: 160)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !574, file: !64, line: 910, baseType: !108, size: 8, offset: 224)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !574, file: !64, line: 911, baseType: !108, size: 8, offset: 232)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !574, file: !64, line: 912, baseType: !18, size: 32, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !574, file: !64, line: 913, baseType: !18, size: 32, offset: 288)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !574, file: !64, line: 915, baseType: !18, size: 32, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !574, file: !64, line: 916, baseType: !18, size: 32, offset: 352)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !574, file: !64, line: 917, baseType: !18, size: 32, offset: 384)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !264, file: !64, line: 587, baseType: !590, size: 64, offset: 6789632)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !64, line: 839, size: 512, elements: !592)
!592 = !{!593, !594, !597, !598, !599, !600}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !591, file: !64, line: 841, baseType: !18, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !591, file: !64, line: 842, baseType: !595, size: 96, offset: 32)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 96, elements: !157)
!596 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !591, file: !64, line: 843, baseType: !595, size: 96, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !591, file: !64, line: 844, baseType: !595, size: 96, offset: 224)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !591, file: !64, line: 845, baseType: !595, size: 96, offset: 320)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !591, file: !64, line: 846, baseType: !595, size: 96, offset: 416)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !264, file: !64, line: 588, baseType: !18, size: 32, offset: 6789696)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !264, file: !64, line: 591, baseType: !42, size: 32, offset: 6789728)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !264, file: !64, line: 592, baseType: !18, size: 32, offset: 6789760)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !264, file: !64, line: 593, baseType: !18, size: 32, offset: 6789792)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !264, file: !64, line: 594, baseType: !18, size: 32, offset: 6789824)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !264, file: !64, line: 595, baseType: !607, size: 64, offset: 6789888)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !64, line: 542, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !64, line: 341, size: 109184, elements: !611)
!611 = !{!612, !614, !615, !616, !617, !618, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !716, !718, !880, !909, !936, !939, !940, !942, !943, !944, !945, !946, !947, !948, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !974, !975, !976, !977, !978, !979, !982, !983, !986, !987, !989, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1002, !1003, !1004, !1005, !1006, !1009, !1010, !1011, !1015, !1019, !1023, !1027, !1031, !1032, !1033, !1034, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1048, !1049}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !610, file: !64, line: 343, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !610, file: !64, line: 344, baseType: !267, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !610, file: !64, line: 345, baseType: !349, size: 64, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !610, file: !64, line: 346, baseType: !400, size: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "svc_extension_flag", scope: !610, file: !64, line: 347, baseType: !18, size: 32, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !610, file: !64, line: 350, baseType: !619, size: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !93, line: 186, size: 33408, elements: !621)
!621 = !{!622, !623, !626, !650, !651, !652, !653, !654, !655, !656, !657, !658, !662, !663, !664}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !620, file: !93, line: 188, baseType: !262, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !620, file: !93, line: 189, baseType: !624, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !64, line: 900, baseType: !268)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !620, file: !93, line: 190, baseType: !627, size: 64, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !93, line: 182, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !93, line: 152, size: 768, elements: !631)
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !630, file: !93, line: 154, baseType: !18, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !630, file: !93, line: 155, baseType: !18, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !630, file: !93, line: 156, baseType: !18, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !630, file: !93, line: 157, baseType: !18, size: 32, offset: 96)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !630, file: !93, line: 159, baseType: !18, size: 32, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !630, file: !93, line: 161, baseType: !42, size: 32, offset: 160)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !630, file: !93, line: 162, baseType: !42, size: 32, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !630, file: !93, line: 164, baseType: !18, size: 32, offset: 224)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !630, file: !93, line: 165, baseType: !18, size: 32, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !630, file: !93, line: 166, baseType: !18, size: 32, offset: 288)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !630, file: !93, line: 167, baseType: !18, size: 32, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !630, file: !93, line: 170, baseType: !18, size: 32, offset: 352)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !630, file: !93, line: 172, baseType: !91, size: 64, offset: 384)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !630, file: !93, line: 173, baseType: !91, size: 64, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !630, file: !93, line: 174, baseType: !91, size: 64, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !630, file: !93, line: 177, baseType: !18, size: 32, offset: 576)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !630, file: !93, line: 178, baseType: !186, size: 64, offset: 608)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !630, file: !93, line: 179, baseType: !186, size: 64, offset: 672)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ref", scope: !620, file: !93, line: 191, baseType: !627, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ltref", scope: !620, file: !93, line: 192, baseType: !627, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !620, file: !93, line: 193, baseType: !42, size: 32, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !620, file: !93, line: 194, baseType: !42, size: 32, offset: 352)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frames_in_buffer", scope: !620, file: !93, line: 195, baseType: !42, size: 32, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ltref_frames_in_buffer", scope: !620, file: !93, line: 196, baseType: !42, size: 32, offset: 416)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_poc", scope: !620, file: !93, line: 197, baseType: !18, size: 32, offset: 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_view_id", scope: !620, file: !93, line: 199, baseType: !18, size: 32, offset: 480)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_pic_idx", scope: !620, file: !93, line: 200, baseType: !659, size: 32768, offset: 512)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 32768, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 1024)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "init_done", scope: !620, file: !93, line: 205, baseType: !18, size: 32, offset: 33280)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !620, file: !93, line: 206, baseType: !18, size: 32, offset: 33312)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "last_picture", scope: !620, file: !93, line: 208, baseType: !628, size: 64, offset: 33344)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !610, file: !64, line: 353, baseType: !18, size: 32, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !610, file: !64, line: 354, baseType: !18, size: 32, offset: 416)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !610, file: !64, line: 355, baseType: !18, size: 32, offset: 448)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "Transform8x8Mode", scope: !610, file: !64, line: 356, baseType: !18, size: 32, offset: 480)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "is_not_independent", scope: !610, file: !64, line: 357, baseType: !18, size: 32, offset: 512)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "toppoc", scope: !610, file: !64, line: 359, baseType: !18, size: 32, offset: 544)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "bottompoc", scope: !610, file: !64, line: 360, baseType: !18, size: 32, offset: 576)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "framepoc", scope: !610, file: !64, line: 361, baseType: !18, size: 32, offset: 608)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !610, file: !64, line: 365, baseType: !42, size: 32, offset: 640)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !610, file: !64, line: 366, baseType: !18, size: 32, offset: 672)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !610, file: !64, line: 368, baseType: !186, size: 64, offset: 704)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntMsb", scope: !610, file: !64, line: 372, baseType: !18, size: 32, offset: 768)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "AbsFrameNum", scope: !610, file: !64, line: 378, baseType: !42, size: 32, offset: 800)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !610, file: !64, line: 379, baseType: !18, size: 32, offset: 832)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "current_mb_nr", scope: !610, file: !64, line: 387, baseType: !42, size: 32, offset: 864)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !610, file: !64, line: 388, baseType: !42, size: 32, offset: 896)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "current_slice_nr", scope: !610, file: !64, line: 389, baseType: !84, size: 16, offset: 928)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "cod_counter", scope: !610, file: !64, line: 396, baseType: !18, size: 32, offset: 960)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "allrefzero", scope: !610, file: !64, line: 397, baseType: !18, size: 32, offset: 992)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !610, file: !64, line: 400, baseType: !18, size: 32, offset: 1024)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !610, file: !64, line: 401, baseType: !18, size: 32, offset: 1056)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_active", scope: !610, file: !64, line: 402, baseType: !186, size: 64, offset: 1088)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !610, file: !64, line: 406, baseType: !18, size: 32, offset: 1152)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !610, file: !64, line: 407, baseType: !18, size: 32, offset: 1184)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !610, file: !64, line: 408, baseType: !18, size: 32, offset: 1216)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "qs", scope: !610, file: !64, line: 409, baseType: !18, size: 32, offset: 1248)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qs_delta", scope: !610, file: !64, line: 410, baseType: !18, size: 32, offset: 1280)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !610, file: !64, line: 411, baseType: !18, size: 32, offset: 1312)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "model_number", scope: !610, file: !64, line: 412, baseType: !18, size: 32, offset: 1344)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !610, file: !64, line: 413, baseType: !42, size: 32, offset: 1376)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !610, file: !64, line: 414, baseType: !42, size: 32, offset: 1408)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !610, file: !64, line: 415, baseType: !108, size: 8, offset: 1440)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !610, file: !64, line: 416, baseType: !97, size: 32, offset: 1472)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !610, file: !64, line: 417, baseType: !18, size: 32, offset: 1504)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "end_mb_nr_plus1", scope: !610, file: !64, line: 418, baseType: !18, size: 32, offset: 1536)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !610, file: !64, line: 419, baseType: !18, size: 32, offset: 1568)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "dp_mode", scope: !610, file: !64, line: 420, baseType: !18, size: 32, offset: 1600)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "current_header", scope: !610, file: !64, line: 421, baseType: !18, size: 32, offset: 1632)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "next_header", scope: !610, file: !64, line: 422, baseType: !18, size: 32, offset: 1664)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "last_dquant", scope: !610, file: !64, line: 423, baseType: !18, size: 32, offset: 1696)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "colour_plane_id", scope: !610, file: !64, line: 426, baseType: !18, size: 32, offset: 1728)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !610, file: !64, line: 427, baseType: !18, size: 32, offset: 1760)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sp_switch", scope: !610, file: !64, line: 428, baseType: !18, size: 32, offset: 1792)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !610, file: !64, line: 429, baseType: !18, size: 32, offset: 1824)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_slice_ref_idx", scope: !610, file: !64, line: 430, baseType: !18, size: 32, offset: 1856)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !610, file: !64, line: 431, baseType: !18, size: 32, offset: 1888)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !610, file: !64, line: 432, baseType: !18, size: 32, offset: 1920)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !610, file: !64, line: 433, baseType: !18, size: 32, offset: 1952)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !610, file: !64, line: 434, baseType: !189, size: 64, offset: 1984)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !610, file: !64, line: 436, baseType: !715, size: 48, offset: 2048)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 48, elements: !374)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !610, file: !64, line: 437, baseType: !717, size: 384, offset: 2112)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 384, elements: !374)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !610, file: !64, line: 440, baseType: !719, size: 64, offset: 2496)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !64, line: 324, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !64, line: 314, size: 384, elements: !722)
!722 = !{!723, !734, !743}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !721, file: !64, line: 317, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !64, line: 47, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream", file: !64, line: 300, size: 256, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "read_len", scope: !726, file: !64, line: 303, baseType: !18, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !726, file: !64, line: 304, baseType: !18, size: 32, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bitoffset", scope: !726, file: !64, line: 306, baseType: !18, size: 32, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_length", scope: !726, file: !64, line: 307, baseType: !18, size: 32, offset: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !726, file: !64, line: 309, baseType: !163, size: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !726, file: !64, line: 310, baseType: !18, size: 32, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "de_cabac", scope: !721, file: !64, line: 318, baseType: !735, size: 256, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !64, line: 95, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 88, size: 256, elements: !737)
!737 = !{!738, !739, !740, !741, !742}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !736, file: !64, line: 90, baseType: !42, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !736, file: !64, line: 91, baseType: !42, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !736, file: !64, line: 92, baseType: !18, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !736, file: !64, line: 93, baseType: !163, size: 64, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !736, file: !64, line: 94, baseType: !85, size: 64, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "readSyntaxElement", scope: !721, file: !64, line: 320, baseType: !744, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!18, !747, !878, !876}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !64, line: 273, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !64, line: 197, size: 3840, elements: !750)
!750 = !{!751, !753, !754, !755, !756, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !785, !786, !787, !788, !789, !792, !793, !802, !803, !804, !805, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !831, !832, !847, !853, !877}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !749, file: !64, line: 199, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !749, file: !64, line: 200, baseType: !613, size: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !749, file: !64, line: 201, baseType: !267, size: 64, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrX", scope: !749, file: !64, line: 202, baseType: !18, size: 32, offset: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !749, file: !64, line: 203, baseType: !757, size: 32, offset: 224)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockPos", file: !64, line: 112, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !64, line: 108, size: 32, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !758, file: !64, line: 110, baseType: !84, size: 16)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !758, file: !64, line: 111, baseType: !84, size: 16, offset: 16)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !749, file: !64, line: 204, baseType: !18, size: 32, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !749, file: !64, line: 205, baseType: !18, size: 32, offset: 288)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "block_y_aff", scope: !749, file: !64, line: 206, baseType: !18, size: 32, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !749, file: !64, line: 207, baseType: !18, size: 32, offset: 352)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !749, file: !64, line: 208, baseType: !18, size: 32, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !749, file: !64, line: 209, baseType: !18, size: 32, offset: 416)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !749, file: !64, line: 210, baseType: !18, size: 32, offset: 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !749, file: !64, line: 212, baseType: !18, size: 32, offset: 480)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !749, file: !64, line: 213, baseType: !18, size: 32, offset: 512)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !749, file: !64, line: 215, baseType: !18, size: 32, offset: 544)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "qpc", scope: !749, file: !64, line: 216, baseType: !186, size: 64, offset: 576)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "qp_scaled", scope: !749, file: !64, line: 217, baseType: !293, size: 96, offset: 640)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "is_lossless", scope: !749, file: !64, line: 218, baseType: !18, size: 32, offset: 736)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !749, file: !64, line: 219, baseType: !18, size: 32, offset: 768)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !749, file: !64, line: 220, baseType: !18, size: 32, offset: 800)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !749, file: !64, line: 221, baseType: !18, size: 32, offset: 832)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !749, file: !64, line: 223, baseType: !84, size: 16, offset: 864)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !749, file: !64, line: 224, baseType: !83, size: 8, offset: 880)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "dpl_flag", scope: !749, file: !64, line: 225, baseType: !83, size: 8, offset: 888)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "delta_quant", scope: !749, file: !64, line: 226, baseType: !84, size: 16, offset: 896)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "list_offset", scope: !749, file: !64, line: 227, baseType: !84, size: 16, offset: 912)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "mb_up", scope: !749, file: !64, line: 229, baseType: !784, size: 64, offset: 960)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "mb_left", scope: !749, file: !64, line: 230, baseType: !784, size: 64, offset: 1024)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "mbup", scope: !749, file: !64, line: 232, baseType: !784, size: 64, offset: 1088)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "mbleft", scope: !749, file: !64, line: 233, baseType: !784, size: 64, offset: 1152)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !749, file: !64, line: 236, baseType: !84, size: 16, offset: 1216)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !749, file: !64, line: 237, baseType: !790, size: 1024, offset: 1232)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 1024, elements: !791)
!791 = !{!145, !230, !230, !145}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !749, file: !64, line: 239, baseType: !18, size: 32, offset: 2272)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !749, file: !64, line: 240, baseType: !794, size: 192, offset: 2304)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !795, size: 192, elements: !157)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !796, line: 103, baseType: !797)
!796 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !798, line: 27, baseType: !799)
!798 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !800, line: 44, baseType: !801)
!800 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!801 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !749, file: !64, line: 241, baseType: !794, size: 192, offset: 2496)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits_8x8", scope: !749, file: !64, line: 242, baseType: !794, size: 192, offset: 2688)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i16mode", scope: !749, file: !64, line: 244, baseType: !18, size: 32, offset: 2880)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !749, file: !64, line: 245, baseType: !806, size: 32, offset: 2912)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 32, elements: !807)
!807 = !{!230}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !749, file: !64, line: 246, baseType: !806, size: 32, offset: 2944)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ipmode_DPCM", scope: !749, file: !64, line: 247, baseType: !83, size: 8, offset: 2976)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !749, file: !64, line: 248, baseType: !83, size: 8, offset: 2984)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !749, file: !64, line: 249, baseType: !83, size: 8, offset: 2992)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "DFDisableIdc", scope: !749, file: !64, line: 250, baseType: !84, size: 16, offset: 3008)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "DFAlphaC0Offset", scope: !749, file: !64, line: 251, baseType: !84, size: 16, offset: 3024)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "DFBetaOffset", scope: !749, file: !64, line: 252, baseType: !84, size: 16, offset: 3040)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !749, file: !64, line: 254, baseType: !18, size: 32, offset: 3072)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !749, file: !64, line: 256, baseType: !18, size: 32, offset: 3104)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !749, file: !64, line: 256, baseType: !18, size: 32, offset: 3136)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !749, file: !64, line: 256, baseType: !18, size: 32, offset: 3168)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !749, file: !64, line: 256, baseType: !18, size: 32, offset: 3200)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !749, file: !64, line: 257, baseType: !18, size: 32, offset: 3232)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !749, file: !64, line: 257, baseType: !18, size: 32, offset: 3264)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !749, file: !64, line: 257, baseType: !18, size: 32, offset: 3296)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !749, file: !64, line: 257, baseType: !18, size: 32, offset: 3328)
