; ModuleID = 'ldecod_src/fmo.c'
source_filename = "ldecod_src/fmo.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [68 x i8] c"wrong pps->pic_size_in_map_units_minus1 for used SPS and FMO type 6\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [67 x i8] c"cannot allocated %d bytes for p_Vid->MapUnitToSliceGroupMap, exit\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [41 x i8] c"Illegal slice_group_map_type %d , exit \0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [61 x i8] c"cannot allocate %d bytes for p_Vid->MbToSliceGroupMap, exit\0A\00", align 1, !dbg !17

; Function Attrs: nounwind uwtable
define dso_local noundef i32 @fmo_init(ptr nocapture noundef %p_Vid, ptr nocapture noundef readonly %pSlice) local_unnamed_addr #0 !dbg !74 {
entry:
    #dbg_value(ptr %p_Vid, !1127, !DIExpression(), !1130)
    #dbg_value(ptr %pSlice, !1128, !DIExpression(), !1130)
  %active_pps = getelementptr inbounds i8, ptr %p_Vid, i64 8, !dbg !1131
  %0 = load ptr, ptr %active_pps, align 8, !dbg !1131
    #dbg_value(ptr %0, !1129, !DIExpression(), !1130)
    #dbg_value(ptr %p_Vid, !1132, !DIExpression(), !1139)
    #dbg_value(ptr %pSlice, !1135, !DIExpression(), !1139)
  %active_sps.i = getelementptr inbounds i8, ptr %p_Vid, i64 16, !dbg !1141
  %1 = load ptr, ptr %active_sps.i, align 8, !dbg !1141

!22 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !23, retainedTypes: !63, globals: !65, splitDebugInlining: false, nameTableKind: None)
!23 = !{!24, !33, !39, !48, !55}
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 22, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "ldecod_src/inc/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "fd6ca9e1c707932f749220576db72b57")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31, !32}
!28 = !DIEnumerator(name: "CF_UNKNOWN", value: -1)
!29 = !DIEnumerator(name: "YUV400", value: 0)
!30 = !DIEnumerator(name: "YUV420", value: 1)
!31 = !DIEnumerator(name: "YUV422", value: 2)
!32 = !DIEnumerator(name: "YUV444", value: 3)
!33 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 15, baseType: !26, size: 32, elements: !34)
!34 = !{!35, !36, !37, !38}
!35 = !DIEnumerator(name: "CM_UNKNOWN", value: -1)
!36 = !DIEnumerator(name: "CM_YUV", value: 0)
!37 = !DIEnumerator(name: "CM_RGB", value: 1)
!38 = !DIEnumerator(name: "CM_XYZ", value: 2)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 25, baseType: !26, size: 32, elements: !41)
!40 = !DIFile(filename: "ldecod_src/inc/io_video.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1141c07f1801ad27d87214c419749431")
!41 = !{!42, !43, !44, !45, !46, !47}
!42 = !DIEnumerator(name: "VIDEO_UNKNOWN", value: -1)
!43 = !DIEnumerator(name: "VIDEO_YUV", value: 0)
!44 = !DIEnumerator(name: "VIDEO_RGB", value: 1)
!45 = !DIEnumerator(name: "VIDEO_XYZ", value: 2)
!46 = !DIEnumerator(name: "VIDEO_TIFF", value: 3)
!47 = !DIEnumerator(name: "VIDEO_AVI", value: 4)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 135, baseType: !50, size: 32, elements: !51)
!49 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!50 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!51 = !{!52, !53, !54}
!52 = !DIEnumerator(name: "FRAME", value: 0)
!53 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!54 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 22, baseType: !50, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60, !61, !62}
!57 = !DIEnumerator(name: "PLANE_Y", value: 0)
!58 = !DIEnumerator(name: "PLANE_U", value: 1)
!59 = !DIEnumerator(name: "PLANE_V", value: 2)
!60 = !DIEnumerator(name: "PLANE_G", value: 0)
!61 = !DIEnumerator(name: "PLANE_B", value: 1)
!62 = !DIEnumerator(name: "PLANE_R", value: 2)
!63 = !{!26, !64}
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!65 = !{!0, !7, !12, !17}
!66 = !{i32 7, !"Dwarf Version", i32 5}
!67 = !{i32 2, !"Debug Info Version", i32 3}
!68 = !{i32 1, !"wchar_size", i32 4}
!69 = !{i32 8, !"PIC Level", i32 2}
!70 = !{i32 7, !"PIE Level", i32 2}
!71 = !{i32 7, !"uwtable", i32 2}
!72 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!73 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!74 = distinct !DISubprogram(name: "fmo_init", scope: !2, file: !2, line: 173, type: !75, scopeLine: 174, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !22, retainedNodes: !1126)
!75 = !DISubroutineType(types: !76)
!76 = !{!26, !77, !438}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !79, line: 836, baseType: !80)
!79 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !79, line: 566, size: 6855040, elements: !81)
!81 = !{!82, !167, !224, !328, !330, !332, !390, !392, !393, !394, !395, !396, !399, !419, !431, !432, !433, !434, !435, !436, !869, !870, !872, !873, !874, !875, !876, !877, !878, !880, !883, !884, !886, !887, !888, !889, !890, !892, !893, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1020, !1021, !1023, !1024, !1027, !1030, !1031, !1032, !1036, !1039, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1051, !1054, !1055, !1056, !1057, !1060, !1065, !1069, !1074, !1078, !1079, !1083, !1084, !1088, !1089, !1093, !1114, !1115, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !80, file: !79, line: 568, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !79, line: 850, size: 32128, elements: !85)
!85 = !{!86, !90, !91, !92, !93, !94, !95, !96, !97, !98, !128, !129, !130, !131, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !84, file: !79, line: 852, baseType: !87, size: 2040)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 255)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !84, file: !79, line: 853, baseType: !87, size: 2040, offset: 2040)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !84, file: !79, line: 854, baseType: !87, size: 2040, offset: 4080)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !84, file: !79, line: 856, baseType: !26, size: 32, offset: 6144)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !84, file: !79, line: 857, baseType: !26, size: 32, offset: 6176)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !84, file: !79, line: 858, baseType: !26, size: 32, offset: 6208)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !84, file: !79, line: 859, baseType: !26, size: 32, offset: 6240)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !84, file: !79, line: 860, baseType: !26, size: 32, offset: 6272)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !84, file: !79, line: 861, baseType: !26, size: 32, offset: 6304)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !84, file: !79, line: 864, baseType: !99, size: 1088, offset: 6336)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !25, line: 52, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !25, line: 30, size: 1088, elements: !101)
!101 = !{!102, !104, !106, !108, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !100, file: !25, line: 32, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !25, line: 28, baseType: !24)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !100, file: !25, line: 33, baseType: !105, size: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !25, line: 20, baseType: !33)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !100, file: !25, line: 34, baseType: !107, size: 64, offset: 64)
!107 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !100, file: !25, line: 35, baseType: !109, size: 96, offset: 128)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 96, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 3)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !100, file: !25, line: 36, baseType: !109, size: 96, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !100, file: !25, line: 37, baseType: !26, size: 32, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !100, file: !25, line: 38, baseType: !26, size: 32, offset: 352)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !100, file: !25, line: 39, baseType: !26, size: 32, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !100, file: !25, line: 40, baseType: !26, size: 32, offset: 416)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !100, file: !25, line: 41, baseType: !26, size: 32, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !100, file: !25, line: 42, baseType: !26, size: 32, offset: 480)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !100, file: !25, line: 43, baseType: !26, size: 32, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !100, file: !25, line: 44, baseType: !26, size: 32, offset: 544)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !100, file: !25, line: 45, baseType: !109, size: 96, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !100, file: !25, line: 46, baseType: !26, size: 32, offset: 672)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !100, file: !25, line: 47, baseType: !109, size: 96, offset: 704)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !100, file: !25, line: 48, baseType: !109, size: 96, offset: 800)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !100, file: !25, line: 49, baseType: !109, size: 96, offset: 896)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !100, file: !25, line: 50, baseType: !26, size: 32, offset: 992)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !100, file: !25, line: 51, baseType: !26, size: 32, offset: 1024)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !84, file: !79, line: 865, baseType: !99, size: 1088, offset: 7424)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !84, file: !79, line: 867, baseType: !26, size: 32, offset: 8512)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !84, file: !79, line: 868, baseType: !26, size: 32, offset: 8544)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !84, file: !79, line: 869, baseType: !132, size: 7744, offset: 8576)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !40, line: 60, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !40, line: 34, size: 7744, elements: !134)
!134 = !{!135, !136, !137, !138, !139, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !133, file: !40, line: 37, baseType: !87, size: 2040)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !133, file: !40, line: 38, baseType: !87, size: 2040, offset: 2040)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !133, file: !40, line: 39, baseType: !87, size: 2040, offset: 4080)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !133, file: !40, line: 40, baseType: !26, size: 32, offset: 6144)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !133, file: !40, line: 41, baseType: !140, size: 32, offset: 6176)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !40, line: 32, baseType: !39)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !133, file: !40, line: 42, baseType: !99, size: 1088, offset: 6208)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !133, file: !40, line: 43, baseType: !26, size: 32, offset: 7296)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !133, file: !40, line: 44, baseType: !26, size: 32, offset: 7328)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !133, file: !40, line: 45, baseType: !26, size: 32, offset: 7360)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !133, file: !40, line: 46, baseType: !26, size: 32, offset: 7392)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !133, file: !40, line: 47, baseType: !26, size: 32, offset: 7424)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !133, file: !40, line: 48, baseType: !26, size: 32, offset: 7456)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !133, file: !40, line: 49, baseType: !26, size: 32, offset: 7488)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !133, file: !40, line: 50, baseType: !26, size: 32, offset: 7520)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !133, file: !40, line: 51, baseType: !26, size: 32, offset: 7552)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !133, file: !40, line: 52, baseType: !26, size: 32, offset: 7584)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !133, file: !40, line: 53, baseType: !26, size: 32, offset: 7616)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !133, file: !40, line: 56, baseType: !154, size: 64, offset: 7680)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !84, file: !79, line: 870, baseType: !132, size: 7744, offset: 16320)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !84, file: !79, line: 871, baseType: !132, size: 7744, offset: 24064)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !84, file: !79, line: 873, baseType: !26, size: 32, offset: 31808)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !84, file: !79, line: 884, baseType: !26, size: 32, offset: 31840)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !84, file: !79, line: 885, baseType: !26, size: 32, offset: 31872)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !84, file: !79, line: 886, baseType: !26, size: 32, offset: 31904)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !84, file: !79, line: 890, baseType: !26, size: 32, offset: 31936)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !84, file: !79, line: 893, baseType: !26, size: 32, offset: 31968)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !84, file: !79, line: 894, baseType: !26, size: 32, offset: 32000)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !84, file: !79, line: 895, baseType: !26, size: 32, offset: 32032)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !84, file: !79, line: 897, baseType: !26, size: 32, offset: 32064)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !84, file: !79, line: 899, baseType: !26, size: 32, offset: 32096)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !80, file: !79, line: 569, baseType: !168, size: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !170, line: 138, baseType: !171)
!170 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 94, size: 17728, elements: !172)
!172 = !{!173, !174, !175, !176, !177, !178, !179, !183, !188, !192, !195, !196, !197, !198, !199, !203, !204, !205, !206, !207, !208, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !171, file: !170, line: 96, baseType: !26, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !171, file: !170, line: 97, baseType: !50, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !171, file: !170, line: 98, baseType: !50, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !171, file: !170, line: 99, baseType: !26, size: 32, offset: 96)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !171, file: !170, line: 100, baseType: !26, size: 32, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !171, file: !170, line: 102, baseType: !26, size: 32, offset: 160)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !171, file: !170, line: 103, baseType: !180, size: 384, offset: 192)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 384, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 12)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !171, file: !170, line: 104, baseType: !184, size: 3072, offset: 576)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 3072, elements: !185)
!185 = !{!186, !187}
!186 = !DISubrange(count: 6)
!187 = !DISubrange(count: 16)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !171, file: !170, line: 105, baseType: !189, size: 12288, offset: 3648)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 12288, elements: !190)
!190 = !{!186, !191}
!191 = !DISubrange(count: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !171, file: !170, line: 106, baseType: !193, size: 192, offset: 15936)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, elements: !194)
!194 = !{!186}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !171, file: !170, line: 107, baseType: !193, size: 192, offset: 16128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !171, file: !170, line: 110, baseType: !26, size: 32, offset: 16320)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !171, file: !170, line: 111, baseType: !50, size: 32, offset: 16352)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !171, file: !170, line: 112, baseType: !50, size: 32, offset: 16384)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !171, file: !170, line: 114, baseType: !200, size: 256, offset: 16416)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 256, elements: !201)
!201 = !{!202}
!202 = !DISubrange(count: 8)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !171, file: !170, line: 116, baseType: !200, size: 256, offset: 16672)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !171, file: !170, line: 117, baseType: !200, size: 256, offset: 16928)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !171, file: !170, line: 119, baseType: !26, size: 32, offset: 17184)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !171, file: !170, line: 120, baseType: !50, size: 32, offset: 17216)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !171, file: !170, line: 122, baseType: !50, size: 32, offset: 17248)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !171, file: !170, line: 123, baseType: !209, size: 64, offset: 17280)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !211, line: 21, baseType: !212)
!211 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!212 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !171, file: !170, line: 125, baseType: !26, size: 32, offset: 17344)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !171, file: !170, line: 126, baseType: !26, size: 32, offset: 17376)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !171, file: !170, line: 127, baseType: !26, size: 32, offset: 17408)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !171, file: !170, line: 128, baseType: !50, size: 32, offset: 17440)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !171, file: !170, line: 129, baseType: !26, size: 32, offset: 17472)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !171, file: !170, line: 130, baseType: !26, size: 32, offset: 17504)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !171, file: !170, line: 131, baseType: !26, size: 32, offset: 17536)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !171, file: !170, line: 133, baseType: !26, size: 32, offset: 17568)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !171, file: !170, line: 135, baseType: !26, size: 32, offset: 17600)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !171, file: !170, line: 136, baseType: !26, size: 32, offset: 17632)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !171, file: !170, line: 137, baseType: !26, size: 32, offset: 17664)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !80, file: !79, line: 570, baseType: !225, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !170, line: 197, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 142, size: 33024, elements: !228)
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !326, !327}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !227, file: !170, line: 144, baseType: !26, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !227, file: !170, line: 146, baseType: !50, size: 32, offset: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !227, file: !170, line: 147, baseType: !26, size: 32, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !227, file: !170, line: 148, baseType: !26, size: 32, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !227, file: !170, line: 149, baseType: !26, size: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !227, file: !170, line: 150, baseType: !26, size: 32, offset: 160)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !227, file: !170, line: 152, baseType: !26, size: 32, offset: 192)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !227, file: !170, line: 154, baseType: !50, size: 32, offset: 224)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !227, file: !170, line: 155, baseType: !50, size: 32, offset: 256)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !227, file: !170, line: 156, baseType: !50, size: 32, offset: 288)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !227, file: !170, line: 158, baseType: !26, size: 32, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !227, file: !170, line: 159, baseType: !180, size: 384, offset: 352)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !227, file: !170, line: 160, baseType: !184, size: 3072, offset: 736)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !227, file: !170, line: 161, baseType: !189, size: 12288, offset: 3808)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !227, file: !170, line: 162, baseType: !193, size: 192, offset: 16096)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !227, file: !170, line: 163, baseType: !193, size: 192, offset: 16288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !227, file: !170, line: 165, baseType: !50, size: 32, offset: 16480)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !227, file: !170, line: 166, baseType: !50, size: 32, offset: 16512)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !227, file: !170, line: 167, baseType: !50, size: 32, offset: 16544)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !227, file: !170, line: 168, baseType: !50, size: 32, offset: 16576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !227, file: !170, line: 170, baseType: !50, size: 32, offset: 16608)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !227, file: !170, line: 172, baseType: !26, size: 32, offset: 16640)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !227, file: !170, line: 173, baseType: !26, size: 32, offset: 16672)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !227, file: !170, line: 174, baseType: !26, size: 32, offset: 16704)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !227, file: !170, line: 175, baseType: !50, size: 32, offset: 16736)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !227, file: !170, line: 177, baseType: !255, size: 8192, offset: 16768)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8192, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 256)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !227, file: !170, line: 178, baseType: !50, size: 32, offset: 24960)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !227, file: !170, line: 179, baseType: !26, size: 32, offset: 24992)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !227, file: !170, line: 180, baseType: !50, size: 32, offset: 25024)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !227, file: !170, line: 181, baseType: !50, size: 32, offset: 25056)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !227, file: !170, line: 182, baseType: !26, size: 32, offset: 25088)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !227, file: !170, line: 184, baseType: !26, size: 32, offset: 25120)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !227, file: !170, line: 185, baseType: !26, size: 32, offset: 25152)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !227, file: !170, line: 186, baseType: !26, size: 32, offset: 25184)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !227, file: !170, line: 187, baseType: !50, size: 32, offset: 25216)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !227, file: !170, line: 188, baseType: !50, size: 32, offset: 25248)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !227, file: !170, line: 189, baseType: !50, size: 32, offset: 25280)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !227, file: !170, line: 190, baseType: !50, size: 32, offset: 25312)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !227, file: !170, line: 191, baseType: !26, size: 32, offset: 25344)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !227, file: !170, line: 192, baseType: !272, size: 7584, offset: 25376)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !170, line: 90, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 53, size: 7584, elements: !274)
!274 = !{!275, !276, !277, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !273, file: !170, line: 55, baseType: !26, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !273, file: !170, line: 56, baseType: !50, size: 32, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !273, file: !170, line: 57, baseType: !278, size: 16, offset: 64)
!278 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !273, file: !170, line: 58, baseType: !278, size: 16, offset: 80)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !273, file: !170, line: 59, baseType: !26, size: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !273, file: !170, line: 60, baseType: !26, size: 32, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !273, file: !170, line: 61, baseType: !26, size: 32, offset: 160)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !273, file: !170, line: 62, baseType: !50, size: 32, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !273, file: !170, line: 63, baseType: !26, size: 32, offset: 224)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !273, file: !170, line: 64, baseType: !26, size: 32, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !273, file: !170, line: 65, baseType: !50, size: 32, offset: 288)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !273, file: !170, line: 66, baseType: !50, size: 32, offset: 320)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !273, file: !170, line: 67, baseType: !50, size: 32, offset: 352)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !273, file: !170, line: 68, baseType: !26, size: 32, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !273, file: !170, line: 69, baseType: !50, size: 32, offset: 416)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !273, file: !170, line: 70, baseType: !50, size: 32, offset: 448)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !273, file: !170, line: 71, baseType: !26, size: 32, offset: 480)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !273, file: !170, line: 72, baseType: !50, size: 32, offset: 512)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !273, file: !170, line: 73, baseType: !50, size: 32, offset: 544)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !273, file: !170, line: 74, baseType: !26, size: 32, offset: 576)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !273, file: !170, line: 75, baseType: !26, size: 32, offset: 608)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !273, file: !170, line: 76, baseType: !298, size: 3296, offset: 640)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !170, line: 50, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 38, size: 3296, elements: !300)
!300 = !{!301, !302, !303, !304, !308, !309, !310, !311, !312, !313}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !299, file: !170, line: 40, baseType: !50, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !299, file: !170, line: 41, baseType: !50, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !299, file: !170, line: 42, baseType: !50, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !299, file: !170, line: 43, baseType: !305, size: 1024, offset: 96)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 1024, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !299, file: !170, line: 44, baseType: !305, size: 1024, offset: 1120)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !299, file: !170, line: 45, baseType: !305, size: 1024, offset: 2144)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !299, file: !170, line: 46, baseType: !50, size: 32, offset: 3168)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !299, file: !170, line: 47, baseType: !50, size: 32, offset: 3200)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !299, file: !170, line: 48, baseType: !50, size: 32, offset: 3232)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !299, file: !170, line: 49, baseType: !50, size: 32, offset: 3264)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !273, file: !170, line: 77, baseType: !26, size: 32, offset: 3936)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !273, file: !170, line: 78, baseType: !298, size: 3296, offset: 3968)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !273, file: !170, line: 80, baseType: !26, size: 32, offset: 7264)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !273, file: !170, line: 81, baseType: !26, size: 32, offset: 7296)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !273, file: !170, line: 82, baseType: !26, size: 32, offset: 7328)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !273, file: !170, line: 83, baseType: !26, size: 32, offset: 7360)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !273, file: !170, line: 84, baseType: !50, size: 32, offset: 7392)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !273, file: !170, line: 85, baseType: !50, size: 32, offset: 7424)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !273, file: !170, line: 86, baseType: !50, size: 32, offset: 7456)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !273, file: !170, line: 87, baseType: !50, size: 32, offset: 7488)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !273, file: !170, line: 88, baseType: !50, size: 32, offset: 7520)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !273, file: !170, line: 89, baseType: !50, size: 32, offset: 7552)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !227, file: !170, line: 193, baseType: !50, size: 32, offset: 32960)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !227, file: !170, line: 195, baseType: !26, size: 32, offset: 32992)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !80, file: !79, line: 571, baseType: !329, size: 1056768, offset: 192)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 1056768, elements: !306)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !80, file: !79, line: 572, baseType: !331, size: 4538368, offset: 1056960)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 4538368, elements: !256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !80, file: !79, line: 575, baseType: !333, size: 64, offset: 5595328)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !170, line: 256, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !170, line: 228, size: 37312, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !357, !358, !359, !360}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !335, file: !170, line: 230, baseType: !226, size: 33024)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !335, file: !170, line: 232, baseType: !50, size: 32, offset: 33024)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !335, file: !170, line: 233, baseType: !26, size: 32, offset: 33056)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !335, file: !170, line: 234, baseType: !154, size: 64, offset: 33088)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !335, file: !170, line: 235, baseType: !154, size: 64, offset: 33152)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !335, file: !170, line: 236, baseType: !343, size: 64, offset: 33216)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !335, file: !170, line: 237, baseType: !154, size: 64, offset: 33280)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !335, file: !170, line: 238, baseType: !343, size: 64, offset: 33344)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !335, file: !170, line: 240, baseType: !154, size: 64, offset: 33408)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !335, file: !170, line: 241, baseType: !343, size: 64, offset: 33472)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !335, file: !170, line: 242, baseType: !154, size: 64, offset: 33536)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !335, file: !170, line: 243, baseType: !343, size: 64, offset: 33600)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !335, file: !170, line: 245, baseType: !26, size: 32, offset: 33664)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !335, file: !170, line: 246, baseType: !154, size: 64, offset: 33728)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !335, file: !170, line: 247, baseType: !154, size: 64, offset: 33792)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !335, file: !170, line: 248, baseType: !343, size: 64, offset: 33856)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !335, file: !170, line: 249, baseType: !343, size: 64, offset: 33920)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !335, file: !170, line: 250, baseType: !356, size: 64, offset: 33984)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !335, file: !170, line: 251, baseType: !343, size: 64, offset: 34048)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !335, file: !170, line: 253, baseType: !50, size: 32, offset: 34112)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !335, file: !170, line: 254, baseType: !26, size: 32, offset: 34144)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !335, file: !170, line: 255, baseType: !361, size: 3136, offset: 34176)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !170, line: 226, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !170, line: 200, size: 3136, elements: !363)
!363 = !{!364, !365, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !383, !384, !386, !387, !388, !389}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !362, file: !170, line: 202, baseType: !26, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !362, file: !170, line: 203, baseType: !366, size: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !362, file: !170, line: 204, baseType: !154, size: 64, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !362, file: !170, line: 205, baseType: !343, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !362, file: !170, line: 206, baseType: !366, size: 64, offset: 256)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !362, file: !170, line: 207, baseType: !154, size: 64, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !362, file: !170, line: 208, baseType: !154, size: 64, offset: 384)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !362, file: !170, line: 209, baseType: !366, size: 64, offset: 448)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !362, file: !170, line: 210, baseType: !366, size: 64, offset: 512)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !362, file: !170, line: 211, baseType: !366, size: 64, offset: 576)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !362, file: !170, line: 212, baseType: !366, size: 64, offset: 640)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !362, file: !170, line: 213, baseType: !366, size: 64, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !362, file: !170, line: 216, baseType: !367, size: 8, offset: 768)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !362, file: !170, line: 217, baseType: !367, size: 8, offset: 776)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !362, file: !170, line: 218, baseType: !367, size: 8, offset: 784)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !362, file: !170, line: 219, baseType: !382, size: 1024, offset: 800)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1024, elements: !306)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !362, file: !170, line: 220, baseType: !382, size: 1024, offset: 1824)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !362, file: !170, line: 221, baseType: !385, size: 256, offset: 2848)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 256, elements: !306)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !362, file: !170, line: 222, baseType: !367, size: 8, offset: 3104)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !362, file: !170, line: 223, baseType: !367, size: 8, offset: 3112)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !362, file: !170, line: 224, baseType: !367, size: 8, offset: 3120)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !362, file: !170, line: 225, baseType: !367, size: 8, offset: 3128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !80, file: !79, line: 577, baseType: !391, size: 1193984, offset: 5595392)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 1193984, elements: !306)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !80, file: !79, line: 578, baseType: !26, size: 32, offset: 6789376)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !80, file: !79, line: 579, baseType: !26, size: 32, offset: 6789408)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !80, file: !79, line: 580, baseType: !26, size: 32, offset: 6789440)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !80, file: !79, line: 581, baseType: !26, size: 32, offset: 6789472)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !80, file: !79, line: 584, baseType: !397, size: 64, offset: 6789504)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !79, line: 584, flags: DIFlagFwdDecl)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !80, file: !79, line: 586, baseType: !400, size: 64, offset: 6789568)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !79, line: 902, size: 416, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !412, !413, !414, !415, !416, !417, !418}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !401, file: !79, line: 904, baseType: !50, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !401, file: !79, line: 905, baseType: !50, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !401, file: !79, line: 906, baseType: !26, size: 32, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !401, file: !79, line: 907, baseType: !50, size: 32, offset: 96)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !401, file: !79, line: 908, baseType: !26, size: 32, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !401, file: !79, line: 909, baseType: !409, size: 64, offset: 160)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 2)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !401, file: !79, line: 910, baseType: !210, size: 8, offset: 224)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !401, file: !79, line: 911, baseType: !210, size: 8, offset: 232)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !401, file: !79, line: 912, baseType: !26, size: 32, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !401, file: !79, line: 913, baseType: !26, size: 32, offset: 288)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !401, file: !79, line: 915, baseType: !26, size: 32, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !401, file: !79, line: 916, baseType: !26, size: 32, offset: 352)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !401, file: !79, line: 917, baseType: !26, size: 32, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !80, file: !79, line: 587, baseType: !420, size: 64, offset: 6789632)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !79, line: 839, size: 512, elements: !422)
!422 = !{!423, !424, !427, !428, !429, !430}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !421, file: !79, line: 841, baseType: !26, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !421, file: !79, line: 842, baseType: !425, size: 96, offset: 32)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 96, elements: !110)
!426 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !421, file: !79, line: 843, baseType: !425, size: 96, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !421, file: !79, line: 844, baseType: !425, size: 96, offset: 224)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !421, file: !79, line: 845, baseType: !425, size: 96, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !421, file: !79, line: 846, baseType: !425, size: 96, offset: 416)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !80, file: !79, line: 588, baseType: !26, size: 32, offset: 6789696)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !80, file: !79, line: 591, baseType: !50, size: 32, offset: 6789728)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !80, file: !79, line: 592, baseType: !26, size: 32, offset: 6789760)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !80, file: !79, line: 593, baseType: !26, size: 32, offset: 6789792)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !80, file: !79, line: 594, baseType: !26, size: 32, offset: 6789824)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !80, file: !79, line: 595, baseType: !437, size: 64, offset: 6789888)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !79, line: 542, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !79, line: 341, size: 109184, elements: !441)
!441 = !{!442, !444, !445, !446, !447, !448, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !513, !515, !520, !691, !721, !748, !751, !752, !754, !755, !756, !757, !758, !759, !760, !772, !773, !774, !775, !776, !777, !778, !779, !784, !785, !786, !787, !788, !791, !792, !793, !794, !795, !796, !799, !800, !803, !804, !806, !809, !810, !811, !812, !813, !814, !815, !816, !817, !819, !820, !821, !822, !823, !827, !828, !829, !833, !837, !841, !845, !849, !850, !851, !852, !856, !857, !858, !859, !860, !861, !862, !863, !864, !866, !867}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !440, file: !79, line: 343, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !440, file: !79, line: 344, baseType: !83, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !440, file: !79, line: 345, baseType: !168, size: 64, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !440, file: !79, line: 346, baseType: !225, size: 64, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "svc_extension_flag", scope: !440, file: !79, line: 347, baseType: !26, size: 32, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !440, file: !79, line: 350, baseType: !449, size: 64, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !79, line: 350, flags: DIFlagFwdDecl)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !440, file: !79, line: 353, baseType: !26, size: 32, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !440, file: !79, line: 354, baseType: !26, size: 32, offset: 416)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !440, file: !79, line: 355, baseType: !26, size: 32, offset: 448)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Transform8x8Mode", scope: !440, file: !79, line: 356, baseType: !26, size: 32, offset: 480)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "is_not_independent", scope: !440, file: !79, line: 357, baseType: !26, size: 32, offset: 512)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "toppoc", scope: !440, file: !79, line: 359, baseType: !26, size: 32, offset: 544)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "bottompoc", scope: !440, file: !79, line: 360, baseType: !26, size: 32, offset: 576)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "framepoc", scope: !440, file: !79, line: 361, baseType: !26, size: 32, offset: 608)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !440, file: !79, line: 365, baseType: !50, size: 32, offset: 640)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !440, file: !79, line: 366, baseType: !26, size: 32, offset: 672)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !440, file: !79, line: 368, baseType: !409, size: 64, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntMsb", scope: !440, file: !79, line: 372, baseType: !26, size: 32, offset: 768)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "AbsFrameNum", scope: !440, file: !79, line: 378, baseType: !50, size: 32, offset: 800)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !440, file: !79, line: 379, baseType: !26, size: 32, offset: 832)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "current_mb_nr", scope: !440, file: !79, line: 387, baseType: !50, size: 32, offset: 864)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !440, file: !79, line: 388, baseType: !50, size: 32, offset: 896)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "current_slice_nr", scope: !440, file: !79, line: 389, baseType: !468, size: 16, offset: 928)
!468 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "cod_counter", scope: !440, file: !79, line: 396, baseType: !26, size: 32, offset: 960)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "allrefzero", scope: !440, file: !79, line: 397, baseType: !26, size: 32, offset: 992)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !440, file: !79, line: 400, baseType: !26, size: 32, offset: 1024)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !440, file: !79, line: 401, baseType: !26, size: 32, offset: 1056)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_active", scope: !440, file: !79, line: 402, baseType: !409, size: 64, offset: 1088)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !440, file: !79, line: 406, baseType: !26, size: 32, offset: 1152)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !440, file: !79, line: 407, baseType: !26, size: 32, offset: 1184)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !440, file: !79, line: 408, baseType: !26, size: 32, offset: 1216)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "qs", scope: !440, file: !79, line: 409, baseType: !26, size: 32, offset: 1248)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qs_delta", scope: !440, file: !79, line: 410, baseType: !26, size: 32, offset: 1280)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !440, file: !79, line: 411, baseType: !26, size: 32, offset: 1312)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "model_number", scope: !440, file: !79, line: 412, baseType: !26, size: 32, offset: 1344)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !440, file: !79, line: 413, baseType: !50, size: 32, offset: 1376)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !440, file: !79, line: 414, baseType: !50, size: 32, offset: 1408)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !440, file: !79, line: 415, baseType: !210, size: 8, offset: 1440)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !440, file: !79, line: 416, baseType: !485, size: 32, offset: 1472)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !49, line: 140, baseType: !48)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !440, file: !79, line: 417, baseType: !26, size: 32, offset: 1504)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "end_mb_nr_plus1", scope: !440, file: !79, line: 418, baseType: !26, size: 32, offset: 1536)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !440, file: !79, line: 419, baseType: !26, size: 32, offset: 1568)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dp_mode", scope: !440, file: !79, line: 420, baseType: !26, size: 32, offset: 1600)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "current_header", scope: !440, file: !79, line: 421, baseType: !26, size: 32, offset: 1632)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "next_header", scope: !440, file: !79, line: 422, baseType: !26, size: 32, offset: 1664)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "last_dquant", scope: !440, file: !79, line: 423, baseType: !26, size: 32, offset: 1696)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "colour_plane_id", scope: !440, file: !79, line: 426, baseType: !26, size: 32, offset: 1728)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !440, file: !79, line: 427, baseType: !26, size: 32, offset: 1760)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sp_switch", scope: !440, file: !79, line: 428, baseType: !26, size: 32, offset: 1792)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !440, file: !79, line: 429, baseType: !26, size: 32, offset: 1824)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_slice_ref_idx", scope: !440, file: !79, line: 430, baseType: !26, size: 32, offset: 1856)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !440, file: !79, line: 431, baseType: !26, size: 32, offset: 1888)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !440, file: !79, line: 432, baseType: !26, size: 32, offset: 1920)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !440, file: !79, line: 433, baseType: !26, size: 32, offset: 1952)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !440, file: !79, line: 434, baseType: !502, size: 64, offset: 1984)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !79, line: 194, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !79, line: 186, size: 256, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !511}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !504, file: !79, line: 188, baseType: !26, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !504, file: !79, line: 189, baseType: !26, size: 32, offset: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !504, file: !79, line: 190, baseType: !26, size: 32, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !504, file: !79, line: 191, baseType: !26, size: 32, offset: 96)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !504, file: !79, line: 192, baseType: !26, size: 32, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !504, file: !79, line: 193, baseType: !512, size: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !440, file: !79, line: 436, baseType: !514, size: 48, offset: 2048)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 48, elements: !194)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !440, file: !79, line: 437, baseType: !516, size: 384, offset: 2112)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 384, elements: !194)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !79, line: 141, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !440, file: !79, line: 440, baseType: !521, size: 64, offset: 2496)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !79, line: 324, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !79, line: 314, size: 384, elements: !524)
!524 = !{!525, !536, !545}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !523, file: !79, line: 317, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !79, line: 47, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream", file: !79, line: 300, size: 256, elements: !529)
!529 = !{!530, !531, !532, !533, !534, !535}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "read_len", scope: !528, file: !79, line: 303, baseType: !26, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !528, file: !79, line: 304, baseType: !26, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bitoffset", scope: !528, file: !79, line: 306, baseType: !26, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_length", scope: !528, file: !79, line: 307, baseType: !26, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !528, file: !79, line: 309, baseType: !209, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !528, file: !79, line: 310, baseType: !26, size: 32, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "de_cabac", scope: !523, file: !79, line: 318, baseType: !537, size: 256, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !79, line: 95, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 88, size: 256, elements: !539)
!539 = !{!540, !541, !542, !543, !544}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !538, file: !79, line: 90, baseType: !50, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !538, file: !79, line: 91, baseType: !50, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !538, file: !79, line: 92, baseType: !26, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !538, file: !79, line: 93, baseType: !209, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !538, file: !79, line: 94, baseType: !154, size: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "readSyntaxElement", scope: !523, file: !79, line: 320, baseType: !546, size: 64, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!26, !549, !689, !687}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !79, line: 273, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !79, line: 197, size: 3840, elements: !552)
!552 = !{!553, !555, !556, !557, !558, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !587, !588, !589, !590, !591, !595, !596, !605, !606, !607, !608, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !634, !635, !658, !664, !688}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !551, file: !79, line: 199, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !551, file: !79, line: 200, baseType: !443, size: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !551, file: !79, line: 201, baseType: !83, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrX", scope: !551, file: !79, line: 202, baseType: !26, size: 32, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !551, file: !79, line: 203, baseType: !559, size: 32, offset: 224)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockPos", file: !79, line: 112, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 108, size: 32, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !560, file: !79, line: 110, baseType: !468, size: 16)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !560, file: !79, line: 111, baseType: !468, size: 16, offset: 16)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !551, file: !79, line: 204, baseType: !26, size: 32, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !551, file: !79, line: 205, baseType: !26, size: 32, offset: 288)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "block_y_aff", scope: !551, file: !79, line: 206, baseType: !26, size: 32, offset: 320)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !551, file: !79, line: 207, baseType: !26, size: 32, offset: 352)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !551, file: !79, line: 208, baseType: !26, size: 32, offset: 384)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !551, file: !79, line: 209, baseType: !26, size: 32, offset: 416)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !551, file: !79, line: 210, baseType: !26, size: 32, offset: 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !551, file: !79, line: 212, baseType: !26, size: 32, offset: 480)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !551, file: !79, line: 213, baseType: !26, size: 32, offset: 512)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !551, file: !79, line: 215, baseType: !26, size: 32, offset: 544)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "qpc", scope: !551, file: !79, line: 216, baseType: !409, size: 64, offset: 576)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "qp_scaled", scope: !551, file: !79, line: 217, baseType: !109, size: 96, offset: 640)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "is_lossless", scope: !551, file: !79, line: 218, baseType: !26, size: 32, offset: 736)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !551, file: !79, line: 219, baseType: !26, size: 32, offset: 768)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !551, file: !79, line: 220, baseType: !26, size: 32, offset: 800)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !551, file: !79, line: 221, baseType: !26, size: 32, offset: 832)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !551, file: !79, line: 223, baseType: !468, size: 16, offset: 864)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !551, file: !79, line: 224, baseType: !367, size: 8, offset: 880)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dpl_flag", scope: !551, file: !79, line: 225, baseType: !367, size: 8, offset: 888)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "delta_quant", scope: !551, file: !79, line: 226, baseType: !468, size: 16, offset: 896)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "list_offset", scope: !551, file: !79, line: 227, baseType: !468, size: 16, offset: 912)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mb_up", scope: !551, file: !79, line: 229, baseType: !586, size: 64, offset: 960)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mb_left", scope: !551, file: !79, line: 230, baseType: !586, size: 64, offset: 1024)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mbup", scope: !551, file: !79, line: 232, baseType: !586, size: 64, offset: 1088)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "mbleft", scope: !551, file: !79, line: 233, baseType: !586, size: 64, offset: 1152)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !551, file: !79, line: 236, baseType: !468, size: 16, offset: 1216)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !551, file: !79, line: 237, baseType: !592, size: 1024, offset: 1232)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 1024, elements: !593)
!593 = !{!411, !594, !594, !411}
!594 = !DISubrange(count: 4)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !551, file: !79, line: 239, baseType: !26, size: 32, offset: 2272)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !551, file: !79, line: 240, baseType: !597, size: 192, offset: 2304)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 192, elements: !110)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !599, line: 103, baseType: !600)
!599 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !601, line: 27, baseType: !602)
!601 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !603, line: 44, baseType: !604)
!603 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!604 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !551, file: !79, line: 241, baseType: !597, size: 192, offset: 2496)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits_8x8", scope: !551, file: !79, line: 242, baseType: !597, size: 192, offset: 2688)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i16mode", scope: !551, file: !79, line: 244, baseType: !26, size: 32, offset: 2880)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !551, file: !79, line: 245, baseType: !609, size: 32, offset: 2912)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 32, elements: !610)
!610 = !{!594}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !551, file: !79, line: 246, baseType: !609, size: 32, offset: 2944)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ipmode_DPCM", scope: !551, file: !79, line: 247, baseType: !367, size: 8, offset: 2976)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !551, file: !79, line: 248, baseType: !367, size: 8, offset: 2984)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !551, file: !79, line: 249, baseType: !367, size: 8, offset: 2992)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "DFDisableIdc", scope: !551, file: !79, line: 250, baseType: !468, size: 16, offset: 3008)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "DFAlphaC0Offset", scope: !551, file: !79, line: 251, baseType: !468, size: 16, offset: 3024)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "DFBetaOffset", scope: !551, file: !79, line: 252, baseType: !468, size: 16, offset: 3040)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !551, file: !79, line: 254, baseType: !26, size: 32, offset: 3072)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !551, file: !79, line: 256, baseType: !26, size: 32, offset: 3104)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !551, file: !79, line: 256, baseType: !26, size: 32, offset: 3136)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !551, file: !79, line: 256, baseType: !26, size: 32, offset: 3168)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !551, file: !79, line: 256, baseType: !26, size: 32, offset: 3200)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !551, file: !79, line: 257, baseType: !26, size: 32, offset: 3232)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !551, file: !79, line: 257, baseType: !26, size: 32, offset: 3264)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !551, file: !79, line: 257, baseType: !26, size: 32, offset: 3296)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !551, file: !79, line: 257, baseType: !26, size: 32, offset: 3328)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !551, file: !79, line: 259, baseType: !26, size: 32, offset: 3360)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !551, file: !79, line: 260, baseType: !26, size: 32, offset: 3392)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_4x4", scope: !551, file: !79, line: 262, baseType: !630, size: 64, offset: 3456)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !586, !633, !26, !26}
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorPlane", file: !49, line: 32, baseType: !55)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_8x8", scope: !551, file: !79, line: 263, baseType: !630, size: 64, offset: 3520)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "GetMVPredictor", scope: !551, file: !79, line: 265, baseType: !636, size: 64, offset: 3584)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !586, !639, !649, !468, !655, !26, !26, !26, !26, !26}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !79, line: 85, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !79, line: 77, size: 128, elements: !642)
!642 = !{!643, !644, !645, !646, !647, !648}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !641, file: !79, line: 79, baseType: !26, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !641, file: !79, line: 80, baseType: !26, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !641, file: !79, line: 81, baseType: !468, size: 16, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !641, file: !79, line: 82, baseType: !468, size: 16, offset: 80)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !641, file: !79, line: 83, baseType: !468, size: 16, offset: 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !641, file: !79, line: 84, baseType: !468, size: 16, offset: 112)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !79, line: 104, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 100, size: 32, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !651, file: !79, line: 102, baseType: !468, size: 16)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !651, file: !79, line: 103, baseType: !468, size: 16, offset: 16)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !79, line: 53, flags: DIFlagFwdDecl)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "read_and_store_CBP_block_bit", scope: !551, file: !79, line: 268, baseType: !659, size: 64, offset: 3648)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DISubroutineType(types: !661)
!661 = !{!26, !586, !662, !26}
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironmentPtr", file: !79, line: 97, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "readRefPictureIdx", scope: !551, file: !79, line: 269, baseType: !665, size: 64, offset: 3712)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!367, !586, !668, !687, !367, !26}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !79, line: 276, size: 384, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !679, !683}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !669, file: !79, line: 278, baseType: !26, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !669, file: !79, line: 279, baseType: !26, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !669, file: !79, line: 280, baseType: !26, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !669, file: !79, line: 281, baseType: !26, size: 32, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !669, file: !79, line: 282, baseType: !26, size: 32, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !669, file: !79, line: 283, baseType: !50, size: 32, offset: 160)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !669, file: !79, line: 284, baseType: !26, size: 32, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !669, file: !79, line: 285, baseType: !26, size: 32, offset: 224)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !669, file: !79, line: 293, baseType: !680, size: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{null, !26, !26, !154, !154}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !669, file: !79, line: 295, baseType: !684, size: 64, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{null, !549, !668, !662}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "mixedModeEdgeFlag", scope: !551, file: !79, line: 272, baseType: !210, size: 8, offset: 3776)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !79, line: 296, baseType: !669)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !440, file: !79, line: 441, baseType: !692, size: 64, offset: 2560)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !79, line: 153, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 145, size: 2912, elements: !695)
!695 = !{!696, !707, !711, !715, !718, !720}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_contexts", scope: !694, file: !79, line: 147, baseType: !697, size: 1056)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 1056, elements: !705)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "BiContextType", file: !79, line: 122, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 117, size: 32, elements: !700)
!700 = !{!701, !703, !704}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !699, file: !79, line: 119, baseType: !702, size: 16)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !211, line: 23, baseType: !278)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "MPS", scope: !699, file: !79, line: 120, baseType: !212, size: 8, offset: 16)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !699, file: !79, line: 121, baseType: !212, size: 8, offset: 24)
!705 = !{!111, !706}
!706 = !DISubrange(count: 11)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "b8_type_contexts", scope: !694, file: !79, line: 148, baseType: !708, size: 576, offset: 1056)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 576, elements: !709)
!709 = !{!411, !710}
!710 = !DISubrange(count: 9)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "mv_res_contexts", scope: !694, file: !79, line: 149, baseType: !712, size: 640, offset: 1632)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 640, elements: !713)
!713 = !{!411, !714}
!714 = !DISubrange(count: 10)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ref_no_contexts", scope: !694, file: !79, line: 150, baseType: !716, size: 384, offset: 2272)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 384, elements: !717)
!717 = !{!411, !186}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "delta_qp_contexts", scope: !694, file: !79, line: 151, baseType: !719, size: 128, offset: 2656)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 128, elements: !610)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_contexts", scope: !694, file: !79, line: 152, baseType: !719, size: 128, offset: 2784)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "tex_ctx", scope: !440, file: !79, line: 442, baseType: !722, size: 64, offset: 2624)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureInfoContexts", file: !79, line: 175, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 164, size: 52768, elements: !725)
!725 = !{!726, !728, !730, !731, !734, !738, !742, !743, !747}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "transform_size_contexts", scope: !724, file: !79, line: 166, baseType: !727, size: 96)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 96, elements: !110)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ipr_contexts", scope: !724, file: !79, line: 167, baseType: !729, size: 64, offset: 96)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 64, elements: !410)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "cipr_contexts", scope: !724, file: !79, line: 168, baseType: !719, size: 128, offset: 160)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_contexts", scope: !724, file: !79, line: 169, baseType: !732, size: 384, offset: 288)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 384, elements: !733)
!733 = !{!111, !594}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "bcbp_contexts", scope: !724, file: !79, line: 170, baseType: !735, size: 2816, offset: 672)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 2816, elements: !736)
!736 = !{!737, !594}
!737 = !DISubrange(count: 22)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "map_contexts", scope: !724, file: !79, line: 171, baseType: !739, size: 21120, offset: 3488)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 21120, elements: !740)
!740 = !{!411, !737, !741}
!741 = !DISubrange(count: 15)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "last_contexts", scope: !724, file: !79, line: 172, baseType: !739, size: 21120, offset: 24608)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "one_contexts", scope: !724, file: !79, line: 173, baseType: !744, size: 3520, offset: 45728)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 3520, elements: !745)
!745 = !{!737, !746}
!746 = !DISubrange(count: 5)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "abs_contexts", scope: !724, file: !79, line: 174, baseType: !744, size: 3520, offset: 49248)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "mvscale", scope: !440, file: !79, line: 444, baseType: !749, size: 6144, offset: 2688)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 6144, elements: !750)
!750 = !{!186, !307}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_reordering_flag", scope: !440, file: !79, line: 446, baseType: !409, size: 64, offset: 8832)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "reordering_of_pic_nums_idc", scope: !440, file: !79, line: 447, baseType: !753, size: 128, offset: 8896)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 128, elements: !410)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_pic_num_minus1", scope: !440, file: !79, line: 448, baseType: !753, size: 128, offset: 9024)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_idx", scope: !440, file: !79, line: 449, baseType: !753, size: 128, offset: 9152)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "abs_diff_view_idx_minus1", scope: !440, file: !79, line: 452, baseType: !753, size: 128, offset: 9280)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !440, file: !79, line: 454, baseType: !26, size: 32, offset: 9408)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !440, file: !79, line: 455, baseType: !26, size: 32, offset: 9440)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !440, file: !79, line: 456, baseType: !26, size: 32, offset: 9472)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "NaluHeaderMVCExt", scope: !440, file: !79, line: 458, baseType: !761, size: 256, offset: 9504)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "NALUnitHeaderMVCExt_t", file: !79, line: 337, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nalunitheadermvcext_tag", file: !79, line: 327, size: 256, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "non_idr_flag", scope: !762, file: !79, line: 329, baseType: !50, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "priority_id", scope: !762, file: !79, line: 330, baseType: !50, size: 32, offset: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !762, file: !79, line: 331, baseType: !50, size: 32, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !762, file: !79, line: 332, baseType: !50, size: 32, offset: 96)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !762, file: !79, line: 333, baseType: !50, size: 32, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !762, file: !79, line: 334, baseType: !50, size: 32, offset: 160)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_one_bit", scope: !762, file: !79, line: 335, baseType: !50, size: 32, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "iPrefixNALU", scope: !762, file: !79, line: 336, baseType: !50, size: 32, offset: 224)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "DFDisableIdc", scope: !440, file: !79, line: 461, baseType: !468, size: 16, offset: 9760)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "DFAlphaC0Offset", scope: !440, file: !79, line: 462, baseType: !468, size: 16, offset: 9776)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "DFBetaOffset", scope: !440, file: !79, line: 463, baseType: !468, size: 16, offset: 9792)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !440, file: !79, line: 465, baseType: !26, size: 32, offset: 9824)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "dpB_NotPresent", scope: !440, file: !79, line: 467, baseType: !26, size: 32, offset: 9856)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "dpC_NotPresent", scope: !440, file: !79, line: 468, baseType: !26, size: 32, offset: 9888)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "is_reset_coeff", scope: !440, file: !79, line: 470, baseType: !26, size: 32, offset: 9920)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mb_pred", scope: !440, file: !79, line: 471, baseType: !780, size: 64, offset: 9984)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !211, line: 41, baseType: !702)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "mb_rec", scope: !440, file: !79, line: 472, baseType: !780, size: 64, offset: 10048)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "mb_rres", scope: !440, file: !79, line: 473, baseType: !356, size: 64, offset: 10112)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cof", scope: !440, file: !79, line: 474, baseType: !356, size: 64, offset: 10176)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "fcf", scope: !440, file: !79, line: 475, baseType: !356, size: 64, offset: 10240)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "cofu", scope: !440, file: !79, line: 477, baseType: !789, size: 512, offset: 10304)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 512, elements: !790)
!790 = !{!187}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_block_l0", scope: !440, file: !79, line: 479, baseType: !781, size: 64, offset: 10816)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_block_l1", scope: !440, file: !79, line: 480, baseType: !781, size: 64, offset: 10880)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_res", scope: !440, file: !79, line: 481, baseType: !343, size: 64, offset: 10944)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_block_l2", scope: !440, file: !79, line: 482, baseType: !781, size: 64, offset: 11008)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_block_l3", scope: !440, file: !79, line: 483, baseType: !781, size: 64, offset: 11072)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "InvLevelScale4x4_Intra", scope: !440, file: !79, line: 486, baseType: !797, size: 9216, offset: 11136)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 9216, elements: !798)
!798 = !{!111, !186, !594, !594}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "InvLevelScale4x4_Inter", scope: !440, file: !79, line: 487, baseType: !797, size: 9216, offset: 20352)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "InvLevelScale8x8_Intra", scope: !440, file: !79, line: 488, baseType: !801, size: 36864, offset: 29568)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 36864, elements: !802)
!802 = !{!111, !186, !202, !202}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "InvLevelScale8x8_Inter", scope: !440, file: !79, line: 489, baseType: !801, size: 36864, offset: 66432)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "qmatrix", scope: !440, file: !79, line: 491, baseType: !805, size: 768, offset: 103296)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 768, elements: !181)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "coeff", scope: !440, file: !79, line: 494, baseType: !807, size: 2048, offset: 104064)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 2048, elements: !808)
!808 = !{!191}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "coeff_ctr", scope: !440, file: !79, line: 495, baseType: !26, size: 32, offset: 106112)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !440, file: !79, line: 496, baseType: !26, size: 32, offset: 106144)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !440, file: !79, line: 500, baseType: !278, size: 16, offset: 106176)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !440, file: !79, line: 501, baseType: !278, size: 16, offset: 106192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "luma_log2_weight_denom", scope: !440, file: !79, line: 503, baseType: !278, size: 16, offset: 106208)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_log2_weight_denom", scope: !440, file: !79, line: 504, baseType: !278, size: 16, offset: 106224)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "wp_weight", scope: !440, file: !79, line: 505, baseType: !356, size: 64, offset: 106240)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "wp_offset", scope: !440, file: !79, line: 506, baseType: !356, size: 64, offset: 106304)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "wbp_weight", scope: !440, file: !79, line: 507, baseType: !818, size: 64, offset: 106368)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "wp_round_luma", scope: !440, file: !79, line: 508, baseType: !468, size: 16, offset: 106432)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "wp_round_chroma", scope: !440, file: !79, line: 509, baseType: !468, size: 16, offset: 106448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "listinterviewidx0", scope: !440, file: !79, line: 512, baseType: !26, size: 32, offset: 106464)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "listinterviewidx1", scope: !440, file: !79, line: 513, baseType: !26, size: 32, offset: 106496)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fs_listinterview0", scope: !440, file: !79, line: 514, baseType: !824, size: 64, offset: 106560)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !79, line: 514, flags: DIFlagFwdDecl)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "fs_listinterview1", scope: !440, file: !79, line: 515, baseType: !824, size: 64, offset: 106624)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "max_mb_vmv_r", scope: !440, file: !79, line: 520, baseType: !26, size: 32, offset: 106688)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ref_flag", scope: !440, file: !79, line: 521, baseType: !830, size: 544, offset: 106720)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 544, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 17)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "read_CBP_and_coeffs_from_NAL", scope: !440, file: !79, line: 523, baseType: !834, size: 64, offset: 107264)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !549}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "decode_one_component", scope: !440, file: !79, line: 524, baseType: !838, size: 64, offset: 107328)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{!26, !549, !633, !781, !518}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "readSlice", scope: !440, file: !79, line: 525, baseType: !842, size: 64, offset: 107392)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DISubroutineType(types: !844)
!844 = !{!26, !443, !83}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nal_startcode_follows", scope: !440, file: !79, line: 526, baseType: !846, size: 64, offset: 107456)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DISubroutineType(types: !848)
!848 = !{!26, !554, !26}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "read_motion_info_from_NAL", scope: !440, file: !79, line: 527, baseType: !834, size: 64, offset: 107520)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "read_one_macroblock", scope: !440, file: !79, line: 528, baseType: !834, size: 64, offset: 107584)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "interpret_mb_mode", scope: !440, file: !79, line: 529, baseType: !834, size: 64, offset: 107648)
