; ModuleID = 'ldecod_src/header.c'
source_filename = "ldecod_src/header.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@p_Dec = external local_unnamed_addr global ptr, align 8
@.str = private unnamed_addr constant [22 x i8] c"SH: first_mb_in_slice\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [15 x i8] c"SH: slice_type\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [25 x i8] c"SH: pic_parameter_set_id\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [20 x i8] c"SH: colour_plane_id\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [14 x i8] c"SH: frame_num\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [19 x i8] c"SH: field_pic_flag\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [22 x i8] c"SH: bottom_field_flag\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [15 x i8] c"SH: idr_pic_id\00", align 1, !dbg !34
@.str.8 = private unnamed_addr constant [22 x i8] c"SH: pic_order_cnt_lsb\00", align 1, !dbg !36
@.str.9 = private unnamed_addr constant [31 x i8] c"SH: delta_pic_order_cnt_bottom\00", align 1, !dbg !38
@.str.10 = private unnamed_addr constant [27 x i8] c"SH: delta_pic_order_cnt[0]\00", align 1, !dbg !43
@.str.11 = private unnamed_addr constant [27 x i8] c"SH: delta_pic_order_cnt[1]\00", align 1, !dbg !48

!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !239, retainedTypes: !307, globals: !328, splitDebugInlining: false, nameTableKind: None)
!239 = !{!240, !249, !255, !264, !274, !279, !287, !294}
!240 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !241, line: 22, baseType: !242, size: 32, elements: !243)
!241 = !DIFile(filename: "ldecod_src/inc/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "fd6ca9e1c707932f749220576db72b57")
!242 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!243 = !{!244, !245, !246, !247, !248}
!244 = !DIEnumerator(name: "CF_UNKNOWN", value: -1)
!245 = !DIEnumerator(name: "YUV400", value: 0)
!246 = !DIEnumerator(name: "YUV420", value: 1)
!247 = !DIEnumerator(name: "YUV422", value: 2)
!248 = !DIEnumerator(name: "YUV444", value: 3)
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !241, line: 15, baseType: !242, size: 32, elements: !250)
!250 = !{!251, !252, !253, !254}
!251 = !DIEnumerator(name: "CM_UNKNOWN", value: -1)
!252 = !DIEnumerator(name: "CM_YUV", value: 0)
!253 = !DIEnumerator(name: "CM_RGB", value: 1)
!254 = !DIEnumerator(name: "CM_XYZ", value: 2)
!255 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !256, line: 25, baseType: !242, size: 32, elements: !257)
!256 = !DIFile(filename: "ldecod_src/inc/io_video.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1141c07f1801ad27d87214c419749431")
!257 = !{!258, !259, !260, !261, !262, !263}
!258 = !DIEnumerator(name: "VIDEO_UNKNOWN", value: -1)
!259 = !DIEnumerator(name: "VIDEO_YUV", value: 0)
!260 = !DIEnumerator(name: "VIDEO_RGB", value: 1)
!261 = !DIEnumerator(name: "VIDEO_XYZ", value: 2)
!262 = !DIEnumerator(name: "VIDEO_TIFF", value: 3)
!263 = !DIEnumerator(name: "VIDEO_AVI", value: 4)
!264 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 22, baseType: !266, size: 32, elements: !267)
!265 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!266 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!267 = !{!268, !269, !270, !271, !272, !273}
!268 = !DIEnumerator(name: "PLANE_Y", value: 0)
!269 = !DIEnumerator(name: "PLANE_U", value: 1)
!270 = !DIEnumerator(name: "PLANE_V", value: 2)
!271 = !DIEnumerator(name: "PLANE_G", value: 0)
!272 = !DIEnumerator(name: "PLANE_B", value: 1)
!273 = !DIEnumerator(name: "PLANE_R", value: 2)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 135, baseType: !266, size: 32, elements: !275)
!275 = !{!276, !277, !278}
!276 = !DIEnumerator(name: "FRAME", value: 0)
!277 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!278 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!279 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 142, baseType: !266, size: 32, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286}
!281 = !DIEnumerator(name: "P_SLICE", value: 0)
!282 = !DIEnumerator(name: "B_SLICE", value: 1)
!283 = !DIEnumerator(name: "I_SLICE", value: 2)
!284 = !DIEnumerator(name: "SP_SLICE", value: 3)
!285 = !DIEnumerator(name: "SI_SLICE", value: 4)
!286 = !DIEnumerator(name: "NUM_SLICE_TYPES", value: 5)
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !265, line: 34, baseType: !266, size: 32, elements: !288)
!288 = !{!289, !290, !291, !292, !293}
!289 = !DIEnumerator(name: "LIST_0", value: 0)
!290 = !DIEnumerator(name: "LIST_1", value: 1)
!291 = !DIEnumerator(name: "BI_PRED", value: 2)
!292 = !DIEnumerator(name: "BI_PRED_L0", value: 3)
!293 = !DIEnumerator(name: "BI_PRED_L1", value: 4)
!294 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !295, line: 74, baseType: !266, size: 32, elements: !296)
!295 = !DIFile(filename: "ldecod_src/inc/defines.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "f06de374c735b286d10ba4ea0c8c0a5d")
!296 = !{!297, !298, !299, !300, !301, !302, !303, !304, !305, !306}
!297 = !DIEnumerator(name: "FREXT_CAVLC444", value: 44)
!298 = !DIEnumerator(name: "BASELINE", value: 66)
!299 = !DIEnumerator(name: "MAIN", value: 77)
!300 = !DIEnumerator(name: "EXTENDED", value: 88)
!301 = !DIEnumerator(name: "FREXT_HP", value: 100)
!302 = !DIEnumerator(name: "FREXT_Hi10P", value: 110)
!303 = !DIEnumerator(name: "FREXT_Hi422", value: 122)
!304 = !DIEnumerator(name: "FREXT_Hi444", value: 244)
!305 = !DIEnumerator(name: "MVC_HIGH", value: 118)
!306 = !DIEnumerator(name: "STEREO_HIGH", value: 128)
!307 = !{!308, !309, !312, !313, !314, !315, !327, !242}
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "SliceType", file: !265, line: 150, baseType: !279)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !310, line: 21, baseType: !311)
!310 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!311 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !265, line: 140, baseType: !274)
!313 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!314 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !317, line: 194, baseType: !318)
!317 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !317, line: 186, size: 256, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !318, file: !317, line: 188, baseType: !242, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !318, file: !317, line: 189, baseType: !242, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !318, file: !317, line: 190, baseType: !242, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !318, file: !317, line: 191, baseType: !242, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !318, file: !317, line: 192, baseType: !242, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !318, file: !317, line: 193, baseType: !326, size: 64, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!328 = !{!0, !7, !12, !17, !22, !27, !32, !34, !36, !38, !43, !48, !50, !52, !57, !62, !67, !69, !71, !73, !78, !83, !85, !87, !92, !94, !96, !101, !103, !105, !110, !115, !117, !119, !124, !126, !329, !131, !136, !138, !140, !142, !334, !144, !146, !148, !150, !152, !154, !156, !158, !160, !339, !162, !167, !169, !171, !173, !341, !175, !177, !179, !181, !183, !185, !187, !189, !191, !196, !198, !200, !202, !204, !206, !208, !210, !212, !214, !219, !224, !226, !228, !230, !232, !234, !236}
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(scope: null, file: !2, line: 926, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 128, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 16)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(scope: null, file: !2, line: 932, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 9)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(scope: null, file: !2, line: 942, type: !221, isLocal: true, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "assignSE2partition", scope: !238, file: !343, line: 103, type: !344, isLocal: true, isDefinition: true)
!343 = !DIFile(filename: "ldecod_src/inc/elements.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "655df3b60bdcd53a79db33d4ea16f27b")
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 320, elements: !346)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!346 = !{!347, !21}
!347 = !DISubrange(count: 2)
!348 = !{i32 7, !"Dwarf Version", i32 5}
!349 = !{i32 2, !"Debug Info Version", i32 3}
!350 = !{i32 1, !"wchar_size", i32 4}
!351 = !{i32 8, !"PIC Level", i32 2}
!352 = !{i32 7, !"PIE Level", i32 2}
!353 = !{i32 7, !"uwtable", i32 2}
!354 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!355 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!356 = distinct !DISubprogram(name: "CeilLog2", scope: !2, file: !2, line: 42, type: !357, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !238, retainedNodes: !359)
!357 = !DISubroutineType(types: !358)
!358 = !{!266, !266}
!359 = !{!360, !361, !362}
!360 = !DILocalVariable(name: "uiVal", arg: 1, scope: !356, file: !2, line: 42, type: !266)
!361 = !DILocalVariable(name: "uiTmp", scope: !356, file: !2, line: 44, type: !266)
!362 = !DILocalVariable(name: "uiRet", scope: !356, file: !2, line: 45, type: !266)
!363 = !DILocation(line: 0, scope: !356)
!364 = !DILocation(line: 44, column: 25, scope: !356)
!365 = !DILocation(line: 47, column: 16, scope: !356)
!366 = !DILocation(line: 47, column: 3, scope: !356)
!367 = !DILocation(line: 52, column: 3, scope: !356)
!368 = distinct !DISubprogram(name: "CeilLog2_sf", scope: !2, file: !2, line: 55, type: !357, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !238, retainedNodes: !369)
!369 = !{!370, !371, !372}
!370 = !DILocalVariable(name: "uiVal", arg: 1, scope: !368, file: !2, line: 55, type: !266)
!371 = !DILocalVariable(name: "uiTmp", scope: !368, file: !2, line: 57, type: !266)
!372 = !DILocalVariable(name: "uiRet", scope: !368, file: !2, line: 58, type: !266)
!373 = !DILocation(line: 0, scope: !368)
!374 = !DILocation(line: 57, column: 25, scope: !368)
!375 = !DILocation(line: 60, column: 16, scope: !368)
!376 = !DILocation(line: 60, column: 3, scope: !368)
!377 = !DILocation(line: 65, column: 3, scope: !368)
!378 = distinct !DISubprogram(name: "FirstPartOfSliceHeader", scope: !2, file: !2, line: 76, type: !379, scopeLine: 77, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !238, retainedNodes: !1532)
!379 = !DISubroutineType(types: !380)
!380 = !{!242, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !317, line: 542, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !317, line: 341, size: 109184, elements: !384)
!384 = !{!385, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1362, !1364, !1367, !1395, !1420, !1423, !1424, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1458, !1459, !1460, !1461, !1462, !1463, !1466, !1467, !1470, !1471, !1473, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1485, !1486, !1487, !1488, !1489, !1491, !1492, !1493, !1497, !1501, !1505, !1509, !1513, !1514, !1515, !1516, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !383, file: !317, line: 343, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !317, line: 566, size: 6855040, elements: !388)
!388 = !{!389, !474, !526, !627, !629, !631, !689, !691, !692, !693, !694, !695, !698, !717, !729, !730, !731, !732, !733, !734, !736, !737, !739, !740, !741, !742, !743, !744, !746, !748, !751, !752, !754, !755, !756, !757, !1027, !1029, !1030, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1176, !1180, !1181, !1183, !1184, !1187, !1190, !1191, !1192, !1194, !1197, !1200, !1201, !1202, !1203, !1204, !1205, !1231, !1232, !1234, !1235, !1236, !1237, !1238, !1241, !1246, !1250, !1254, !1258, !1259, !1263, !1264, !1268, !1269, !1273, !1294, !1295, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !387, file: !317, line: 568, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !317, line: 850, size: 32128, elements: !392)
!392 = !{!393, !397, !398, !399, !400, !401, !402, !403, !404, !405, !435, !436, !437, !438, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !391, file: !317, line: 852, baseType: !394, size: 2040)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 255)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !391, file: !317, line: 853, baseType: !394, size: 2040, offset: 2040)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !391, file: !317, line: 854, baseType: !394, size: 2040, offset: 4080)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !391, file: !317, line: 856, baseType: !242, size: 32, offset: 6144)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !391, file: !317, line: 857, baseType: !242, size: 32, offset: 6176)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !391, file: !317, line: 858, baseType: !242, size: 32, offset: 6208)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !391, file: !317, line: 859, baseType: !242, size: 32, offset: 6240)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !391, file: !317, line: 860, baseType: !242, size: 32, offset: 6272)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !391, file: !317, line: 861, baseType: !242, size: 32, offset: 6304)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !391, file: !317, line: 864, baseType: !406, size: 1088, offset: 6336)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !241, line: 52, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !241, line: 30, size: 1088, elements: !408)
!408 = !{!409, !411, !413, !415, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !407, file: !241, line: 32, baseType: !410, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !241, line: 28, baseType: !240)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !407, file: !241, line: 33, baseType: !412, size: 32, offset: 32)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !241, line: 20, baseType: !249)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !407, file: !241, line: 34, baseType: !414, size: 64, offset: 64)
!414 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !407, file: !241, line: 35, baseType: !416, size: 96, offset: 128)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 96, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 3)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !407, file: !241, line: 36, baseType: !416, size: 96, offset: 224)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !407, file: !241, line: 37, baseType: !242, size: 32, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !407, file: !241, line: 38, baseType: !242, size: 32, offset: 352)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !407, file: !241, line: 39, baseType: !242, size: 32, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !407, file: !241, line: 40, baseType: !242, size: 32, offset: 416)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !407, file: !241, line: 41, baseType: !242, size: 32, offset: 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !407, file: !241, line: 42, baseType: !242, size: 32, offset: 480)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !407, file: !241, line: 43, baseType: !242, size: 32, offset: 512)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !407, file: !241, line: 44, baseType: !242, size: 32, offset: 544)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !407, file: !241, line: 45, baseType: !416, size: 96, offset: 576)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !407, file: !241, line: 46, baseType: !242, size: 32, offset: 672)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !407, file: !241, line: 47, baseType: !416, size: 96, offset: 704)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !407, file: !241, line: 48, baseType: !416, size: 96, offset: 800)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !407, file: !241, line: 49, baseType: !416, size: 96, offset: 896)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !407, file: !241, line: 50, baseType: !242, size: 32, offset: 992)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !407, file: !241, line: 51, baseType: !242, size: 32, offset: 1024)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !391, file: !317, line: 865, baseType: !406, size: 1088, offset: 7424)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !391, file: !317, line: 867, baseType: !242, size: 32, offset: 8512)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !391, file: !317, line: 868, baseType: !242, size: 32, offset: 8544)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !391, file: !317, line: 869, baseType: !439, size: 7744, offset: 8576)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !256, line: 60, baseType: !440)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !256, line: 34, size: 7744, elements: !441)
!441 = !{!442, !443, !444, !445, !446, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !440, file: !256, line: 37, baseType: !394, size: 2040)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !440, file: !256, line: 38, baseType: !394, size: 2040, offset: 2040)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !440, file: !256, line: 39, baseType: !394, size: 2040, offset: 4080)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !440, file: !256, line: 40, baseType: !242, size: 32, offset: 6144)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !440, file: !256, line: 41, baseType: !447, size: 32, offset: 6176)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !256, line: 32, baseType: !255)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !440, file: !256, line: 42, baseType: !406, size: 1088, offset: 6208)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !440, file: !256, line: 43, baseType: !242, size: 32, offset: 7296)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !440, file: !256, line: 44, baseType: !242, size: 32, offset: 7328)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !440, file: !256, line: 45, baseType: !242, size: 32, offset: 7360)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !440, file: !256, line: 46, baseType: !242, size: 32, offset: 7392)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !440, file: !256, line: 47, baseType: !242, size: 32, offset: 7424)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !440, file: !256, line: 48, baseType: !242, size: 32, offset: 7456)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !440, file: !256, line: 49, baseType: !242, size: 32, offset: 7488)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !440, file: !256, line: 50, baseType: !242, size: 32, offset: 7520)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !440, file: !256, line: 51, baseType: !242, size: 32, offset: 7552)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !440, file: !256, line: 52, baseType: !242, size: 32, offset: 7584)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !440, file: !256, line: 53, baseType: !242, size: 32, offset: 7616)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !440, file: !256, line: 56, baseType: !461, size: 64, offset: 7680)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !391, file: !317, line: 870, baseType: !439, size: 7744, offset: 16320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !391, file: !317, line: 871, baseType: !439, size: 7744, offset: 24064)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !391, file: !317, line: 873, baseType: !242, size: 32, offset: 31808)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !391, file: !317, line: 884, baseType: !242, size: 32, offset: 31840)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !391, file: !317, line: 885, baseType: !242, size: 32, offset: 31872)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !391, file: !317, line: 886, baseType: !242, size: 32, offset: 31904)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !391, file: !317, line: 890, baseType: !242, size: 32, offset: 31936)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !391, file: !317, line: 893, baseType: !242, size: 32, offset: 31968)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !391, file: !317, line: 894, baseType: !242, size: 32, offset: 32000)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !391, file: !317, line: 895, baseType: !242, size: 32, offset: 32032)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !391, file: !317, line: 897, baseType: !242, size: 32, offset: 32064)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !391, file: !317, line: 899, baseType: !242, size: 32, offset: 32096)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !387, file: !317, line: 569, baseType: !475, size: 64, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !477, line: 138, baseType: !478)
!477 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !477, line: 94, size: 17728, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !490, !494, !497, !500, !501, !502, !503, !504, !508, !509, !510, !511, !512, !513, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !478, file: !477, line: 96, baseType: !242, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !478, file: !477, line: 97, baseType: !266, size: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !478, file: !477, line: 98, baseType: !266, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !478, file: !477, line: 99, baseType: !242, size: 32, offset: 96)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !478, file: !477, line: 100, baseType: !242, size: 32, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !478, file: !477, line: 102, baseType: !242, size: 32, offset: 160)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !478, file: !477, line: 103, baseType: !487, size: 384, offset: 192)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 384, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 12)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !478, file: !477, line: 104, baseType: !491, size: 3072, offset: 576)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 3072, elements: !492)
!492 = !{!493, !333}
!493 = !DISubrange(count: 6)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !478, file: !477, line: 105, baseType: !495, size: 12288, offset: 3648)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 12288, elements: !496)
!496 = !{!493, !166}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !478, file: !477, line: 106, baseType: !498, size: 192, offset: 15936)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 192, elements: !499)
!499 = !{!493}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !478, file: !477, line: 107, baseType: !498, size: 192, offset: 16128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !478, file: !477, line: 110, baseType: !242, size: 32, offset: 16320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !478, file: !477, line: 111, baseType: !266, size: 32, offset: 16352)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !478, file: !477, line: 112, baseType: !266, size: 32, offset: 16384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !478, file: !477, line: 114, baseType: !505, size: 256, offset: 16416)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 256, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 8)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !478, file: !477, line: 116, baseType: !505, size: 256, offset: 16672)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !478, file: !477, line: 117, baseType: !505, size: 256, offset: 16928)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !478, file: !477, line: 119, baseType: !242, size: 32, offset: 17184)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !478, file: !477, line: 120, baseType: !266, size: 32, offset: 17216)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !478, file: !477, line: 122, baseType: !266, size: 32, offset: 17248)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !478, file: !477, line: 123, baseType: !514, size: 64, offset: 17280)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !478, file: !477, line: 125, baseType: !242, size: 32, offset: 17344)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !478, file: !477, line: 126, baseType: !242, size: 32, offset: 17376)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !478, file: !477, line: 127, baseType: !242, size: 32, offset: 17408)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !478, file: !477, line: 128, baseType: !266, size: 32, offset: 17440)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !478, file: !477, line: 129, baseType: !242, size: 32, offset: 17472)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !478, file: !477, line: 130, baseType: !242, size: 32, offset: 17504)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !478, file: !477, line: 131, baseType: !242, size: 32, offset: 17536)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !478, file: !477, line: 133, baseType: !242, size: 32, offset: 17568)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !478, file: !477, line: 135, baseType: !242, size: 32, offset: 17600)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !478, file: !477, line: 136, baseType: !242, size: 32, offset: 17632)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !478, file: !477, line: 137, baseType: !242, size: 32, offset: 17664)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !387, file: !317, line: 570, baseType: !527, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !477, line: 197, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !477, line: 142, size: 33024, elements: !530)
!530 = !{!531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !625, !626}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !529, file: !477, line: 144, baseType: !242, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !529, file: !477, line: 146, baseType: !266, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !529, file: !477, line: 147, baseType: !242, size: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !529, file: !477, line: 148, baseType: !242, size: 32, offset: 96)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !529, file: !477, line: 149, baseType: !242, size: 32, offset: 128)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !529, file: !477, line: 150, baseType: !242, size: 32, offset: 160)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !529, file: !477, line: 152, baseType: !242, size: 32, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !529, file: !477, line: 154, baseType: !266, size: 32, offset: 224)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !529, file: !477, line: 155, baseType: !266, size: 32, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !529, file: !477, line: 156, baseType: !266, size: 32, offset: 288)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !529, file: !477, line: 158, baseType: !242, size: 32, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !529, file: !477, line: 159, baseType: !487, size: 384, offset: 352)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !529, file: !477, line: 160, baseType: !491, size: 3072, offset: 736)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !529, file: !477, line: 161, baseType: !495, size: 12288, offset: 3808)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !529, file: !477, line: 162, baseType: !498, size: 192, offset: 16096)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !529, file: !477, line: 163, baseType: !498, size: 192, offset: 16288)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !529, file: !477, line: 165, baseType: !266, size: 32, offset: 16480)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !529, file: !477, line: 166, baseType: !266, size: 32, offset: 16512)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !529, file: !477, line: 167, baseType: !266, size: 32, offset: 16544)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !529, file: !477, line: 168, baseType: !266, size: 32, offset: 16576)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !529, file: !477, line: 170, baseType: !266, size: 32, offset: 16608)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !529, file: !477, line: 172, baseType: !242, size: 32, offset: 16640)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !529, file: !477, line: 173, baseType: !242, size: 32, offset: 16672)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !529, file: !477, line: 174, baseType: !242, size: 32, offset: 16704)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !529, file: !477, line: 175, baseType: !266, size: 32, offset: 16736)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !529, file: !477, line: 177, baseType: !557, size: 8192, offset: 16768)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 8192, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !529, file: !477, line: 178, baseType: !266, size: 32, offset: 24960)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !529, file: !477, line: 179, baseType: !242, size: 32, offset: 24992)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !529, file: !477, line: 180, baseType: !266, size: 32, offset: 25024)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !529, file: !477, line: 181, baseType: !266, size: 32, offset: 25056)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !529, file: !477, line: 182, baseType: !242, size: 32, offset: 25088)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !529, file: !477, line: 184, baseType: !242, size: 32, offset: 25120)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !529, file: !477, line: 185, baseType: !242, size: 32, offset: 25152)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !529, file: !477, line: 186, baseType: !242, size: 32, offset: 25184)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !529, file: !477, line: 187, baseType: !266, size: 32, offset: 25216)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !529, file: !477, line: 188, baseType: !266, size: 32, offset: 25248)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !529, file: !477, line: 189, baseType: !266, size: 32, offset: 25280)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !529, file: !477, line: 190, baseType: !266, size: 32, offset: 25312)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !529, file: !477, line: 191, baseType: !242, size: 32, offset: 25344)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !529, file: !477, line: 192, baseType: !574, size: 7584, offset: 25376)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !477, line: 90, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !477, line: 53, size: 7584, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !575, file: !477, line: 55, baseType: !242, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !575, file: !477, line: 56, baseType: !266, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !575, file: !477, line: 57, baseType: !313, size: 16, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !575, file: !477, line: 58, baseType: !313, size: 16, offset: 80)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !575, file: !477, line: 59, baseType: !242, size: 32, offset: 96)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !575, file: !477, line: 60, baseType: !242, size: 32, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !575, file: !477, line: 61, baseType: !242, size: 32, offset: 160)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !575, file: !477, line: 62, baseType: !266, size: 32, offset: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !575, file: !477, line: 63, baseType: !242, size: 32, offset: 224)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !575, file: !477, line: 64, baseType: !242, size: 32, offset: 256)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !575, file: !477, line: 65, baseType: !266, size: 32, offset: 288)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !575, file: !477, line: 66, baseType: !266, size: 32, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !575, file: !477, line: 67, baseType: !266, size: 32, offset: 352)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !575, file: !477, line: 68, baseType: !242, size: 32, offset: 384)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !575, file: !477, line: 69, baseType: !266, size: 32, offset: 416)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !575, file: !477, line: 70, baseType: !266, size: 32, offset: 448)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !575, file: !477, line: 71, baseType: !242, size: 32, offset: 480)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !575, file: !477, line: 72, baseType: !266, size: 32, offset: 512)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !575, file: !477, line: 73, baseType: !266, size: 32, offset: 544)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !575, file: !477, line: 74, baseType: !242, size: 32, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !575, file: !477, line: 75, baseType: !242, size: 32, offset: 608)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !575, file: !477, line: 76, baseType: !599, size: 3296, offset: 640)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !477, line: 50, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !477, line: 38, size: 3296, elements: !601)
!601 = !{!602, !603, !604, !605, !607, !608, !609, !610, !611, !612}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !600, file: !477, line: 40, baseType: !266, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !600, file: !477, line: 41, baseType: !266, size: 32, offset: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !600, file: !477, line: 42, baseType: !266, size: 32, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !600, file: !477, line: 43, baseType: !606, size: 1024, offset: 96)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 1024, elements: !55)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !600, file: !477, line: 44, baseType: !606, size: 1024, offset: 1120)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !600, file: !477, line: 45, baseType: !606, size: 1024, offset: 2144)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !600, file: !477, line: 46, baseType: !266, size: 32, offset: 3168)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !600, file: !477, line: 47, baseType: !266, size: 32, offset: 3200)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !600, file: !477, line: 48, baseType: !266, size: 32, offset: 3232)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !600, file: !477, line: 49, baseType: !266, size: 32, offset: 3264)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !575, file: !477, line: 77, baseType: !242, size: 32, offset: 3936)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !575, file: !477, line: 78, baseType: !599, size: 3296, offset: 3968)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !575, file: !477, line: 80, baseType: !242, size: 32, offset: 7264)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !575, file: !477, line: 81, baseType: !242, size: 32, offset: 7296)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !575, file: !477, line: 82, baseType: !242, size: 32, offset: 7328)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !575, file: !477, line: 83, baseType: !242, size: 32, offset: 7360)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !575, file: !477, line: 84, baseType: !266, size: 32, offset: 7392)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !575, file: !477, line: 85, baseType: !266, size: 32, offset: 7424)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !575, file: !477, line: 86, baseType: !266, size: 32, offset: 7456)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !575, file: !477, line: 87, baseType: !266, size: 32, offset: 7488)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !575, file: !477, line: 88, baseType: !266, size: 32, offset: 7520)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !575, file: !477, line: 89, baseType: !266, size: 32, offset: 7552)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !529, file: !477, line: 193, baseType: !266, size: 32, offset: 32960)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !529, file: !477, line: 195, baseType: !242, size: 32, offset: 32992)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !387, file: !317, line: 571, baseType: !628, size: 1056768, offset: 192)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 1056768, elements: !55)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !387, file: !317, line: 572, baseType: !630, size: 4538368, offset: 1056960)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 4538368, elements: !558)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !387, file: !317, line: 575, baseType: !632, size: 64, offset: 5595328)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !477, line: 256, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !477, line: 228, size: 37312, elements: !635)
!635 = !{!636, !637, !638, !639, !640, !641, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !656, !657, !658, !659}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !634, file: !477, line: 230, baseType: !528, size: 33024)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !634, file: !477, line: 232, baseType: !266, size: 32, offset: 33024)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !634, file: !477, line: 233, baseType: !242, size: 32, offset: 33056)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !634, file: !477, line: 234, baseType: !461, size: 64, offset: 33088)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !634, file: !477, line: 235, baseType: !461, size: 64, offset: 33152)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !634, file: !477, line: 236, baseType: !642, size: 64, offset: 33216)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !634, file: !477, line: 237, baseType: !461, size: 64, offset: 33280)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !634, file: !477, line: 238, baseType: !642, size: 64, offset: 33344)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !634, file: !477, line: 240, baseType: !461, size: 64, offset: 33408)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !634, file: !477, line: 241, baseType: !642, size: 64, offset: 33472)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !634, file: !477, line: 242, baseType: !461, size: 64, offset: 33536)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !634, file: !477, line: 243, baseType: !642, size: 64, offset: 33600)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !634, file: !477, line: 245, baseType: !242, size: 32, offset: 33664)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !634, file: !477, line: 246, baseType: !461, size: 64, offset: 33728)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !634, file: !477, line: 247, baseType: !461, size: 64, offset: 33792)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !634, file: !477, line: 248, baseType: !642, size: 64, offset: 33856)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !634, file: !477, line: 249, baseType: !642, size: 64, offset: 33920)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !634, file: !477, line: 250, baseType: !655, size: 64, offset: 33984)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !634, file: !477, line: 251, baseType: !642, size: 64, offset: 34048)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !634, file: !477, line: 253, baseType: !266, size: 32, offset: 34112)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !634, file: !477, line: 254, baseType: !242, size: 32, offset: 34144)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !634, file: !477, line: 255, baseType: !660, size: 3136, offset: 34176)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !477, line: 226, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !477, line: 200, size: 3136, elements: !662)
!662 = !{!663, !664, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !682, !683, !685, !686, !687, !688}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !661, file: !477, line: 202, baseType: !242, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !661, file: !477, line: 203, baseType: !665, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !661, file: !477, line: 204, baseType: !461, size: 64, offset: 128)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !661, file: !477, line: 205, baseType: !642, size: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !661, file: !477, line: 206, baseType: !665, size: 64, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !661, file: !477, line: 207, baseType: !461, size: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !661, file: !477, line: 208, baseType: !461, size: 64, offset: 384)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !661, file: !477, line: 209, baseType: !665, size: 64, offset: 448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !661, file: !477, line: 210, baseType: !665, size: 64, offset: 512)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !661, file: !477, line: 211, baseType: !665, size: 64, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !661, file: !477, line: 212, baseType: !665, size: 64, offset: 640)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !661, file: !477, line: 213, baseType: !665, size: 64, offset: 704)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !661, file: !477, line: 216, baseType: !666, size: 8, offset: 768)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !661, file: !477, line: 217, baseType: !666, size: 8, offset: 776)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !661, file: !477, line: 218, baseType: !666, size: 8, offset: 784)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !661, file: !477, line: 219, baseType: !681, size: 1024, offset: 800)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 1024, elements: !55)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !661, file: !477, line: 220, baseType: !681, size: 1024, offset: 1824)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !661, file: !477, line: 221, baseType: !684, size: 256, offset: 2848)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 256, elements: !55)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !661, file: !477, line: 222, baseType: !666, size: 8, offset: 3104)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !661, file: !477, line: 223, baseType: !666, size: 8, offset: 3112)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !661, file: !477, line: 224, baseType: !666, size: 8, offset: 3120)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !661, file: !477, line: 225, baseType: !666, size: 8, offset: 3128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !387, file: !317, line: 577, baseType: !690, size: 1193984, offset: 5595392)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 1193984, elements: !55)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !387, file: !317, line: 578, baseType: !242, size: 32, offset: 6789376)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !387, file: !317, line: 579, baseType: !242, size: 32, offset: 6789408)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !387, file: !317, line: 580, baseType: !242, size: 32, offset: 6789440)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !387, file: !317, line: 581, baseType: !242, size: 32, offset: 6789472)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !387, file: !317, line: 584, baseType: !696, size: 64, offset: 6789504)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !317, line: 584, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !387, file: !317, line: 586, baseType: !699, size: 64, offset: 6789568)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !317, line: 902, size: 416, elements: !701)
!701 = !{!702, !703, !704, !705, !706, !707, !710, !711, !712, !713, !714, !715, !716}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !700, file: !317, line: 904, baseType: !266, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !700, file: !317, line: 905, baseType: !266, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !700, file: !317, line: 906, baseType: !242, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !700, file: !317, line: 907, baseType: !266, size: 32, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !700, file: !317, line: 908, baseType: !242, size: 32, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !700, file: !317, line: 909, baseType: !708, size: 64, offset: 160)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 64, elements: !709)
!709 = !{!347}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !700, file: !317, line: 910, baseType: !309, size: 8, offset: 224)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !700, file: !317, line: 911, baseType: !309, size: 8, offset: 232)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !700, file: !317, line: 912, baseType: !242, size: 32, offset: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !700, file: !317, line: 913, baseType: !242, size: 32, offset: 288)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !700, file: !317, line: 915, baseType: !242, size: 32, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !700, file: !317, line: 916, baseType: !242, size: 32, offset: 352)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !700, file: !317, line: 917, baseType: !242, size: 32, offset: 384)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !387, file: !317, line: 587, baseType: !718, size: 64, offset: 6789632)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !317, line: 839, size: 512, elements: !720)
!720 = !{!721, !722, !725, !726, !727, !728}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !719, file: !317, line: 841, baseType: !242, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !719, file: !317, line: 842, baseType: !723, size: 96, offset: 32)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 96, elements: !417)
!724 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !719, file: !317, line: 843, baseType: !723, size: 96, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !719, file: !317, line: 844, baseType: !723, size: 96, offset: 224)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !719, file: !317, line: 845, baseType: !723, size: 96, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !719, file: !317, line: 846, baseType: !723, size: 96, offset: 416)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !387, file: !317, line: 588, baseType: !242, size: 32, offset: 6789696)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !387, file: !317, line: 591, baseType: !266, size: 32, offset: 6789728)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !387, file: !317, line: 592, baseType: !242, size: 32, offset: 6789760)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !387, file: !317, line: 593, baseType: !242, size: 32, offset: 6789792)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !387, file: !317, line: 594, baseType: !242, size: 32, offset: 6789824)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !387, file: !317, line: 595, baseType: !735, size: 64, offset: 6789888)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !387, file: !317, line: 596, baseType: !665, size: 64, offset: 6789952)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block_JV", scope: !387, file: !317, line: 597, baseType: !738, size: 192, offset: 6790016)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 192, elements: !417)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !387, file: !317, line: 601, baseType: !242, size: 32, offset: 6790208)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !387, file: !317, line: 602, baseType: !242, size: 32, offset: 6790240)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !387, file: !317, line: 603, baseType: !242, size: 32, offset: 6790272)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !387, file: !317, line: 604, baseType: !242, size: 32, offset: 6790304)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !387, file: !317, line: 605, baseType: !242, size: 32, offset: 6790336)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !387, file: !317, line: 607, baseType: !745, size: 64, offset: 6790400)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode_JV", scope: !387, file: !317, line: 608, baseType: !747, size: 192, offset: 6790464)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 192, elements: !417)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !387, file: !317, line: 609, baseType: !749, size: 64, offset: 6790656)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "siblock", scope: !387, file: !317, line: 610, baseType: !642, size: 64, offset: 6790720)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "siblock_JV", scope: !387, file: !317, line: 611, baseType: !753, size: 192, offset: 6790784)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !642, size: 192, elements: !417)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "newframe", scope: !387, file: !317, line: 613, baseType: !242, size: 32, offset: 6790976)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !387, file: !317, line: 614, baseType: !242, size: 32, offset: 6791008)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "pNextSlice", scope: !387, file: !317, line: 617, baseType: !381, size: 64, offset: 6791040)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !387, file: !317, line: 618, baseType: !758, size: 64, offset: 6791104)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !317, line: 273, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !317, line: 197, size: 3840, elements: !761)
!761 = !{!762, !764, !765, !766, !767, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !796, !797, !798, !799, !800, !804, !805, !814, !815, !816, !817, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !843, !844, !968, !982, !1026}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !760, file: !317, line: 199, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !760, file: !317, line: 200, baseType: !386, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !760, file: !317, line: 201, baseType: !390, size: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrX", scope: !760, file: !317, line: 202, baseType: !242, size: 32, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !760, file: !317, line: 203, baseType: !768, size: 32, offset: 224)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockPos", file: !317, line: 112, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 108, size: 32, elements: !770)
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !769, file: !317, line: 110, baseType: !314, size: 16)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !769, file: !317, line: 111, baseType: !314, size: 16, offset: 16)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !760, file: !317, line: 204, baseType: !242, size: 32, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !760, file: !317, line: 205, baseType: !242, size: 32, offset: 288)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "block_y_aff", scope: !760, file: !317, line: 206, baseType: !242, size: 32, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !760, file: !317, line: 207, baseType: !242, size: 32, offset: 352)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !760, file: !317, line: 208, baseType: !242, size: 32, offset: 384)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !760, file: !317, line: 209, baseType: !242, size: 32, offset: 416)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !760, file: !317, line: 210, baseType: !242, size: 32, offset: 448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !760, file: !317, line: 212, baseType: !242, size: 32, offset: 480)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !760, file: !317, line: 213, baseType: !242, size: 32, offset: 512)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !760, file: !317, line: 215, baseType: !242, size: 32, offset: 544)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "qpc", scope: !760, file: !317, line: 216, baseType: !708, size: 64, offset: 576)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "qp_scaled", scope: !760, file: !317, line: 217, baseType: !416, size: 96, offset: 640)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "is_lossless", scope: !760, file: !317, line: 218, baseType: !242, size: 32, offset: 736)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !760, file: !317, line: 219, baseType: !242, size: 32, offset: 768)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !760, file: !317, line: 220, baseType: !242, size: 32, offset: 800)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !760, file: !317, line: 221, baseType: !242, size: 32, offset: 832)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !760, file: !317, line: 223, baseType: !314, size: 16, offset: 864)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !760, file: !317, line: 224, baseType: !666, size: 8, offset: 880)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "dpl_flag", scope: !760, file: !317, line: 225, baseType: !666, size: 8, offset: 888)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "delta_quant", scope: !760, file: !317, line: 226, baseType: !314, size: 16, offset: 896)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "list_offset", scope: !760, file: !317, line: 227, baseType: !314, size: 16, offset: 912)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "mb_up", scope: !760, file: !317, line: 229, baseType: !795, size: 64, offset: 960)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "mb_left", scope: !760, file: !317, line: 230, baseType: !795, size: 64, offset: 1024)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "mbup", scope: !760, file: !317, line: 232, baseType: !795, size: 64, offset: 1088)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "mbleft", scope: !760, file: !317, line: 233, baseType: !795, size: 64, offset: 1152)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !760, file: !317, line: 236, baseType: !314, size: 16, offset: 1216)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !760, file: !317, line: 237, baseType: !801, size: 1024, offset: 1232)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 1024, elements: !802)
!802 = !{!347, !803, !803, !347}
!803 = !DISubrange(count: 4)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !760, file: !317, line: 239, baseType: !242, size: 32, offset: 2272)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !760, file: !317, line: 240, baseType: !806, size: 192, offset: 2304)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 192, elements: !417)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !808, line: 103, baseType: !809)
!808 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !810, line: 27, baseType: !811)
!810 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !812, line: 44, baseType: !813)
!812 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!813 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !760, file: !317, line: 241, baseType: !806, size: 192, offset: 2496)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits_8x8", scope: !760, file: !317, line: 242, baseType: !806, size: 192, offset: 2688)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "i16mode", scope: !760, file: !317, line: 244, baseType: !242, size: 32, offset: 2880)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !760, file: !317, line: 245, baseType: !818, size: 32, offset: 2912)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 32, elements: !819)
!819 = !{!803}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !760, file: !317, line: 246, baseType: !818, size: 32, offset: 2944)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ipmode_DPCM", scope: !760, file: !317, line: 247, baseType: !666, size: 8, offset: 2976)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !760, file: !317, line: 248, baseType: !666, size: 8, offset: 2984)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !760, file: !317, line: 249, baseType: !666, size: 8, offset: 2992)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "DFDisableIdc", scope: !760, file: !317, line: 250, baseType: !314, size: 16, offset: 3008)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "DFAlphaC0Offset", scope: !760, file: !317, line: 251, baseType: !314, size: 16, offset: 3024)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "DFBetaOffset", scope: !760, file: !317, line: 252, baseType: !314, size: 16, offset: 3040)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !760, file: !317, line: 254, baseType: !242, size: 32, offset: 3072)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !760, file: !317, line: 256, baseType: !242, size: 32, offset: 3104)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !760, file: !317, line: 256, baseType: !242, size: 32, offset: 3136)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !760, file: !317, line: 256, baseType: !242, size: 32, offset: 3168)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !760, file: !317, line: 256, baseType: !242, size: 32, offset: 3200)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !760, file: !317, line: 257, baseType: !242, size: 32, offset: 3232)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !760, file: !317, line: 257, baseType: !242, size: 32, offset: 3264)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !760, file: !317, line: 257, baseType: !242, size: 32, offset: 3296)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !760, file: !317, line: 257, baseType: !242, size: 32, offset: 3328)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !760, file: !317, line: 259, baseType: !242, size: 32, offset: 3360)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !760, file: !317, line: 260, baseType: !242, size: 32, offset: 3392)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_4x4", scope: !760, file: !317, line: 262, baseType: !839, size: 64, offset: 3456)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !795, !842, !242, !242}
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorPlane", file: !265, line: 32, baseType: !264)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_8x8", scope: !760, file: !317, line: 263, baseType: !839, size: 64, offset: 3520)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "GetMVPredictor", scope: !760, file: !317, line: 265, baseType: !845, size: 64, offset: 3584)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{null, !795, !848, !858, !314, !864, !242, !242, !242, !242, !242}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !317, line: 85, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !317, line: 77, size: 128, elements: !851)
!851 = !{!852, !853, !854, !855, !856, !857}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !850, file: !317, line: 79, baseType: !242, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !850, file: !317, line: 80, baseType: !242, size: 32, offset: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !850, file: !317, line: 81, baseType: !314, size: 16, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !850, file: !317, line: 82, baseType: !314, size: 16, offset: 80)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !850, file: !317, line: 83, baseType: !314, size: 16, offset: 96)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !850, file: !317, line: 84, baseType: !314, size: 16, offset: 112)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !317, line: 104, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 100, size: 32, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !860, file: !317, line: 102, baseType: !314, size: 16)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !860, file: !317, line: 103, baseType: !314, size: 16, offset: 16)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !867, line: 36, size: 256, elements: !868)
!867 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!868 = !{!869, !965, !967}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !866, file: !867, line: 38, baseType: !870, size: 128)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !871, size: 128, elements: !709)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !867, line: 46, size: 3328, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !911, !913, !914, !915, !917, !921, !923, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !962}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !872, file: !867, line: 48, baseType: !312, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !872, file: !867, line: 50, baseType: !242, size: 32, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !872, file: !867, line: 51, baseType: !242, size: 32, offset: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !872, file: !867, line: 52, baseType: !242, size: 32, offset: 96)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !872, file: !867, line: 53, baseType: !242, size: 32, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !872, file: !867, line: 54, baseType: !266, size: 32, offset: 160)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !872, file: !867, line: 55, baseType: !266, size: 32, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !872, file: !867, line: 57, baseType: !242, size: 32, offset: 224)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !872, file: !867, line: 58, baseType: !242, size: 32, offset: 256)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !872, file: !867, line: 59, baseType: !242, size: 32, offset: 288)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !872, file: !867, line: 61, baseType: !309, size: 8, offset: 320)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !872, file: !867, line: 62, baseType: !242, size: 32, offset: 352)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !872, file: !867, line: 63, baseType: !242, size: 32, offset: 384)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !872, file: !867, line: 64, baseType: !242, size: 32, offset: 416)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !872, file: !867, line: 65, baseType: !242, size: 32, offset: 448)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !872, file: !867, line: 67, baseType: !314, size: 16, offset: 480)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !872, file: !867, line: 69, baseType: !242, size: 32, offset: 512)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !872, file: !867, line: 69, baseType: !242, size: 32, offset: 544)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !872, file: !867, line: 69, baseType: !242, size: 32, offset: 576)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !872, file: !867, line: 69, baseType: !242, size: 32, offset: 608)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !872, file: !867, line: 70, baseType: !242, size: 32, offset: 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !872, file: !867, line: 70, baseType: !242, size: 32, offset: 672)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !872, file: !867, line: 70, baseType: !242, size: 32, offset: 704)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !872, file: !867, line: 70, baseType: !242, size: 32, offset: 736)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !872, file: !867, line: 71, baseType: !242, size: 32, offset: 768)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !872, file: !867, line: 72, baseType: !242, size: 32, offset: 800)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !872, file: !867, line: 73, baseType: !266, size: 32, offset: 832)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !872, file: !867, line: 74, baseType: !266, size: 32, offset: 864)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !872, file: !867, line: 75, baseType: !242, size: 32, offset: 896)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !872, file: !867, line: 75, baseType: !242, size: 32, offset: 928)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !872, file: !867, line: 76, baseType: !242, size: 32, offset: 960)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !872, file: !867, line: 76, baseType: !242, size: 32, offset: 992)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !872, file: !867, line: 79, baseType: !907, size: 64, offset: 1024)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !310, line: 41, baseType: !910)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !310, line: 23, baseType: !313)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !872, file: !867, line: 80, baseType: !912, size: 64, offset: 1088)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !872, file: !867, line: 81, baseType: !912, size: 64, offset: 1152)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !872, file: !867, line: 84, baseType: !864, size: 64, offset: 1216)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !872, file: !867, line: 85, baseType: !916, size: 192, offset: 1280)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !864, size: 192, elements: !417)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !872, file: !867, line: 87, baseType: !918, size: 64, offset: 1472)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !867, line: 29, size: 64, elements: !919)
!919 = !{!920}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !918, file: !867, line: 31, baseType: !514, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !872, file: !867, line: 88, baseType: !922, size: 192, offset: 1536)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 192, elements: !417)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !872, file: !867, line: 90, baseType: !924, size: 64, offset: 1728)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !872, file: !867, line: 92, baseType: !871, size: 64, offset: 1792)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !872, file: !867, line: 93, baseType: !871, size: 64, offset: 1856)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !872, file: !867, line: 94, baseType: !871, size: 64, offset: 1920)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !872, file: !867, line: 96, baseType: !242, size: 32, offset: 1984)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !872, file: !867, line: 97, baseType: !242, size: 32, offset: 2016)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !872, file: !867, line: 98, baseType: !242, size: 32, offset: 2048)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !872, file: !867, line: 99, baseType: !242, size: 32, offset: 2080)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !872, file: !867, line: 100, baseType: !242, size: 32, offset: 2112)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !872, file: !867, line: 102, baseType: !242, size: 32, offset: 2144)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !872, file: !867, line: 103, baseType: !242, size: 32, offset: 2176)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !872, file: !867, line: 104, baseType: !242, size: 32, offset: 2208)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !872, file: !867, line: 105, baseType: !242, size: 32, offset: 2240)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !872, file: !867, line: 106, baseType: !242, size: 32, offset: 2272)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !872, file: !867, line: 107, baseType: !242, size: 32, offset: 2304)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !872, file: !867, line: 108, baseType: !242, size: 32, offset: 2336)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !872, file: !867, line: 109, baseType: !242, size: 32, offset: 2368)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !872, file: !867, line: 110, baseType: !708, size: 64, offset: 2400)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !872, file: !867, line: 111, baseType: !242, size: 32, offset: 2464)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !872, file: !867, line: 112, baseType: !315, size: 64, offset: 2496)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !872, file: !867, line: 115, baseType: !242, size: 32, offset: 2560)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !872, file: !867, line: 118, baseType: !242, size: 32, offset: 2592)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !872, file: !867, line: 119, baseType: !242, size: 32, offset: 2624)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !872, file: !867, line: 120, baseType: !242, size: 32, offset: 2656)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !872, file: !867, line: 121, baseType: !908, size: 64, offset: 2688)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !872, file: !867, line: 124, baseType: !242, size: 32, offset: 2752)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !872, file: !867, line: 125, baseType: !242, size: 32, offset: 2784)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !872, file: !867, line: 126, baseType: !242, size: 32, offset: 2816)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !872, file: !867, line: 128, baseType: !242, size: 32, offset: 2848)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !872, file: !867, line: 129, baseType: !242, size: 32, offset: 2880)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !872, file: !867, line: 130, baseType: !242, size: 32, offset: 2912)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !872, file: !867, line: 131, baseType: !242, size: 32, offset: 2944)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !872, file: !867, line: 132, baseType: !907, size: 64, offset: 3008)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !872, file: !867, line: 133, baseType: !242, size: 32, offset: 3072)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !872, file: !867, line: 134, baseType: !242, size: 32, offset: 3104)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !872, file: !867, line: 136, baseType: !961, size: 16, offset: 3136)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 16, elements: !709)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !872, file: !867, line: 137, baseType: !963, size: 128, offset: 3200)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 128, elements: !709)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !866, file: !867, line: 39, baseType: !966, size: 64, offset: 128)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !859, size: 64, elements: !709)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !866, file: !867, line: 40, baseType: !961, size: 16, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "read_and_store_CBP_block_bit", scope: !760, file: !317, line: 268, baseType: !969, size: 64, offset: 3648)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!242, !795, !972, !242}
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironmentPtr", file: !317, line: 97, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !317, line: 95, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !317, line: 88, size: 256, elements: !976)
!976 = !{!977, !978, !979, !980, !981}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !975, file: !317, line: 90, baseType: !266, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !975, file: !317, line: 91, baseType: !266, size: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !975, file: !317, line: 92, baseType: !242, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !975, file: !317, line: 93, baseType: !514, size: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !975, file: !317, line: 94, baseType: !461, size: 64, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "readRefPictureIdx", scope: !760, file: !317, line: 269, baseType: !983, size: 64, offset: 3712)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!666, !795, !986, !1005, !666, !242}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !317, line: 276, size: 384, elements: !988)
!988 = !{!989, !990, !991, !992, !993, !994, !995, !996, !997, !1001}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !987, file: !317, line: 278, baseType: !242, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !987, file: !317, line: 279, baseType: !242, size: 32, offset: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !987, file: !317, line: 280, baseType: !242, size: 32, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !987, file: !317, line: 281, baseType: !242, size: 32, offset: 96)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !987, file: !317, line: 282, baseType: !242, size: 32, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !987, file: !317, line: 283, baseType: !266, size: 32, offset: 160)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !987, file: !317, line: 284, baseType: !242, size: 32, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !987, file: !317, line: 285, baseType: !242, size: 32, offset: 224)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !987, file: !317, line: 293, baseType: !998, size: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, !242, !242, !461, !461}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !987, file: !317, line: 295, baseType: !1002, size: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{null, !758, !986, !972}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !317, line: 314, size: 384, elements: !1007)
!1007 = !{!1008, !1019, !1020}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !1006, file: !317, line: 317, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !317, line: 47, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream", file: !317, line: 300, size: 256, elements: !1012)
!1012 = !{!1013, !1014, !1015, !1016, !1017, !1018}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "read_len", scope: !1011, file: !317, line: 303, baseType: !242, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !1011, file: !317, line: 304, baseType: !242, size: 32, offset: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bitoffset", scope: !1011, file: !317, line: 306, baseType: !242, size: 32, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_length", scope: !1011, file: !317, line: 307, baseType: !242, size: 32, offset: 96)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !1011, file: !317, line: 309, baseType: !514, size: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !1011, file: !317, line: 310, baseType: !242, size: 32, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "de_cabac", scope: !1006, file: !317, line: 318, baseType: !974, size: 256, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "readSyntaxElement", scope: !1006, file: !317, line: 320, baseType: !1021, size: 64, offset: 320)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!242, !758, !1024, !1005}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !317, line: 296, baseType: !987)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "mixedModeEdgeFlag", scope: !760, file: !317, line: 272, baseType: !309, size: 8, offset: 3776)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data_JV", scope: !387, file: !317, line: 619, baseType: !1028, size: 192, offset: 6791168)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 192, elements: !417)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaArrayType", scope: !387, file: !317, line: 621, baseType: !242, size: 32, offset: 6791360)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_head", scope: !387, file: !317, line: 626, baseType: !1031, size: 64, offset: 6791424)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !317, line: 626, flags: DIFlagFwdDecl)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_end", scope: !387, file: !317, line: 627, baseType: !1031, size: 64, offset: 6791488)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !387, file: !317, line: 629, baseType: !266, size: 32, offset: 6791552)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "non_conforming_stream", scope: !387, file: !317, line: 630, baseType: !242, size: 32, offset: 6791584)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntMsb", scope: !387, file: !317, line: 634, baseType: !242, size: 32, offset: 6791616)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntLsb", scope: !387, file: !317, line: 635, baseType: !266, size: 32, offset: 6791648)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedPicOrderCnt", scope: !387, file: !317, line: 638, baseType: !242, size: 32, offset: 6791680)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntCycleCnt", scope: !387, file: !317, line: 638, baseType: !242, size: 32, offset: 6791712)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumInPicOrderCntCycle", scope: !387, file: !317, line: 638, baseType: !242, size: 32, offset: 6791744)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNum", scope: !387, file: !317, line: 639, baseType: !266, size: 32, offset: 6791776)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumOffset", scope: !387, file: !317, line: 639, baseType: !266, size: 32, offset: 6791808)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDeltaPerPicOrderCntCycle", scope: !387, file: !317, line: 640, baseType: !242, size: 32, offset: 6791840)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !387, file: !317, line: 641, baseType: !242, size: 32, offset: 6791872)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNumOffset", scope: !387, file: !317, line: 642, baseType: !242, size: 32, offset: 6791904)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFrameNum", scope: !387, file: !317, line: 645, baseType: !242, size: 32, offset: 6791936)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !387, file: !317, line: 647, baseType: !266, size: 32, offset: 6791968)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !387, file: !317, line: 648, baseType: !266, size: 32, offset: 6792000)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !387, file: !317, line: 649, baseType: !266, size: 32, offset: 6792032)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !387, file: !317, line: 650, baseType: !266, size: 32, offset: 6792064)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !387, file: !317, line: 651, baseType: !266, size: 32, offset: 6792096)
