; ModuleID = 'ldecod_src/image.c'
source_filename = "ldecod_src/image.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.macroblock = type { ptr, ptr, ptr, i32, %struct.BlockPos, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], [3 x i32], i32, i32, i32, i32, i16, i8, i8, i16, i16, ptr, ptr, ptr, ptr, i16, [2 x [4 x [4 x [2 x i16]]]], i32, [3 x i64], [3 x i64], [3 x i64], i32, [4 x i8], [4 x i8], i8, i8, i8, i16, i16, i16, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, i8 }
%struct.BlockPos = type { i16, i16 }
%struct.object_buffer = type { i8, i32, i32, [3 x i32] }
%struct.pic_motion_params = type { [2 x ptr], [2 x %struct.MotionVector], [2 x i8] }
%struct.MotionVector = type { i16, i16 }

@.str = private unnamed_addr constant [111 x i8] c"Source picture has higher bit depth than imgpel data type. \0APlease recompile with larger data type for imgpel.\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [80 x i8] c"reading only from formats of 8, 16 or 32 bit allowed on big endian architecture\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [14 x i8] c"find_snr: buf\00", align 1, !dbg !12
@stderr = external local_unnamed_addr global ptr, align 8

!254 = !DIEnumerator(name: "SE_PTYPE", value: 1)
!255 = !DIEnumerator(name: "SE_MBTYPE", value: 2)
!256 = !DIEnumerator(name: "SE_REFFRAME", value: 3)
!257 = !DIEnumerator(name: "SE_INTRAPREDMODE", value: 4)
!258 = !DIEnumerator(name: "SE_MVD", value: 5)
!259 = !DIEnumerator(name: "SE_CBP", value: 6)
!260 = !DIEnumerator(name: "SE_LUM_DC_INTRA", value: 7)
!261 = !DIEnumerator(name: "SE_CHR_DC_INTRA", value: 8)
!262 = !DIEnumerator(name: "SE_LUM_AC_INTRA", value: 9)
!263 = !DIEnumerator(name: "SE_CHR_AC_INTRA", value: 10)
!264 = !DIEnumerator(name: "SE_LUM_DC_INTER", value: 11)
!265 = !DIEnumerator(name: "SE_CHR_DC_INTER", value: 12)
!266 = !DIEnumerator(name: "SE_LUM_AC_INTER", value: 13)
!267 = !DIEnumerator(name: "SE_CHR_AC_INTER", value: 14)
!268 = !DIEnumerator(name: "SE_DELTA_QUANT", value: 15)
!269 = !DIEnumerator(name: "SE_BFRAME", value: 16)
!270 = !DIEnumerator(name: "SE_EOS", value: 17)
!271 = !DIEnumerator(name: "SE_MAX_ELEMENTS", value: 20)
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !137, line: 119, baseType: !138, size: 32, elements: !273)
!273 = !{!274, !275}
!274 = !DIEnumerator(name: "CAVLC", value: 0)
!275 = !DIEnumerator(name: "CABAC", value: 1)
!276 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !209, line: 203, baseType: !138, size: 32, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286}
!278 = !DIEnumerator(name: "VERT_PRED", value: 0)
!279 = !DIEnumerator(name: "HOR_PRED", value: 1)
!280 = !DIEnumerator(name: "DC_PRED", value: 2)
!281 = !DIEnumerator(name: "DIAG_DOWN_LEFT_PRED", value: 3)
!282 = !DIEnumerator(name: "DIAG_DOWN_RIGHT_PRED", value: 4)
!283 = !DIEnumerator(name: "VERT_RIGHT_PRED", value: 5)
!284 = !DIEnumerator(name: "HOR_DOWN_PRED", value: 6)
!285 = !DIEnumerator(name: "VERT_LEFT_PRED", value: 7)
!286 = !DIEnumerator(name: "HOR_UP_PRED", value: 8)
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !137, line: 166, baseType: !138, size: 32, elements: !288)
!288 = !{!289, !290}
!289 = !DIEnumerator(name: "IS_LUMA", value: 0)
!290 = !DIEnumerator(name: "IS_CHROMA", value: 1)
!291 = !{!145, !292, !293, !829, !828, !725, !1557, !643, !584, !429, !138, !793, !328}
!292 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !296, line: 542, baseType: !297)
!296 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !296, line: 341, size: 109184, elements: !298)
!298 = !{!299, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1383, !1385, !1388, !1416, !1443, !1446, !1447, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1482, !1483, !1484, !1485, !1486, !1487, !1490, !1491, !1494, !1495, !1497, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1510, !1511, !1512, !1513, !1514, !1516, !1517, !1518, !1522, !1526, !1530, !1534, !1538, !1539, !1540, !1541, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !297, file: !296, line: 343, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !296, line: 566, size: 6855040, elements: !302)
!302 = !{!303, !388, !443, !545, !547, !549, !607, !609, !610, !611, !612, !613, !616, !636, !648, !649, !650, !651, !652, !653, !654, !655, !657, !658, !659, !660, !661, !662, !664, !666, !669, !670, !672, !673, !674, !675, !957, !959, !960, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1111, !1115, !1116, !1118, !1119, !1128, !1150, !1151, !1152, !1154, !1168, !1210, !1211, !1212, !1213, !1214, !1215, !1239, !1240, !1242, !1243, !1244, !1245, !1246, !1263, !1268, !1272, !1276, !1280, !1281, !1285, !1286, !1290, !1291, !1295, !1316, !1317, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !301, file: !296, line: 568, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !296, line: 850, size: 32128, elements: !306)
!306 = !{!307, !311, !312, !313, !314, !315, !316, !317, !318, !319, !349, !350, !351, !352, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !305, file: !296, line: 852, baseType: !308, size: 2040)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 255)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !305, file: !296, line: 853, baseType: !308, size: 2040, offset: 2040)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !305, file: !296, line: 854, baseType: !308, size: 2040, offset: 4080)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !305, file: !296, line: 856, baseType: !145, size: 32, offset: 6144)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !305, file: !296, line: 857, baseType: !145, size: 32, offset: 6176)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !305, file: !296, line: 858, baseType: !145, size: 32, offset: 6208)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !305, file: !296, line: 859, baseType: !145, size: 32, offset: 6240)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !305, file: !296, line: 860, baseType: !145, size: 32, offset: 6272)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !305, file: !296, line: 861, baseType: !145, size: 32, offset: 6304)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !305, file: !296, line: 864, baseType: !320, size: 1088, offset: 6336)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !144, line: 52, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !144, line: 30, size: 1088, elements: !322)
!322 = !{!323, !325, !327, !329, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !321, file: !144, line: 32, baseType: !324, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !144, line: 28, baseType: !143)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !321, file: !144, line: 33, baseType: !326, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !144, line: 20, baseType: !152)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !321, file: !144, line: 34, baseType: !328, size: 64, offset: 64)
!328 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !321, file: !144, line: 35, baseType: !330, size: 96, offset: 128)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 96, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 3)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !321, file: !144, line: 36, baseType: !330, size: 96, offset: 224)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !321, file: !144, line: 37, baseType: !145, size: 32, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !321, file: !144, line: 38, baseType: !145, size: 32, offset: 352)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !321, file: !144, line: 39, baseType: !145, size: 32, offset: 384)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !321, file: !144, line: 40, baseType: !145, size: 32, offset: 416)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !321, file: !144, line: 41, baseType: !145, size: 32, offset: 448)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !321, file: !144, line: 42, baseType: !145, size: 32, offset: 480)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !321, file: !144, line: 43, baseType: !145, size: 32, offset: 512)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !321, file: !144, line: 44, baseType: !145, size: 32, offset: 544)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !321, file: !144, line: 45, baseType: !330, size: 96, offset: 576)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !321, file: !144, line: 46, baseType: !145, size: 32, offset: 672)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !321, file: !144, line: 47, baseType: !330, size: 96, offset: 704)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !321, file: !144, line: 48, baseType: !330, size: 96, offset: 800)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !321, file: !144, line: 49, baseType: !330, size: 96, offset: 896)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !321, file: !144, line: 50, baseType: !145, size: 32, offset: 992)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !321, file: !144, line: 51, baseType: !145, size: 32, offset: 1024)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !305, file: !296, line: 865, baseType: !320, size: 1088, offset: 7424)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !305, file: !296, line: 867, baseType: !145, size: 32, offset: 8512)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !305, file: !296, line: 868, baseType: !145, size: 32, offset: 8544)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !305, file: !296, line: 869, baseType: !353, size: 7744, offset: 8576)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !159, line: 60, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !159, line: 34, size: 7744, elements: !355)
!355 = !{!356, !357, !358, !359, !360, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !354, file: !159, line: 37, baseType: !308, size: 2040)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !354, file: !159, line: 38, baseType: !308, size: 2040, offset: 2040)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !354, file: !159, line: 39, baseType: !308, size: 2040, offset: 4080)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !354, file: !159, line: 40, baseType: !145, size: 32, offset: 6144)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !354, file: !159, line: 41, baseType: !361, size: 32, offset: 6176)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !159, line: 32, baseType: !158)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !354, file: !159, line: 42, baseType: !320, size: 1088, offset: 6208)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !354, file: !159, line: 43, baseType: !145, size: 32, offset: 7296)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !354, file: !159, line: 44, baseType: !145, size: 32, offset: 7328)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !354, file: !159, line: 45, baseType: !145, size: 32, offset: 7360)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !354, file: !159, line: 46, baseType: !145, size: 32, offset: 7392)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !354, file: !159, line: 47, baseType: !145, size: 32, offset: 7424)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !354, file: !159, line: 48, baseType: !145, size: 32, offset: 7456)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !354, file: !159, line: 49, baseType: !145, size: 32, offset: 7488)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !354, file: !159, line: 50, baseType: !145, size: 32, offset: 7520)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !354, file: !159, line: 51, baseType: !145, size: 32, offset: 7552)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !354, file: !159, line: 52, baseType: !145, size: 32, offset: 7584)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !354, file: !159, line: 53, baseType: !145, size: 32, offset: 7616)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !354, file: !159, line: 56, baseType: !375, size: 64, offset: 7680)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !305, file: !296, line: 870, baseType: !353, size: 7744, offset: 16320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !305, file: !296, line: 871, baseType: !353, size: 7744, offset: 24064)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !305, file: !296, line: 873, baseType: !145, size: 32, offset: 31808)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !305, file: !296, line: 884, baseType: !145, size: 32, offset: 31840)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !305, file: !296, line: 885, baseType: !145, size: 32, offset: 31872)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !305, file: !296, line: 886, baseType: !145, size: 32, offset: 31904)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !305, file: !296, line: 890, baseType: !145, size: 32, offset: 31936)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !305, file: !296, line: 893, baseType: !145, size: 32, offset: 31968)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !305, file: !296, line: 894, baseType: !145, size: 32, offset: 32000)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !305, file: !296, line: 895, baseType: !145, size: 32, offset: 32032)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !305, file: !296, line: 897, baseType: !145, size: 32, offset: 32064)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !305, file: !296, line: 899, baseType: !145, size: 32, offset: 32096)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !301, file: !296, line: 569, baseType: !389, size: 64, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !391, line: 138, baseType: !392)
!391 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 94, size: 17728, elements: !393)
!393 = !{!394, !395, !396, !397, !398, !399, !400, !404, !408, !412, !414, !415, !416, !417, !418, !422, !423, !424, !425, !426, !427, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !392, file: !391, line: 96, baseType: !145, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !392, file: !391, line: 97, baseType: !138, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !392, file: !391, line: 98, baseType: !138, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !392, file: !391, line: 99, baseType: !145, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !392, file: !391, line: 100, baseType: !145, size: 32, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !392, file: !391, line: 102, baseType: !145, size: 32, offset: 160)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !392, file: !391, line: 103, baseType: !401, size: 384, offset: 192)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 384, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 12)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !392, file: !391, line: 104, baseType: !405, size: 3072, offset: 576)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 3072, elements: !406)
!406 = !{!87, !407}
!407 = !DISubrange(count: 16)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !392, file: !391, line: 105, baseType: !409, size: 12288, offset: 3648)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 12288, elements: !410)
!410 = !{!87, !411}
!411 = !DISubrange(count: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !392, file: !391, line: 106, baseType: !413, size: 192, offset: 15936)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 192, elements: !86)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !392, file: !391, line: 107, baseType: !413, size: 192, offset: 16128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !392, file: !391, line: 110, baseType: !145, size: 32, offset: 16320)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !392, file: !391, line: 111, baseType: !138, size: 32, offset: 16352)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !392, file: !391, line: 112, baseType: !138, size: 32, offset: 16384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !392, file: !391, line: 114, baseType: !419, size: 256, offset: 16416)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 256, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 8)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !392, file: !391, line: 116, baseType: !419, size: 256, offset: 16672)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !392, file: !391, line: 117, baseType: !419, size: 256, offset: 16928)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !392, file: !391, line: 119, baseType: !145, size: 32, offset: 17184)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !392, file: !391, line: 120, baseType: !138, size: 32, offset: 17216)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !392, file: !391, line: 122, baseType: !138, size: 32, offset: 17248)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !392, file: !391, line: 123, baseType: !428, size: 64, offset: 17280)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !430, line: 21, baseType: !431)
!430 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!431 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !392, file: !391, line: 125, baseType: !145, size: 32, offset: 17344)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !392, file: !391, line: 126, baseType: !145, size: 32, offset: 17376)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !392, file: !391, line: 127, baseType: !145, size: 32, offset: 17408)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !392, file: !391, line: 128, baseType: !138, size: 32, offset: 17440)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !392, file: !391, line: 129, baseType: !145, size: 32, offset: 17472)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !392, file: !391, line: 130, baseType: !145, size: 32, offset: 17504)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !392, file: !391, line: 131, baseType: !145, size: 32, offset: 17536)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !392, file: !391, line: 133, baseType: !145, size: 32, offset: 17568)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !392, file: !391, line: 135, baseType: !145, size: 32, offset: 17600)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !392, file: !391, line: 136, baseType: !145, size: 32, offset: 17632)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !392, file: !391, line: 137, baseType: !145, size: 32, offset: 17664)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !301, file: !296, line: 570, baseType: !444, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !391, line: 197, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 142, size: 33024, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !543, !544}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !446, file: !391, line: 144, baseType: !145, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !446, file: !391, line: 146, baseType: !138, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !446, file: !391, line: 147, baseType: !145, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !446, file: !391, line: 148, baseType: !145, size: 32, offset: 96)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !446, file: !391, line: 149, baseType: !145, size: 32, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !446, file: !391, line: 150, baseType: !145, size: 32, offset: 160)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !446, file: !391, line: 152, baseType: !145, size: 32, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !446, file: !391, line: 154, baseType: !138, size: 32, offset: 224)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !446, file: !391, line: 155, baseType: !138, size: 32, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !446, file: !391, line: 156, baseType: !138, size: 32, offset: 288)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !446, file: !391, line: 158, baseType: !145, size: 32, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !446, file: !391, line: 159, baseType: !401, size: 384, offset: 352)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !446, file: !391, line: 160, baseType: !405, size: 3072, offset: 736)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !446, file: !391, line: 161, baseType: !409, size: 12288, offset: 3808)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !446, file: !391, line: 162, baseType: !413, size: 192, offset: 16096)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !446, file: !391, line: 163, baseType: !413, size: 192, offset: 16288)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !446, file: !391, line: 165, baseType: !138, size: 32, offset: 16480)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !446, file: !391, line: 166, baseType: !138, size: 32, offset: 16512)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !446, file: !391, line: 167, baseType: !138, size: 32, offset: 16544)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !446, file: !391, line: 168, baseType: !138, size: 32, offset: 16576)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !446, file: !391, line: 170, baseType: !138, size: 32, offset: 16608)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !446, file: !391, line: 172, baseType: !145, size: 32, offset: 16640)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !446, file: !391, line: 173, baseType: !145, size: 32, offset: 16672)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !446, file: !391, line: 174, baseType: !145, size: 32, offset: 16704)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !446, file: !391, line: 175, baseType: !138, size: 32, offset: 16736)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !446, file: !391, line: 177, baseType: !474, size: 8192, offset: 16768)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 8192, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !446, file: !391, line: 178, baseType: !138, size: 32, offset: 24960)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !446, file: !391, line: 179, baseType: !145, size: 32, offset: 24992)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !446, file: !391, line: 180, baseType: !138, size: 32, offset: 25024)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !446, file: !391, line: 181, baseType: !138, size: 32, offset: 25056)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !446, file: !391, line: 182, baseType: !145, size: 32, offset: 25088)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !446, file: !391, line: 184, baseType: !145, size: 32, offset: 25120)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !446, file: !391, line: 185, baseType: !145, size: 32, offset: 25152)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !446, file: !391, line: 186, baseType: !145, size: 32, offset: 25184)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !446, file: !391, line: 187, baseType: !138, size: 32, offset: 25216)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !446, file: !391, line: 188, baseType: !138, size: 32, offset: 25248)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !446, file: !391, line: 189, baseType: !138, size: 32, offset: 25280)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !446, file: !391, line: 190, baseType: !138, size: 32, offset: 25312)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !446, file: !391, line: 191, baseType: !145, size: 32, offset: 25344)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !446, file: !391, line: 192, baseType: !491, size: 7584, offset: 25376)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !391, line: 90, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 53, size: 7584, elements: !493)
!493 = !{!494, !495, !496, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !492, file: !391, line: 55, baseType: !145, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !492, file: !391, line: 56, baseType: !138, size: 32, offset: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !492, file: !391, line: 57, baseType: !497, size: 16, offset: 64)
!497 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !492, file: !391, line: 58, baseType: !497, size: 16, offset: 80)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !492, file: !391, line: 59, baseType: !145, size: 32, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !492, file: !391, line: 60, baseType: !145, size: 32, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !492, file: !391, line: 61, baseType: !145, size: 32, offset: 160)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !492, file: !391, line: 62, baseType: !138, size: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !492, file: !391, line: 63, baseType: !145, size: 32, offset: 224)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !492, file: !391, line: 64, baseType: !145, size: 32, offset: 256)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !492, file: !391, line: 65, baseType: !138, size: 32, offset: 288)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !492, file: !391, line: 66, baseType: !138, size: 32, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !492, file: !391, line: 67, baseType: !138, size: 32, offset: 352)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !492, file: !391, line: 68, baseType: !145, size: 32, offset: 384)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !492, file: !391, line: 69, baseType: !138, size: 32, offset: 416)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !492, file: !391, line: 70, baseType: !138, size: 32, offset: 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !492, file: !391, line: 71, baseType: !145, size: 32, offset: 480)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !492, file: !391, line: 72, baseType: !138, size: 32, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !492, file: !391, line: 73, baseType: !138, size: 32, offset: 544)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !492, file: !391, line: 74, baseType: !145, size: 32, offset: 576)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !492, file: !391, line: 75, baseType: !145, size: 32, offset: 608)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !492, file: !391, line: 76, baseType: !517, size: 3296, offset: 640)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !391, line: 50, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 38, size: 3296, elements: !519)
!519 = !{!520, !521, !522, !523, !525, !526, !527, !528, !529, !530}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !518, file: !391, line: 40, baseType: !138, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !518, file: !391, line: 41, baseType: !138, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !518, file: !391, line: 42, baseType: !138, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !518, file: !391, line: 43, baseType: !524, size: 1024, offset: 96)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 1024, elements: !110)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !518, file: !391, line: 44, baseType: !524, size: 1024, offset: 1120)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !518, file: !391, line: 45, baseType: !524, size: 1024, offset: 2144)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !518, file: !391, line: 46, baseType: !138, size: 32, offset: 3168)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !518, file: !391, line: 47, baseType: !138, size: 32, offset: 3200)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !518, file: !391, line: 48, baseType: !138, size: 32, offset: 3232)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !518, file: !391, line: 49, baseType: !138, size: 32, offset: 3264)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !492, file: !391, line: 77, baseType: !145, size: 32, offset: 3936)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !492, file: !391, line: 78, baseType: !517, size: 3296, offset: 3968)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !492, file: !391, line: 80, baseType: !145, size: 32, offset: 7264)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !492, file: !391, line: 81, baseType: !145, size: 32, offset: 7296)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !492, file: !391, line: 82, baseType: !145, size: 32, offset: 7328)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !492, file: !391, line: 83, baseType: !145, size: 32, offset: 7360)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !492, file: !391, line: 84, baseType: !138, size: 32, offset: 7392)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !492, file: !391, line: 85, baseType: !138, size: 32, offset: 7424)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !492, file: !391, line: 86, baseType: !138, size: 32, offset: 7456)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !492, file: !391, line: 87, baseType: !138, size: 32, offset: 7488)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !492, file: !391, line: 88, baseType: !138, size: 32, offset: 7520)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !492, file: !391, line: 89, baseType: !138, size: 32, offset: 7552)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !446, file: !391, line: 193, baseType: !138, size: 32, offset: 32960)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !446, file: !391, line: 195, baseType: !145, size: 32, offset: 32992)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !301, file: !296, line: 571, baseType: !546, size: 1056768, offset: 192)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 1056768, elements: !110)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !301, file: !296, line: 572, baseType: !548, size: 4538368, offset: 1056960)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 4538368, elements: !475)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !301, file: !296, line: 575, baseType: !550, size: 64, offset: 5595328)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !391, line: 256, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 228, size: 37312, elements: !553)
!553 = !{!554, !555, !556, !557, !558, !559, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !574, !575, !576, !577}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !552, file: !391, line: 230, baseType: !445, size: 33024)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !552, file: !391, line: 232, baseType: !138, size: 32, offset: 33024)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !552, file: !391, line: 233, baseType: !145, size: 32, offset: 33056)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !552, file: !391, line: 234, baseType: !375, size: 64, offset: 33088)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !552, file: !391, line: 235, baseType: !375, size: 64, offset: 33152)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !552, file: !391, line: 236, baseType: !560, size: 64, offset: 33216)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !552, file: !391, line: 237, baseType: !375, size: 64, offset: 33280)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !552, file: !391, line: 238, baseType: !560, size: 64, offset: 33344)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !552, file: !391, line: 240, baseType: !375, size: 64, offset: 33408)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !552, file: !391, line: 241, baseType: !560, size: 64, offset: 33472)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !552, file: !391, line: 242, baseType: !375, size: 64, offset: 33536)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !552, file: !391, line: 243, baseType: !560, size: 64, offset: 33600)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !552, file: !391, line: 245, baseType: !145, size: 32, offset: 33664)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !552, file: !391, line: 246, baseType: !375, size: 64, offset: 33728)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !552, file: !391, line: 247, baseType: !375, size: 64, offset: 33792)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !552, file: !391, line: 248, baseType: !560, size: 64, offset: 33856)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !552, file: !391, line: 249, baseType: !560, size: 64, offset: 33920)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !552, file: !391, line: 250, baseType: !573, size: 64, offset: 33984)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !552, file: !391, line: 251, baseType: !560, size: 64, offset: 34048)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !552, file: !391, line: 253, baseType: !138, size: 32, offset: 34112)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !552, file: !391, line: 254, baseType: !145, size: 32, offset: 34144)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !552, file: !391, line: 255, baseType: !578, size: 3136, offset: 34176)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !391, line: 226, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !391, line: 200, size: 3136, elements: !580)
!580 = !{!581, !582, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !600, !601, !603, !604, !605, !606}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !579, file: !391, line: 202, baseType: !145, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !579, file: !391, line: 203, baseType: !583, size: 64, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !579, file: !391, line: 204, baseType: !375, size: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !579, file: !391, line: 205, baseType: !560, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !579, file: !391, line: 206, baseType: !583, size: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !579, file: !391, line: 207, baseType: !375, size: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !579, file: !391, line: 208, baseType: !375, size: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !579, file: !391, line: 209, baseType: !583, size: 64, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !579, file: !391, line: 210, baseType: !583, size: 64, offset: 512)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !579, file: !391, line: 211, baseType: !583, size: 64, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !579, file: !391, line: 212, baseType: !583, size: 64, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !579, file: !391, line: 213, baseType: !583, size: 64, offset: 704)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !579, file: !391, line: 216, baseType: !584, size: 8, offset: 768)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !579, file: !391, line: 217, baseType: !584, size: 8, offset: 776)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !579, file: !391, line: 218, baseType: !584, size: 8, offset: 784)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !579, file: !391, line: 219, baseType: !599, size: 1024, offset: 800)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 1024, elements: !110)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !579, file: !391, line: 220, baseType: !599, size: 1024, offset: 1824)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !579, file: !391, line: 221, baseType: !602, size: 256, offset: 2848)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 256, elements: !110)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !579, file: !391, line: 222, baseType: !584, size: 8, offset: 3104)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !579, file: !391, line: 223, baseType: !584, size: 8, offset: 3112)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !579, file: !391, line: 224, baseType: !584, size: 8, offset: 3120)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !579, file: !391, line: 225, baseType: !584, size: 8, offset: 3128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !301, file: !296, line: 577, baseType: !608, size: 1193984, offset: 5595392)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 1193984, elements: !110)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !301, file: !296, line: 578, baseType: !145, size: 32, offset: 6789376)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !301, file: !296, line: 579, baseType: !145, size: 32, offset: 6789408)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !301, file: !296, line: 580, baseType: !145, size: 32, offset: 6789440)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !301, file: !296, line: 581, baseType: !145, size: 32, offset: 6789472)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !301, file: !296, line: 584, baseType: !614, size: 64, offset: 6789504)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !296, line: 584, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !301, file: !296, line: 586, baseType: !617, size: 64, offset: 6789568)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !296, line: 902, size: 416, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625, !629, !630, !631, !632, !633, !634, !635}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !618, file: !296, line: 904, baseType: !138, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !618, file: !296, line: 905, baseType: !138, size: 32, offset: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !618, file: !296, line: 906, baseType: !145, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !618, file: !296, line: 907, baseType: !138, size: 32, offset: 96)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !618, file: !296, line: 908, baseType: !145, size: 32, offset: 128)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !618, file: !296, line: 909, baseType: !626, size: 64, offset: 160)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 64, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 2)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !618, file: !296, line: 910, baseType: !429, size: 8, offset: 224)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !618, file: !296, line: 911, baseType: !429, size: 8, offset: 232)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !618, file: !296, line: 912, baseType: !145, size: 32, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !618, file: !296, line: 913, baseType: !145, size: 32, offset: 288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !618, file: !296, line: 915, baseType: !145, size: 32, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !618, file: !296, line: 916, baseType: !145, size: 32, offset: 352)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !618, file: !296, line: 917, baseType: !145, size: 32, offset: 384)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !301, file: !296, line: 587, baseType: !637, size: 64, offset: 6789632)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !296, line: 839, size: 512, elements: !639)
!639 = !{!640, !641, !644, !645, !646, !647}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !638, file: !296, line: 841, baseType: !145, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !638, file: !296, line: 842, baseType: !642, size: 96, offset: 32)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 96, elements: !331)
!643 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !638, file: !296, line: 843, baseType: !642, size: 96, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !638, file: !296, line: 844, baseType: !642, size: 96, offset: 224)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !638, file: !296, line: 845, baseType: !642, size: 96, offset: 320)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !638, file: !296, line: 846, baseType: !642, size: 96, offset: 416)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !301, file: !296, line: 588, baseType: !145, size: 32, offset: 6789696)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !301, file: !296, line: 591, baseType: !138, size: 32, offset: 6789728)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !301, file: !296, line: 592, baseType: !145, size: 32, offset: 6789760)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !301, file: !296, line: 593, baseType: !145, size: 32, offset: 6789792)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !301, file: !296, line: 594, baseType: !145, size: 32, offset: 6789824)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !301, file: !296, line: 595, baseType: !293, size: 64, offset: 6789888)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !301, file: !296, line: 596, baseType: !583, size: 64, offset: 6789952)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block_JV", scope: !301, file: !296, line: 597, baseType: !656, size: 192, offset: 6790016)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 192, elements: !331)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !301, file: !296, line: 601, baseType: !145, size: 32, offset: 6790208)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !301, file: !296, line: 602, baseType: !145, size: 32, offset: 6790240)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !301, file: !296, line: 603, baseType: !145, size: 32, offset: 6790272)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !301, file: !296, line: 604, baseType: !145, size: 32, offset: 6790304)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !301, file: !296, line: 605, baseType: !145, size: 32, offset: 6790336)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !301, file: !296, line: 607, baseType: !663, size: 64, offset: 6790400)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode_JV", scope: !301, file: !296, line: 608, baseType: !665, size: 192, offset: 6790464)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 192, elements: !331)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !301, file: !296, line: 609, baseType: !667, size: 64, offset: 6790656)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "siblock", scope: !301, file: !296, line: 610, baseType: !560, size: 64, offset: 6790720)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "siblock_JV", scope: !301, file: !296, line: 611, baseType: !671, size: 192, offset: 6790784)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 192, elements: !331)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "newframe", scope: !301, file: !296, line: 613, baseType: !145, size: 32, offset: 6790976)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !301, file: !296, line: 614, baseType: !145, size: 32, offset: 6791008)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "pNextSlice", scope: !301, file: !296, line: 617, baseType: !294, size: 64, offset: 6791040)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !301, file: !296, line: 618, baseType: !676, size: 64, offset: 6791104)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !296, line: 273, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !296, line: 197, size: 3840, elements: !679)
!679 = !{!680, !682, !683, !684, !685, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !714, !715, !716, !717, !718, !722, !723, !732, !733, !734, !735, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !761, !762, !898, !912, !956}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !678, file: !296, line: 199, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !678, file: !296, line: 200, baseType: !300, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !678, file: !296, line: 201, baseType: !304, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrX", scope: !678, file: !296, line: 202, baseType: !145, size: 32, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !678, file: !296, line: 203, baseType: !686, size: 32, offset: 224)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockPos", file: !296, line: 112, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !296, line: 108, size: 32, elements: !688)
!688 = !{!689, !690}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !687, file: !296, line: 110, baseType: !292, size: 16)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !687, file: !296, line: 111, baseType: !292, size: 16, offset: 16)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !678, file: !296, line: 204, baseType: !145, size: 32, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !678, file: !296, line: 205, baseType: !145, size: 32, offset: 288)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "block_y_aff", scope: !678, file: !296, line: 206, baseType: !145, size: 32, offset: 320)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !678, file: !296, line: 207, baseType: !145, size: 32, offset: 352)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !678, file: !296, line: 208, baseType: !145, size: 32, offset: 384)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !678, file: !296, line: 209, baseType: !145, size: 32, offset: 416)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !678, file: !296, line: 210, baseType: !145, size: 32, offset: 448)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !678, file: !296, line: 212, baseType: !145, size: 32, offset: 480)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !678, file: !296, line: 213, baseType: !145, size: 32, offset: 512)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !678, file: !296, line: 215, baseType: !145, size: 32, offset: 544)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "qpc", scope: !678, file: !296, line: 216, baseType: !626, size: 64, offset: 576)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "qp_scaled", scope: !678, file: !296, line: 217, baseType: !330, size: 96, offset: 640)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "is_lossless", scope: !678, file: !296, line: 218, baseType: !145, size: 32, offset: 736)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !678, file: !296, line: 219, baseType: !145, size: 32, offset: 768)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !678, file: !296, line: 220, baseType: !145, size: 32, offset: 800)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !678, file: !296, line: 221, baseType: !145, size: 32, offset: 832)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !678, file: !296, line: 223, baseType: !292, size: 16, offset: 864)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !678, file: !296, line: 224, baseType: !584, size: 8, offset: 880)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "dpl_flag", scope: !678, file: !296, line: 225, baseType: !584, size: 8, offset: 888)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "delta_quant", scope: !678, file: !296, line: 226, baseType: !292, size: 16, offset: 896)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "list_offset", scope: !678, file: !296, line: 227, baseType: !292, size: 16, offset: 912)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "mb_up", scope: !678, file: !296, line: 229, baseType: !713, size: 64, offset: 960)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "mb_left", scope: !678, file: !296, line: 230, baseType: !713, size: 64, offset: 1024)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mbup", scope: !678, file: !296, line: 232, baseType: !713, size: 64, offset: 1088)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "mbleft", scope: !678, file: !296, line: 233, baseType: !713, size: 64, offset: 1152)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !678, file: !296, line: 236, baseType: !292, size: 16, offset: 1216)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !678, file: !296, line: 237, baseType: !719, size: 1024, offset: 1232)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 1024, elements: !720)
!720 = !{!628, !721, !721, !628}
!721 = !DISubrange(count: 4)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !678, file: !296, line: 239, baseType: !145, size: 32, offset: 2272)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !678, file: !296, line: 240, baseType: !724, size: 192, offset: 2304)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 192, elements: !331)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !726, line: 103, baseType: !727)
!726 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !728, line: 27, baseType: !729)
!728 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !730, line: 44, baseType: !731)
!730 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!731 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !678, file: !296, line: 241, baseType: !724, size: 192, offset: 2496)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits_8x8", scope: !678, file: !296, line: 242, baseType: !724, size: 192, offset: 2688)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "i16mode", scope: !678, file: !296, line: 244, baseType: !145, size: 32, offset: 2880)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !678, file: !296, line: 245, baseType: !736, size: 32, offset: 2912)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 32, elements: !737)
!737 = !{!721}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !678, file: !296, line: 246, baseType: !736, size: 32, offset: 2944)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "ipmode_DPCM", scope: !678, file: !296, line: 247, baseType: !584, size: 8, offset: 2976)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !678, file: !296, line: 248, baseType: !584, size: 8, offset: 2984)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !678, file: !296, line: 249, baseType: !584, size: 8, offset: 2992)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "DFDisableIdc", scope: !678, file: !296, line: 250, baseType: !292, size: 16, offset: 3008)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "DFAlphaC0Offset", scope: !678, file: !296, line: 251, baseType: !292, size: 16, offset: 3024)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "DFBetaOffset", scope: !678, file: !296, line: 252, baseType: !292, size: 16, offset: 3040)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !678, file: !296, line: 254, baseType: !145, size: 32, offset: 3072)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !678, file: !296, line: 256, baseType: !145, size: 32, offset: 3104)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !678, file: !296, line: 256, baseType: !145, size: 32, offset: 3136)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !678, file: !296, line: 256, baseType: !145, size: 32, offset: 3168)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !678, file: !296, line: 256, baseType: !145, size: 32, offset: 3200)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !678, file: !296, line: 257, baseType: !145, size: 32, offset: 3232)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !678, file: !296, line: 257, baseType: !145, size: 32, offset: 3264)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !678, file: !296, line: 257, baseType: !145, size: 32, offset: 3296)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !678, file: !296, line: 257, baseType: !145, size: 32, offset: 3328)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !678, file: !296, line: 259, baseType: !145, size: 32, offset: 3360)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !678, file: !296, line: 260, baseType: !145, size: 32, offset: 3392)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_4x4", scope: !678, file: !296, line: 262, baseType: !757, size: 64, offset: 3456)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !713, !760, !145, !145}
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorPlane", file: !137, line: 32, baseType: !167)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_8x8", scope: !678, file: !296, line: 263, baseType: !757, size: 64, offset: 3520)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "GetMVPredictor", scope: !678, file: !296, line: 265, baseType: !763, size: 64, offset: 3584)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DISubroutineType(types: !765)
!765 = !{null, !713, !766, !776, !292, !782, !145, !145, !145, !145, !145}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !296, line: 85, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !296, line: 77, size: 128, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !768, file: !296, line: 79, baseType: !145, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !768, file: !296, line: 80, baseType: !145, size: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !768, file: !296, line: 81, baseType: !292, size: 16, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !768, file: !296, line: 82, baseType: !292, size: 16, offset: 80)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !768, file: !296, line: 83, baseType: !292, size: 16, offset: 96)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !768, file: !296, line: 84, baseType: !292, size: 16, offset: 112)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !296, line: 104, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !296, line: 100, size: 32, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !778, file: !296, line: 102, baseType: !292, size: 16)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !778, file: !296, line: 103, baseType: !292, size: 16, offset: 16)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !785, line: 36, size: 256, elements: !786)
!785 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!786 = !{!787, !895, !897}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !784, file: !785, line: 38, baseType: !788, size: 128)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 128, elements: !627)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !785, line: 46, size: 3328, elements: !791)
!791 = !{!792, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !830, !832, !833, !834, !836, !840, !842, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !892}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !790, file: !785, line: 48, baseType: !793, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !137, line: 140, baseType: !136)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !790, file: !785, line: 50, baseType: !145, size: 32, offset: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !790, file: !785, line: 51, baseType: !145, size: 32, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !790, file: !785, line: 52, baseType: !145, size: 32, offset: 96)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !790, file: !785, line: 53, baseType: !145, size: 32, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !790, file: !785, line: 54, baseType: !138, size: 32, offset: 160)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !790, file: !785, line: 55, baseType: !138, size: 32, offset: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !790, file: !785, line: 57, baseType: !145, size: 32, offset: 224)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !790, file: !785, line: 58, baseType: !145, size: 32, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !790, file: !785, line: 59, baseType: !145, size: 32, offset: 288)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !790, file: !785, line: 61, baseType: !429, size: 8, offset: 320)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !790, file: !785, line: 62, baseType: !145, size: 32, offset: 352)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !790, file: !785, line: 63, baseType: !145, size: 32, offset: 384)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !790, file: !785, line: 64, baseType: !145, size: 32, offset: 416)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !790, file: !785, line: 65, baseType: !145, size: 32, offset: 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !790, file: !785, line: 67, baseType: !292, size: 16, offset: 480)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !790, file: !785, line: 69, baseType: !145, size: 32, offset: 512)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !790, file: !785, line: 69, baseType: !145, size: 32, offset: 544)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !790, file: !785, line: 69, baseType: !145, size: 32, offset: 576)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !790, file: !785, line: 69, baseType: !145, size: 32, offset: 608)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !790, file: !785, line: 70, baseType: !145, size: 32, offset: 640)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !790, file: !785, line: 70, baseType: !145, size: 32, offset: 672)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !790, file: !785, line: 70, baseType: !145, size: 32, offset: 704)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !790, file: !785, line: 70, baseType: !145, size: 32, offset: 736)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !790, file: !785, line: 71, baseType: !145, size: 32, offset: 768)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !790, file: !785, line: 72, baseType: !145, size: 32, offset: 800)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !790, file: !785, line: 73, baseType: !138, size: 32, offset: 832)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !790, file: !785, line: 74, baseType: !138, size: 32, offset: 864)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !790, file: !785, line: 75, baseType: !145, size: 32, offset: 896)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !790, file: !785, line: 75, baseType: !145, size: 32, offset: 928)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !790, file: !785, line: 76, baseType: !145, size: 32, offset: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !790, file: !785, line: 76, baseType: !145, size: 32, offset: 992)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !790, file: !785, line: 79, baseType: !826, size: 64, offset: 1024)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !430, line: 41, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !430, line: 23, baseType: !497)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !790, file: !785, line: 80, baseType: !831, size: 64, offset: 1088)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !790, file: !785, line: 81, baseType: !831, size: 64, offset: 1152)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !790, file: !785, line: 84, baseType: !782, size: 64, offset: 1216)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !790, file: !785, line: 85, baseType: !835, size: 192, offset: 1280)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !782, size: 192, elements: !331)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !790, file: !785, line: 87, baseType: !837, size: 64, offset: 1472)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !785, line: 29, size: 64, elements: !838)
!838 = !{!839}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !837, file: !785, line: 31, baseType: !428, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !790, file: !785, line: 88, baseType: !841, size: 192, offset: 1536)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !837, size: 192, elements: !331)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !790, file: !785, line: 90, baseType: !843, size: 64, offset: 1728)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !790, file: !785, line: 92, baseType: !789, size: 64, offset: 1792)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !790, file: !785, line: 93, baseType: !789, size: 64, offset: 1856)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !790, file: !785, line: 94, baseType: !789, size: 64, offset: 1920)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !790, file: !785, line: 96, baseType: !145, size: 32, offset: 1984)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !790, file: !785, line: 97, baseType: !145, size: 32, offset: 2016)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !790, file: !785, line: 98, baseType: !145, size: 32, offset: 2048)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !790, file: !785, line: 99, baseType: !145, size: 32, offset: 2080)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !790, file: !785, line: 100, baseType: !145, size: 32, offset: 2112)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !790, file: !785, line: 102, baseType: !145, size: 32, offset: 2144)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !790, file: !785, line: 103, baseType: !145, size: 32, offset: 2176)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !790, file: !785, line: 104, baseType: !145, size: 32, offset: 2208)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !790, file: !785, line: 105, baseType: !145, size: 32, offset: 2240)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !790, file: !785, line: 106, baseType: !145, size: 32, offset: 2272)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !790, file: !785, line: 107, baseType: !145, size: 32, offset: 2304)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !790, file: !785, line: 108, baseType: !145, size: 32, offset: 2336)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !790, file: !785, line: 109, baseType: !145, size: 32, offset: 2368)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !790, file: !785, line: 110, baseType: !626, size: 64, offset: 2400)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !790, file: !785, line: 111, baseType: !145, size: 32, offset: 2464)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !790, file: !785, line: 112, baseType: !864, size: 64, offset: 2496)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !296, line: 194, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !296, line: 186, size: 256, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !866, file: !296, line: 188, baseType: !145, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !866, file: !296, line: 189, baseType: !145, size: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !866, file: !296, line: 190, baseType: !145, size: 32, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !866, file: !296, line: 191, baseType: !145, size: 32, offset: 96)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !866, file: !296, line: 192, baseType: !145, size: 32, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !866, file: !296, line: 193, baseType: !874, size: 64, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !790, file: !785, line: 115, baseType: !145, size: 32, offset: 2560)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !790, file: !785, line: 118, baseType: !145, size: 32, offset: 2592)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !790, file: !785, line: 119, baseType: !145, size: 32, offset: 2624)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !790, file: !785, line: 120, baseType: !145, size: 32, offset: 2656)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !790, file: !785, line: 121, baseType: !827, size: 64, offset: 2688)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !790, file: !785, line: 124, baseType: !145, size: 32, offset: 2752)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !790, file: !785, line: 125, baseType: !145, size: 32, offset: 2784)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !790, file: !785, line: 126, baseType: !145, size: 32, offset: 2816)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !790, file: !785, line: 128, baseType: !145, size: 32, offset: 2848)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !790, file: !785, line: 129, baseType: !145, size: 32, offset: 2880)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !790, file: !785, line: 130, baseType: !145, size: 32, offset: 2912)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !790, file: !785, line: 131, baseType: !145, size: 32, offset: 2944)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !790, file: !785, line: 132, baseType: !826, size: 64, offset: 3008)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !790, file: !785, line: 133, baseType: !145, size: 32, offset: 3072)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !790, file: !785, line: 134, baseType: !145, size: 32, offset: 3104)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !790, file: !785, line: 136, baseType: !891, size: 16, offset: 3136)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 16, elements: !627)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !790, file: !785, line: 137, baseType: !893, size: 128, offset: 3200)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 128, elements: !627)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !784, file: !785, line: 39, baseType: !896, size: 64, offset: 128)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 64, elements: !627)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !784, file: !785, line: 40, baseType: !891, size: 16, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "read_and_store_CBP_block_bit", scope: !678, file: !296, line: 268, baseType: !899, size: 64, offset: 3648)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = !DISubroutineType(types: !901)
!901 = !{!145, !713, !902, !145}
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironmentPtr", file: !296, line: 97, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !296, line: 95, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !296, line: 88, size: 256, elements: !906)
!906 = !{!907, !908, !909, !910, !911}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !905, file: !296, line: 90, baseType: !138, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !905, file: !296, line: 91, baseType: !138, size: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !905, file: !296, line: 92, baseType: !145, size: 32, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !905, file: !296, line: 93, baseType: !428, size: 64, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !905, file: !296, line: 94, baseType: !375, size: 64, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "readRefPictureIdx", scope: !678, file: !296, line: 269, baseType: !913, size: 64, offset: 3712)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!584, !713, !916, !935, !584, !145}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !296, line: 276, size: 384, elements: !918)
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926, !927, !931}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !917, file: !296, line: 278, baseType: !145, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !917, file: !296, line: 279, baseType: !145, size: 32, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !917, file: !296, line: 280, baseType: !145, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !917, file: !296, line: 281, baseType: !145, size: 32, offset: 96)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !917, file: !296, line: 282, baseType: !145, size: 32, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !917, file: !296, line: 283, baseType: !138, size: 32, offset: 160)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !917, file: !296, line: 284, baseType: !145, size: 32, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !917, file: !296, line: 285, baseType: !145, size: 32, offset: 224)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !917, file: !296, line: 293, baseType: !928, size: 64, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{null, !145, !145, !375, !375}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !917, file: !296, line: 295, baseType: !932, size: 64, offset: 320)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !676, !916, !902}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !296, line: 314, size: 384, elements: !937)
!937 = !{!938, !949, !950}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !936, file: !296, line: 317, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !296, line: 47, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream", file: !296, line: 300, size: 256, elements: !942)
!942 = !{!943, !944, !945, !946, !947, !948}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "read_len", scope: !941, file: !296, line: 303, baseType: !145, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !941, file: !296, line: 304, baseType: !145, size: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bitoffset", scope: !941, file: !296, line: 306, baseType: !145, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_length", scope: !941, file: !296, line: 307, baseType: !145, size: 32, offset: 96)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !941, file: !296, line: 309, baseType: !428, size: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !941, file: !296, line: 310, baseType: !145, size: 32, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "de_cabac", scope: !936, file: !296, line: 318, baseType: !904, size: 256, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "readSyntaxElement", scope: !936, file: !296, line: 320, baseType: !951, size: 64, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!145, !676, !954, !935}
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !296, line: 296, baseType: !917)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "mixedModeEdgeFlag", scope: !678, file: !296, line: 272, baseType: !429, size: 8, offset: 3776)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data_JV", scope: !301, file: !296, line: 619, baseType: !958, size: 192, offset: 6791168)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 192, elements: !331)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaArrayType", scope: !301, file: !296, line: 621, baseType: !145, size: 32, offset: 6791360)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_head", scope: !301, file: !296, line: 626, baseType: !961, size: 64, offset: 6791424)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !963, line: 136, size: 192, elements: !964)
!963 = !DIFile(filename: "ldecod_src/inc/erc_api.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "9f38a583d5066807e951e2b61474101e")
!964 = !{!965, !968, !969}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !962, file: !963, line: 137, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !785, line: 138, baseType: !790)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "missingpocs", scope: !962, file: !963, line: 138, baseType: !145, size: 32, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !962, file: !963, line: 139, baseType: !961, size: 64, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_end", scope: !301, file: !296, line: 627, baseType: !961, size: 64, offset: 6791488)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !301, file: !296, line: 629, baseType: !138, size: 32, offset: 6791552)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "non_conforming_stream", scope: !301, file: !296, line: 630, baseType: !145, size: 32, offset: 6791584)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntMsb", scope: !301, file: !296, line: 634, baseType: !145, size: 32, offset: 6791616)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntLsb", scope: !301, file: !296, line: 635, baseType: !138, size: 32, offset: 6791648)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedPicOrderCnt", scope: !301, file: !296, line: 638, baseType: !145, size: 32, offset: 6791680)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntCycleCnt", scope: !301, file: !296, line: 638, baseType: !145, size: 32, offset: 6791712)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumInPicOrderCntCycle", scope: !301, file: !296, line: 638, baseType: !145, size: 32, offset: 6791744)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNum", scope: !301, file: !296, line: 639, baseType: !138, size: 32, offset: 6791776)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumOffset", scope: !301, file: !296, line: 639, baseType: !138, size: 32, offset: 6791808)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDeltaPerPicOrderCntCycle", scope: !301, file: !296, line: 640, baseType: !145, size: 32, offset: 6791840)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !301, file: !296, line: 641, baseType: !145, size: 32, offset: 6791872)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNumOffset", scope: !301, file: !296, line: 642, baseType: !145, size: 32, offset: 6791904)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFrameNum", scope: !301, file: !296, line: 645, baseType: !145, size: 32, offset: 6791936)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !301, file: !296, line: 647, baseType: !138, size: 32, offset: 6791968)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !301, file: !296, line: 648, baseType: !138, size: 32, offset: 6792000)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !301, file: !296, line: 649, baseType: !138, size: 32, offset: 6792032)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !301, file: !296, line: 650, baseType: !138, size: 32, offset: 6792064)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !301, file: !296, line: 651, baseType: !138, size: 32, offset: 6792096)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !301, file: !296, line: 652, baseType: !138, size: 32, offset: 6792128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "oldFrameSizeInMbs", scope: !301, file: !296, line: 653, baseType: !138, size: 32, offset: 6792160)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !301, file: !296, line: 655, baseType: !145, size: 32, offset: 6792192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !301, file: !296, line: 657, baseType: !145, size: 32, offset: 6792224)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !301, file: !296, line: 658, baseType: !145, size: 32, offset: 6792256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_bitsize_on_disk", scope: !301, file: !296, line: 661, baseType: !145, size: 32, offset: 6792288)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !301, file: !296, line: 662, baseType: !292, size: 16, offset: 6792320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !301, file: !296, line: 663, baseType: !292, size: 16, offset: 6792336)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_scale", scope: !301, file: !296, line: 664, baseType: !626, size: 64, offset: 6792352)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !301, file: !296, line: 665, baseType: !145, size: 32, offset: 6792416)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !301, file: !296, line: 666, baseType: !145, size: 32, offset: 6792448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value_comp", scope: !301, file: !296, line: 667, baseType: !1001, size: 96, offset: 6792480)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 96, elements: !331)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "max_pel_value_comp", scope: !301, file: !296, line: 668, baseType: !330, size: 96, offset: 6792576)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !301, file: !296, line: 670, baseType: !145, size: 32, offset: 6792672)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !301, file: !296, line: 671, baseType: !145, size: 32, offset: 6792704)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !301, file: !296, line: 672, baseType: !145, size: 32, offset: 6792736)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !301, file: !296, line: 673, baseType: !145, size: 32, offset: 6792768)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "num_uv_blocks", scope: !301, file: !296, line: 674, baseType: !145, size: 32, offset: 6792800)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !301, file: !296, line: 675, baseType: !145, size: 32, offset: 6792832)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !301, file: !296, line: 676, baseType: !145, size: 32, offset: 6792864)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !301, file: !296, line: 677, baseType: !145, size: 32, offset: 6792896)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x_blk", scope: !301, file: !296, line: 678, baseType: !145, size: 32, offset: 6792928)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y_blk", scope: !301, file: !296, line: 679, baseType: !145, size: 32, offset: 6792960)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !301, file: !296, line: 680, baseType: !1014, size: 192, offset: 6792992)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 192, elements: !1015)
!1015 = !{!332, !628}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_blk", scope: !301, file: !296, line: 681, baseType: !1014, size: 192, offset: 6793184)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_shift", scope: !301, file: !296, line: 682, baseType: !1014, size: 192, offset: 6793376)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_x", scope: !301, file: !296, line: 683, baseType: !145, size: 32, offset: 6793568)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_y", scope: !301, file: !296, line: 684, baseType: !145, size: 32, offset: 6793600)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_x", scope: !301, file: !296, line: 685, baseType: !145, size: 32, offset: 6793632)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_y", scope: !301, file: !296, line: 686, baseType: !145, size: 32, offset: 6793664)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "total_scale", scope: !301, file: !296, line: 687, baseType: !145, size: 32, offset: 6793696)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "max_vmv_r", scope: !301, file: !296, line: 689, baseType: !145, size: 32, offset: 6793728)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "idr_psnr_number", scope: !301, file: !296, line: 692, baseType: !145, size: 32, offset: 6793760)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "psnr_number", scope: !301, file: !296, line: 693, baseType: !145, size: 32, offset: 6793792)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "last_ref_pic_poc", scope: !301, file: !296, line: 700, baseType: !145, size: 32, offset: 6793824)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !301, file: !296, line: 701, baseType: !145, size: 32, offset: 6793856)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !301, file: !296, line: 702, baseType: !145, size: 32, offset: 6793888)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !301, file: !296, line: 703, baseType: !145, size: 32, offset: 6793920)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "earlier_missing_poc", scope: !301, file: !296, line: 704, baseType: !145, size: 32, offset: 6793952)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_conceal", scope: !301, file: !296, line: 705, baseType: !138, size: 32, offset: 6793984)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "IDR_concealment_flag", scope: !301, file: !296, line: 706, baseType: !145, size: 32, offset: 6794016)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_slice_type", scope: !301, file: !296, line: 707, baseType: !145, size: 32, offset: 6794048)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point", scope: !301, file: !296, line: 710, baseType: !145, size: 32, offset: 6794080)
