; ModuleID = 'ldecod_src/img_io.c'
source_filename = "ldecod_src/img_io.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.video_size = type { ptr, i32, i32 }

@.str.2 = private unnamed_addr constant [3 x i8] c"_.\00", align 1, !dbg !0
@.str.3 = private unnamed_addr constant [3 x i8] c"ip\00", align 1, !dbg !7
@VideoRes = internal unnamed_addr constant [12 x %struct.video_size] [%struct.video_size { ptr @.str.15, i32 176, i32 144 }, %struct.video_size { ptr @.str.16, i32 160, i32 128 }, %struct.video_size { ptr @.str.17, i32 320, i32 240 }, %struct.video_size { ptr @.str.18, i32 352, i32 240 }, %struct.video_size { ptr @.str.19, i32 352, i32 288 }, %struct.video_size { ptr @.str.20, i32 640, i32 480 }, %struct.video_size { ptr @.str.21, i32 720, i32 480 }, %struct.video_size { ptr @.str.22, i32 704, i32 576 }, %struct.video_size { ptr @.str.23, i32 720, i32 576 }, %struct.video_size { ptr @.str.24, i32 1280, i32 720 }, %struct.video_size { ptr @.str.25, i32 1920, i32 1080 }, %struct.video_size zeroinitializer], align 16, !dbg !9
@.str.6 = private unnamed_addr constant [5 x i8] c"%0*d\00", align 1, !dbg !51
@.str.7 = private unnamed_addr constant [4 x i8] c"%*d\00", align 1, !dbg !56
@.str.8 = private unnamed_addr constant [36 x i8] c"OpenFrameFile: cannot open file %s\0A\00", align 1, !dbg !61
@errortext = external global [300 x i8], align 16

!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!39 = !{!40, !45, !0, !7, !47, !49, !51, !56, !61, !66, !71, !76, !78, !80, !82, !84, !86, !91, !93, !95, !97, !99, !101, !103, !105, !107, !9}
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(scope: null, file: !2, line: 58, type: !42, isLocal: true, isDefinition: true)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !43)
!43 = !{!44}
!44 = !DISubrange(count: 2)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(scope: null, file: !2, line: 63, type: !42, isLocal: true, isDefinition: true)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(scope: null, file: !2, line: 174, type: !42, isLocal: true, isDefinition: true)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !42, isLocal: true, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(scope: null, file: !2, line: 234, type: !53, isLocal: true, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 5)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(scope: null, file: !2, line: 236, type: !58, isLocal: true, isDefinition: true)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 32, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 4)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(scope: null, file: !2, line: 247, type: !63, isLocal: true, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 36)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(scope: null, file: !2, line: 264, type: !68, isLocal: true, isDefinition: true)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 480, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 60)
!71 = !DIGlobalVariableExpression(var: !72, expr: !DIExpression())
!72 = distinct !DIGlobalVariable(scope: null, file: !2, line: 270, type: !73, isLocal: true, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 29)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(scope: null, file: !2, line: 301, type: !58, isLocal: true, isDefinition: true)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(scope: null, file: !2, line: 307, type: !58, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(scope: null, file: !2, line: 313, type: !58, isLocal: true, isDefinition: true)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(scope: null, file: !2, line: 318, type: !58, isLocal: true, isDefinition: true)
!84 = !DIGlobalVariableExpression(var: !85, expr: !DIExpression())
!85 = distinct !DIGlobalVariable(scope: null, file: !2, line: 25, type: !53, isLocal: true, isDefinition: true)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(scope: null, file: !2, line: 26, type: !88, isLocal: true, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 48, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 6)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(scope: null, file: !2, line: 27, type: !53, isLocal: true, isDefinition: true)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(scope: null, file: !2, line: 28, type: !58, isLocal: true, isDefinition: true)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(scope: null, file: !2, line: 29, type: !58, isLocal: true, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(scope: null, file: !2, line: 30, type: !58, isLocal: true, isDefinition: true)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(scope: null, file: !2, line: 31, type: !58, isLocal: true, isDefinition: true)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(scope: null, file: !2, line: 32, type: !58, isLocal: true, isDefinition: true)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(scope: null, file: !2, line: 33, type: !58, isLocal: true, isDefinition: true)
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(scope: null, file: !2, line: 34, type: !53, isLocal: true, isDefinition: true)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(scope: null, file: !2, line: 35, type: !88, isLocal: true, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 1536, elements: !118)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "VIDEO_SIZE", file: !14, line: 23, baseType: !112)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_size", file: !14, line: 19, size: 128, elements: !113)
!113 = !{!114, !116, !117}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !112, file: !14, line: 20, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "x_size", scope: !112, file: !14, line: 21, baseType: !15, size: 32, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "y_size", scope: !112, file: !14, line: 22, baseType: !15, size: 32, offset: 96)
!118 = !{!119}
!119 = !DISubrange(count: 12)
!120 = !{i32 7, !"Dwarf Version", i32 5}
!121 = !{i32 2, !"Debug Info Version", i32 3}
!122 = !{i32 1, !"wchar_size", i32 4}
!123 = !{i32 8, !"PIC Level", i32 2}
!124 = !{i32 7, !"PIE Level", i32 2}
!125 = !{i32 7, !"uwtable", i32 2}
!126 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!127 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!128 = distinct !DISubprogram(name: "ParseSizeFromString", scope: !2, file: !2, line: 46, type: !129, scopeLine: 47, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !11, retainedNodes: !186)
!129 = !DISubroutineType(types: !130)
!130 = !{!15, !131, !184, !184, !185}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !14, line: 60, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !14, line: 34, size: 7744, elements: !134)
!134 = !{!135, !139, !140, !141, !142, !144, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !133, file: !14, line: 37, baseType: !136, size: 2040)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 255)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !133, file: !14, line: 38, baseType: !136, size: 2040, offset: 2040)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !133, file: !14, line: 39, baseType: !136, size: 2040, offset: 4080)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !133, file: !14, line: 40, baseType: !15, size: 32, offset: 6144)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !133, file: !14, line: 41, baseType: !143, size: 32, offset: 6176)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !14, line: 32, baseType: !13)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !133, file: !14, line: 42, baseType: !145, size: 1088, offset: 6208)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !24, line: 52, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !24, line: 30, size: 1088, elements: !147)
!147 = !{!148, !150, !152, !154, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !146, file: !24, line: 32, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !24, line: 28, baseType: !23)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !146, file: !24, line: 33, baseType: !151, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !24, line: 20, baseType: !31)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !146, file: !24, line: 34, baseType: !153, size: 64, offset: 64)
!153 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !146, file: !24, line: 35, baseType: !155, size: 96, offset: 128)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 96, elements: !5)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !146, file: !24, line: 36, baseType: !155, size: 96, offset: 224)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !146, file: !24, line: 37, baseType: !15, size: 32, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !146, file: !24, line: 38, baseType: !15, size: 32, offset: 352)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !146, file: !24, line: 39, baseType: !15, size: 32, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !146, file: !24, line: 40, baseType: !15, size: 32, offset: 416)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !146, file: !24, line: 41, baseType: !15, size: 32, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !146, file: !24, line: 42, baseType: !15, size: 32, offset: 480)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !146, file: !24, line: 43, baseType: !15, size: 32, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !146, file: !24, line: 44, baseType: !15, size: 32, offset: 544)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !146, file: !24, line: 45, baseType: !155, size: 96, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !146, file: !24, line: 46, baseType: !15, size: 32, offset: 672)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !146, file: !24, line: 47, baseType: !155, size: 96, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !146, file: !24, line: 48, baseType: !155, size: 96, offset: 800)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !146, file: !24, line: 49, baseType: !155, size: 96, offset: 896)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !146, file: !24, line: 50, baseType: !15, size: 32, offset: 992)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !146, file: !24, line: 51, baseType: !15, size: 32, offset: 1024)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !133, file: !14, line: 43, baseType: !15, size: 32, offset: 7296)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !133, file: !14, line: 44, baseType: !15, size: 32, offset: 7328)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !133, file: !14, line: 45, baseType: !15, size: 32, offset: 7360)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !133, file: !14, line: 46, baseType: !15, size: 32, offset: 7392)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !133, file: !14, line: 47, baseType: !15, size: 32, offset: 7424)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !133, file: !14, line: 48, baseType: !15, size: 32, offset: 7456)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !133, file: !14, line: 49, baseType: !15, size: 32, offset: 7488)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !133, file: !14, line: 50, baseType: !15, size: 32, offset: 7520)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !133, file: !14, line: 51, baseType: !15, size: 32, offset: 7552)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !133, file: !14, line: 52, baseType: !15, size: 32, offset: 7584)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !133, file: !14, line: 53, baseType: !15, size: 32, offset: 7616)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !133, file: !14, line: 56, baseType: !184, size: 64, offset: 7680)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194, !195, !196}
!187 = !DILocalVariable(name: "input_file", arg: 1, scope: !128, file: !2, line: 46, type: !131)
!188 = !DILocalVariable(name: "x_size", arg: 2, scope: !128, file: !2, line: 46, type: !184)
!189 = !DILocalVariable(name: "y_size", arg: 3, scope: !128, file: !2, line: 46, type: !184)
!190 = !DILocalVariable(name: "fps", arg: 4, scope: !128, file: !2, line: 46, type: !185)
!191 = !DILocalVariable(name: "p1", scope: !128, file: !2, line: 48, type: !115)
!192 = !DILocalVariable(name: "p2", scope: !128, file: !2, line: 48, type: !115)
!193 = !DILocalVariable(name: "tail", scope: !128, file: !2, line: 48, type: !115)
!194 = !DILocalVariable(name: "fn", scope: !128, file: !2, line: 49, type: !115)
!195 = !DILocalVariable(name: "c", scope: !128, file: !2, line: 50, type: !4)
!196 = !DILocalVariable(name: "i", scope: !128, file: !2, line: 51, type: !15)
!197 = distinct !DIAssignID()
!198 = !DILocation(line: 0, scope: !128)
!199 = !DILocation(line: 48, column: 3, scope: !128)
!200 = !DILocation(line: 53, column: 21, scope: !128)
!201 = !DILocation(line: 53, column: 11, scope: !128)
!202 = !DILocation(line: 55, column: 13, scope: !128)
!203 = !DILocation(line: 55, column: 3, scope: !128)
!204 = !DILocation(line: 58, column: 10, scope: !205)
!205 = distinct !DILexicalBlock(scope: !128, file: !2, line: 56, column: 3)
!206 = !DILocation(line: 59, column: 12, scope: !207)
!207 = distinct !DILexicalBlock(scope: !205, file: !2, line: 59, column: 9)
!208 = !DILocation(line: 59, column: 9, scope: !205)
!209 = !DILocation(line: 63, column: 10, scope: !205)
!210 = !DILocation(line: 66, column: 12, scope: !211)
!211 = distinct !DILexicalBlock(scope: !205, file: !2, line: 66, column: 9)
!212 = !DILocation(line: 66, column: 9, scope: !205)
!213 = !DILocation(line: 70, column: 9, scope: !205)
!214 = !DILocation(line: 71, column: 26, scope: !205)
!215 = !DILocation(line: 71, column: 15, scope: !205)
!216 = !DILocation(line: 71, column: 13, scope: !205)
!217 = !DILocation(line: 74, column: 10, scope: !218)
!218 = distinct !DILexicalBlock(scope: !205, file: !2, line: 74, column: 9)
!219 = !DILocation(line: 74, column: 9, scope: !218)
!220 = !DILocation(line: 74, column: 15, scope: !218)
!221 = !DILocation(line: 74, column: 23, scope: !218)
!222 = !DILocation(line: 74, column: 26, scope: !218)
!223 = !DILocation(line: 74, column: 36, scope: !218)
!224 = !DILocation(line: 74, column: 9, scope: !205)
!225 = !DILocation(line: 76, column: 11, scope: !226)
!226 = distinct !DILexicalBlock(scope: !218, file: !2, line: 75, column: 5)
!227 = !DILocation(line: 78, column: 7, scope: !226)
!228 = !DILocation(line: 82, column: 9, scope: !205)
!229 = !DILocation(line: 85, column: 22, scope: !205)
!230 = !DILocation(line: 85, column: 10, scope: !205)
!231 = !DILocation(line: 87, column: 12, scope: !232)
!232 = distinct !DILexicalBlock(scope: !205, file: !2, line: 87, column: 9)
!233 = !DILocation(line: 87, column: 9, scope: !205)
!234 = !DILocation(line: 94, column: 9, scope: !205)
!235 = !DILocation(line: 95, column: 9, scope: !205)
!236 = !DILocation(line: 96, column: 15, scope: !205)
!237 = !DILocation(line: 96, column: 13, scope: !205)
!238 = !DILocation(line: 99, column: 10, scope: !239)
!239 = distinct !DILexicalBlock(scope: !205, file: !2, line: 99, column: 9)
!240 = !DILocation(line: 99, column: 9, scope: !239)
!241 = !DILocation(line: 99, column: 15, scope: !239)
!242 = !DILocation(line: 99, column: 23, scope: !239)
!243 = !DILocation(line: 99, column: 26, scope: !239)
!244 = !DILocation(line: 99, column: 36, scope: !239)
!245 = !DILocation(line: 99, column: 9, scope: !205)
!246 = !DILocation(line: 101, column: 11, scope: !247)
