; ModuleID = 'ldecod_src/intra16x16_pred_normal.c'
source_filename = "ldecod_src/intra16x16_pred_normal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.pix_pos = type { i32, i32, i16, i16, i16, i16 }

@.str = private unnamed_addr constant [47 x i8] c"illegal 16x16 intra prediction mode input: %d\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [43 x i8] c"invalid 16x16 intra pred Mode VERT_PRED_16\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [42 x i8] c"invalid 16x16 intra pred Mode HOR_PRED_16\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [39 x i8] c"invalid 16x16 intra pred Mode PLANE_16\00", align 1, !dbg !17

; Function Attrs: nounwind uwtable
define dso_local range(i32 0, 2) i32 @intrapred_16x16_normal(ptr noundef %currMB, i32 noundef %pl, i32 noundef %predmode) local_unnamed_addr #0 !dbg !93 {
entry:
  %a.i78 = alloca %struct.pix_pos, align 4, !DIAssignID !1279
    #dbg_assign(i1 undef, !1280, !DIExpression(), !1279, ptr %a.i78, !DIExpression(), !1312)
  %b.i79 = alloca %struct.pix_pos, align 4, !DIAssignID !1315
    #dbg_assign(i1 undef, !1302, !DIExpression(), !1315, ptr %b.i79, !DIExpression(), !1312)
  %d.i = alloca %struct.pix_pos, align 4, !DIAssignID !1316
  %a.i40 = alloca %struct.pix_pos, align 4, !DIAssignID !1317

!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !64, line: 246, baseType: !50, size: 32, elements: !71)
!71 = !{!72, !73, !74}
!72 = !DIEnumerator(name: "DECODING_OK", value: 0)
!73 = !DIEnumerator(name: "SEARCH_SYNC", value: 1)
!74 = !DIEnumerator(name: "PICTURE_DECODED", value: 2)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !49, line: 166, baseType: !50, size: 32, elements: !76)
!76 = !{!77, !78}
!77 = !DIEnumerator(name: "IS_LUMA", value: 0)
!78 = !DIEnumerator(name: "IS_CHROMA", value: 1)
!79 = !{!80}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !81, line: 41, baseType: !82)
!81 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !81, line: 23, baseType: !83)
!83 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!84 = !{!0, !7, !12, !17}
!85 = !{i32 7, !"Dwarf Version", i32 5}
!86 = !{i32 2, !"Debug Info Version", i32 3}
!87 = !{i32 1, !"wchar_size", i32 4}
!88 = !{i32 8, !"PIC Level", i32 2}
!89 = !{i32 7, !"PIE Level", i32 2}
!90 = !{i32 7, !"uwtable", i32 2}
!91 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!92 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!93 = distinct !DISubprogram(name: "intrapred_16x16_normal", scope: !2, file: !2, line: 325, type: !94, scopeLine: 328, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !22, retainedNodes: !1275)
!94 = !DISubroutineType(types: !95)
!95 = !{!26, !96, !865, !26}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !98, line: 273, baseType: !99)
!98 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !98, line: 197, size: 3840, elements: !100)
!100 = !{!101, !1191, !1192, !1193, !1194, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1223, !1224, !1225, !1226, !1227, !1230, !1231, !1233, !1234, !1235, !1236, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1260, !1261, !1266, !1270, !1274}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !99, file: !98, line: 199, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !98, line: 341, size: 109184, elements: !104)
!104 = !{!105, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !965, !967, !1020, !1050, !1077, !1080, !1081, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1116, !1117, !1118, !1119, !1120, !1121, !1124, !1125, !1128, !1129, !1131, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1144, !1145, !1146, !1147, !1148, !1150, !1151, !1152, !1156, !1160, !1164, !1168, !1172, !1173, !1174, !1175, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !103, file: !98, line: 343, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !98, line: 566, size: 6855040, elements: !108)
!108 = !{!109, !194, !250, !353, !355, !357, !415, !417, !418, !419, !420, !421, !424, !444, !456, !457, !458, !459, !460, !461, !465, !466, !468, !469, !470, !471, !472, !473, !475, !477, !480, !481, !483, !484, !485, !486, !487, !489, !490, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !520, !521, !522, !523, !524, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !606, !607, !611, !612, !613, !614, !615, !616, !617, !618, !619, !621, !622, !623, !763, !767, !768, !770, !771, !774, !777, !778, !779, !783, !786, !789, !790, !791, !792, !793, !794, !820, !821, !823, !827, !828, !829, !830, !833, !838, !852, !856, !860, !861, !866, !867, !871, !872, !876, !897, !898, !901, !902, !903, !904, !905, !906, !907, !908}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !107, file: !98, line: 568, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !98, line: 850, size: 32128, elements: !112)
!112 = !{!113, !117, !118, !119, !120, !121, !122, !123, !124, !125, !155, !156, !157, !158, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !111, file: !98, line: 852, baseType: !114, size: 2040)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 255)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !111, file: !98, line: 853, baseType: !114, size: 2040, offset: 2040)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !111, file: !98, line: 854, baseType: !114, size: 2040, offset: 4080)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !111, file: !98, line: 856, baseType: !26, size: 32, offset: 6144)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !111, file: !98, line: 857, baseType: !26, size: 32, offset: 6176)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !111, file: !98, line: 858, baseType: !26, size: 32, offset: 6208)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !111, file: !98, line: 859, baseType: !26, size: 32, offset: 6240)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !111, file: !98, line: 860, baseType: !26, size: 32, offset: 6272)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !111, file: !98, line: 861, baseType: !26, size: 32, offset: 6304)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !111, file: !98, line: 864, baseType: !126, size: 1088, offset: 6336)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !25, line: 52, baseType: !127)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !25, line: 30, size: 1088, elements: !128)
!128 = !{!129, !131, !133, !135, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !127, file: !25, line: 32, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !25, line: 28, baseType: !24)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !127, file: !25, line: 33, baseType: !132, size: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !25, line: 20, baseType: !33)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !127, file: !25, line: 34, baseType: !134, size: 64, offset: 64)
!134 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !127, file: !25, line: 35, baseType: !136, size: 96, offset: 128)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 96, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 3)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !127, file: !25, line: 36, baseType: !136, size: 96, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !127, file: !25, line: 37, baseType: !26, size: 32, offset: 320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !127, file: !25, line: 38, baseType: !26, size: 32, offset: 352)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !127, file: !25, line: 39, baseType: !26, size: 32, offset: 384)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !127, file: !25, line: 40, baseType: !26, size: 32, offset: 416)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !127, file: !25, line: 41, baseType: !26, size: 32, offset: 448)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !127, file: !25, line: 42, baseType: !26, size: 32, offset: 480)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !127, file: !25, line: 43, baseType: !26, size: 32, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !127, file: !25, line: 44, baseType: !26, size: 32, offset: 544)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !127, file: !25, line: 45, baseType: !136, size: 96, offset: 576)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !127, file: !25, line: 46, baseType: !26, size: 32, offset: 672)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !127, file: !25, line: 47, baseType: !136, size: 96, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !127, file: !25, line: 48, baseType: !136, size: 96, offset: 800)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !127, file: !25, line: 49, baseType: !136, size: 96, offset: 896)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !127, file: !25, line: 50, baseType: !26, size: 32, offset: 992)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !127, file: !25, line: 51, baseType: !26, size: 32, offset: 1024)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !111, file: !98, line: 865, baseType: !126, size: 1088, offset: 7424)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !111, file: !98, line: 867, baseType: !26, size: 32, offset: 8512)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !111, file: !98, line: 868, baseType: !26, size: 32, offset: 8544)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !111, file: !98, line: 869, baseType: !159, size: 7744, offset: 8576)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !40, line: 60, baseType: !160)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !40, line: 34, size: 7744, elements: !161)
!161 = !{!162, !163, !164, !165, !166, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !160, file: !40, line: 37, baseType: !114, size: 2040)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !160, file: !40, line: 38, baseType: !114, size: 2040, offset: 2040)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !160, file: !40, line: 39, baseType: !114, size: 2040, offset: 4080)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !160, file: !40, line: 40, baseType: !26, size: 32, offset: 6144)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !160, file: !40, line: 41, baseType: !167, size: 32, offset: 6176)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !40, line: 32, baseType: !39)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !160, file: !40, line: 42, baseType: !126, size: 1088, offset: 6208)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !160, file: !40, line: 43, baseType: !26, size: 32, offset: 7296)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !160, file: !40, line: 44, baseType: !26, size: 32, offset: 7328)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !160, file: !40, line: 45, baseType: !26, size: 32, offset: 7360)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !160, file: !40, line: 46, baseType: !26, size: 32, offset: 7392)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !160, file: !40, line: 47, baseType: !26, size: 32, offset: 7424)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !160, file: !40, line: 48, baseType: !26, size: 32, offset: 7456)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !160, file: !40, line: 49, baseType: !26, size: 32, offset: 7488)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !160, file: !40, line: 50, baseType: !26, size: 32, offset: 7520)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !160, file: !40, line: 51, baseType: !26, size: 32, offset: 7552)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !160, file: !40, line: 52, baseType: !26, size: 32, offset: 7584)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !160, file: !40, line: 53, baseType: !26, size: 32, offset: 7616)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !160, file: !40, line: 56, baseType: !181, size: 64, offset: 7680)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !111, file: !98, line: 870, baseType: !159, size: 7744, offset: 16320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !111, file: !98, line: 871, baseType: !159, size: 7744, offset: 24064)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !111, file: !98, line: 873, baseType: !26, size: 32, offset: 31808)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !111, file: !98, line: 884, baseType: !26, size: 32, offset: 31840)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !111, file: !98, line: 885, baseType: !26, size: 32, offset: 31872)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !111, file: !98, line: 886, baseType: !26, size: 32, offset: 31904)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !111, file: !98, line: 890, baseType: !26, size: 32, offset: 31936)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !111, file: !98, line: 893, baseType: !26, size: 32, offset: 31968)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !111, file: !98, line: 894, baseType: !26, size: 32, offset: 32000)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !111, file: !98, line: 895, baseType: !26, size: 32, offset: 32032)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !111, file: !98, line: 897, baseType: !26, size: 32, offset: 32064)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !111, file: !98, line: 899, baseType: !26, size: 32, offset: 32096)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !107, file: !98, line: 569, baseType: !195, size: 64, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !197, line: 138, baseType: !198)
!197 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !197, line: 94, size: 17728, elements: !199)
!199 = !{!200, !201, !202, !203, !204, !205, !206, !210, !215, !219, !222, !223, !224, !225, !226, !230, !231, !232, !233, !234, !235, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !198, file: !197, line: 96, baseType: !26, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !198, file: !197, line: 97, baseType: !50, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !198, file: !197, line: 98, baseType: !50, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !198, file: !197, line: 99, baseType: !26, size: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !198, file: !197, line: 100, baseType: !26, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !198, file: !197, line: 102, baseType: !26, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !198, file: !197, line: 103, baseType: !207, size: 384, offset: 192)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 384, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 12)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !198, file: !197, line: 104, baseType: !211, size: 3072, offset: 576)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 3072, elements: !212)
!212 = !{!213, !214}
!213 = !DISubrange(count: 6)
!214 = !DISubrange(count: 16)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !198, file: !197, line: 105, baseType: !216, size: 12288, offset: 3648)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 12288, elements: !217)
!217 = !{!213, !218}
!218 = !DISubrange(count: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !198, file: !197, line: 106, baseType: !220, size: 192, offset: 15936)
!220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, elements: !221)
!221 = !{!213}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !198, file: !197, line: 107, baseType: !220, size: 192, offset: 16128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !198, file: !197, line: 110, baseType: !26, size: 32, offset: 16320)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !198, file: !197, line: 111, baseType: !50, size: 32, offset: 16352)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !198, file: !197, line: 112, baseType: !50, size: 32, offset: 16384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !198, file: !197, line: 114, baseType: !227, size: 256, offset: 16416)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 256, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 8)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !198, file: !197, line: 116, baseType: !227, size: 256, offset: 16672)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !198, file: !197, line: 117, baseType: !227, size: 256, offset: 16928)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !198, file: !197, line: 119, baseType: !26, size: 32, offset: 17184)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !198, file: !197, line: 120, baseType: !50, size: 32, offset: 17216)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !198, file: !197, line: 122, baseType: !50, size: 32, offset: 17248)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !198, file: !197, line: 123, baseType: !236, size: 64, offset: 17280)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !81, line: 21, baseType: !238)
!238 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !198, file: !197, line: 125, baseType: !26, size: 32, offset: 17344)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !198, file: !197, line: 126, baseType: !26, size: 32, offset: 17376)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !198, file: !197, line: 127, baseType: !26, size: 32, offset: 17408)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !198, file: !197, line: 128, baseType: !50, size: 32, offset: 17440)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !198, file: !197, line: 129, baseType: !26, size: 32, offset: 17472)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !198, file: !197, line: 130, baseType: !26, size: 32, offset: 17504)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !198, file: !197, line: 131, baseType: !26, size: 32, offset: 17536)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !198, file: !197, line: 133, baseType: !26, size: 32, offset: 17568)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !198, file: !197, line: 135, baseType: !26, size: 32, offset: 17600)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !198, file: !197, line: 136, baseType: !26, size: 32, offset: 17632)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !198, file: !197, line: 137, baseType: !26, size: 32, offset: 17664)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !107, file: !98, line: 570, baseType: !251, size: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !197, line: 197, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !197, line: 142, size: 33024, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !351, !352}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !253, file: !197, line: 144, baseType: !26, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !253, file: !197, line: 146, baseType: !50, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !253, file: !197, line: 147, baseType: !26, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !253, file: !197, line: 148, baseType: !26, size: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !253, file: !197, line: 149, baseType: !26, size: 32, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !253, file: !197, line: 150, baseType: !26, size: 32, offset: 160)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !253, file: !197, line: 152, baseType: !26, size: 32, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !253, file: !197, line: 154, baseType: !50, size: 32, offset: 224)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !253, file: !197, line: 155, baseType: !50, size: 32, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !253, file: !197, line: 156, baseType: !50, size: 32, offset: 288)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !253, file: !197, line: 158, baseType: !26, size: 32, offset: 320)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !253, file: !197, line: 159, baseType: !207, size: 384, offset: 352)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !253, file: !197, line: 160, baseType: !211, size: 3072, offset: 736)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !253, file: !197, line: 161, baseType: !216, size: 12288, offset: 3808)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !253, file: !197, line: 162, baseType: !220, size: 192, offset: 16096)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !253, file: !197, line: 163, baseType: !220, size: 192, offset: 16288)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !253, file: !197, line: 165, baseType: !50, size: 32, offset: 16480)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !253, file: !197, line: 166, baseType: !50, size: 32, offset: 16512)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !253, file: !197, line: 167, baseType: !50, size: 32, offset: 16544)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !253, file: !197, line: 168, baseType: !50, size: 32, offset: 16576)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !253, file: !197, line: 170, baseType: !50, size: 32, offset: 16608)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !253, file: !197, line: 172, baseType: !26, size: 32, offset: 16640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !253, file: !197, line: 173, baseType: !26, size: 32, offset: 16672)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !253, file: !197, line: 174, baseType: !26, size: 32, offset: 16704)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !253, file: !197, line: 175, baseType: !50, size: 32, offset: 16736)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !253, file: !197, line: 177, baseType: !281, size: 8192, offset: 16768)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 8192, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 256)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !253, file: !197, line: 178, baseType: !50, size: 32, offset: 24960)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !253, file: !197, line: 179, baseType: !26, size: 32, offset: 24992)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !253, file: !197, line: 180, baseType: !50, size: 32, offset: 25024)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !253, file: !197, line: 181, baseType: !50, size: 32, offset: 25056)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !253, file: !197, line: 182, baseType: !26, size: 32, offset: 25088)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !253, file: !197, line: 184, baseType: !26, size: 32, offset: 25120)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !253, file: !197, line: 185, baseType: !26, size: 32, offset: 25152)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !253, file: !197, line: 186, baseType: !26, size: 32, offset: 25184)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !253, file: !197, line: 187, baseType: !50, size: 32, offset: 25216)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !253, file: !197, line: 188, baseType: !50, size: 32, offset: 25248)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !253, file: !197, line: 189, baseType: !50, size: 32, offset: 25280)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !253, file: !197, line: 190, baseType: !50, size: 32, offset: 25312)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !253, file: !197, line: 191, baseType: !26, size: 32, offset: 25344)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !253, file: !197, line: 192, baseType: !298, size: 7584, offset: 25376)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !197, line: 90, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !197, line: 53, size: 7584, elements: !300)
!300 = !{!301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !299, file: !197, line: 55, baseType: !26, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !299, file: !197, line: 56, baseType: !50, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !299, file: !197, line: 57, baseType: !83, size: 16, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !299, file: !197, line: 58, baseType: !83, size: 16, offset: 80)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !299, file: !197, line: 59, baseType: !26, size: 32, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !299, file: !197, line: 60, baseType: !26, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !299, file: !197, line: 61, baseType: !26, size: 32, offset: 160)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !299, file: !197, line: 62, baseType: !50, size: 32, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !299, file: !197, line: 63, baseType: !26, size: 32, offset: 224)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !299, file: !197, line: 64, baseType: !26, size: 32, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !299, file: !197, line: 65, baseType: !50, size: 32, offset: 288)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !299, file: !197, line: 66, baseType: !50, size: 32, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !299, file: !197, line: 67, baseType: !50, size: 32, offset: 352)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !299, file: !197, line: 68, baseType: !26, size: 32, offset: 384)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !299, file: !197, line: 69, baseType: !50, size: 32, offset: 416)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !299, file: !197, line: 70, baseType: !50, size: 32, offset: 448)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !299, file: !197, line: 71, baseType: !26, size: 32, offset: 480)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !299, file: !197, line: 72, baseType: !50, size: 32, offset: 512)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !299, file: !197, line: 73, baseType: !50, size: 32, offset: 544)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !299, file: !197, line: 74, baseType: !26, size: 32, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !299, file: !197, line: 75, baseType: !26, size: 32, offset: 608)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !299, file: !197, line: 76, baseType: !323, size: 3296, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !197, line: 50, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !197, line: 38, size: 3296, elements: !325)
!325 = !{!326, !327, !328, !329, !333, !334, !335, !336, !337, !338}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !324, file: !197, line: 40, baseType: !50, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !324, file: !197, line: 41, baseType: !50, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !324, file: !197, line: 42, baseType: !50, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !324, file: !197, line: 43, baseType: !330, size: 1024, offset: 96)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 1024, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !324, file: !197, line: 44, baseType: !330, size: 1024, offset: 1120)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !324, file: !197, line: 45, baseType: !330, size: 1024, offset: 2144)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !324, file: !197, line: 46, baseType: !50, size: 32, offset: 3168)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !324, file: !197, line: 47, baseType: !50, size: 32, offset: 3200)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !324, file: !197, line: 48, baseType: !50, size: 32, offset: 3232)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !324, file: !197, line: 49, baseType: !50, size: 32, offset: 3264)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !299, file: !197, line: 77, baseType: !26, size: 32, offset: 3936)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !299, file: !197, line: 78, baseType: !323, size: 3296, offset: 3968)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !299, file: !197, line: 80, baseType: !26, size: 32, offset: 7264)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !299, file: !197, line: 81, baseType: !26, size: 32, offset: 7296)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !299, file: !197, line: 82, baseType: !26, size: 32, offset: 7328)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !299, file: !197, line: 83, baseType: !26, size: 32, offset: 7360)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !299, file: !197, line: 84, baseType: !50, size: 32, offset: 7392)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !299, file: !197, line: 85, baseType: !50, size: 32, offset: 7424)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !299, file: !197, line: 86, baseType: !50, size: 32, offset: 7456)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !299, file: !197, line: 87, baseType: !50, size: 32, offset: 7488)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !299, file: !197, line: 88, baseType: !50, size: 32, offset: 7520)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !299, file: !197, line: 89, baseType: !50, size: 32, offset: 7552)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !253, file: !197, line: 193, baseType: !50, size: 32, offset: 32960)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !253, file: !197, line: 195, baseType: !26, size: 32, offset: 32992)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !107, file: !98, line: 571, baseType: !354, size: 1056768, offset: 192)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 1056768, elements: !331)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !107, file: !98, line: 572, baseType: !356, size: 4538368, offset: 1056960)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 4538368, elements: !282)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !107, file: !98, line: 575, baseType: !358, size: 64, offset: 5595328)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !197, line: 256, baseType: !360)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !197, line: 228, size: 37312, elements: !361)
!361 = !{!362, !363, !364, !365, !366, !367, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !382, !383, !384, !385}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !360, file: !197, line: 230, baseType: !252, size: 33024)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !360, file: !197, line: 232, baseType: !50, size: 32, offset: 33024)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !360, file: !197, line: 233, baseType: !26, size: 32, offset: 33056)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !360, file: !197, line: 234, baseType: !181, size: 64, offset: 33088)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !360, file: !197, line: 235, baseType: !181, size: 64, offset: 33152)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !360, file: !197, line: 236, baseType: !368, size: 64, offset: 33216)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !360, file: !197, line: 237, baseType: !181, size: 64, offset: 33280)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !360, file: !197, line: 238, baseType: !368, size: 64, offset: 33344)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !360, file: !197, line: 240, baseType: !181, size: 64, offset: 33408)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !360, file: !197, line: 241, baseType: !368, size: 64, offset: 33472)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !360, file: !197, line: 242, baseType: !181, size: 64, offset: 33536)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !360, file: !197, line: 243, baseType: !368, size: 64, offset: 33600)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !360, file: !197, line: 245, baseType: !26, size: 32, offset: 33664)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !360, file: !197, line: 246, baseType: !181, size: 64, offset: 33728)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !360, file: !197, line: 247, baseType: !181, size: 64, offset: 33792)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !360, file: !197, line: 248, baseType: !368, size: 64, offset: 33856)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !360, file: !197, line: 249, baseType: !368, size: 64, offset: 33920)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !360, file: !197, line: 250, baseType: !381, size: 64, offset: 33984)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !360, file: !197, line: 251, baseType: !368, size: 64, offset: 34048)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !360, file: !197, line: 253, baseType: !50, size: 32, offset: 34112)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !360, file: !197, line: 254, baseType: !26, size: 32, offset: 34144)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !360, file: !197, line: 255, baseType: !386, size: 3136, offset: 34176)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !197, line: 226, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !197, line: 200, size: 3136, elements: !388)
!388 = !{!389, !390, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !408, !409, !411, !412, !413, !414}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !387, file: !197, line: 202, baseType: !26, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !387, file: !197, line: 203, baseType: !391, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !387, file: !197, line: 204, baseType: !181, size: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !387, file: !197, line: 205, baseType: !368, size: 64, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !387, file: !197, line: 206, baseType: !391, size: 64, offset: 256)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !387, file: !197, line: 207, baseType: !181, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !387, file: !197, line: 208, baseType: !181, size: 64, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !387, file: !197, line: 209, baseType: !391, size: 64, offset: 448)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !387, file: !197, line: 210, baseType: !391, size: 64, offset: 512)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !387, file: !197, line: 211, baseType: !391, size: 64, offset: 576)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !387, file: !197, line: 212, baseType: !391, size: 64, offset: 640)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !387, file: !197, line: 213, baseType: !391, size: 64, offset: 704)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !387, file: !197, line: 216, baseType: !392, size: 8, offset: 768)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !387, file: !197, line: 217, baseType: !392, size: 8, offset: 776)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !387, file: !197, line: 218, baseType: !392, size: 8, offset: 784)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !387, file: !197, line: 219, baseType: !407, size: 1024, offset: 800)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 1024, elements: !331)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !387, file: !197, line: 220, baseType: !407, size: 1024, offset: 1824)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !387, file: !197, line: 221, baseType: !410, size: 256, offset: 2848)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 256, elements: !331)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !387, file: !197, line: 222, baseType: !392, size: 8, offset: 3104)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !387, file: !197, line: 223, baseType: !392, size: 8, offset: 3112)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !387, file: !197, line: 224, baseType: !392, size: 8, offset: 3120)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !387, file: !197, line: 225, baseType: !392, size: 8, offset: 3128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !107, file: !98, line: 577, baseType: !416, size: 1193984, offset: 5595392)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 1193984, elements: !331)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !107, file: !98, line: 578, baseType: !26, size: 32, offset: 6789376)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !107, file: !98, line: 579, baseType: !26, size: 32, offset: 6789408)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !107, file: !98, line: 580, baseType: !26, size: 32, offset: 6789440)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !107, file: !98, line: 581, baseType: !26, size: 32, offset: 6789472)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !107, file: !98, line: 584, baseType: !422, size: 64, offset: 6789504)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !98, line: 584, flags: DIFlagFwdDecl)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !107, file: !98, line: 586, baseType: !425, size: 64, offset: 6789568)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !98, line: 902, size: 416, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433, !437, !438, !439, !440, !441, !442, !443}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !426, file: !98, line: 904, baseType: !50, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !426, file: !98, line: 905, baseType: !50, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !426, file: !98, line: 906, baseType: !26, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !426, file: !98, line: 907, baseType: !50, size: 32, offset: 96)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !426, file: !98, line: 908, baseType: !26, size: 32, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !426, file: !98, line: 909, baseType: !434, size: 64, offset: 160)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 64, elements: !435)
!435 = !{!436}
!436 = !DISubrange(count: 2)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !426, file: !98, line: 910, baseType: !237, size: 8, offset: 224)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !426, file: !98, line: 911, baseType: !237, size: 8, offset: 232)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !426, file: !98, line: 912, baseType: !26, size: 32, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !426, file: !98, line: 913, baseType: !26, size: 32, offset: 288)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !426, file: !98, line: 915, baseType: !26, size: 32, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !426, file: !98, line: 916, baseType: !26, size: 32, offset: 352)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !426, file: !98, line: 917, baseType: !26, size: 32, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !107, file: !98, line: 587, baseType: !445, size: 64, offset: 6789632)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !98, line: 839, size: 512, elements: !447)
!447 = !{!448, !449, !452, !453, !454, !455}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !446, file: !98, line: 841, baseType: !26, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !446, file: !98, line: 842, baseType: !450, size: 96, offset: 32)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 96, elements: !137)
!451 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !446, file: !98, line: 843, baseType: !450, size: 96, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !446, file: !98, line: 844, baseType: !450, size: 96, offset: 224)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !446, file: !98, line: 845, baseType: !450, size: 96, offset: 320)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !446, file: !98, line: 846, baseType: !450, size: 96, offset: 416)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !107, file: !98, line: 588, baseType: !26, size: 32, offset: 6789696)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !107, file: !98, line: 591, baseType: !50, size: 32, offset: 6789728)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !107, file: !98, line: 592, baseType: !26, size: 32, offset: 6789760)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !107, file: !98, line: 593, baseType: !26, size: 32, offset: 6789792)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !107, file: !98, line: 594, baseType: !26, size: 32, offset: 6789824)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !107, file: !98, line: 595, baseType: !462, size: 64, offset: 6789888)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !98, line: 542, baseType: !103)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !107, file: !98, line: 596, baseType: !391, size: 64, offset: 6789952)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block_JV", scope: !107, file: !98, line: 597, baseType: !467, size: 192, offset: 6790016)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 192, elements: !137)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !107, file: !98, line: 601, baseType: !26, size: 32, offset: 6790208)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !107, file: !98, line: 602, baseType: !26, size: 32, offset: 6790240)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !107, file: !98, line: 603, baseType: !26, size: 32, offset: 6790272)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !107, file: !98, line: 604, baseType: !26, size: 32, offset: 6790304)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !107, file: !98, line: 605, baseType: !26, size: 32, offset: 6790336)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !107, file: !98, line: 607, baseType: !474, size: 64, offset: 6790400)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode_JV", scope: !107, file: !98, line: 608, baseType: !476, size: 192, offset: 6790464)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 192, elements: !137)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !107, file: !98, line: 609, baseType: !478, size: 64, offset: 6790656)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "siblock", scope: !107, file: !98, line: 610, baseType: !368, size: 64, offset: 6790720)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "siblock_JV", scope: !107, file: !98, line: 611, baseType: !482, size: 192, offset: 6790784)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 192, elements: !137)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "newframe", scope: !107, file: !98, line: 613, baseType: !26, size: 32, offset: 6790976)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !107, file: !98, line: 614, baseType: !26, size: 32, offset: 6791008)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pNextSlice", scope: !107, file: !98, line: 617, baseType: !463, size: 64, offset: 6791040)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !107, file: !98, line: 618, baseType: !96, size: 64, offset: 6791104)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data_JV", scope: !107, file: !98, line: 619, baseType: !488, size: 192, offset: 6791168)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 192, elements: !137)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaArrayType", scope: !107, file: !98, line: 621, baseType: !26, size: 32, offset: 6791360)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_head", scope: !107, file: !98, line: 626, baseType: !491, size: 64, offset: 6791424)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !98, line: 626, flags: DIFlagFwdDecl)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_end", scope: !107, file: !98, line: 627, baseType: !491, size: 64, offset: 6791488)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !107, file: !98, line: 629, baseType: !50, size: 32, offset: 6791552)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "non_conforming_stream", scope: !107, file: !98, line: 630, baseType: !26, size: 32, offset: 6791584)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntMsb", scope: !107, file: !98, line: 634, baseType: !26, size: 32, offset: 6791616)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntLsb", scope: !107, file: !98, line: 635, baseType: !50, size: 32, offset: 6791648)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedPicOrderCnt", scope: !107, file: !98, line: 638, baseType: !26, size: 32, offset: 6791680)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntCycleCnt", scope: !107, file: !98, line: 638, baseType: !26, size: 32, offset: 6791712)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumInPicOrderCntCycle", scope: !107, file: !98, line: 638, baseType: !26, size: 32, offset: 6791744)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNum", scope: !107, file: !98, line: 639, baseType: !50, size: 32, offset: 6791776)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumOffset", scope: !107, file: !98, line: 639, baseType: !50, size: 32, offset: 6791808)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDeltaPerPicOrderCntCycle", scope: !107, file: !98, line: 640, baseType: !26, size: 32, offset: 6791840)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !107, file: !98, line: 641, baseType: !26, size: 32, offset: 6791872)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNumOffset", scope: !107, file: !98, line: 642, baseType: !26, size: 32, offset: 6791904)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFrameNum", scope: !107, file: !98, line: 645, baseType: !26, size: 32, offset: 6791936)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !107, file: !98, line: 647, baseType: !50, size: 32, offset: 6791968)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !107, file: !98, line: 648, baseType: !50, size: 32, offset: 6792000)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !107, file: !98, line: 649, baseType: !50, size: 32, offset: 6792032)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !107, file: !98, line: 650, baseType: !50, size: 32, offset: 6792064)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !107, file: !98, line: 651, baseType: !50, size: 32, offset: 6792096)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !107, file: !98, line: 652, baseType: !50, size: 32, offset: 6792128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "oldFrameSizeInMbs", scope: !107, file: !98, line: 653, baseType: !50, size: 32, offset: 6792160)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !107, file: !98, line: 655, baseType: !26, size: 32, offset: 6792192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !107, file: !98, line: 657, baseType: !26, size: 32, offset: 6792224)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !107, file: !98, line: 658, baseType: !26, size: 32, offset: 6792256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_bitsize_on_disk", scope: !107, file: !98, line: 661, baseType: !26, size: 32, offset: 6792288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !107, file: !98, line: 662, baseType: !519, size: 16, offset: 6792320)
!519 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !107, file: !98, line: 663, baseType: !519, size: 16, offset: 6792336)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_scale", scope: !107, file: !98, line: 664, baseType: !434, size: 64, offset: 6792352)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !107, file: !98, line: 665, baseType: !26, size: 32, offset: 6792416)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !107, file: !98, line: 666, baseType: !26, size: 32, offset: 6792448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value_comp", scope: !107, file: !98, line: 667, baseType: !525, size: 96, offset: 6792480)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 96, elements: !137)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "max_pel_value_comp", scope: !107, file: !98, line: 668, baseType: !136, size: 96, offset: 6792576)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !107, file: !98, line: 670, baseType: !26, size: 32, offset: 6792672)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !107, file: !98, line: 671, baseType: !26, size: 32, offset: 6792704)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !107, file: !98, line: 672, baseType: !26, size: 32, offset: 6792736)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !107, file: !98, line: 673, baseType: !26, size: 32, offset: 6792768)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "num_uv_blocks", scope: !107, file: !98, line: 674, baseType: !26, size: 32, offset: 6792800)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !107, file: !98, line: 675, baseType: !26, size: 32, offset: 6792832)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !107, file: !98, line: 676, baseType: !26, size: 32, offset: 6792864)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !107, file: !98, line: 677, baseType: !26, size: 32, offset: 6792896)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x_blk", scope: !107, file: !98, line: 678, baseType: !26, size: 32, offset: 6792928)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y_blk", scope: !107, file: !98, line: 679, baseType: !26, size: 32, offset: 6792960)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !107, file: !98, line: 680, baseType: !538, size: 192, offset: 6792992)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, elements: !539)
!539 = !{!138, !436}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_blk", scope: !107, file: !98, line: 681, baseType: !538, size: 192, offset: 6793184)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_shift", scope: !107, file: !98, line: 682, baseType: !538, size: 192, offset: 6793376)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_x", scope: !107, file: !98, line: 683, baseType: !26, size: 32, offset: 6793568)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_y", scope: !107, file: !98, line: 684, baseType: !26, size: 32, offset: 6793600)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_x", scope: !107, file: !98, line: 685, baseType: !26, size: 32, offset: 6793632)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_y", scope: !107, file: !98, line: 686, baseType: !26, size: 32, offset: 6793664)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "total_scale", scope: !107, file: !98, line: 687, baseType: !26, size: 32, offset: 6793696)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "max_vmv_r", scope: !107, file: !98, line: 689, baseType: !26, size: 32, offset: 6793728)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "idr_psnr_number", scope: !107, file: !98, line: 692, baseType: !26, size: 32, offset: 6793760)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "psnr_number", scope: !107, file: !98, line: 693, baseType: !26, size: 32, offset: 6793792)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "last_ref_pic_poc", scope: !107, file: !98, line: 700, baseType: !26, size: 32, offset: 6793824)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !107, file: !98, line: 701, baseType: !26, size: 32, offset: 6793856)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !107, file: !98, line: 702, baseType: !26, size: 32, offset: 6793888)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !107, file: !98, line: 703, baseType: !26, size: 32, offset: 6793920)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "earlier_missing_poc", scope: !107, file: !98, line: 704, baseType: !26, size: 32, offset: 6793952)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_conceal", scope: !107, file: !98, line: 705, baseType: !50, size: 32, offset: 6793984)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "IDR_concealment_flag", scope: !107, file: !98, line: 706, baseType: !26, size: 32, offset: 6794016)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_slice_type", scope: !107, file: !98, line: 707, baseType: !26, size: 32, offset: 6794048)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point", scope: !107, file: !98, line: 710, baseType: !26, size: 32, offset: 6794080)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point_found", scope: !107, file: !98, line: 711, baseType: !26, size: 32, offset: 6794112)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_cnt", scope: !107, file: !98, line: 712, baseType: !26, size: 32, offset: 6794144)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_num", scope: !107, file: !98, line: 713, baseType: !26, size: 32, offset: 6794176)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_poc", scope: !107, file: !98, line: 714, baseType: !26, size: 32, offset: 6794208)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !107, file: !98, line: 716, baseType: !26, size: 32, offset: 6794240)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !107, file: !98, line: 717, baseType: !26, size: 32, offset: 6794272)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !107, file: !98, line: 719, baseType: !236, size: 64, offset: 6794304)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !107, file: !98, line: 720, baseType: !236, size: 64, offset: 6794368)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "imgData", scope: !107, file: !98, line: 722, baseType: !568, size: 2560, offset: 6794432)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageData", file: !569, line: 38, baseType: !570)
!569 = !DIFile(filename: "ldecod_src/inc/io_image.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "8caef624e6f5391b0c6ab2984e7f77c6")
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "image_data", file: !569, line: 20, size: 2560, elements: !571)
!571 = !{!572, !573, !577, !578, !579, !583, !584, !585, !586, !587}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !570, file: !569, line: 22, baseType: !126, size: 1088)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "frm_data", scope: !570, file: !569, line: 24, baseType: !574, size: 192, offset: 1088)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 192, elements: !137)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "top_data", scope: !570, file: !569, line: 25, baseType: !574, size: 192, offset: 1280)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "bot_data", scope: !570, file: !569, line: 26, baseType: !574, size: 192, offset: 1472)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "frm_uint16", scope: !570, file: !569, line: 31, baseType: !580, size: 192, offset: 1664)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 192, elements: !137)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "top_uint16", scope: !570, file: !569, line: 32, baseType: !580, size: 192, offset: 1856)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "bot_uint16", scope: !570, file: !569, line: 33, baseType: !580, size: 192, offset: 2048)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "frm_stride", scope: !570, file: !569, line: 35, baseType: !136, size: 96, offset: 2240)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "top_stride", scope: !570, file: !569, line: 36, baseType: !136, size: 96, offset: 2336)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "bot_stride", scope: !570, file: !569, line: 37, baseType: !136, size: 96, offset: 2432)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "imgData0", scope: !107, file: !98, line: 723, baseType: !568, size: 2560, offset: 6796992)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "imgData1", scope: !107, file: !98, line: 724, baseType: !568, size: 2560, offset: 6799552)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "imgData2", scope: !107, file: !98, line: 725, baseType: !568, size: 2560, offset: 6802112)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "imgData32", scope: !107, file: !98, line: 728, baseType: !568, size: 2560, offset: 6804672)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "imgData4", scope: !107, file: !98, line: 729, baseType: !568, size: 2560, offset: 6807232)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "imgData5", scope: !107, file: !98, line: 730, baseType: !568, size: 2560, offset: 6809792)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "imgData6", scope: !107, file: !98, line: 731, baseType: !568, size: 2560, offset: 6812352)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "previous_frame_num", scope: !107, file: !98, line: 735, baseType: !50, size: 32, offset: 6814912)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Is_primary_correct", scope: !107, file: !98, line: 737, baseType: !26, size: 32, offset: 6814944)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "Is_redundant_correct", scope: !107, file: !98, line: 738, baseType: !26, size: 32, offset: 6814976)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tot_time", scope: !107, file: !98, line: 741, baseType: !599, size: 64, offset: 6815040)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !600, line: 103, baseType: !601)
!600 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !602, line: 27, baseType: !603)
!602 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !604, line: 44, baseType: !605)
!604 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!605 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "p_out", scope: !107, file: !98, line: 744, baseType: !26, size: 32, offset: 6815104)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "p_out_mvc", scope: !107, file: !98, line: 746, baseType: !608, size: 32768, offset: 6815136)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 32768, elements: !609)
!609 = !{!610}
!610 = !DISubrange(count: 1024)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "p_ref", scope: !107, file: !98, line: 748, baseType: !26, size: 32, offset: 6847904)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessUnitExists", scope: !107, file: !98, line: 751, baseType: !26, size: 32, offset: 6847936)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "NALUCount", scope: !107, file: !98, line: 752, baseType: !26, size: 32, offset: 6847968)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Bframe_ctr", scope: !107, file: !98, line: 755, baseType: !26, size: 32, offset: 6848000)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "frame_no", scope: !107, file: !98, line: 756, baseType: !26, size: 32, offset: 6848032)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "g_nFrame", scope: !107, file: !98, line: 758, baseType: !26, size: 32, offset: 6848064)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "global_init_done", scope: !107, file: !98, line: 759, baseType: !26, size: 32, offset: 6848096)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ref", scope: !107, file: !98, line: 762, baseType: !575, size: 64, offset: 6848128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV_ref", scope: !107, file: !98, line: 763, baseType: !620, size: 64, offset: 6848192)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "qp_per_matrix", scope: !107, file: !98, line: 765, baseType: !181, size: 64, offset: 6848256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "qp_rem_matrix", scope: !107, file: !98, line: 766, baseType: !181, size: 64, offset: 6848320)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "last_out_fs", scope: !107, file: !98, line: 768, baseType: !624, size: 64, offset: 6848384)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !626, line: 152, size: 768, elements: !627)
!626 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!627 = !{!628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !758, !759, !760, !761, !762}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !625, file: !626, line: 154, baseType: !26, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !625, file: !626, line: 155, baseType: !26, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !625, file: !626, line: 156, baseType: !26, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !625, file: !626, line: 157, baseType: !26, size: 32, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !625, file: !626, line: 159, baseType: !26, size: 32, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !625, file: !626, line: 161, baseType: !50, size: 32, offset: 160)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !625, file: !626, line: 162, baseType: !50, size: 32, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !625, file: !626, line: 164, baseType: !26, size: 32, offset: 224)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !625, file: !626, line: 165, baseType: !26, size: 32, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !625, file: !626, line: 166, baseType: !26, size: 32, offset: 288)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !625, file: !626, line: 167, baseType: !26, size: 32, offset: 320)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !625, file: !626, line: 170, baseType: !26, size: 32, offset: 352)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !625, file: !626, line: 172, baseType: !641, size: 64, offset: 384)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !626, line: 138, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !626, line: 46, size: 3328, elements: !644)
!644 = !{!645, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !698, !700, !704, !706, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !643, file: !626, line: 48, baseType: !646, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !49, line: 140, baseType: !48)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !643, file: !626, line: 50, baseType: !26, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !643, file: !626, line: 51, baseType: !26, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !643, file: !626, line: 52, baseType: !26, size: 32, offset: 96)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !643, file: !626, line: 53, baseType: !26, size: 32, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !643, file: !626, line: 54, baseType: !50, size: 32, offset: 160)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !643, file: !626, line: 55, baseType: !50, size: 32, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !643, file: !626, line: 57, baseType: !26, size: 32, offset: 224)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !643, file: !626, line: 58, baseType: !26, size: 32, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !643, file: !626, line: 59, baseType: !26, size: 32, offset: 288)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !643, file: !626, line: 61, baseType: !237, size: 8, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !643, file: !626, line: 62, baseType: !26, size: 32, offset: 352)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !643, file: !626, line: 63, baseType: !26, size: 32, offset: 384)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !643, file: !626, line: 64, baseType: !26, size: 32, offset: 416)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !643, file: !626, line: 65, baseType: !26, size: 32, offset: 448)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !643, file: !626, line: 67, baseType: !519, size: 16, offset: 480)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !643, file: !626, line: 69, baseType: !26, size: 32, offset: 512)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !643, file: !626, line: 69, baseType: !26, size: 32, offset: 544)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !643, file: !626, line: 69, baseType: !26, size: 32, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !643, file: !626, line: 69, baseType: !26, size: 32, offset: 608)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !643, file: !626, line: 70, baseType: !26, size: 32, offset: 640)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !643, file: !626, line: 70, baseType: !26, size: 32, offset: 672)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !643, file: !626, line: 70, baseType: !26, size: 32, offset: 704)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !643, file: !626, line: 70, baseType: !26, size: 32, offset: 736)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !643, file: !626, line: 71, baseType: !26, size: 32, offset: 768)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !643, file: !626, line: 72, baseType: !26, size: 32, offset: 800)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !643, file: !626, line: 73, baseType: !50, size: 32, offset: 832)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !643, file: !626, line: 74, baseType: !50, size: 32, offset: 864)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !643, file: !626, line: 75, baseType: !26, size: 32, offset: 896)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !643, file: !626, line: 75, baseType: !26, size: 32, offset: 928)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !643, file: !626, line: 76, baseType: !26, size: 32, offset: 960)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !643, file: !626, line: 76, baseType: !26, size: 32, offset: 992)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !643, file: !626, line: 79, baseType: !575, size: 64, offset: 1024)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !643, file: !626, line: 80, baseType: !620, size: 64, offset: 1088)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !643, file: !626, line: 81, baseType: !620, size: 64, offset: 1152)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !643, file: !626, line: 84, baseType: !682, size: 64, offset: 1216)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !626, line: 36, size: 256, elements: !685)
!685 = !{!686, !689, !696}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !684, file: !626, line: 38, baseType: !687, size: 128)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 128, elements: !435)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !684, file: !626, line: 39, baseType: !690, size: 64, offset: 128)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 64, elements: !435)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !98, line: 104, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 100, size: 32, elements: !693)
!693 = !{!694, !695}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !692, file: !98, line: 102, baseType: !519, size: 16)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !692, file: !98, line: 103, baseType: !519, size: 16, offset: 16)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !684, file: !626, line: 40, baseType: !697, size: 16, offset: 192)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 16, elements: !435)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !643, file: !626, line: 85, baseType: !699, size: 192, offset: 1280)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 192, elements: !137)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !643, file: !626, line: 87, baseType: !701, size: 64, offset: 1472)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !626, line: 29, size: 64, elements: !702)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !701, file: !626, line: 31, baseType: !236, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !643, file: !626, line: 88, baseType: !705, size: 192, offset: 1536)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !701, size: 192, elements: !137)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !643, file: !626, line: 90, baseType: !707, size: 64, offset: 1728)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !643, file: !626, line: 92, baseType: !688, size: 64, offset: 1792)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !643, file: !626, line: 93, baseType: !688, size: 64, offset: 1856)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !643, file: !626, line: 94, baseType: !688, size: 64, offset: 1920)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !643, file: !626, line: 96, baseType: !26, size: 32, offset: 1984)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !643, file: !626, line: 97, baseType: !26, size: 32, offset: 2016)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !643, file: !626, line: 98, baseType: !26, size: 32, offset: 2048)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !643, file: !626, line: 99, baseType: !26, size: 32, offset: 2080)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !643, file: !626, line: 100, baseType: !26, size: 32, offset: 2112)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !643, file: !626, line: 102, baseType: !26, size: 32, offset: 2144)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !643, file: !626, line: 103, baseType: !26, size: 32, offset: 2176)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !643, file: !626, line: 104, baseType: !26, size: 32, offset: 2208)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !643, file: !626, line: 105, baseType: !26, size: 32, offset: 2240)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !643, file: !626, line: 106, baseType: !26, size: 32, offset: 2272)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !643, file: !626, line: 107, baseType: !26, size: 32, offset: 2304)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !643, file: !626, line: 108, baseType: !26, size: 32, offset: 2336)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !643, file: !626, line: 109, baseType: !26, size: 32, offset: 2368)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !643, file: !626, line: 110, baseType: !434, size: 64, offset: 2400)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !643, file: !626, line: 111, baseType: !26, size: 32, offset: 2464)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !643, file: !626, line: 112, baseType: !728, size: 64, offset: 2496)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !98, line: 194, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !98, line: 186, size: 256, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !730, file: !98, line: 188, baseType: !26, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !730, file: !98, line: 189, baseType: !26, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !730, file: !98, line: 190, baseType: !26, size: 32, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !730, file: !98, line: 191, baseType: !26, size: 32, offset: 96)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !730, file: !98, line: 192, baseType: !26, size: 32, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !730, file: !98, line: 193, baseType: !738, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !643, file: !626, line: 115, baseType: !26, size: 32, offset: 2560)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !643, file: !626, line: 118, baseType: !26, size: 32, offset: 2592)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !643, file: !626, line: 119, baseType: !26, size: 32, offset: 2624)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !643, file: !626, line: 120, baseType: !26, size: 32, offset: 2656)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !643, file: !626, line: 121, baseType: !576, size: 64, offset: 2688)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !643, file: !626, line: 124, baseType: !26, size: 32, offset: 2752)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !643, file: !626, line: 125, baseType: !26, size: 32, offset: 2784)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !643, file: !626, line: 126, baseType: !26, size: 32, offset: 2816)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !643, file: !626, line: 128, baseType: !26, size: 32, offset: 2848)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !643, file: !626, line: 129, baseType: !26, size: 32, offset: 2880)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !643, file: !626, line: 130, baseType: !26, size: 32, offset: 2912)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !643, file: !626, line: 131, baseType: !26, size: 32, offset: 2944)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !643, file: !626, line: 132, baseType: !575, size: 64, offset: 3008)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !643, file: !626, line: 133, baseType: !26, size: 32, offset: 3072)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !643, file: !626, line: 134, baseType: !26, size: 32, offset: 3104)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !643, file: !626, line: 136, baseType: !697, size: 16, offset: 3136)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !643, file: !626, line: 137, baseType: !756, size: 128, offset: 3200)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 128, elements: !435)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !625, file: !626, line: 173, baseType: !641, size: 64, offset: 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !625, file: !626, line: 174, baseType: !641, size: 64, offset: 512)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !625, file: !626, line: 177, baseType: !26, size: 32, offset: 576)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !625, file: !626, line: 178, baseType: !434, size: 64, offset: 608)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !625, file: !626, line: 179, baseType: !434, size: 64, offset: 672)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pocs_in_dpb", scope: !107, file: !98, line: 769, baseType: !764, size: 3200, offset: 6848448)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 3200, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 100)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture", scope: !107, file: !98, line: 771, baseType: !688, size: 64, offset: 6851648)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture_JV", scope: !107, file: !98, line: 772, baseType: !769, size: 192, offset: 6851712)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 192, elements: !137)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "no_reference_picture", scope: !107, file: !98, line: 773, baseType: !688, size: 64, offset: 6851904)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "erc_object_list", scope: !107, file: !98, line: 776, baseType: !772, size: 64, offset: 6851968)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DICompositeType(tag: DW_TAG_structure_type, name: "object_buffer", file: !98, line: 776, flags: DIFlagFwdDecl)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "erc_errorVar", scope: !107, file: !98, line: 777, baseType: !775, size: 64, offset: 6852032)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "ercVariables_s", file: !98, line: 777, flags: DIFlagFwdDecl)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "erc_mvperMB", scope: !107, file: !98, line: 779, baseType: !26, size: 32, offset: 6852096)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "erc_img", scope: !107, file: !98, line: 780, baseType: !106, size: 64, offset: 6852160)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ec_flag", scope: !107, file: !98, line: 781, baseType: !780, size: 640, offset: 6852224)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 640, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 20)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "annex_b", scope: !107, file: !98, line: 783, baseType: !784, size: 64, offset: 6852864)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "annex_b_struct", file: !98, line: 783, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bitsfile", scope: !107, file: !98, line: 784, baseType: !787, size: 64, offset: 6852928)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "sBitsFile", file: !98, line: 784, flags: DIFlagFwdDecl)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "out_buffer", scope: !107, file: !98, line: 786, baseType: !624, size: 64, offset: 6852992)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output", scope: !107, file: !98, line: 788, baseType: !688, size: 64, offset: 6853056)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output_state", scope: !107, file: !98, line: 789, baseType: !26, size: 32, offset: 6853120)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_flag", scope: !107, file: !98, line: 790, baseType: !26, size: 32, offset: 6853152)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "BitStreamFile", scope: !107, file: !98, line: 792, baseType: !26, size: 32, offset: 6853184)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !107, file: !98, line: 794, baseType: !795, size: 64, offset: 6853248)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !626, line: 186, size: 33408, elements: !797)
!797 = !{!798, !801, !804, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !796, file: !626, line: 188, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !98, line: 836, baseType: !107)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !796, file: !626, line: 189, baseType: !802, size: 64, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !98, line: 900, baseType: !111)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !796, file: !626, line: 190, baseType: !805, size: 64, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !626, line: 182, baseType: !625)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ref", scope: !796, file: !626, line: 191, baseType: !805, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ltref", scope: !796, file: !626, line: 192, baseType: !805, size: 64, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !796, file: !626, line: 193, baseType: !50, size: 32, offset: 320)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !796, file: !626, line: 194, baseType: !50, size: 32, offset: 352)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frames_in_buffer", scope: !796, file: !626, line: 195, baseType: !50, size: 32, offset: 384)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ltref_frames_in_buffer", scope: !796, file: !626, line: 196, baseType: !50, size: 32, offset: 416)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_poc", scope: !796, file: !626, line: 197, baseType: !26, size: 32, offset: 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_view_id", scope: !796, file: !626, line: 199, baseType: !26, size: 32, offset: 480)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_pic_idx", scope: !796, file: !626, line: 200, baseType: !608, size: 32768, offset: 512)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "init_done", scope: !796, file: !626, line: 205, baseType: !26, size: 32, offset: 33280)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !796, file: !626, line: 206, baseType: !26, size: 32, offset: 33312)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "last_picture", scope: !796, file: !626, line: 208, baseType: !806, size: 64, offset: 33344)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb_legacy", scope: !107, file: !98, line: 795, baseType: !795, size: 64, offset: 6853312)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb_layer", scope: !107, file: !98, line: 796, baseType: !822, size: 128, offset: 6853376)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !795, size: 128, elements: !435)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "cslice_type", scope: !107, file: !98, line: 800, baseType: !824, size: 72, offset: 6853504)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 9)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "MbToSliceGroupMap", scope: !107, file: !98, line: 802, baseType: !181, size: 64, offset: 6853632)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "MapUnitToSliceGroupMap", scope: !107, file: !98, line: 803, baseType: !181, size: 64, offset: 6853696)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSliceGroups", scope: !107, file: !98, line: 804, baseType: !26, size: 32, offset: 6853760)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "seiToneMapping", scope: !107, file: !98, line: 807, baseType: !831, size: 64, offset: 6853824)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "tone_mapping_struct_s", file: !98, line: 807, flags: DIFlagFwdDecl)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "buf2img", scope: !107, file: !98, line: 810, baseType: !834, size: 64, offset: 6853888)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !575, !837, !26, !26, !26, !26, !26, !26}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
