; ModuleID = 'ldecod_src/intra_chroma_pred.c'
source_filename = "ldecod_src/intra_chroma_pred.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.pix_pos = type { i32, i32, i16, i16, i16, i16 }

@.str = private unnamed_addr constant [52 x i8] c"unexpected VERT_PRED_8 chroma intra prediction mode\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [37 x i8] c"illegal chroma intra prediction mode\00", align 1, !dbg !7
@subblk_offset_y = internal unnamed_addr constant [3 x [8 x [4 x i8]]] [[8 x [4 x i8]] [[4 x i8] c"\00\00\04\04", [4 x i8] c"\00\00\04\04", [4 x i8] zeroinitializer, [4 x i8] zeroinitializer, [4 x i8] zeroinitializer, [4 x i8] zeroinitializer, [4 x i8] zeroinitializer, [4 x i8] zeroinitializer], [8 x [4 x i8]] [[4 x i8] c"\00\00\04\04", [4 x i8] c"\08\08\0C\0C", [4 x i8] c"\00\00\04\04", [4 x i8] c"\08\08\0C\0C", [4 x i8] zeroinitializer, [4 x i8] zeroinitializer, [4 x i8] zeroinitializer, [4 x i8] zeroinitializer], [8 x [4 x i8]] [[4 x i8] c"\00\00\04\04", [4 x i8] c"\00\00\04\04", [4 x i8] c"\08\08\0C\0C", [4 x i8] c"\08\08\0C\0C", [4 x i8] c"\00\00\04\04", [4 x i8] c"\00\00\04\04", [4 x i8] c"\08\08\0C\0C", [4 x i8] c"\08\08\0C\0C"]], align 16, !dbg !12

!54 = !DIEnumerator(name: "PLANE_R", value: 2)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 166, baseType: !42, size: 32, elements: !56)
!56 = !{!57, !58}
!57 = !DIEnumerator(name: "IS_LUMA", value: 0)
!58 = !DIEnumerator(name: "IS_CHROMA", value: 1)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 224, baseType: !42, size: 32, elements: !61)
!60 = !DIFile(filename: "ldecod_src/inc/defines.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "f06de374c735b286d10ba4ea0c8c0a5d")
!61 = !{!62, !63, !64, !65}
!62 = !DIEnumerator(name: "DC_PRED_8", value: 0)
!63 = !DIEnumerator(name: "HOR_PRED_8", value: 1)
!64 = !DIEnumerator(name: "VERT_PRED_8", value: 2)
!65 = !DIEnumerator(name: "PLANE_8", value: 3)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !68, line: 41, baseType: !69)
!68 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !68, line: 23, baseType: !70)
!70 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!71 = !{!0, !7, !72, !1338, !1343, !1348, !12, !1375}
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "block_pos", scope: !74, file: !2, line: 442, type: !1335, isLocal: true, isDefinition: true)
!74 = distinct !DISubprogram(name: "intrapred_chroma_mbaff", scope: !2, file: !2, line: 429, type: !75, scopeLine: 430, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !1254)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !79, line: 273, baseType: !80)
!79 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !79, line: 197, size: 3840, elements: !81)
!81 = !{!82, !1170, !1171, !1172, !1173, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1202, !1203, !1204, !1205, !1206, !1209, !1210, !1212, !1213, !1214, !1215, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1239, !1240, !1245, !1249, !1253}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !80, file: !79, line: 199, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !79, line: 341, size: 109184, elements: !85)
!85 = !{!86, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !946, !948, !1001, !1031, !1058, !1061, !1062, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1097, !1098, !1099, !1100, !1101, !1102, !1105, !1106, !1109, !1110, !1112, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1125, !1126, !1127, !1128, !1129, !1131, !1132, !1133, !1137, !1139, !1143, !1147, !1151, !1152, !1153, !1154, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !84, file: !79, line: 343, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !79, line: 566, size: 6855040, elements: !89)
!89 = !{!90, !175, !231, !334, !336, !338, !396, !398, !399, !400, !401, !402, !405, !425, !437, !438, !439, !440, !441, !442, !446, !447, !449, !450, !451, !452, !453, !454, !456, !458, !461, !462, !464, !465, !466, !467, !468, !470, !471, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !501, !502, !503, !504, !505, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !587, !588, !592, !593, !594, !595, !596, !597, !598, !599, !600, !602, !603, !604, !744, !748, !749, !751, !752, !755, !758, !759, !760, !764, !767, !770, !771, !772, !773, !774, !775, !801, !802, !804, !808, !809, !810, !811, !814, !819, !833, !837, !841, !842, !847, !848, !852, !853, !857, !878, !879, !882, !883, !884, !885, !886, !887, !888, !889}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !88, file: !79, line: 568, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !79, line: 850, size: 32128, elements: !93)
!93 = !{!94, !98, !99, !100, !101, !102, !103, !104, !105, !106, !136, !137, !138, !139, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !92, file: !79, line: 852, baseType: !95, size: 2040)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 255)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !92, file: !79, line: 853, baseType: !95, size: 2040, offset: 2040)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !92, file: !79, line: 854, baseType: !95, size: 2040, offset: 4080)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !92, file: !79, line: 856, baseType: !18, size: 32, offset: 6144)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !92, file: !79, line: 857, baseType: !18, size: 32, offset: 6176)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !92, file: !79, line: 858, baseType: !18, size: 32, offset: 6208)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !92, file: !79, line: 859, baseType: !18, size: 32, offset: 6240)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !92, file: !79, line: 860, baseType: !18, size: 32, offset: 6272)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !92, file: !79, line: 861, baseType: !18, size: 32, offset: 6304)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !92, file: !79, line: 864, baseType: !107, size: 1088, offset: 6336)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !17, line: 52, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !17, line: 30, size: 1088, elements: !109)
!109 = !{!110, !112, !114, !116, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !108, file: !17, line: 32, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !17, line: 28, baseType: !16)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !108, file: !17, line: 33, baseType: !113, size: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !17, line: 20, baseType: !25)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !108, file: !17, line: 34, baseType: !115, size: 64, offset: 64)
!115 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !108, file: !17, line: 35, baseType: !117, size: 96, offset: 128)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 96, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 3)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !108, file: !17, line: 36, baseType: !117, size: 96, offset: 224)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !108, file: !17, line: 37, baseType: !18, size: 32, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !108, file: !17, line: 38, baseType: !18, size: 32, offset: 352)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !108, file: !17, line: 39, baseType: !18, size: 32, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !108, file: !17, line: 40, baseType: !18, size: 32, offset: 416)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !108, file: !17, line: 41, baseType: !18, size: 32, offset: 448)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !108, file: !17, line: 42, baseType: !18, size: 32, offset: 480)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !108, file: !17, line: 43, baseType: !18, size: 32, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !108, file: !17, line: 44, baseType: !18, size: 32, offset: 544)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !108, file: !17, line: 45, baseType: !117, size: 96, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !108, file: !17, line: 46, baseType: !18, size: 32, offset: 672)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !108, file: !17, line: 47, baseType: !117, size: 96, offset: 704)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !108, file: !17, line: 48, baseType: !117, size: 96, offset: 800)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !108, file: !17, line: 49, baseType: !117, size: 96, offset: 896)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !108, file: !17, line: 50, baseType: !18, size: 32, offset: 992)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !108, file: !17, line: 51, baseType: !18, size: 32, offset: 1024)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !92, file: !79, line: 865, baseType: !107, size: 1088, offset: 7424)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !92, file: !79, line: 867, baseType: !18, size: 32, offset: 8512)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !92, file: !79, line: 868, baseType: !18, size: 32, offset: 8544)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !92, file: !79, line: 869, baseType: !140, size: 7744, offset: 8576)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !32, line: 60, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !32, line: 34, size: 7744, elements: !142)
!142 = !{!143, !144, !145, !146, !147, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !141, file: !32, line: 37, baseType: !95, size: 2040)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !141, file: !32, line: 38, baseType: !95, size: 2040, offset: 2040)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !141, file: !32, line: 39, baseType: !95, size: 2040, offset: 4080)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !141, file: !32, line: 40, baseType: !18, size: 32, offset: 6144)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !141, file: !32, line: 41, baseType: !148, size: 32, offset: 6176)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !32, line: 32, baseType: !31)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !141, file: !32, line: 42, baseType: !107, size: 1088, offset: 6208)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !141, file: !32, line: 43, baseType: !18, size: 32, offset: 7296)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !141, file: !32, line: 44, baseType: !18, size: 32, offset: 7328)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !141, file: !32, line: 45, baseType: !18, size: 32, offset: 7360)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !141, file: !32, line: 46, baseType: !18, size: 32, offset: 7392)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !141, file: !32, line: 47, baseType: !18, size: 32, offset: 7424)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !141, file: !32, line: 48, baseType: !18, size: 32, offset: 7456)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !141, file: !32, line: 49, baseType: !18, size: 32, offset: 7488)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !141, file: !32, line: 50, baseType: !18, size: 32, offset: 7520)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !141, file: !32, line: 51, baseType: !18, size: 32, offset: 7552)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !141, file: !32, line: 52, baseType: !18, size: 32, offset: 7584)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !141, file: !32, line: 53, baseType: !18, size: 32, offset: 7616)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !141, file: !32, line: 56, baseType: !162, size: 64, offset: 7680)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !92, file: !79, line: 870, baseType: !140, size: 7744, offset: 16320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !92, file: !79, line: 871, baseType: !140, size: 7744, offset: 24064)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !92, file: !79, line: 873, baseType: !18, size: 32, offset: 31808)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !92, file: !79, line: 884, baseType: !18, size: 32, offset: 31840)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !92, file: !79, line: 885, baseType: !18, size: 32, offset: 31872)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !92, file: !79, line: 886, baseType: !18, size: 32, offset: 31904)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !92, file: !79, line: 890, baseType: !18, size: 32, offset: 31936)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !92, file: !79, line: 893, baseType: !18, size: 32, offset: 31968)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !92, file: !79, line: 894, baseType: !18, size: 32, offset: 32000)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !92, file: !79, line: 895, baseType: !18, size: 32, offset: 32032)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !92, file: !79, line: 897, baseType: !18, size: 32, offset: 32064)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !92, file: !79, line: 899, baseType: !18, size: 32, offset: 32096)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !88, file: !79, line: 569, baseType: !176, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !178, line: 138, baseType: !179)
!178 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 94, size: 17728, elements: !180)
!180 = !{!181, !182, !183, !184, !185, !186, !187, !191, !196, !200, !203, !204, !205, !206, !207, !211, !212, !213, !214, !215, !216, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !179, file: !178, line: 96, baseType: !18, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !179, file: !178, line: 97, baseType: !42, size: 32, offset: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !179, file: !178, line: 98, baseType: !42, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !179, file: !178, line: 99, baseType: !18, size: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !179, file: !178, line: 100, baseType: !18, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !179, file: !178, line: 102, baseType: !18, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !179, file: !178, line: 103, baseType: !188, size: 384, offset: 192)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 384, elements: !189)
!189 = !{!190}
!190 = !DISubrange(count: 12)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !179, file: !178, line: 104, baseType: !192, size: 3072, offset: 576)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 3072, elements: !193)
!193 = !{!194, !195}
!194 = !DISubrange(count: 6)
!195 = !DISubrange(count: 16)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !179, file: !178, line: 105, baseType: !197, size: 12288, offset: 3648)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 12288, elements: !198)
!198 = !{!194, !199}
!199 = !DISubrange(count: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !179, file: !178, line: 106, baseType: !201, size: 192, offset: 15936)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 192, elements: !202)
!202 = !{!194}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !179, file: !178, line: 107, baseType: !201, size: 192, offset: 16128)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !179, file: !178, line: 110, baseType: !18, size: 32, offset: 16320)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !179, file: !178, line: 111, baseType: !42, size: 32, offset: 16352)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !179, file: !178, line: 112, baseType: !42, size: 32, offset: 16384)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !179, file: !178, line: 114, baseType: !208, size: 256, offset: 16416)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 256, elements: !209)
!209 = !{!210}
!210 = !DISubrange(count: 8)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !179, file: !178, line: 116, baseType: !208, size: 256, offset: 16672)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !179, file: !178, line: 117, baseType: !208, size: 256, offset: 16928)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !179, file: !178, line: 119, baseType: !18, size: 32, offset: 17184)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !179, file: !178, line: 120, baseType: !42, size: 32, offset: 17216)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !179, file: !178, line: 122, baseType: !42, size: 32, offset: 17248)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !179, file: !178, line: 123, baseType: !217, size: 64, offset: 17280)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !68, line: 21, baseType: !219)
!219 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !179, file: !178, line: 125, baseType: !18, size: 32, offset: 17344)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !179, file: !178, line: 126, baseType: !18, size: 32, offset: 17376)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !179, file: !178, line: 127, baseType: !18, size: 32, offset: 17408)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !179, file: !178, line: 128, baseType: !42, size: 32, offset: 17440)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !179, file: !178, line: 129, baseType: !18, size: 32, offset: 17472)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !179, file: !178, line: 130, baseType: !18, size: 32, offset: 17504)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !179, file: !178, line: 131, baseType: !18, size: 32, offset: 17536)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !179, file: !178, line: 133, baseType: !18, size: 32, offset: 17568)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !179, file: !178, line: 135, baseType: !18, size: 32, offset: 17600)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !179, file: !178, line: 136, baseType: !18, size: 32, offset: 17632)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !179, file: !178, line: 137, baseType: !18, size: 32, offset: 17664)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !88, file: !79, line: 570, baseType: !232, size: 64, offset: 128)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !178, line: 197, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 142, size: 33024, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !332, !333}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !234, file: !178, line: 144, baseType: !18, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !234, file: !178, line: 146, baseType: !42, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !234, file: !178, line: 147, baseType: !18, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !234, file: !178, line: 148, baseType: !18, size: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !234, file: !178, line: 149, baseType: !18, size: 32, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !234, file: !178, line: 150, baseType: !18, size: 32, offset: 160)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !234, file: !178, line: 152, baseType: !18, size: 32, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !234, file: !178, line: 154, baseType: !42, size: 32, offset: 224)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !234, file: !178, line: 155, baseType: !42, size: 32, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !234, file: !178, line: 156, baseType: !42, size: 32, offset: 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !234, file: !178, line: 158, baseType: !18, size: 32, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !234, file: !178, line: 159, baseType: !188, size: 384, offset: 352)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !234, file: !178, line: 160, baseType: !192, size: 3072, offset: 736)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !234, file: !178, line: 161, baseType: !197, size: 12288, offset: 3808)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !234, file: !178, line: 162, baseType: !201, size: 192, offset: 16096)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !234, file: !178, line: 163, baseType: !201, size: 192, offset: 16288)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !234, file: !178, line: 165, baseType: !42, size: 32, offset: 16480)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !234, file: !178, line: 166, baseType: !42, size: 32, offset: 16512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !234, file: !178, line: 167, baseType: !42, size: 32, offset: 16544)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !234, file: !178, line: 168, baseType: !42, size: 32, offset: 16576)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !234, file: !178, line: 170, baseType: !42, size: 32, offset: 16608)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !234, file: !178, line: 172, baseType: !18, size: 32, offset: 16640)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !234, file: !178, line: 173, baseType: !18, size: 32, offset: 16672)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !234, file: !178, line: 174, baseType: !18, size: 32, offset: 16704)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !234, file: !178, line: 175, baseType: !42, size: 32, offset: 16736)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !234, file: !178, line: 177, baseType: !262, size: 8192, offset: 16768)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8192, elements: !263)
!263 = !{!264}
!264 = !DISubrange(count: 256)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !234, file: !178, line: 178, baseType: !42, size: 32, offset: 24960)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !234, file: !178, line: 179, baseType: !18, size: 32, offset: 24992)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !234, file: !178, line: 180, baseType: !42, size: 32, offset: 25024)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !234, file: !178, line: 181, baseType: !42, size: 32, offset: 25056)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !234, file: !178, line: 182, baseType: !18, size: 32, offset: 25088)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !234, file: !178, line: 184, baseType: !18, size: 32, offset: 25120)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !234, file: !178, line: 185, baseType: !18, size: 32, offset: 25152)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !234, file: !178, line: 186, baseType: !18, size: 32, offset: 25184)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !234, file: !178, line: 187, baseType: !42, size: 32, offset: 25216)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !234, file: !178, line: 188, baseType: !42, size: 32, offset: 25248)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !234, file: !178, line: 189, baseType: !42, size: 32, offset: 25280)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !234, file: !178, line: 190, baseType: !42, size: 32, offset: 25312)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !234, file: !178, line: 191, baseType: !18, size: 32, offset: 25344)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !234, file: !178, line: 192, baseType: !279, size: 7584, offset: 25376)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !178, line: 90, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 53, size: 7584, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !280, file: !178, line: 55, baseType: !18, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !280, file: !178, line: 56, baseType: !42, size: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !280, file: !178, line: 57, baseType: !70, size: 16, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !280, file: !178, line: 58, baseType: !70, size: 16, offset: 80)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !280, file: !178, line: 59, baseType: !18, size: 32, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !280, file: !178, line: 60, baseType: !18, size: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !280, file: !178, line: 61, baseType: !18, size: 32, offset: 160)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !280, file: !178, line: 62, baseType: !42, size: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !280, file: !178, line: 63, baseType: !18, size: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !280, file: !178, line: 64, baseType: !18, size: 32, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !280, file: !178, line: 65, baseType: !42, size: 32, offset: 288)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !280, file: !178, line: 66, baseType: !42, size: 32, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !280, file: !178, line: 67, baseType: !42, size: 32, offset: 352)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !280, file: !178, line: 68, baseType: !18, size: 32, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !280, file: !178, line: 69, baseType: !42, size: 32, offset: 416)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !280, file: !178, line: 70, baseType: !42, size: 32, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !280, file: !178, line: 71, baseType: !18, size: 32, offset: 480)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !280, file: !178, line: 72, baseType: !42, size: 32, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !280, file: !178, line: 73, baseType: !42, size: 32, offset: 544)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !280, file: !178, line: 74, baseType: !18, size: 32, offset: 576)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !280, file: !178, line: 75, baseType: !18, size: 32, offset: 608)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !280, file: !178, line: 76, baseType: !304, size: 3296, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !178, line: 50, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 38, size: 3296, elements: !306)
!306 = !{!307, !308, !309, !310, !314, !315, !316, !317, !318, !319}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !305, file: !178, line: 40, baseType: !42, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !305, file: !178, line: 41, baseType: !42, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !305, file: !178, line: 42, baseType: !42, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !305, file: !178, line: 43, baseType: !311, size: 1024, offset: 96)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 1024, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !305, file: !178, line: 44, baseType: !311, size: 1024, offset: 1120)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !305, file: !178, line: 45, baseType: !311, size: 1024, offset: 2144)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !305, file: !178, line: 46, baseType: !42, size: 32, offset: 3168)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !305, file: !178, line: 47, baseType: !42, size: 32, offset: 3200)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !305, file: !178, line: 48, baseType: !42, size: 32, offset: 3232)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !305, file: !178, line: 49, baseType: !42, size: 32, offset: 3264)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !280, file: !178, line: 77, baseType: !18, size: 32, offset: 3936)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !280, file: !178, line: 78, baseType: !304, size: 3296, offset: 3968)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !280, file: !178, line: 80, baseType: !18, size: 32, offset: 7264)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !280, file: !178, line: 81, baseType: !18, size: 32, offset: 7296)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !280, file: !178, line: 82, baseType: !18, size: 32, offset: 7328)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !280, file: !178, line: 83, baseType: !18, size: 32, offset: 7360)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !280, file: !178, line: 84, baseType: !42, size: 32, offset: 7392)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !280, file: !178, line: 85, baseType: !42, size: 32, offset: 7424)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !280, file: !178, line: 86, baseType: !42, size: 32, offset: 7456)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !280, file: !178, line: 87, baseType: !42, size: 32, offset: 7488)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !280, file: !178, line: 88, baseType: !42, size: 32, offset: 7520)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !280, file: !178, line: 89, baseType: !42, size: 32, offset: 7552)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !234, file: !178, line: 193, baseType: !42, size: 32, offset: 32960)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !234, file: !178, line: 195, baseType: !18, size: 32, offset: 32992)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !88, file: !79, line: 571, baseType: !335, size: 1056768, offset: 192)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 1056768, elements: !312)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !88, file: !79, line: 572, baseType: !337, size: 4538368, offset: 1056960)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 4538368, elements: !263)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !88, file: !79, line: 575, baseType: !339, size: 64, offset: 5595328)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !178, line: 256, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !178, line: 228, size: 37312, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !363, !364, !365, !366}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !341, file: !178, line: 230, baseType: !233, size: 33024)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !341, file: !178, line: 232, baseType: !42, size: 32, offset: 33024)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !341, file: !178, line: 233, baseType: !18, size: 32, offset: 33056)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !341, file: !178, line: 234, baseType: !162, size: 64, offset: 33088)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !341, file: !178, line: 235, baseType: !162, size: 64, offset: 33152)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !341, file: !178, line: 236, baseType: !349, size: 64, offset: 33216)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !341, file: !178, line: 237, baseType: !162, size: 64, offset: 33280)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !341, file: !178, line: 238, baseType: !349, size: 64, offset: 33344)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !341, file: !178, line: 240, baseType: !162, size: 64, offset: 33408)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !341, file: !178, line: 241, baseType: !349, size: 64, offset: 33472)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !341, file: !178, line: 242, baseType: !162, size: 64, offset: 33536)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !341, file: !178, line: 243, baseType: !349, size: 64, offset: 33600)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !341, file: !178, line: 245, baseType: !18, size: 32, offset: 33664)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !341, file: !178, line: 246, baseType: !162, size: 64, offset: 33728)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !341, file: !178, line: 247, baseType: !162, size: 64, offset: 33792)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !341, file: !178, line: 248, baseType: !349, size: 64, offset: 33856)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !341, file: !178, line: 249, baseType: !349, size: 64, offset: 33920)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !341, file: !178, line: 250, baseType: !362, size: 64, offset: 33984)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !341, file: !178, line: 251, baseType: !349, size: 64, offset: 34048)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !341, file: !178, line: 253, baseType: !42, size: 32, offset: 34112)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !341, file: !178, line: 254, baseType: !18, size: 32, offset: 34144)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !341, file: !178, line: 255, baseType: !367, size: 3136, offset: 34176)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !178, line: 226, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !178, line: 200, size: 3136, elements: !369)
!369 = !{!370, !371, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !389, !390, !392, !393, !394, !395}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !368, file: !178, line: 202, baseType: !18, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !368, file: !178, line: 203, baseType: !372, size: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !368, file: !178, line: 204, baseType: !162, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !368, file: !178, line: 205, baseType: !349, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !368, file: !178, line: 206, baseType: !372, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !368, file: !178, line: 207, baseType: !162, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !368, file: !178, line: 208, baseType: !162, size: 64, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !368, file: !178, line: 209, baseType: !372, size: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !368, file: !178, line: 210, baseType: !372, size: 64, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !368, file: !178, line: 211, baseType: !372, size: 64, offset: 576)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !368, file: !178, line: 212, baseType: !372, size: 64, offset: 640)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !368, file: !178, line: 213, baseType: !372, size: 64, offset: 704)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !368, file: !178, line: 216, baseType: !373, size: 8, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !368, file: !178, line: 217, baseType: !373, size: 8, offset: 776)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !368, file: !178, line: 218, baseType: !373, size: 8, offset: 784)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !368, file: !178, line: 219, baseType: !388, size: 1024, offset: 800)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 1024, elements: !312)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !368, file: !178, line: 220, baseType: !388, size: 1024, offset: 1824)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !368, file: !178, line: 221, baseType: !391, size: 256, offset: 2848)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 256, elements: !312)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !368, file: !178, line: 222, baseType: !373, size: 8, offset: 3104)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !368, file: !178, line: 223, baseType: !373, size: 8, offset: 3112)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !368, file: !178, line: 224, baseType: !373, size: 8, offset: 3120)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !368, file: !178, line: 225, baseType: !373, size: 8, offset: 3128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !88, file: !79, line: 577, baseType: !397, size: 1193984, offset: 5595392)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 1193984, elements: !312)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !88, file: !79, line: 578, baseType: !18, size: 32, offset: 6789376)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !88, file: !79, line: 579, baseType: !18, size: 32, offset: 6789408)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !88, file: !79, line: 580, baseType: !18, size: 32, offset: 6789440)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !88, file: !79, line: 581, baseType: !18, size: 32, offset: 6789472)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !88, file: !79, line: 584, baseType: !403, size: 64, offset: 6789504)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !79, line: 584, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !88, file: !79, line: 586, baseType: !406, size: 64, offset: 6789568)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !79, line: 902, size: 416, elements: !408)
!408 = !{!409, !410, !411, !412, !413, !414, !418, !419, !420, !421, !422, !423, !424}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !407, file: !79, line: 904, baseType: !42, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !407, file: !79, line: 905, baseType: !42, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !407, file: !79, line: 906, baseType: !18, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !407, file: !79, line: 907, baseType: !42, size: 32, offset: 96)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !407, file: !79, line: 908, baseType: !18, size: 32, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !407, file: !79, line: 909, baseType: !415, size: 64, offset: 160)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 2)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !407, file: !79, line: 910, baseType: !218, size: 8, offset: 224)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !407, file: !79, line: 911, baseType: !218, size: 8, offset: 232)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !407, file: !79, line: 912, baseType: !18, size: 32, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !407, file: !79, line: 913, baseType: !18, size: 32, offset: 288)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !407, file: !79, line: 915, baseType: !18, size: 32, offset: 320)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !407, file: !79, line: 916, baseType: !18, size: 32, offset: 352)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !407, file: !79, line: 917, baseType: !18, size: 32, offset: 384)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !88, file: !79, line: 587, baseType: !426, size: 64, offset: 6789632)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !79, line: 839, size: 512, elements: !428)
!428 = !{!429, !430, !433, !434, !435, !436}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !427, file: !79, line: 841, baseType: !18, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !427, file: !79, line: 842, baseType: !431, size: 96, offset: 32)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 96, elements: !118)
!432 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !427, file: !79, line: 843, baseType: !431, size: 96, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !427, file: !79, line: 844, baseType: !431, size: 96, offset: 224)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !427, file: !79, line: 845, baseType: !431, size: 96, offset: 320)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !427, file: !79, line: 846, baseType: !431, size: 96, offset: 416)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !88, file: !79, line: 588, baseType: !18, size: 32, offset: 6789696)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !88, file: !79, line: 591, baseType: !42, size: 32, offset: 6789728)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !88, file: !79, line: 592, baseType: !18, size: 32, offset: 6789760)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !88, file: !79, line: 593, baseType: !18, size: 32, offset: 6789792)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !88, file: !79, line: 594, baseType: !18, size: 32, offset: 6789824)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !88, file: !79, line: 595, baseType: !443, size: 64, offset: 6789888)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !79, line: 542, baseType: !84)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !88, file: !79, line: 596, baseType: !372, size: 64, offset: 6789952)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block_JV", scope: !88, file: !79, line: 597, baseType: !448, size: 192, offset: 6790016)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 192, elements: !118)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, file: !79, line: 601, baseType: !18, size: 32, offset: 6790208)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !88, file: !79, line: 602, baseType: !18, size: 32, offset: 6790240)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !88, file: !79, line: 603, baseType: !18, size: 32, offset: 6790272)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !88, file: !79, line: 604, baseType: !18, size: 32, offset: 6790304)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !88, file: !79, line: 605, baseType: !18, size: 32, offset: 6790336)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !88, file: !79, line: 607, baseType: !455, size: 64, offset: 6790400)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode_JV", scope: !88, file: !79, line: 608, baseType: !457, size: 192, offset: 6790464)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 192, elements: !118)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !88, file: !79, line: 609, baseType: !459, size: 64, offset: 6790656)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "siblock", scope: !88, file: !79, line: 610, baseType: !349, size: 64, offset: 6790720)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "siblock_JV", scope: !88, file: !79, line: 611, baseType: !463, size: 192, offset: 6790784)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 192, elements: !118)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "newframe", scope: !88, file: !79, line: 613, baseType: !18, size: 32, offset: 6790976)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !88, file: !79, line: 614, baseType: !18, size: 32, offset: 6791008)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "pNextSlice", scope: !88, file: !79, line: 617, baseType: !444, size: 64, offset: 6791040)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !88, file: !79, line: 618, baseType: !77, size: 64, offset: 6791104)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data_JV", scope: !88, file: !79, line: 619, baseType: !469, size: 192, offset: 6791168)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 192, elements: !118)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaArrayType", scope: !88, file: !79, line: 621, baseType: !18, size: 32, offset: 6791360)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_head", scope: !88, file: !79, line: 626, baseType: !472, size: 64, offset: 6791424)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !79, line: 626, flags: DIFlagFwdDecl)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_end", scope: !88, file: !79, line: 627, baseType: !472, size: 64, offset: 6791488)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !88, file: !79, line: 629, baseType: !42, size: 32, offset: 6791552)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "non_conforming_stream", scope: !88, file: !79, line: 630, baseType: !18, size: 32, offset: 6791584)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntMsb", scope: !88, file: !79, line: 634, baseType: !18, size: 32, offset: 6791616)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntLsb", scope: !88, file: !79, line: 635, baseType: !42, size: 32, offset: 6791648)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedPicOrderCnt", scope: !88, file: !79, line: 638, baseType: !18, size: 32, offset: 6791680)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntCycleCnt", scope: !88, file: !79, line: 638, baseType: !18, size: 32, offset: 6791712)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumInPicOrderCntCycle", scope: !88, file: !79, line: 638, baseType: !18, size: 32, offset: 6791744)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNum", scope: !88, file: !79, line: 639, baseType: !42, size: 32, offset: 6791776)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumOffset", scope: !88, file: !79, line: 639, baseType: !42, size: 32, offset: 6791808)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDeltaPerPicOrderCntCycle", scope: !88, file: !79, line: 640, baseType: !18, size: 32, offset: 6791840)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !88, file: !79, line: 641, baseType: !18, size: 32, offset: 6791872)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNumOffset", scope: !88, file: !79, line: 642, baseType: !18, size: 32, offset: 6791904)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFrameNum", scope: !88, file: !79, line: 645, baseType: !18, size: 32, offset: 6791936)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !88, file: !79, line: 647, baseType: !42, size: 32, offset: 6791968)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !88, file: !79, line: 648, baseType: !42, size: 32, offset: 6792000)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !88, file: !79, line: 649, baseType: !42, size: 32, offset: 6792032)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !88, file: !79, line: 650, baseType: !42, size: 32, offset: 6792064)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !88, file: !79, line: 651, baseType: !42, size: 32, offset: 6792096)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !88, file: !79, line: 652, baseType: !42, size: 32, offset: 6792128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "oldFrameSizeInMbs", scope: !88, file: !79, line: 653, baseType: !42, size: 32, offset: 6792160)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !88, file: !79, line: 655, baseType: !18, size: 32, offset: 6792192)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !88, file: !79, line: 657, baseType: !18, size: 32, offset: 6792224)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !88, file: !79, line: 658, baseType: !18, size: 32, offset: 6792256)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_bitsize_on_disk", scope: !88, file: !79, line: 661, baseType: !18, size: 32, offset: 6792288)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !88, file: !79, line: 662, baseType: !500, size: 16, offset: 6792320)
!500 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !88, file: !79, line: 663, baseType: !500, size: 16, offset: 6792336)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_scale", scope: !88, file: !79, line: 664, baseType: !415, size: 64, offset: 6792352)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !88, file: !79, line: 665, baseType: !18, size: 32, offset: 6792416)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !88, file: !79, line: 666, baseType: !18, size: 32, offset: 6792448)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value_comp", scope: !88, file: !79, line: 667, baseType: !506, size: 96, offset: 6792480)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 96, elements: !118)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "max_pel_value_comp", scope: !88, file: !79, line: 668, baseType: !117, size: 96, offset: 6792576)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !88, file: !79, line: 670, baseType: !18, size: 32, offset: 6792672)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !88, file: !79, line: 671, baseType: !18, size: 32, offset: 6792704)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !88, file: !79, line: 672, baseType: !18, size: 32, offset: 6792736)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !88, file: !79, line: 673, baseType: !18, size: 32, offset: 6792768)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "num_uv_blocks", scope: !88, file: !79, line: 674, baseType: !18, size: 32, offset: 6792800)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !88, file: !79, line: 675, baseType: !18, size: 32, offset: 6792832)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !88, file: !79, line: 676, baseType: !18, size: 32, offset: 6792864)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !88, file: !79, line: 677, baseType: !18, size: 32, offset: 6792896)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x_blk", scope: !88, file: !79, line: 678, baseType: !18, size: 32, offset: 6792928)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y_blk", scope: !88, file: !79, line: 679, baseType: !18, size: 32, offset: 6792960)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !88, file: !79, line: 680, baseType: !519, size: 192, offset: 6792992)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 192, elements: !520)
!520 = !{!119, !417}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_blk", scope: !88, file: !79, line: 681, baseType: !519, size: 192, offset: 6793184)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_shift", scope: !88, file: !79, line: 682, baseType: !519, size: 192, offset: 6793376)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_x", scope: !88, file: !79, line: 683, baseType: !18, size: 32, offset: 6793568)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_y", scope: !88, file: !79, line: 684, baseType: !18, size: 32, offset: 6793600)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_x", scope: !88, file: !79, line: 685, baseType: !18, size: 32, offset: 6793632)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_y", scope: !88, file: !79, line: 686, baseType: !18, size: 32, offset: 6793664)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "total_scale", scope: !88, file: !79, line: 687, baseType: !18, size: 32, offset: 6793696)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "max_vmv_r", scope: !88, file: !79, line: 689, baseType: !18, size: 32, offset: 6793728)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "idr_psnr_number", scope: !88, file: !79, line: 692, baseType: !18, size: 32, offset: 6793760)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "psnr_number", scope: !88, file: !79, line: 693, baseType: !18, size: 32, offset: 6793792)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "last_ref_pic_poc", scope: !88, file: !79, line: 700, baseType: !18, size: 32, offset: 6793824)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !88, file: !79, line: 701, baseType: !18, size: 32, offset: 6793856)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !88, file: !79, line: 702, baseType: !18, size: 32, offset: 6793888)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !88, file: !79, line: 703, baseType: !18, size: 32, offset: 6793920)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "earlier_missing_poc", scope: !88, file: !79, line: 704, baseType: !18, size: 32, offset: 6793952)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_conceal", scope: !88, file: !79, line: 705, baseType: !42, size: 32, offset: 6793984)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "IDR_concealment_flag", scope: !88, file: !79, line: 706, baseType: !18, size: 32, offset: 6794016)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_slice_type", scope: !88, file: !79, line: 707, baseType: !18, size: 32, offset: 6794048)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point", scope: !88, file: !79, line: 710, baseType: !18, size: 32, offset: 6794080)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point_found", scope: !88, file: !79, line: 711, baseType: !18, size: 32, offset: 6794112)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_cnt", scope: !88, file: !79, line: 712, baseType: !18, size: 32, offset: 6794144)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_num", scope: !88, file: !79, line: 713, baseType: !18, size: 32, offset: 6794176)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_poc", scope: !88, file: !79, line: 714, baseType: !18, size: 32, offset: 6794208)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !88, file: !79, line: 716, baseType: !18, size: 32, offset: 6794240)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !88, file: !79, line: 717, baseType: !18, size: 32, offset: 6794272)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !88, file: !79, line: 719, baseType: !217, size: 64, offset: 6794304)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !88, file: !79, line: 720, baseType: !217, size: 64, offset: 6794368)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "imgData", scope: !88, file: !79, line: 722, baseType: !549, size: 2560, offset: 6794432)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageData", file: !550, line: 38, baseType: !551)
!550 = !DIFile(filename: "ldecod_src/inc/io_image.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "8caef624e6f5391b0c6ab2984e7f77c6")
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "image_data", file: !550, line: 20, size: 2560, elements: !552)
!552 = !{!553, !554, !558, !559, !560, !564, !565, !566, !567, !568}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !551, file: !550, line: 22, baseType: !107, size: 1088)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "frm_data", scope: !551, file: !550, line: 24, baseType: !555, size: 192, offset: 1088)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 192, elements: !118)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "top_data", scope: !551, file: !550, line: 25, baseType: !555, size: 192, offset: 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "bot_data", scope: !551, file: !550, line: 26, baseType: !555, size: 192, offset: 1472)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "frm_uint16", scope: !551, file: !550, line: 31, baseType: !561, size: 192, offset: 1664)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 192, elements: !118)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "top_uint16", scope: !551, file: !550, line: 32, baseType: !561, size: 192, offset: 1856)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "bot_uint16", scope: !551, file: !550, line: 33, baseType: !561, size: 192, offset: 2048)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "frm_stride", scope: !551, file: !550, line: 35, baseType: !117, size: 96, offset: 2240)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "top_stride", scope: !551, file: !550, line: 36, baseType: !117, size: 96, offset: 2336)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "bot_stride", scope: !551, file: !550, line: 37, baseType: !117, size: 96, offset: 2432)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "imgData0", scope: !88, file: !79, line: 723, baseType: !549, size: 2560, offset: 6796992)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "imgData1", scope: !88, file: !79, line: 724, baseType: !549, size: 2560, offset: 6799552)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "imgData2", scope: !88, file: !79, line: 725, baseType: !549, size: 2560, offset: 6802112)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "imgData32", scope: !88, file: !79, line: 728, baseType: !549, size: 2560, offset: 6804672)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "imgData4", scope: !88, file: !79, line: 729, baseType: !549, size: 2560, offset: 6807232)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "imgData5", scope: !88, file: !79, line: 730, baseType: !549, size: 2560, offset: 6809792)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "imgData6", scope: !88, file: !79, line: 731, baseType: !549, size: 2560, offset: 6812352)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "previous_frame_num", scope: !88, file: !79, line: 735, baseType: !42, size: 32, offset: 6814912)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Is_primary_correct", scope: !88, file: !79, line: 737, baseType: !18, size: 32, offset: 6814944)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "Is_redundant_correct", scope: !88, file: !79, line: 738, baseType: !18, size: 32, offset: 6814976)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "tot_time", scope: !88, file: !79, line: 741, baseType: !580, size: 64, offset: 6815040)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !581, line: 103, baseType: !582)
!581 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !583, line: 27, baseType: !584)
!583 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !585, line: 44, baseType: !586)
!585 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!586 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "p_out", scope: !88, file: !79, line: 744, baseType: !18, size: 32, offset: 6815104)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "p_out_mvc", scope: !88, file: !79, line: 746, baseType: !589, size: 32768, offset: 6815136)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 32768, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 1024)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "p_ref", scope: !88, file: !79, line: 748, baseType: !18, size: 32, offset: 6847904)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessUnitExists", scope: !88, file: !79, line: 751, baseType: !18, size: 32, offset: 6847936)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "NALUCount", scope: !88, file: !79, line: 752, baseType: !18, size: 32, offset: 6847968)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Bframe_ctr", scope: !88, file: !79, line: 755, baseType: !18, size: 32, offset: 6848000)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "frame_no", scope: !88, file: !79, line: 756, baseType: !18, size: 32, offset: 6848032)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "g_nFrame", scope: !88, file: !79, line: 758, baseType: !18, size: 32, offset: 6848064)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "global_init_done", scope: !88, file: !79, line: 759, baseType: !18, size: 32, offset: 6848096)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ref", scope: !88, file: !79, line: 762, baseType: !556, size: 64, offset: 6848128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV_ref", scope: !88, file: !79, line: 763, baseType: !601, size: 64, offset: 6848192)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "qp_per_matrix", scope: !88, file: !79, line: 765, baseType: !162, size: 64, offset: 6848256)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "qp_rem_matrix", scope: !88, file: !79, line: 766, baseType: !162, size: 64, offset: 6848320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "last_out_fs", scope: !88, file: !79, line: 768, baseType: !605, size: 64, offset: 6848384)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !607, line: 152, size: 768, elements: !608)
!607 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !739, !740, !741, !742, !743}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !606, file: !607, line: 154, baseType: !18, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !606, file: !607, line: 155, baseType: !18, size: 32, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !606, file: !607, line: 156, baseType: !18, size: 32, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !606, file: !607, line: 157, baseType: !18, size: 32, offset: 96)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !606, file: !607, line: 159, baseType: !18, size: 32, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !606, file: !607, line: 161, baseType: !42, size: 32, offset: 160)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !606, file: !607, line: 162, baseType: !42, size: 32, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !606, file: !607, line: 164, baseType: !18, size: 32, offset: 224)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !606, file: !607, line: 165, baseType: !18, size: 32, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !606, file: !607, line: 166, baseType: !18, size: 32, offset: 288)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !606, file: !607, line: 167, baseType: !18, size: 32, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !606, file: !607, line: 170, baseType: !18, size: 32, offset: 352)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !606, file: !607, line: 172, baseType: !622, size: 64, offset: 384)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !607, line: 138, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !607, line: 46, size: 3328, elements: !625)
!625 = !{!626, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !679, !681, !685, !687, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !624, file: !607, line: 48, baseType: !627, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !41, line: 140, baseType: !40)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !624, file: !607, line: 50, baseType: !18, size: 32, offset: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !624, file: !607, line: 51, baseType: !18, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !624, file: !607, line: 52, baseType: !18, size: 32, offset: 96)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !624, file: !607, line: 53, baseType: !18, size: 32, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !624, file: !607, line: 54, baseType: !42, size: 32, offset: 160)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !624, file: !607, line: 55, baseType: !42, size: 32, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !624, file: !607, line: 57, baseType: !18, size: 32, offset: 224)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !624, file: !607, line: 58, baseType: !18, size: 32, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !624, file: !607, line: 59, baseType: !18, size: 32, offset: 288)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !624, file: !607, line: 61, baseType: !218, size: 8, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !624, file: !607, line: 62, baseType: !18, size: 32, offset: 352)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !624, file: !607, line: 63, baseType: !18, size: 32, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !624, file: !607, line: 64, baseType: !18, size: 32, offset: 416)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !624, file: !607, line: 65, baseType: !18, size: 32, offset: 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !624, file: !607, line: 67, baseType: !500, size: 16, offset: 480)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !624, file: !607, line: 69, baseType: !18, size: 32, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !624, file: !607, line: 69, baseType: !18, size: 32, offset: 544)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !624, file: !607, line: 69, baseType: !18, size: 32, offset: 576)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !624, file: !607, line: 69, baseType: !18, size: 32, offset: 608)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !624, file: !607, line: 70, baseType: !18, size: 32, offset: 640)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !624, file: !607, line: 70, baseType: !18, size: 32, offset: 672)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !624, file: !607, line: 70, baseType: !18, size: 32, offset: 704)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !624, file: !607, line: 70, baseType: !18, size: 32, offset: 736)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !624, file: !607, line: 71, baseType: !18, size: 32, offset: 768)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !624, file: !607, line: 72, baseType: !18, size: 32, offset: 800)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !624, file: !607, line: 73, baseType: !42, size: 32, offset: 832)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !624, file: !607, line: 74, baseType: !42, size: 32, offset: 864)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !624, file: !607, line: 75, baseType: !18, size: 32, offset: 896)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !624, file: !607, line: 75, baseType: !18, size: 32, offset: 928)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !624, file: !607, line: 76, baseType: !18, size: 32, offset: 960)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !624, file: !607, line: 76, baseType: !18, size: 32, offset: 992)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !624, file: !607, line: 79, baseType: !556, size: 64, offset: 1024)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !624, file: !607, line: 80, baseType: !601, size: 64, offset: 1088)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !624, file: !607, line: 81, baseType: !601, size: 64, offset: 1152)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !624, file: !607, line: 84, baseType: !663, size: 64, offset: 1216)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !607, line: 36, size: 256, elements: !666)
!666 = !{!667, !670, !677}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !665, file: !607, line: 38, baseType: !668, size: 128)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 128, elements: !416)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !665, file: !607, line: 39, baseType: !671, size: 64, offset: 128)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 64, elements: !416)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !79, line: 104, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 100, size: 32, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !673, file: !79, line: 102, baseType: !500, size: 16)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !673, file: !79, line: 103, baseType: !500, size: 16, offset: 16)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !665, file: !607, line: 40, baseType: !678, size: 16, offset: 192)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 16, elements: !416)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !624, file: !607, line: 85, baseType: !680, size: 192, offset: 1280)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 192, elements: !118)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !624, file: !607, line: 87, baseType: !682, size: 64, offset: 1472)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !607, line: 29, size: 64, elements: !683)
!683 = !{!684}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !682, file: !607, line: 31, baseType: !217, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !624, file: !607, line: 88, baseType: !686, size: 192, offset: 1536)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 192, elements: !118)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !624, file: !607, line: 90, baseType: !688, size: 64, offset: 1728)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !624, file: !607, line: 92, baseType: !669, size: 64, offset: 1792)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !624, file: !607, line: 93, baseType: !669, size: 64, offset: 1856)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !624, file: !607, line: 94, baseType: !669, size: 64, offset: 1920)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !624, file: !607, line: 96, baseType: !18, size: 32, offset: 1984)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !624, file: !607, line: 97, baseType: !18, size: 32, offset: 2016)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !624, file: !607, line: 98, baseType: !18, size: 32, offset: 2048)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !624, file: !607, line: 99, baseType: !18, size: 32, offset: 2080)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !624, file: !607, line: 100, baseType: !18, size: 32, offset: 2112)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !624, file: !607, line: 102, baseType: !18, size: 32, offset: 2144)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !624, file: !607, line: 103, baseType: !18, size: 32, offset: 2176)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !624, file: !607, line: 104, baseType: !18, size: 32, offset: 2208)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !624, file: !607, line: 105, baseType: !18, size: 32, offset: 2240)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !624, file: !607, line: 106, baseType: !18, size: 32, offset: 2272)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !624, file: !607, line: 107, baseType: !18, size: 32, offset: 2304)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !624, file: !607, line: 108, baseType: !18, size: 32, offset: 2336)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !624, file: !607, line: 109, baseType: !18, size: 32, offset: 2368)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !624, file: !607, line: 110, baseType: !415, size: 64, offset: 2400)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !624, file: !607, line: 111, baseType: !18, size: 32, offset: 2464)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !624, file: !607, line: 112, baseType: !709, size: 64, offset: 2496)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !79, line: 194, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !79, line: 186, size: 256, elements: !712)
!712 = !{!713, !714, !715, !716, !717, !718}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !711, file: !79, line: 188, baseType: !18, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !711, file: !79, line: 189, baseType: !18, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !711, file: !79, line: 190, baseType: !18, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !711, file: !79, line: 191, baseType: !18, size: 32, offset: 96)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !711, file: !79, line: 192, baseType: !18, size: 32, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !711, file: !79, line: 193, baseType: !719, size: 64, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !624, file: !607, line: 115, baseType: !18, size: 32, offset: 2560)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !624, file: !607, line: 118, baseType: !18, size: 32, offset: 2592)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !624, file: !607, line: 119, baseType: !18, size: 32, offset: 2624)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !624, file: !607, line: 120, baseType: !18, size: 32, offset: 2656)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !624, file: !607, line: 121, baseType: !557, size: 64, offset: 2688)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !624, file: !607, line: 124, baseType: !18, size: 32, offset: 2752)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !624, file: !607, line: 125, baseType: !18, size: 32, offset: 2784)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !624, file: !607, line: 126, baseType: !18, size: 32, offset: 2816)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !624, file: !607, line: 128, baseType: !18, size: 32, offset: 2848)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !624, file: !607, line: 129, baseType: !18, size: 32, offset: 2880)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !624, file: !607, line: 130, baseType: !18, size: 32, offset: 2912)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !624, file: !607, line: 131, baseType: !18, size: 32, offset: 2944)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !624, file: !607, line: 132, baseType: !556, size: 64, offset: 3008)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !624, file: !607, line: 133, baseType: !18, size: 32, offset: 3072)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !624, file: !607, line: 134, baseType: !18, size: 32, offset: 3104)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !624, file: !607, line: 136, baseType: !678, size: 16, offset: 3136)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !624, file: !607, line: 137, baseType: !737, size: 128, offset: 3200)
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !738, size: 128, elements: !416)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !606, file: !607, line: 173, baseType: !622, size: 64, offset: 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !606, file: !607, line: 174, baseType: !622, size: 64, offset: 512)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !606, file: !607, line: 177, baseType: !18, size: 32, offset: 576)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !606, file: !607, line: 178, baseType: !415, size: 64, offset: 608)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !606, file: !607, line: 179, baseType: !415, size: 64, offset: 672)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pocs_in_dpb", scope: !88, file: !79, line: 769, baseType: !745, size: 3200, offset: 6848448)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 3200, elements: !746)
!746 = !{!747}
!747 = !DISubrange(count: 100)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture", scope: !88, file: !79, line: 771, baseType: !669, size: 64, offset: 6851648)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture_JV", scope: !88, file: !79, line: 772, baseType: !750, size: 192, offset: 6851712)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 192, elements: !118)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "no_reference_picture", scope: !88, file: !79, line: 773, baseType: !669, size: 64, offset: 6851904)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "erc_object_list", scope: !88, file: !79, line: 776, baseType: !753, size: 64, offset: 6851968)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DICompositeType(tag: DW_TAG_structure_type, name: "object_buffer", file: !79, line: 776, flags: DIFlagFwdDecl)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "erc_errorVar", scope: !88, file: !79, line: 777, baseType: !756, size: 64, offset: 6852032)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "ercVariables_s", file: !79, line: 777, flags: DIFlagFwdDecl)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "erc_mvperMB", scope: !88, file: !79, line: 779, baseType: !18, size: 32, offset: 6852096)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "erc_img", scope: !88, file: !79, line: 780, baseType: !87, size: 64, offset: 6852160)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ec_flag", scope: !88, file: !79, line: 781, baseType: !761, size: 640, offset: 6852224)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 640, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 20)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "annex_b", scope: !88, file: !79, line: 783, baseType: !765, size: 64, offset: 6852864)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "annex_b_struct", file: !79, line: 783, flags: DIFlagFwdDecl)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "bitsfile", scope: !88, file: !79, line: 784, baseType: !768, size: 64, offset: 6852928)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DICompositeType(tag: DW_TAG_structure_type, name: "sBitsFile", file: !79, line: 784, flags: DIFlagFwdDecl)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "out_buffer", scope: !88, file: !79, line: 786, baseType: !605, size: 64, offset: 6852992)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output", scope: !88, file: !79, line: 788, baseType: !669, size: 64, offset: 6853056)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output_state", scope: !88, file: !79, line: 789, baseType: !18, size: 32, offset: 6853120)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_flag", scope: !88, file: !79, line: 790, baseType: !18, size: 32, offset: 6853152)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "BitStreamFile", scope: !88, file: !79, line: 792, baseType: !18, size: 32, offset: 6853184)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !88, file: !79, line: 794, baseType: !776, size: 64, offset: 6853248)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !607, line: 186, size: 33408, elements: !778)
!778 = !{!779, !782, !785, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !777, file: !607, line: 188, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !79, line: 836, baseType: !88)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !777, file: !607, line: 189, baseType: !783, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !79, line: 900, baseType: !92)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !777, file: !607, line: 190, baseType: !786, size: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !607, line: 182, baseType: !606)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ref", scope: !777, file: !607, line: 191, baseType: !786, size: 64, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ltref", scope: !777, file: !607, line: 192, baseType: !786, size: 64, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !777, file: !607, line: 193, baseType: !42, size: 32, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !777, file: !607, line: 194, baseType: !42, size: 32, offset: 352)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frames_in_buffer", scope: !777, file: !607, line: 195, baseType: !42, size: 32, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "ltref_frames_in_buffer", scope: !777, file: !607, line: 196, baseType: !42, size: 32, offset: 416)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_poc", scope: !777, file: !607, line: 197, baseType: !18, size: 32, offset: 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_view_id", scope: !777, file: !607, line: 199, baseType: !18, size: 32, offset: 480)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_pic_idx", scope: !777, file: !607, line: 200, baseType: !589, size: 32768, offset: 512)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "init_done", scope: !777, file: !607, line: 205, baseType: !18, size: 32, offset: 33280)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !777, file: !607, line: 206, baseType: !18, size: 32, offset: 33312)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "last_picture", scope: !777, file: !607, line: 208, baseType: !787, size: 64, offset: 33344)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb_legacy", scope: !88, file: !79, line: 795, baseType: !776, size: 64, offset: 6853312)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb_layer", scope: !88, file: !79, line: 796, baseType: !803, size: 128, offset: 6853376)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 128, elements: !416)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "cslice_type", scope: !88, file: !79, line: 800, baseType: !805, size: 72, offset: 6853504)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 9)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "MbToSliceGroupMap", scope: !88, file: !79, line: 802, baseType: !162, size: 64, offset: 6853632)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "MapUnitToSliceGroupMap", scope: !88, file: !79, line: 803, baseType: !162, size: 64, offset: 6853696)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSliceGroups", scope: !88, file: !79, line: 804, baseType: !18, size: 32, offset: 6853760)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "seiToneMapping", scope: !88, file: !79, line: 807, baseType: !812, size: 64, offset: 6853824)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "tone_mapping_struct_s", file: !79, line: 807, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "buf2img", scope: !88, file: !79, line: 810, baseType: !815, size: 64, offset: 6853888)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DISubroutineType(types: !817)
!817 = !{null, !556, !818, !18, !18, !18, !18, !18, !18}
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "getNeighbour", scope: !88, file: !79, line: 811, baseType: !820, size: 64, offset: 6853952)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !77, !18, !18, !162, !823}
