; ModuleID = 'ldecod_src/intra16x16_pred.c'
source_filename = "ldecod_src/intra16x16_pred.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

; Function Attrs: nounwind uwtable
define dso_local i32 @intrapred16x16(ptr noundef %currMB, i32 noundef %pl, i32 noundef %predmode) local_unnamed_addr #0 !dbg !50 {
entry:
    #dbg_value(ptr %currMB, !1238, !DIExpression(), !1241)
    #dbg_value(i32 %pl, !1239, !DIExpression(), !1241)
    #dbg_value(i32 %predmode, !1240, !DIExpression(), !1241)
  %0 = load ptr, ptr %currMB, align 8, !dbg !1242
  %mb_aff_frame_flag = getelementptr inbounds i8, ptr %0, i64 128, !dbg !1244
  %1 = load i32, ptr %mb_aff_frame_flag, align 8, !dbg !1244
  %tobool.not = icmp eq i32 %1, 0, !dbg !1245
  br i1 %tobool.not, label %if.else, label %if.then, !dbg !1246

if.then:                                          ; preds = %entry
  %call = tail call i32 @intrapred_16x16_mbaff(ptr noundef nonnull %currMB, i32 noundef %pl, i32 noundef %predmode) #2, !dbg !1247
  br label %return, !dbg !1249

if.else:                                          ; preds = %entry
  %call1 = tail call i32 @intrapred_16x16_normal(ptr noundef nonnull %currMB, i32 noundef %pl, i32 noundef %predmode) #2, !dbg !1250
  br label %return, !dbg !1252

return:                                           ; preds = %if.else, %if.then

!26 = !DIEnumerator(name: "VIDEO_AVI", value: 4)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 135, baseType: !29, size: 32, elements: !30)
!28 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!29 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!30 = !{!31, !32, !33}
!31 = !DIEnumerator(name: "FRAME", value: 0)
!32 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!33 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 22, baseType: !29, size: 32, elements: !35)
!35 = !{!36, !37, !38, !39, !40, !41}
!36 = !DIEnumerator(name: "PLANE_Y", value: 0)
!37 = !DIEnumerator(name: "PLANE_U", value: 1)
!38 = !DIEnumerator(name: "PLANE_V", value: 2)
!39 = !DIEnumerator(name: "PLANE_G", value: 0)
!40 = !DIEnumerator(name: "PLANE_B", value: 1)
!41 = !DIEnumerator(name: "PLANE_R", value: 2)
!42 = !{i32 7, !"Dwarf Version", i32 5}
!43 = !{i32 2, !"Debug Info Version", i32 3}
!44 = !{i32 1, !"wchar_size", i32 4}
!45 = !{i32 8, !"PIC Level", i32 2}
!46 = !{i32 7, !"PIE Level", i32 2}
!47 = !{i32 7, !"uwtable", i32 2}
!48 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!49 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!50 = distinct !DISubprogram(name: "intrapred16x16", scope: !1, file: !1, line: 34, type: !51, scopeLine: 37, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1237)
!51 = !DISubroutineType(types: !52)
!52 = !{!5, !53, !827, !5}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !55, line: 273, baseType: !56)
!55 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !55, line: 197, size: 3840, elements: !57)
!57 = !{!58, !1153, !1154, !1155, !1156, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1185, !1186, !1187, !1188, !1189, !1192, !1193, !1195, !1196, !1197, !1198, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1222, !1223, !1228, !1232, !1236}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !56, file: !55, line: 199, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !55, line: 341, size: 109184, elements: !61)
!61 = !{!62, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !927, !929, !982, !1012, !1039, !1042, !1043, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1078, !1079, !1080, !1081, !1082, !1083, !1086, !1087, !1090, !1091, !1093, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1106, !1107, !1108, !1109, !1110, !1112, !1113, !1114, !1118, !1122, !1126, !1130, !1134, !1135, !1136, !1137, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !60, file: !55, line: 343, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !55, line: 566, size: 6855040, elements: !65)
!65 = !{!66, !152, !209, !313, !315, !317, !375, !377, !378, !379, !380, !381, !384, !404, !416, !417, !418, !419, !420, !421, !425, !426, !428, !429, !430, !431, !432, !433, !435, !437, !440, !441, !443, !444, !445, !446, !447, !449, !450, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !480, !481, !482, !483, !484, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !568, !569, !573, !574, !575, !576, !577, !578, !579, !580, !581, !583, !584, !585, !725, !729, !730, !732, !733, !736, !739, !740, !741, !745, !748, !751, !752, !753, !754, !755, !756, !782, !783, !785, !789, !790, !791, !792, !795, !800, !814, !818, !822, !823, !828, !829, !833, !834, !838, !859, !860, !863, !864, !865, !866, !867, !868, !869, !870}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !64, file: !55, line: 568, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !55, line: 850, size: 32128, elements: !69)
!69 = !{!70, !75, !76, !77, !78, !79, !80, !81, !82, !83, !113, !114, !115, !116, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !68, file: !55, line: 852, baseType: !71, size: 2040)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 2040, elements: !73)
!72 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!73 = !{!74}
!74 = !DISubrange(count: 255)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !68, file: !55, line: 853, baseType: !71, size: 2040, offset: 2040)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !68, file: !55, line: 854, baseType: !71, size: 2040, offset: 4080)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !68, file: !55, line: 856, baseType: !5, size: 32, offset: 6144)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !68, file: !55, line: 857, baseType: !5, size: 32, offset: 6176)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !68, file: !55, line: 858, baseType: !5, size: 32, offset: 6208)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !68, file: !55, line: 859, baseType: !5, size: 32, offset: 6240)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !68, file: !55, line: 860, baseType: !5, size: 32, offset: 6272)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !68, file: !55, line: 861, baseType: !5, size: 32, offset: 6304)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !68, file: !55, line: 864, baseType: !84, size: 1088, offset: 6336)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !4, line: 52, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !4, line: 30, size: 1088, elements: !86)
!86 = !{!87, !89, !91, !93, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !85, file: !4, line: 32, baseType: !88, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !4, line: 28, baseType: !3)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !85, file: !4, line: 33, baseType: !90, size: 32, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !4, line: 20, baseType: !12)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !85, file: !4, line: 34, baseType: !92, size: 64, offset: 64)
!92 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !85, file: !4, line: 35, baseType: !94, size: 96, offset: 128)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 96, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 3)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !85, file: !4, line: 36, baseType: !94, size: 96, offset: 224)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !85, file: !4, line: 37, baseType: !5, size: 32, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !85, file: !4, line: 38, baseType: !5, size: 32, offset: 352)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !85, file: !4, line: 39, baseType: !5, size: 32, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !85, file: !4, line: 40, baseType: !5, size: 32, offset: 416)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !85, file: !4, line: 41, baseType: !5, size: 32, offset: 448)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !85, file: !4, line: 42, baseType: !5, size: 32, offset: 480)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !85, file: !4, line: 43, baseType: !5, size: 32, offset: 512)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !85, file: !4, line: 44, baseType: !5, size: 32, offset: 544)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !85, file: !4, line: 45, baseType: !94, size: 96, offset: 576)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !85, file: !4, line: 46, baseType: !5, size: 32, offset: 672)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !85, file: !4, line: 47, baseType: !94, size: 96, offset: 704)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !85, file: !4, line: 48, baseType: !94, size: 96, offset: 800)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !85, file: !4, line: 49, baseType: !94, size: 96, offset: 896)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !85, file: !4, line: 50, baseType: !5, size: 32, offset: 992)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !85, file: !4, line: 51, baseType: !5, size: 32, offset: 1024)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !68, file: !55, line: 865, baseType: !84, size: 1088, offset: 7424)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !68, file: !55, line: 867, baseType: !5, size: 32, offset: 8512)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !68, file: !55, line: 868, baseType: !5, size: 32, offset: 8544)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !68, file: !55, line: 869, baseType: !117, size: 7744, offset: 8576)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !19, line: 60, baseType: !118)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !19, line: 34, size: 7744, elements: !119)
!119 = !{!120, !121, !122, !123, !124, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !118, file: !19, line: 37, baseType: !71, size: 2040)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !118, file: !19, line: 38, baseType: !71, size: 2040, offset: 2040)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !118, file: !19, line: 39, baseType: !71, size: 2040, offset: 4080)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !118, file: !19, line: 40, baseType: !5, size: 32, offset: 6144)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !118, file: !19, line: 41, baseType: !125, size: 32, offset: 6176)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !19, line: 32, baseType: !18)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !118, file: !19, line: 42, baseType: !84, size: 1088, offset: 6208)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !118, file: !19, line: 43, baseType: !5, size: 32, offset: 7296)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !118, file: !19, line: 44, baseType: !5, size: 32, offset: 7328)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !118, file: !19, line: 45, baseType: !5, size: 32, offset: 7360)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !118, file: !19, line: 46, baseType: !5, size: 32, offset: 7392)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !118, file: !19, line: 47, baseType: !5, size: 32, offset: 7424)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !118, file: !19, line: 48, baseType: !5, size: 32, offset: 7456)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !118, file: !19, line: 49, baseType: !5, size: 32, offset: 7488)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !118, file: !19, line: 50, baseType: !5, size: 32, offset: 7520)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !118, file: !19, line: 51, baseType: !5, size: 32, offset: 7552)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !118, file: !19, line: 52, baseType: !5, size: 32, offset: 7584)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !118, file: !19, line: 53, baseType: !5, size: 32, offset: 7616)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !118, file: !19, line: 56, baseType: !139, size: 64, offset: 7680)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !68, file: !55, line: 870, baseType: !117, size: 7744, offset: 16320)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !68, file: !55, line: 871, baseType: !117, size: 7744, offset: 24064)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !68, file: !55, line: 873, baseType: !5, size: 32, offset: 31808)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !68, file: !55, line: 884, baseType: !5, size: 32, offset: 31840)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !68, file: !55, line: 885, baseType: !5, size: 32, offset: 31872)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !68, file: !55, line: 886, baseType: !5, size: 32, offset: 31904)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !68, file: !55, line: 890, baseType: !5, size: 32, offset: 31936)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !68, file: !55, line: 893, baseType: !5, size: 32, offset: 31968)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !68, file: !55, line: 894, baseType: !5, size: 32, offset: 32000)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !68, file: !55, line: 895, baseType: !5, size: 32, offset: 32032)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !68, file: !55, line: 897, baseType: !5, size: 32, offset: 32064)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !68, file: !55, line: 899, baseType: !5, size: 32, offset: 32096)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !64, file: !55, line: 569, baseType: !153, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !155, line: 138, baseType: !156)
!155 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 94, size: 17728, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163, !164, !168, !173, !177, !180, !181, !182, !183, !184, !188, !189, !190, !191, !192, !193, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !156, file: !155, line: 96, baseType: !5, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !156, file: !155, line: 97, baseType: !29, size: 32, offset: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !156, file: !155, line: 98, baseType: !29, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !156, file: !155, line: 99, baseType: !5, size: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !156, file: !155, line: 100, baseType: !5, size: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !156, file: !155, line: 102, baseType: !5, size: 32, offset: 160)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !156, file: !155, line: 103, baseType: !165, size: 384, offset: 192)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 384, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 12)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !156, file: !155, line: 104, baseType: !169, size: 3072, offset: 576)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 3072, elements: !170)
!170 = !{!171, !172}
!171 = !DISubrange(count: 6)
!172 = !DISubrange(count: 16)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !156, file: !155, line: 105, baseType: !174, size: 12288, offset: 3648)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 12288, elements: !175)
!175 = !{!171, !176}
!176 = !DISubrange(count: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !156, file: !155, line: 106, baseType: !178, size: 192, offset: 15936)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 192, elements: !179)
!179 = !{!171}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !156, file: !155, line: 107, baseType: !178, size: 192, offset: 16128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !156, file: !155, line: 110, baseType: !5, size: 32, offset: 16320)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !156, file: !155, line: 111, baseType: !29, size: 32, offset: 16352)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !156, file: !155, line: 112, baseType: !29, size: 32, offset: 16384)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !156, file: !155, line: 114, baseType: !185, size: 256, offset: 16416)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 256, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 8)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !156, file: !155, line: 116, baseType: !185, size: 256, offset: 16672)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !156, file: !155, line: 117, baseType: !185, size: 256, offset: 16928)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !156, file: !155, line: 119, baseType: !5, size: 32, offset: 17184)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !156, file: !155, line: 120, baseType: !29, size: 32, offset: 17216)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !156, file: !155, line: 122, baseType: !29, size: 32, offset: 17248)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !156, file: !155, line: 123, baseType: !194, size: 64, offset: 17280)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !196, line: 21, baseType: !197)
!196 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!197 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !156, file: !155, line: 125, baseType: !5, size: 32, offset: 17344)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !156, file: !155, line: 126, baseType: !5, size: 32, offset: 17376)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !156, file: !155, line: 127, baseType: !5, size: 32, offset: 17408)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !156, file: !155, line: 128, baseType: !29, size: 32, offset: 17440)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !156, file: !155, line: 129, baseType: !5, size: 32, offset: 17472)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !156, file: !155, line: 130, baseType: !5, size: 32, offset: 17504)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !156, file: !155, line: 131, baseType: !5, size: 32, offset: 17536)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !156, file: !155, line: 133, baseType: !5, size: 32, offset: 17568)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !156, file: !155, line: 135, baseType: !5, size: 32, offset: 17600)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !156, file: !155, line: 136, baseType: !5, size: 32, offset: 17632)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !156, file: !155, line: 137, baseType: !5, size: 32, offset: 17664)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !64, file: !55, line: 570, baseType: !210, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !155, line: 197, baseType: !212)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 142, size: 33024, elements: !213)
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !311, !312}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !212, file: !155, line: 144, baseType: !5, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !212, file: !155, line: 146, baseType: !29, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !212, file: !155, line: 147, baseType: !5, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !212, file: !155, line: 148, baseType: !5, size: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !212, file: !155, line: 149, baseType: !5, size: 32, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !212, file: !155, line: 150, baseType: !5, size: 32, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !212, file: !155, line: 152, baseType: !5, size: 32, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !212, file: !155, line: 154, baseType: !29, size: 32, offset: 224)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !212, file: !155, line: 155, baseType: !29, size: 32, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !212, file: !155, line: 156, baseType: !29, size: 32, offset: 288)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !212, file: !155, line: 158, baseType: !5, size: 32, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !212, file: !155, line: 159, baseType: !165, size: 384, offset: 352)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !212, file: !155, line: 160, baseType: !169, size: 3072, offset: 736)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !212, file: !155, line: 161, baseType: !174, size: 12288, offset: 3808)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !212, file: !155, line: 162, baseType: !178, size: 192, offset: 16096)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !212, file: !155, line: 163, baseType: !178, size: 192, offset: 16288)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !212, file: !155, line: 165, baseType: !29, size: 32, offset: 16480)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !212, file: !155, line: 166, baseType: !29, size: 32, offset: 16512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !212, file: !155, line: 167, baseType: !29, size: 32, offset: 16544)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !212, file: !155, line: 168, baseType: !29, size: 32, offset: 16576)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !212, file: !155, line: 170, baseType: !29, size: 32, offset: 16608)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !212, file: !155, line: 172, baseType: !5, size: 32, offset: 16640)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !212, file: !155, line: 173, baseType: !5, size: 32, offset: 16672)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !212, file: !155, line: 174, baseType: !5, size: 32, offset: 16704)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !212, file: !155, line: 175, baseType: !29, size: 32, offset: 16736)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !212, file: !155, line: 177, baseType: !240, size: 8192, offset: 16768)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8192, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 256)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !212, file: !155, line: 178, baseType: !29, size: 32, offset: 24960)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !212, file: !155, line: 179, baseType: !5, size: 32, offset: 24992)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !212, file: !155, line: 180, baseType: !29, size: 32, offset: 25024)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !212, file: !155, line: 181, baseType: !29, size: 32, offset: 25056)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !212, file: !155, line: 182, baseType: !5, size: 32, offset: 25088)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !212, file: !155, line: 184, baseType: !5, size: 32, offset: 25120)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !212, file: !155, line: 185, baseType: !5, size: 32, offset: 25152)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !212, file: !155, line: 186, baseType: !5, size: 32, offset: 25184)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !212, file: !155, line: 187, baseType: !29, size: 32, offset: 25216)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !212, file: !155, line: 188, baseType: !29, size: 32, offset: 25248)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !212, file: !155, line: 189, baseType: !29, size: 32, offset: 25280)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !212, file: !155, line: 190, baseType: !29, size: 32, offset: 25312)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !212, file: !155, line: 191, baseType: !5, size: 32, offset: 25344)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !212, file: !155, line: 192, baseType: !257, size: 7584, offset: 25376)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !155, line: 90, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 53, size: 7584, elements: !259)
!259 = !{!260, !261, !262, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !258, file: !155, line: 55, baseType: !5, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !258, file: !155, line: 56, baseType: !29, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !258, file: !155, line: 57, baseType: !263, size: 16, offset: 64)
!263 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !258, file: !155, line: 58, baseType: !263, size: 16, offset: 80)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !258, file: !155, line: 59, baseType: !5, size: 32, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !258, file: !155, line: 60, baseType: !5, size: 32, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !258, file: !155, line: 61, baseType: !5, size: 32, offset: 160)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !258, file: !155, line: 62, baseType: !29, size: 32, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !258, file: !155, line: 63, baseType: !5, size: 32, offset: 224)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !258, file: !155, line: 64, baseType: !5, size: 32, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !258, file: !155, line: 65, baseType: !29, size: 32, offset: 288)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !258, file: !155, line: 66, baseType: !29, size: 32, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !258, file: !155, line: 67, baseType: !29, size: 32, offset: 352)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !258, file: !155, line: 68, baseType: !5, size: 32, offset: 384)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !258, file: !155, line: 69, baseType: !29, size: 32, offset: 416)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !258, file: !155, line: 70, baseType: !29, size: 32, offset: 448)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !258, file: !155, line: 71, baseType: !5, size: 32, offset: 480)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !258, file: !155, line: 72, baseType: !29, size: 32, offset: 512)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !258, file: !155, line: 73, baseType: !29, size: 32, offset: 544)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !258, file: !155, line: 74, baseType: !5, size: 32, offset: 576)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !258, file: !155, line: 75, baseType: !5, size: 32, offset: 608)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !258, file: !155, line: 76, baseType: !283, size: 3296, offset: 640)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !155, line: 50, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 38, size: 3296, elements: !285)
!285 = !{!286, !287, !288, !289, !293, !294, !295, !296, !297, !298}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !284, file: !155, line: 40, baseType: !29, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !284, file: !155, line: 41, baseType: !29, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !284, file: !155, line: 42, baseType: !29, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !284, file: !155, line: 43, baseType: !290, size: 1024, offset: 96)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1024, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !284, file: !155, line: 44, baseType: !290, size: 1024, offset: 1120)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !284, file: !155, line: 45, baseType: !290, size: 1024, offset: 2144)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !284, file: !155, line: 46, baseType: !29, size: 32, offset: 3168)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !284, file: !155, line: 47, baseType: !29, size: 32, offset: 3200)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !284, file: !155, line: 48, baseType: !29, size: 32, offset: 3232)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !284, file: !155, line: 49, baseType: !29, size: 32, offset: 3264)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !258, file: !155, line: 77, baseType: !5, size: 32, offset: 3936)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !258, file: !155, line: 78, baseType: !283, size: 3296, offset: 3968)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !258, file: !155, line: 80, baseType: !5, size: 32, offset: 7264)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !258, file: !155, line: 81, baseType: !5, size: 32, offset: 7296)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !258, file: !155, line: 82, baseType: !5, size: 32, offset: 7328)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !258, file: !155, line: 83, baseType: !5, size: 32, offset: 7360)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !258, file: !155, line: 84, baseType: !29, size: 32, offset: 7392)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !258, file: !155, line: 85, baseType: !29, size: 32, offset: 7424)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !258, file: !155, line: 86, baseType: !29, size: 32, offset: 7456)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !258, file: !155, line: 87, baseType: !29, size: 32, offset: 7488)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !258, file: !155, line: 88, baseType: !29, size: 32, offset: 7520)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !258, file: !155, line: 89, baseType: !29, size: 32, offset: 7552)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !212, file: !155, line: 193, baseType: !29, size: 32, offset: 32960)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !212, file: !155, line: 195, baseType: !5, size: 32, offset: 32992)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !64, file: !55, line: 571, baseType: !314, size: 1056768, offset: 192)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 1056768, elements: !291)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !64, file: !55, line: 572, baseType: !316, size: 4538368, offset: 1056960)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 4538368, elements: !241)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !64, file: !55, line: 575, baseType: !318, size: 64, offset: 5595328)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !155, line: 256, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 228, size: 37312, elements: !321)
!321 = !{!322, !323, !324, !325, !326, !327, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !342, !343, !344, !345}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !320, file: !155, line: 230, baseType: !211, size: 33024)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !320, file: !155, line: 232, baseType: !29, size: 32, offset: 33024)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !320, file: !155, line: 233, baseType: !5, size: 32, offset: 33056)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !320, file: !155, line: 234, baseType: !139, size: 64, offset: 33088)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !320, file: !155, line: 235, baseType: !139, size: 64, offset: 33152)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !320, file: !155, line: 236, baseType: !328, size: 64, offset: 33216)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !320, file: !155, line: 237, baseType: !139, size: 64, offset: 33280)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !320, file: !155, line: 238, baseType: !328, size: 64, offset: 33344)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !320, file: !155, line: 240, baseType: !139, size: 64, offset: 33408)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !320, file: !155, line: 241, baseType: !328, size: 64, offset: 33472)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !320, file: !155, line: 242, baseType: !139, size: 64, offset: 33536)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !320, file: !155, line: 243, baseType: !328, size: 64, offset: 33600)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !320, file: !155, line: 245, baseType: !5, size: 32, offset: 33664)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !320, file: !155, line: 246, baseType: !139, size: 64, offset: 33728)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !320, file: !155, line: 247, baseType: !139, size: 64, offset: 33792)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !320, file: !155, line: 248, baseType: !328, size: 64, offset: 33856)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !320, file: !155, line: 249, baseType: !328, size: 64, offset: 33920)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !320, file: !155, line: 250, baseType: !341, size: 64, offset: 33984)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !320, file: !155, line: 251, baseType: !328, size: 64, offset: 34048)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !320, file: !155, line: 253, baseType: !29, size: 32, offset: 34112)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !320, file: !155, line: 254, baseType: !5, size: 32, offset: 34144)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !320, file: !155, line: 255, baseType: !346, size: 3136, offset: 34176)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !155, line: 226, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !155, line: 200, size: 3136, elements: !348)
!348 = !{!349, !350, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !368, !369, !371, !372, !373, !374}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !347, file: !155, line: 202, baseType: !5, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !347, file: !155, line: 203, baseType: !351, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !347, file: !155, line: 204, baseType: !139, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !347, file: !155, line: 205, baseType: !328, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !347, file: !155, line: 206, baseType: !351, size: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !347, file: !155, line: 207, baseType: !139, size: 64, offset: 320)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !347, file: !155, line: 208, baseType: !139, size: 64, offset: 384)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !347, file: !155, line: 209, baseType: !351, size: 64, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !347, file: !155, line: 210, baseType: !351, size: 64, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !347, file: !155, line: 211, baseType: !351, size: 64, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !347, file: !155, line: 212, baseType: !351, size: 64, offset: 640)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !347, file: !155, line: 213, baseType: !351, size: 64, offset: 704)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !347, file: !155, line: 216, baseType: !352, size: 8, offset: 768)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !347, file: !155, line: 217, baseType: !352, size: 8, offset: 776)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !347, file: !155, line: 218, baseType: !352, size: 8, offset: 784)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !347, file: !155, line: 219, baseType: !367, size: 1024, offset: 800)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 1024, elements: !291)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !347, file: !155, line: 220, baseType: !367, size: 1024, offset: 1824)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !347, file: !155, line: 221, baseType: !370, size: 256, offset: 2848)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 256, elements: !291)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !347, file: !155, line: 222, baseType: !352, size: 8, offset: 3104)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !347, file: !155, line: 223, baseType: !352, size: 8, offset: 3112)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !347, file: !155, line: 224, baseType: !352, size: 8, offset: 3120)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !347, file: !155, line: 225, baseType: !352, size: 8, offset: 3128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !64, file: !55, line: 577, baseType: !376, size: 1193984, offset: 5595392)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 1193984, elements: !291)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !64, file: !55, line: 578, baseType: !5, size: 32, offset: 6789376)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !64, file: !55, line: 579, baseType: !5, size: 32, offset: 6789408)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !64, file: !55, line: 580, baseType: !5, size: 32, offset: 6789440)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !64, file: !55, line: 581, baseType: !5, size: 32, offset: 6789472)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !64, file: !55, line: 584, baseType: !382, size: 64, offset: 6789504)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !55, line: 584, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !64, file: !55, line: 586, baseType: !385, size: 64, offset: 6789568)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !55, line: 902, size: 416, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !393, !397, !398, !399, !400, !401, !402, !403}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !386, file: !55, line: 904, baseType: !29, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !386, file: !55, line: 905, baseType: !29, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !386, file: !55, line: 906, baseType: !5, size: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !386, file: !55, line: 907, baseType: !29, size: 32, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !386, file: !55, line: 908, baseType: !5, size: 32, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !386, file: !55, line: 909, baseType: !394, size: 64, offset: 160)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 2)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !386, file: !55, line: 910, baseType: !195, size: 8, offset: 224)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !386, file: !55, line: 911, baseType: !195, size: 8, offset: 232)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !386, file: !55, line: 912, baseType: !5, size: 32, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !386, file: !55, line: 913, baseType: !5, size: 32, offset: 288)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !386, file: !55, line: 915, baseType: !5, size: 32, offset: 320)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !386, file: !55, line: 916, baseType: !5, size: 32, offset: 352)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !386, file: !55, line: 917, baseType: !5, size: 32, offset: 384)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !64, file: !55, line: 587, baseType: !405, size: 64, offset: 6789632)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !55, line: 839, size: 512, elements: !407)
!407 = !{!408, !409, !412, !413, !414, !415}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !406, file: !55, line: 841, baseType: !5, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !406, file: !55, line: 842, baseType: !410, size: 96, offset: 32)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 96, elements: !95)
!411 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !406, file: !55, line: 843, baseType: !410, size: 96, offset: 128)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !406, file: !55, line: 844, baseType: !410, size: 96, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !406, file: !55, line: 845, baseType: !410, size: 96, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !406, file: !55, line: 846, baseType: !410, size: 96, offset: 416)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !64, file: !55, line: 588, baseType: !5, size: 32, offset: 6789696)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !64, file: !55, line: 591, baseType: !29, size: 32, offset: 6789728)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !64, file: !55, line: 592, baseType: !5, size: 32, offset: 6789760)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !64, file: !55, line: 593, baseType: !5, size: 32, offset: 6789792)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !64, file: !55, line: 594, baseType: !5, size: 32, offset: 6789824)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !64, file: !55, line: 595, baseType: !422, size: 64, offset: 6789888)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !55, line: 542, baseType: !60)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !64, file: !55, line: 596, baseType: !351, size: 64, offset: 6789952)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block_JV", scope: !64, file: !55, line: 597, baseType: !427, size: 192, offset: 6790016)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 192, elements: !95)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !64, file: !55, line: 601, baseType: !5, size: 32, offset: 6790208)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !64, file: !55, line: 602, baseType: !5, size: 32, offset: 6790240)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !64, file: !55, line: 603, baseType: !5, size: 32, offset: 6790272)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !64, file: !55, line: 604, baseType: !5, size: 32, offset: 6790304)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !64, file: !55, line: 605, baseType: !5, size: 32, offset: 6790336)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !64, file: !55, line: 607, baseType: !434, size: 64, offset: 6790400)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode_JV", scope: !64, file: !55, line: 608, baseType: !436, size: 192, offset: 6790464)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 192, elements: !95)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !64, file: !55, line: 609, baseType: !438, size: 64, offset: 6790656)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "siblock", scope: !64, file: !55, line: 610, baseType: !328, size: 64, offset: 6790720)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "siblock_JV", scope: !64, file: !55, line: 611, baseType: !442, size: 192, offset: 6790784)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 192, elements: !95)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "newframe", scope: !64, file: !55, line: 613, baseType: !5, size: 32, offset: 6790976)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !64, file: !55, line: 614, baseType: !5, size: 32, offset: 6791008)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "pNextSlice", scope: !64, file: !55, line: 617, baseType: !423, size: 64, offset: 6791040)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !64, file: !55, line: 618, baseType: !53, size: 64, offset: 6791104)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data_JV", scope: !64, file: !55, line: 619, baseType: !448, size: 192, offset: 6791168)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 192, elements: !95)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaArrayType", scope: !64, file: !55, line: 621, baseType: !5, size: 32, offset: 6791360)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_head", scope: !64, file: !55, line: 626, baseType: !451, size: 64, offset: 6791424)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !55, line: 626, flags: DIFlagFwdDecl)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_end", scope: !64, file: !55, line: 627, baseType: !451, size: 64, offset: 6791488)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !64, file: !55, line: 629, baseType: !29, size: 32, offset: 6791552)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "non_conforming_stream", scope: !64, file: !55, line: 630, baseType: !5, size: 32, offset: 6791584)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntMsb", scope: !64, file: !55, line: 634, baseType: !5, size: 32, offset: 6791616)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntLsb", scope: !64, file: !55, line: 635, baseType: !29, size: 32, offset: 6791648)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedPicOrderCnt", scope: !64, file: !55, line: 638, baseType: !5, size: 32, offset: 6791680)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntCycleCnt", scope: !64, file: !55, line: 638, baseType: !5, size: 32, offset: 6791712)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumInPicOrderCntCycle", scope: !64, file: !55, line: 638, baseType: !5, size: 32, offset: 6791744)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNum", scope: !64, file: !55, line: 639, baseType: !29, size: 32, offset: 6791776)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumOffset", scope: !64, file: !55, line: 639, baseType: !29, size: 32, offset: 6791808)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDeltaPerPicOrderCntCycle", scope: !64, file: !55, line: 640, baseType: !5, size: 32, offset: 6791840)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !64, file: !55, line: 641, baseType: !5, size: 32, offset: 6791872)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNumOffset", scope: !64, file: !55, line: 642, baseType: !5, size: 32, offset: 6791904)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFrameNum", scope: !64, file: !55, line: 645, baseType: !5, size: 32, offset: 6791936)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !64, file: !55, line: 647, baseType: !29, size: 32, offset: 6791968)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !64, file: !55, line: 648, baseType: !29, size: 32, offset: 6792000)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !64, file: !55, line: 649, baseType: !29, size: 32, offset: 6792032)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !64, file: !55, line: 650, baseType: !29, size: 32, offset: 6792064)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !64, file: !55, line: 651, baseType: !29, size: 32, offset: 6792096)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !64, file: !55, line: 652, baseType: !29, size: 32, offset: 6792128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "oldFrameSizeInMbs", scope: !64, file: !55, line: 653, baseType: !29, size: 32, offset: 6792160)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !64, file: !55, line: 655, baseType: !5, size: 32, offset: 6792192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !64, file: !55, line: 657, baseType: !5, size: 32, offset: 6792224)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !64, file: !55, line: 658, baseType: !5, size: 32, offset: 6792256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_bitsize_on_disk", scope: !64, file: !55, line: 661, baseType: !5, size: 32, offset: 6792288)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !64, file: !55, line: 662, baseType: !479, size: 16, offset: 6792320)
!479 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !64, file: !55, line: 663, baseType: !479, size: 16, offset: 6792336)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_scale", scope: !64, file: !55, line: 664, baseType: !394, size: 64, offset: 6792352)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !64, file: !55, line: 665, baseType: !5, size: 32, offset: 6792416)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !64, file: !55, line: 666, baseType: !5, size: 32, offset: 6792448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value_comp", scope: !64, file: !55, line: 667, baseType: !485, size: 96, offset: 6792480)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 96, elements: !95)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "max_pel_value_comp", scope: !64, file: !55, line: 668, baseType: !94, size: 96, offset: 6792576)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !64, file: !55, line: 670, baseType: !5, size: 32, offset: 6792672)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !64, file: !55, line: 671, baseType: !5, size: 32, offset: 6792704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !64, file: !55, line: 672, baseType: !5, size: 32, offset: 6792736)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !64, file: !55, line: 673, baseType: !5, size: 32, offset: 6792768)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "num_uv_blocks", scope: !64, file: !55, line: 674, baseType: !5, size: 32, offset: 6792800)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !64, file: !55, line: 675, baseType: !5, size: 32, offset: 6792832)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !64, file: !55, line: 676, baseType: !5, size: 32, offset: 6792864)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !64, file: !55, line: 677, baseType: !5, size: 32, offset: 6792896)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x_blk", scope: !64, file: !55, line: 678, baseType: !5, size: 32, offset: 6792928)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y_blk", scope: !64, file: !55, line: 679, baseType: !5, size: 32, offset: 6792960)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !64, file: !55, line: 680, baseType: !498, size: 192, offset: 6792992)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 192, elements: !499)
!499 = !{!96, !396}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_blk", scope: !64, file: !55, line: 681, baseType: !498, size: 192, offset: 6793184)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_shift", scope: !64, file: !55, line: 682, baseType: !498, size: 192, offset: 6793376)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_x", scope: !64, file: !55, line: 683, baseType: !5, size: 32, offset: 6793568)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_y", scope: !64, file: !55, line: 684, baseType: !5, size: 32, offset: 6793600)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_x", scope: !64, file: !55, line: 685, baseType: !5, size: 32, offset: 6793632)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_y", scope: !64, file: !55, line: 686, baseType: !5, size: 32, offset: 6793664)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "total_scale", scope: !64, file: !55, line: 687, baseType: !5, size: 32, offset: 6793696)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "max_vmv_r", scope: !64, file: !55, line: 689, baseType: !5, size: 32, offset: 6793728)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "idr_psnr_number", scope: !64, file: !55, line: 692, baseType: !5, size: 32, offset: 6793760)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "psnr_number", scope: !64, file: !55, line: 693, baseType: !5, size: 32, offset: 6793792)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "last_ref_pic_poc", scope: !64, file: !55, line: 700, baseType: !5, size: 32, offset: 6793824)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !64, file: !55, line: 701, baseType: !5, size: 32, offset: 6793856)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !64, file: !55, line: 702, baseType: !5, size: 32, offset: 6793888)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !64, file: !55, line: 703, baseType: !5, size: 32, offset: 6793920)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "earlier_missing_poc", scope: !64, file: !55, line: 704, baseType: !5, size: 32, offset: 6793952)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_conceal", scope: !64, file: !55, line: 705, baseType: !29, size: 32, offset: 6793984)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "IDR_concealment_flag", scope: !64, file: !55, line: 706, baseType: !5, size: 32, offset: 6794016)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_slice_type", scope: !64, file: !55, line: 707, baseType: !5, size: 32, offset: 6794048)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point", scope: !64, file: !55, line: 710, baseType: !5, size: 32, offset: 6794080)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point_found", scope: !64, file: !55, line: 711, baseType: !5, size: 32, offset: 6794112)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_cnt", scope: !64, file: !55, line: 712, baseType: !5, size: 32, offset: 6794144)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_num", scope: !64, file: !55, line: 713, baseType: !5, size: 32, offset: 6794176)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_poc", scope: !64, file: !55, line: 714, baseType: !5, size: 32, offset: 6794208)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !64, file: !55, line: 716, baseType: !5, size: 32, offset: 6794240)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !64, file: !55, line: 717, baseType: !5, size: 32, offset: 6794272)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !64, file: !55, line: 719, baseType: !194, size: 64, offset: 6794304)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !64, file: !55, line: 720, baseType: !194, size: 64, offset: 6794368)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "imgData", scope: !64, file: !55, line: 722, baseType: !528, size: 2560, offset: 6794432)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageData", file: !529, line: 38, baseType: !530)
!529 = !DIFile(filename: "ldecod_src/inc/io_image.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "8caef624e6f5391b0c6ab2984e7f77c6")
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "image_data", file: !529, line: 20, size: 2560, elements: !531)
!531 = !{!532, !533, !539, !540, !541, !545, !546, !547, !548, !549}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !530, file: !529, line: 22, baseType: !84, size: 1088)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "frm_data", scope: !530, file: !529, line: 24, baseType: !534, size: 192, offset: 1088)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 192, elements: !95)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !196, line: 41, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !196, line: 23, baseType: !263)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "top_data", scope: !530, file: !529, line: 25, baseType: !534, size: 192, offset: 1280)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "bot_data", scope: !530, file: !529, line: 26, baseType: !534, size: 192, offset: 1472)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "frm_uint16", scope: !530, file: !529, line: 31, baseType: !542, size: 192, offset: 1664)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 192, elements: !95)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "top_uint16", scope: !530, file: !529, line: 32, baseType: !542, size: 192, offset: 1856)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "bot_uint16", scope: !530, file: !529, line: 33, baseType: !542, size: 192, offset: 2048)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "frm_stride", scope: !530, file: !529, line: 35, baseType: !94, size: 96, offset: 2240)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "top_stride", scope: !530, file: !529, line: 36, baseType: !94, size: 96, offset: 2336)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "bot_stride", scope: !530, file: !529, line: 37, baseType: !94, size: 96, offset: 2432)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "imgData0", scope: !64, file: !55, line: 723, baseType: !528, size: 2560, offset: 6796992)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "imgData1", scope: !64, file: !55, line: 724, baseType: !528, size: 2560, offset: 6799552)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "imgData2", scope: !64, file: !55, line: 725, baseType: !528, size: 2560, offset: 6802112)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "imgData32", scope: !64, file: !55, line: 728, baseType: !528, size: 2560, offset: 6804672)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "imgData4", scope: !64, file: !55, line: 729, baseType: !528, size: 2560, offset: 6807232)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "imgData5", scope: !64, file: !55, line: 730, baseType: !528, size: 2560, offset: 6809792)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "imgData6", scope: !64, file: !55, line: 731, baseType: !528, size: 2560, offset: 6812352)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "previous_frame_num", scope: !64, file: !55, line: 735, baseType: !29, size: 32, offset: 6814912)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Is_primary_correct", scope: !64, file: !55, line: 737, baseType: !5, size: 32, offset: 6814944)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Is_redundant_correct", scope: !64, file: !55, line: 738, baseType: !5, size: 32, offset: 6814976)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "tot_time", scope: !64, file: !55, line: 741, baseType: !561, size: 64, offset: 6815040)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !562, line: 103, baseType: !563)
!562 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !564, line: 27, baseType: !565)
!564 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !566, line: 44, baseType: !567)
!566 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!567 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "p_out", scope: !64, file: !55, line: 744, baseType: !5, size: 32, offset: 6815104)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "p_out_mvc", scope: !64, file: !55, line: 746, baseType: !570, size: 32768, offset: 6815136)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 32768, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 1024)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "p_ref", scope: !64, file: !55, line: 748, baseType: !5, size: 32, offset: 6847904)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessUnitExists", scope: !64, file: !55, line: 751, baseType: !5, size: 32, offset: 6847936)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "NALUCount", scope: !64, file: !55, line: 752, baseType: !5, size: 32, offset: 6847968)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Bframe_ctr", scope: !64, file: !55, line: 755, baseType: !5, size: 32, offset: 6848000)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "frame_no", scope: !64, file: !55, line: 756, baseType: !5, size: 32, offset: 6848032)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "g_nFrame", scope: !64, file: !55, line: 758, baseType: !5, size: 32, offset: 6848064)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "global_init_done", scope: !64, file: !55, line: 759, baseType: !5, size: 32, offset: 6848096)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ref", scope: !64, file: !55, line: 762, baseType: !535, size: 64, offset: 6848128)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV_ref", scope: !64, file: !55, line: 763, baseType: !582, size: 64, offset: 6848192)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "qp_per_matrix", scope: !64, file: !55, line: 765, baseType: !139, size: 64, offset: 6848256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "qp_rem_matrix", scope: !64, file: !55, line: 766, baseType: !139, size: 64, offset: 6848320)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "last_out_fs", scope: !64, file: !55, line: 768, baseType: !586, size: 64, offset: 6848384)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !588, line: 152, size: 768, elements: !589)
!588 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !720, !721, !722, !723, !724}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !587, file: !588, line: 154, baseType: !5, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !587, file: !588, line: 155, baseType: !5, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !587, file: !588, line: 156, baseType: !5, size: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !587, file: !588, line: 157, baseType: !5, size: 32, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !587, file: !588, line: 159, baseType: !5, size: 32, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !587, file: !588, line: 161, baseType: !29, size: 32, offset: 160)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !587, file: !588, line: 162, baseType: !29, size: 32, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !587, file: !588, line: 164, baseType: !5, size: 32, offset: 224)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !587, file: !588, line: 165, baseType: !5, size: 32, offset: 256)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !587, file: !588, line: 166, baseType: !5, size: 32, offset: 288)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !587, file: !588, line: 167, baseType: !5, size: 32, offset: 320)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !587, file: !588, line: 170, baseType: !5, size: 32, offset: 352)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !587, file: !588, line: 172, baseType: !603, size: 64, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !588, line: 138, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !588, line: 46, size: 3328, elements: !606)
!606 = !{!607, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !660, !662, !666, !668, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !605, file: !588, line: 48, baseType: !608, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !28, line: 140, baseType: !27)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !605, file: !588, line: 50, baseType: !5, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !605, file: !588, line: 51, baseType: !5, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !605, file: !588, line: 52, baseType: !5, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !605, file: !588, line: 53, baseType: !5, size: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !605, file: !588, line: 54, baseType: !29, size: 32, offset: 160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !605, file: !588, line: 55, baseType: !29, size: 32, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !605, file: !588, line: 57, baseType: !5, size: 32, offset: 224)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !605, file: !588, line: 58, baseType: !5, size: 32, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !605, file: !588, line: 59, baseType: !5, size: 32, offset: 288)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !605, file: !588, line: 61, baseType: !195, size: 8, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !605, file: !588, line: 62, baseType: !5, size: 32, offset: 352)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !605, file: !588, line: 63, baseType: !5, size: 32, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !605, file: !588, line: 64, baseType: !5, size: 32, offset: 416)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !605, file: !588, line: 65, baseType: !5, size: 32, offset: 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !605, file: !588, line: 67, baseType: !479, size: 16, offset: 480)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !605, file: !588, line: 69, baseType: !5, size: 32, offset: 512)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !605, file: !588, line: 69, baseType: !5, size: 32, offset: 544)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !605, file: !588, line: 69, baseType: !5, size: 32, offset: 576)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !605, file: !588, line: 69, baseType: !5, size: 32, offset: 608)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !605, file: !588, line: 70, baseType: !5, size: 32, offset: 640)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !605, file: !588, line: 70, baseType: !5, size: 32, offset: 672)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !605, file: !588, line: 70, baseType: !5, size: 32, offset: 704)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !605, file: !588, line: 70, baseType: !5, size: 32, offset: 736)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !605, file: !588, line: 71, baseType: !5, size: 32, offset: 768)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !605, file: !588, line: 72, baseType: !5, size: 32, offset: 800)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !605, file: !588, line: 73, baseType: !29, size: 32, offset: 832)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !605, file: !588, line: 74, baseType: !29, size: 32, offset: 864)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !605, file: !588, line: 75, baseType: !5, size: 32, offset: 896)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !605, file: !588, line: 75, baseType: !5, size: 32, offset: 928)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !605, file: !588, line: 76, baseType: !5, size: 32, offset: 960)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !605, file: !588, line: 76, baseType: !5, size: 32, offset: 992)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !605, file: !588, line: 79, baseType: !535, size: 64, offset: 1024)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !605, file: !588, line: 80, baseType: !582, size: 64, offset: 1088)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !605, file: !588, line: 81, baseType: !582, size: 64, offset: 1152)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !605, file: !588, line: 84, baseType: !644, size: 64, offset: 1216)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !588, line: 36, size: 256, elements: !647)
!647 = !{!648, !651, !658}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !646, file: !588, line: 38, baseType: !649, size: 128)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 128, elements: !395)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !646, file: !588, line: 39, baseType: !652, size: 64, offset: 128)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 64, elements: !395)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !55, line: 104, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 100, size: 32, elements: !655)
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !654, file: !55, line: 102, baseType: !479, size: 16)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !654, file: !55, line: 103, baseType: !479, size: 16, offset: 16)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !646, file: !588, line: 40, baseType: !659, size: 16, offset: 192)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 16, elements: !395)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !605, file: !588, line: 85, baseType: !661, size: 192, offset: 1280)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 192, elements: !95)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !605, file: !588, line: 87, baseType: !663, size: 64, offset: 1472)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !588, line: 29, size: 64, elements: !664)
!664 = !{!665}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !663, file: !588, line: 31, baseType: !194, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !605, file: !588, line: 88, baseType: !667, size: 192, offset: 1536)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 192, elements: !95)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !605, file: !588, line: 90, baseType: !669, size: 64, offset: 1728)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !605, file: !588, line: 92, baseType: !650, size: 64, offset: 1792)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !605, file: !588, line: 93, baseType: !650, size: 64, offset: 1856)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !605, file: !588, line: 94, baseType: !650, size: 64, offset: 1920)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !605, file: !588, line: 96, baseType: !5, size: 32, offset: 1984)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !605, file: !588, line: 97, baseType: !5, size: 32, offset: 2016)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !605, file: !588, line: 98, baseType: !5, size: 32, offset: 2048)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !605, file: !588, line: 99, baseType: !5, size: 32, offset: 2080)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !605, file: !588, line: 100, baseType: !5, size: 32, offset: 2112)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !605, file: !588, line: 102, baseType: !5, size: 32, offset: 2144)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !605, file: !588, line: 103, baseType: !5, size: 32, offset: 2176)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !605, file: !588, line: 104, baseType: !5, size: 32, offset: 2208)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !605, file: !588, line: 105, baseType: !5, size: 32, offset: 2240)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !605, file: !588, line: 106, baseType: !5, size: 32, offset: 2272)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !605, file: !588, line: 107, baseType: !5, size: 32, offset: 2304)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !605, file: !588, line: 108, baseType: !5, size: 32, offset: 2336)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !605, file: !588, line: 109, baseType: !5, size: 32, offset: 2368)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !605, file: !588, line: 110, baseType: !394, size: 64, offset: 2400)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !605, file: !588, line: 111, baseType: !5, size: 32, offset: 2464)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !605, file: !588, line: 112, baseType: !690, size: 64, offset: 2496)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !55, line: 194, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !55, line: 186, size: 256, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !699}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !692, file: !55, line: 188, baseType: !5, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !692, file: !55, line: 189, baseType: !5, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !692, file: !55, line: 190, baseType: !5, size: 32, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !692, file: !55, line: 191, baseType: !5, size: 32, offset: 96)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !692, file: !55, line: 192, baseType: !5, size: 32, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !692, file: !55, line: 193, baseType: !700, size: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !605, file: !588, line: 115, baseType: !5, size: 32, offset: 2560)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !605, file: !588, line: 118, baseType: !5, size: 32, offset: 2592)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !605, file: !588, line: 119, baseType: !5, size: 32, offset: 2624)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !605, file: !588, line: 120, baseType: !5, size: 32, offset: 2656)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !605, file: !588, line: 121, baseType: !536, size: 64, offset: 2688)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !605, file: !588, line: 124, baseType: !5, size: 32, offset: 2752)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !605, file: !588, line: 125, baseType: !5, size: 32, offset: 2784)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !605, file: !588, line: 126, baseType: !5, size: 32, offset: 2816)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !605, file: !588, line: 128, baseType: !5, size: 32, offset: 2848)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !605, file: !588, line: 129, baseType: !5, size: 32, offset: 2880)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !605, file: !588, line: 130, baseType: !5, size: 32, offset: 2912)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !605, file: !588, line: 131, baseType: !5, size: 32, offset: 2944)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !605, file: !588, line: 132, baseType: !535, size: 64, offset: 3008)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !605, file: !588, line: 133, baseType: !5, size: 32, offset: 3072)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !605, file: !588, line: 134, baseType: !5, size: 32, offset: 3104)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !605, file: !588, line: 136, baseType: !659, size: 16, offset: 3136)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !605, file: !588, line: 137, baseType: !718, size: 128, offset: 3200)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !719, size: 128, elements: !395)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !587, file: !588, line: 173, baseType: !603, size: 64, offset: 448)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !587, file: !588, line: 174, baseType: !603, size: 64, offset: 512)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !587, file: !588, line: 177, baseType: !5, size: 32, offset: 576)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !587, file: !588, line: 178, baseType: !394, size: 64, offset: 608)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !587, file: !588, line: 179, baseType: !394, size: 64, offset: 672)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pocs_in_dpb", scope: !64, file: !55, line: 769, baseType: !726, size: 3200, offset: 6848448)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 3200, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 100)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture", scope: !64, file: !55, line: 771, baseType: !650, size: 64, offset: 6851648)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture_JV", scope: !64, file: !55, line: 772, baseType: !731, size: 192, offset: 6851712)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 192, elements: !95)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "no_reference_picture", scope: !64, file: !55, line: 773, baseType: !650, size: 64, offset: 6851904)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "erc_object_list", scope: !64, file: !55, line: 776, baseType: !734, size: 64, offset: 6851968)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DICompositeType(tag: DW_TAG_structure_type, name: "object_buffer", file: !55, line: 776, flags: DIFlagFwdDecl)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "erc_errorVar", scope: !64, file: !55, line: 777, baseType: !737, size: 64, offset: 6852032)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DICompositeType(tag: DW_TAG_structure_type, name: "ercVariables_s", file: !55, line: 777, flags: DIFlagFwdDecl)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "erc_mvperMB", scope: !64, file: !55, line: 779, baseType: !5, size: 32, offset: 6852096)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "erc_img", scope: !64, file: !55, line: 780, baseType: !63, size: 64, offset: 6852160)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "ec_flag", scope: !64, file: !55, line: 781, baseType: !742, size: 640, offset: 6852224)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 640, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 20)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "annex_b", scope: !64, file: !55, line: 783, baseType: !746, size: 64, offset: 6852864)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DICompositeType(tag: DW_TAG_structure_type, name: "annex_b_struct", file: !55, line: 783, flags: DIFlagFwdDecl)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "bitsfile", scope: !64, file: !55, line: 784, baseType: !749, size: 64, offset: 6852928)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "sBitsFile", file: !55, line: 784, flags: DIFlagFwdDecl)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "out_buffer", scope: !64, file: !55, line: 786, baseType: !586, size: 64, offset: 6852992)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output", scope: !64, file: !55, line: 788, baseType: !650, size: 64, offset: 6853056)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output_state", scope: !64, file: !55, line: 789, baseType: !5, size: 32, offset: 6853120)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_flag", scope: !64, file: !55, line: 790, baseType: !5, size: 32, offset: 6853152)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "BitStreamFile", scope: !64, file: !55, line: 792, baseType: !5, size: 32, offset: 6853184)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !64, file: !55, line: 794, baseType: !757, size: 64, offset: 6853248)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !588, line: 186, size: 33408, elements: !759)
!759 = !{!760, !763, !766, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !758, file: !588, line: 188, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !55, line: 836, baseType: !64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !758, file: !588, line: 189, baseType: !764, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !55, line: 900, baseType: !68)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !758, file: !588, line: 190, baseType: !767, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !588, line: 182, baseType: !587)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ref", scope: !758, file: !588, line: 191, baseType: !767, size: 64, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ltref", scope: !758, file: !588, line: 192, baseType: !767, size: 64, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !758, file: !588, line: 193, baseType: !29, size: 32, offset: 320)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !758, file: !588, line: 194, baseType: !29, size: 32, offset: 352)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frames_in_buffer", scope: !758, file: !588, line: 195, baseType: !29, size: 32, offset: 384)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ltref_frames_in_buffer", scope: !758, file: !588, line: 196, baseType: !29, size: 32, offset: 416)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_poc", scope: !758, file: !588, line: 197, baseType: !5, size: 32, offset: 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_view_id", scope: !758, file: !588, line: 199, baseType: !5, size: 32, offset: 480)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_pic_idx", scope: !758, file: !588, line: 200, baseType: !570, size: 32768, offset: 512)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "init_done", scope: !758, file: !588, line: 205, baseType: !5, size: 32, offset: 33280)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !758, file: !588, line: 206, baseType: !5, size: 32, offset: 33312)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "last_picture", scope: !758, file: !588, line: 208, baseType: !768, size: 64, offset: 33344)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb_legacy", scope: !64, file: !55, line: 795, baseType: !757, size: 64, offset: 6853312)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb_layer", scope: !64, file: !55, line: 796, baseType: !784, size: 128, offset: 6853376)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 128, elements: !395)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "cslice_type", scope: !64, file: !55, line: 800, baseType: !786, size: 72, offset: 6853504)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 72, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 9)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "MbToSliceGroupMap", scope: !64, file: !55, line: 802, baseType: !139, size: 64, offset: 6853632)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "MapUnitToSliceGroupMap", scope: !64, file: !55, line: 803, baseType: !139, size: 64, offset: 6853696)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSliceGroups", scope: !64, file: !55, line: 804, baseType: !5, size: 32, offset: 6853760)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "seiToneMapping", scope: !64, file: !55, line: 807, baseType: !793, size: 64, offset: 6853824)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "tone_mapping_struct_s", file: !55, line: 807, flags: DIFlagFwdDecl)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "buf2img", scope: !64, file: !55, line: 810, baseType: !796, size: 64, offset: 6853888)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{null, !535, !799, !5, !5, !5, !5, !5, !5}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "getNeighbour", scope: !64, file: !55, line: 811, baseType: !801, size: 64, offset: 6853952)
