; ModuleID = 'ldecod_src/ldecod.c'
source_filename = "ldecod_src/ldecod.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.datapartition = type { ptr, %struct.DecodingEnvironment, ptr }
%struct.DecodingEnvironment = type { i32, i32, i32, ptr, ptr }
%struct.BlockPos = type { i16, i16 }

@stderr = external local_unnamed_addr global ptr, align 8
@.str = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1, !dbg !0
@errortext = dso_local global [300 x i8] zeroinitializer, align 16, !dbg !7
@.str.1 = private unnamed_addr constant [60 x i8] c"AllocPartition: Memory allocation for Data Partition failed\00", align 1, !dbg !1456
@.str.2 = private unnamed_addr constant [55 x i8] c"AllocPartition: Memory allocation for Bitstream failed\00", align 1, !dbg !1461
@.str.3 = private unnamed_addr constant [58 x i8] c"AllocPartition: Memory allocation for streamBuffer failed\00", align 1, !dbg !1466
@.str.4 = private unnamed_addr constant [61 x i8] c"Memory allocation for Slice datastruct in NAL-mode %d failed\00", align 1, !dbg !1471
@.str.5 = private unnamed_addr constant [34 x i8] c"malloc_slice: currSlice->listX[i]\00", align 1, !dbg !1476
@.str.6 = private unnamed_addr constant [36 x i8] c"init_global_buffers: p_Vid->mb_data\00", align 1, !dbg !1481
@.str.7 = private unnamed_addr constant [43 x i8] c"init_global_buffers: p_Vid->intra_block_JV\00", align 1, !dbg !1486

!30 = !DIEnumerator(name: "VIDEO_YUV", value: 0)
!31 = !DIEnumerator(name: "VIDEO_RGB", value: 1)
!32 = !DIEnumerator(name: "VIDEO_XYZ", value: 2)
!33 = !DIEnumerator(name: "VIDEO_TIFF", value: 3)
!34 = !DIEnumerator(name: "VIDEO_AVI", value: 4)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 135, baseType: !37, size: 32, elements: !38)
!36 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!37 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!38 = !{!39, !40, !41}
!39 = !DIEnumerator(name: "FRAME", value: 0)
!40 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!41 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 22, baseType: !37, size: 32, elements: !43)
!43 = !{!44, !45, !46, !47, !48, !49}
!44 = !DIEnumerator(name: "PLANE_Y", value: 0)
!45 = !DIEnumerator(name: "PLANE_U", value: 1)
!46 = !DIEnumerator(name: "PLANE_V", value: 2)
!47 = !DIEnumerator(name: "PLANE_G", value: 0)
!48 = !DIEnumerator(name: "PLANE_B", value: 1)
!49 = !DIEnumerator(name: "PLANE_R", value: 2)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 24, baseType: !37, size: 32, elements: !52)
!51 = !DIFile(filename: "ldecod_src/inc/nalucommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "f9e55677f5f79524218c8a7a94869788")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!53 = !DIEnumerator(name: "NALU_TYPE_SLICE", value: 1)
!54 = !DIEnumerator(name: "NALU_TYPE_DPA", value: 2)
!55 = !DIEnumerator(name: "NALU_TYPE_DPB", value: 3)
!56 = !DIEnumerator(name: "NALU_TYPE_DPC", value: 4)
!57 = !DIEnumerator(name: "NALU_TYPE_IDR", value: 5)
!58 = !DIEnumerator(name: "NALU_TYPE_SEI", value: 6)
!59 = !DIEnumerator(name: "NALU_TYPE_SPS", value: 7)
!60 = !DIEnumerator(name: "NALU_TYPE_PPS", value: 8)
!61 = !DIEnumerator(name: "NALU_TYPE_AUD", value: 9)
!62 = !DIEnumerator(name: "NALU_TYPE_EOSEQ", value: 10)
!63 = !DIEnumerator(name: "NALU_TYPE_EOSTREAM", value: 11)
!64 = !DIEnumerator(name: "NALU_TYPE_FILL", value: 12)
!65 = !DIEnumerator(name: "NALU_TYPE_PREFIX", value: 14)
!66 = !DIEnumerator(name: "NALU_TYPE_SUB_SPS", value: 15)
!67 = !DIEnumerator(name: "NALU_TYPE_SLC_EXT", value: 20)
!68 = !DIEnumerator(name: "NALU_TYPE_VDRD", value: 24)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 46, baseType: !37, size: 32, elements: !70)
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "NALU_PRIORITY_HIGHEST", value: 3)
!72 = !DIEnumerator(name: "NALU_PRIORITY_HIGH", value: 2)
!73 = !DIEnumerator(name: "NALU_PRIORITY_LOW", value: 1)
!74 = !DIEnumerator(name: "NALU_PRIORITY_DISPOSABLE", value: 0)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 19, baseType: !37, size: 32, elements: !77)
!76 = !DIFile(filename: "ldecod_src/inc/h264decoder.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "ba430f541025e478510e78b4ed3faeb6")
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85}
!78 = !DIEnumerator(name: "DEC_GEN_NOERR", value: 0)
!79 = !DIEnumerator(name: "DEC_OPEN_NOERR", value: 0)
!80 = !DIEnumerator(name: "DEC_CLOSE_NOERR", value: 0)
!81 = !DIEnumerator(name: "DEC_SUCCEED", value: 0)
!82 = !DIEnumerator(name: "DEC_EOS", value: 1)
!83 = !DIEnumerator(name: "DEC_NEED_DATA", value: 2)
!84 = !DIEnumerator(name: "DEC_INVALID_PARAM", value: 3)
!85 = !DIEnumerator(name: "DEC_ERRMASK", value: 32768)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 231, baseType: !37, size: 32, elements: !88)
!87 = !DIFile(filename: "ldecod_src/inc/defines.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "f06de374c735b286d10ba4ea0c8c0a5d")
!88 = !{!89, !90, !91, !92}
!89 = !DIEnumerator(name: "EOS", value: 1)
!90 = !DIEnumerator(name: "SOP", value: 2)
!91 = !DIEnumerator(name: "SOS", value: 3)
!92 = !DIEnumerator(name: "SOS_CONT", value: 4)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 142, baseType: !37, size: 32, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100}
!95 = !DIEnumerator(name: "P_SLICE", value: 0)
!96 = !DIEnumerator(name: "B_SLICE", value: 1)
!97 = !DIEnumerator(name: "I_SLICE", value: 2)
!98 = !DIEnumerator(name: "SP_SLICE", value: 3)
!99 = !DIEnumerator(name: "SI_SLICE", value: 4)
!100 = !DIEnumerator(name: "NUM_SLICE_TYPES", value: 5)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 119, baseType: !37, size: 32, elements: !102)
!102 = !{!103, !104}
!103 = !DIEnumerator(name: "CAVLC", value: 0)
!104 = !DIEnumerator(name: "CABAC", value: 1)
!105 = !{!106, !1378, !112, !121, !503, !140, !431, !1379, !13, !558, !1011, !1380, !878, !1443, !1445, !1447, !1449, !502, !922, !37, !1451, !177}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !108, line: 324, baseType: !109)
!108 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !108, line: 314, size: 384, elements: !110)
!110 = !{!111, !126, !136}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !109, file: !108, line: 317, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !108, line: 47, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream", file: !108, line: 300, size: 256, elements: !115)
!115 = !{!116, !117, !118, !119, !120, !125}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "read_len", scope: !114, file: !108, line: 303, baseType: !13, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !114, file: !108, line: 304, baseType: !13, size: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bitoffset", scope: !114, file: !108, line: 306, baseType: !13, size: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_length", scope: !114, file: !108, line: 307, baseType: !13, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !114, file: !108, line: 309, baseType: !121, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !123, line: 21, baseType: !124)
!123 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!124 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !114, file: !108, line: 310, baseType: !13, size: 32, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "de_cabac", scope: !109, file: !108, line: 318, baseType: !127, size: 256, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !108, line: 95, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 88, size: 256, elements: !129)
!129 = !{!130, !131, !132, !133, !134}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !128, file: !108, line: 90, baseType: !37, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !128, file: !108, line: 91, baseType: !37, size: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !128, file: !108, line: 92, baseType: !13, size: 32, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !128, file: !108, line: 93, baseType: !121, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !128, file: !108, line: 94, baseType: !135, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "readSyntaxElement", scope: !109, file: !108, line: 320, baseType: !137, size: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!13, !140, !1376, !1374}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !108, line: 273, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !108, line: 197, size: 3840, elements: !143)
!143 = !{!144, !1273, !1274, !1275, !1276, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1305, !1306, !1307, !1308, !1309, !1312, !1313, !1315, !1316, !1317, !1318, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1342, !1343, !1348, !1354, !1375}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !142, file: !108, line: 199, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !108, line: 341, size: 109184, elements: !147)
!147 = !{!148, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1098, !1100, !1101, !1129, !1156, !1159, !1160, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1195, !1196, !1197, !1198, !1199, !1200, !1203, !1204, !1207, !1208, !1210, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1223, !1224, !1225, !1226, !1227, !1229, !1230, !1231, !1235, !1239, !1243, !1247, !1251, !1252, !1253, !1254, !1258, !1259, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !146, file: !108, line: 343, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !108, line: 566, size: 6855040, elements: !151)
!151 = !{!152, !236, !289, !393, !395, !397, !455, !457, !458, !459, !460, !461, !464, !484, !496, !497, !498, !499, !500, !501, !505, !506, !508, !509, !510, !511, !512, !513, !515, !517, !520, !521, !523, !524, !525, !526, !527, !529, !530, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !772, !773, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !810, !814, !815, !817, !818, !827, !849, !850, !851, !855, !869, !911, !912, !913, !914, !915, !916, !940, !941, !943, !947, !948, !949, !950, !967, !972, !986, !990, !994, !995, !1000, !1001, !1005, !1006, !1010, !1031, !1032, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !150, file: !108, line: 568, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !108, line: 850, size: 32128, elements: !155)
!155 = !{!156, !160, !161, !162, !163, !164, !165, !166, !167, !168, !198, !199, !200, !201, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !154, file: !108, line: 852, baseType: !157, size: 2040)
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !158)
!158 = !{!159}
!159 = !DISubrange(count: 255)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !154, file: !108, line: 853, baseType: !157, size: 2040, offset: 2040)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !154, file: !108, line: 854, baseType: !157, size: 2040, offset: 4080)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !154, file: !108, line: 856, baseType: !13, size: 32, offset: 6144)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !154, file: !108, line: 857, baseType: !13, size: 32, offset: 6176)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !154, file: !108, line: 858, baseType: !13, size: 32, offset: 6208)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !154, file: !108, line: 859, baseType: !13, size: 32, offset: 6240)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !154, file: !108, line: 860, baseType: !13, size: 32, offset: 6272)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !154, file: !108, line: 861, baseType: !13, size: 32, offset: 6304)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !154, file: !108, line: 864, baseType: !169, size: 1088, offset: 6336)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !12, line: 52, baseType: !170)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !12, line: 30, size: 1088, elements: !171)
!171 = !{!172, !174, !176, !178, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !170, file: !12, line: 32, baseType: !173, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !12, line: 28, baseType: !11)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !170, file: !12, line: 33, baseType: !175, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !12, line: 20, baseType: !20)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !170, file: !12, line: 34, baseType: !177, size: 64, offset: 64)
!177 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !170, file: !12, line: 35, baseType: !179, size: 96, offset: 128)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 96, elements: !180)
!180 = !{!181}
!181 = !DISubrange(count: 3)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !170, file: !12, line: 36, baseType: !179, size: 96, offset: 224)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !170, file: !12, line: 37, baseType: !13, size: 32, offset: 320)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !170, file: !12, line: 38, baseType: !13, size: 32, offset: 352)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !170, file: !12, line: 39, baseType: !13, size: 32, offset: 384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !170, file: !12, line: 40, baseType: !13, size: 32, offset: 416)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !170, file: !12, line: 41, baseType: !13, size: 32, offset: 448)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !170, file: !12, line: 42, baseType: !13, size: 32, offset: 480)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !170, file: !12, line: 43, baseType: !13, size: 32, offset: 512)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !170, file: !12, line: 44, baseType: !13, size: 32, offset: 544)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !170, file: !12, line: 45, baseType: !179, size: 96, offset: 576)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !170, file: !12, line: 46, baseType: !13, size: 32, offset: 672)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !170, file: !12, line: 47, baseType: !179, size: 96, offset: 704)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !170, file: !12, line: 48, baseType: !179, size: 96, offset: 800)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !170, file: !12, line: 49, baseType: !179, size: 96, offset: 896)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !170, file: !12, line: 50, baseType: !13, size: 32, offset: 992)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !170, file: !12, line: 51, baseType: !13, size: 32, offset: 1024)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !154, file: !108, line: 865, baseType: !169, size: 1088, offset: 7424)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !154, file: !108, line: 867, baseType: !13, size: 32, offset: 8512)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !154, file: !108, line: 868, baseType: !13, size: 32, offset: 8544)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !154, file: !108, line: 869, baseType: !202, size: 7744, offset: 8576)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !27, line: 60, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !27, line: 34, size: 7744, elements: !204)
!204 = !{!205, !206, !207, !208, !209, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !203, file: !27, line: 37, baseType: !157, size: 2040)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !203, file: !27, line: 38, baseType: !157, size: 2040, offset: 2040)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !203, file: !27, line: 39, baseType: !157, size: 2040, offset: 4080)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !203, file: !27, line: 40, baseType: !13, size: 32, offset: 6144)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !203, file: !27, line: 41, baseType: !210, size: 32, offset: 6176)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !27, line: 32, baseType: !26)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !203, file: !27, line: 42, baseType: !169, size: 1088, offset: 6208)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !203, file: !27, line: 43, baseType: !13, size: 32, offset: 7296)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !203, file: !27, line: 44, baseType: !13, size: 32, offset: 7328)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !203, file: !27, line: 45, baseType: !13, size: 32, offset: 7360)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !203, file: !27, line: 46, baseType: !13, size: 32, offset: 7392)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !203, file: !27, line: 47, baseType: !13, size: 32, offset: 7424)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !203, file: !27, line: 48, baseType: !13, size: 32, offset: 7456)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !203, file: !27, line: 49, baseType: !13, size: 32, offset: 7488)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !203, file: !27, line: 50, baseType: !13, size: 32, offset: 7520)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !203, file: !27, line: 51, baseType: !13, size: 32, offset: 7552)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !203, file: !27, line: 52, baseType: !13, size: 32, offset: 7584)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !203, file: !27, line: 53, baseType: !13, size: 32, offset: 7616)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !203, file: !27, line: 56, baseType: !135, size: 64, offset: 7680)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !154, file: !108, line: 870, baseType: !202, size: 7744, offset: 16320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !154, file: !108, line: 871, baseType: !202, size: 7744, offset: 24064)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !154, file: !108, line: 873, baseType: !13, size: 32, offset: 31808)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !154, file: !108, line: 884, baseType: !13, size: 32, offset: 31840)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !154, file: !108, line: 885, baseType: !13, size: 32, offset: 31872)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !154, file: !108, line: 886, baseType: !13, size: 32, offset: 31904)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !154, file: !108, line: 890, baseType: !13, size: 32, offset: 31936)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !154, file: !108, line: 893, baseType: !13, size: 32, offset: 31968)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !154, file: !108, line: 894, baseType: !13, size: 32, offset: 32000)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !154, file: !108, line: 895, baseType: !13, size: 32, offset: 32032)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !154, file: !108, line: 897, baseType: !13, size: 32, offset: 32064)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !154, file: !108, line: 899, baseType: !13, size: 32, offset: 32096)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !150, file: !108, line: 569, baseType: !237, size: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !239, line: 138, baseType: !240)
!239 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 94, size: 17728, elements: !241)
!241 = !{!242, !243, !244, !245, !246, !247, !248, !252, !257, !261, !264, !265, !266, !267, !268, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !240, file: !239, line: 96, baseType: !13, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !240, file: !239, line: 97, baseType: !37, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !240, file: !239, line: 98, baseType: !37, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !240, file: !239, line: 99, baseType: !13, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !240, file: !239, line: 100, baseType: !13, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !240, file: !239, line: 102, baseType: !13, size: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !240, file: !239, line: 103, baseType: !249, size: 384, offset: 192)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 384, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 12)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !240, file: !239, line: 104, baseType: !253, size: 3072, offset: 576)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 3072, elements: !254)
!254 = !{!255, !256}
!255 = !DISubrange(count: 6)
!256 = !DISubrange(count: 16)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !240, file: !239, line: 105, baseType: !258, size: 12288, offset: 3648)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 12288, elements: !259)
!259 = !{!255, !260}
!260 = !DISubrange(count: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !240, file: !239, line: 106, baseType: !262, size: 192, offset: 15936)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 192, elements: !263)
!263 = !{!255}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !240, file: !239, line: 107, baseType: !262, size: 192, offset: 16128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !240, file: !239, line: 110, baseType: !13, size: 32, offset: 16320)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !240, file: !239, line: 111, baseType: !37, size: 32, offset: 16352)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !240, file: !239, line: 112, baseType: !37, size: 32, offset: 16384)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !240, file: !239, line: 114, baseType: !269, size: 256, offset: 16416)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 256, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 8)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !240, file: !239, line: 116, baseType: !269, size: 256, offset: 16672)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !240, file: !239, line: 117, baseType: !269, size: 256, offset: 16928)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !240, file: !239, line: 119, baseType: !13, size: 32, offset: 17184)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !240, file: !239, line: 120, baseType: !37, size: 32, offset: 17216)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !240, file: !239, line: 122, baseType: !37, size: 32, offset: 17248)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !240, file: !239, line: 123, baseType: !121, size: 64, offset: 17280)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !240, file: !239, line: 125, baseType: !13, size: 32, offset: 17344)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !240, file: !239, line: 126, baseType: !13, size: 32, offset: 17376)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !240, file: !239, line: 127, baseType: !13, size: 32, offset: 17408)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !240, file: !239, line: 128, baseType: !37, size: 32, offset: 17440)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !240, file: !239, line: 129, baseType: !13, size: 32, offset: 17472)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !240, file: !239, line: 130, baseType: !13, size: 32, offset: 17504)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !240, file: !239, line: 131, baseType: !13, size: 32, offset: 17536)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !240, file: !239, line: 133, baseType: !13, size: 32, offset: 17568)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !240, file: !239, line: 135, baseType: !13, size: 32, offset: 17600)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !240, file: !239, line: 136, baseType: !13, size: 32, offset: 17632)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !240, file: !239, line: 137, baseType: !13, size: 32, offset: 17664)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !150, file: !108, line: 570, baseType: !290, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !239, line: 197, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 142, size: 33024, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !391, !392}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !292, file: !239, line: 144, baseType: !13, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !292, file: !239, line: 146, baseType: !37, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !292, file: !239, line: 147, baseType: !13, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !292, file: !239, line: 148, baseType: !13, size: 32, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !292, file: !239, line: 149, baseType: !13, size: 32, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !292, file: !239, line: 150, baseType: !13, size: 32, offset: 160)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !292, file: !239, line: 152, baseType: !13, size: 32, offset: 192)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !292, file: !239, line: 154, baseType: !37, size: 32, offset: 224)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !292, file: !239, line: 155, baseType: !37, size: 32, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !292, file: !239, line: 156, baseType: !37, size: 32, offset: 288)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !292, file: !239, line: 158, baseType: !13, size: 32, offset: 320)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !292, file: !239, line: 159, baseType: !249, size: 384, offset: 352)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !292, file: !239, line: 160, baseType: !253, size: 3072, offset: 736)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !292, file: !239, line: 161, baseType: !258, size: 12288, offset: 3808)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !292, file: !239, line: 162, baseType: !262, size: 192, offset: 16096)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !292, file: !239, line: 163, baseType: !262, size: 192, offset: 16288)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !292, file: !239, line: 165, baseType: !37, size: 32, offset: 16480)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !292, file: !239, line: 166, baseType: !37, size: 32, offset: 16512)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !292, file: !239, line: 167, baseType: !37, size: 32, offset: 16544)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !292, file: !239, line: 168, baseType: !37, size: 32, offset: 16576)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !292, file: !239, line: 170, baseType: !37, size: 32, offset: 16608)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !292, file: !239, line: 172, baseType: !13, size: 32, offset: 16640)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !292, file: !239, line: 173, baseType: !13, size: 32, offset: 16672)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !292, file: !239, line: 174, baseType: !13, size: 32, offset: 16704)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !292, file: !239, line: 175, baseType: !37, size: 32, offset: 16736)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !292, file: !239, line: 177, baseType: !320, size: 8192, offset: 16768)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8192, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !292, file: !239, line: 178, baseType: !37, size: 32, offset: 24960)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !292, file: !239, line: 179, baseType: !13, size: 32, offset: 24992)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !292, file: !239, line: 180, baseType: !37, size: 32, offset: 25024)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !292, file: !239, line: 181, baseType: !37, size: 32, offset: 25056)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !292, file: !239, line: 182, baseType: !13, size: 32, offset: 25088)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !292, file: !239, line: 184, baseType: !13, size: 32, offset: 25120)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !292, file: !239, line: 185, baseType: !13, size: 32, offset: 25152)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !292, file: !239, line: 186, baseType: !13, size: 32, offset: 25184)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !292, file: !239, line: 187, baseType: !37, size: 32, offset: 25216)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !292, file: !239, line: 188, baseType: !37, size: 32, offset: 25248)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !292, file: !239, line: 189, baseType: !37, size: 32, offset: 25280)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !292, file: !239, line: 190, baseType: !37, size: 32, offset: 25312)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !292, file: !239, line: 191, baseType: !13, size: 32, offset: 25344)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !292, file: !239, line: 192, baseType: !337, size: 7584, offset: 25376)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !239, line: 90, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 53, size: 7584, elements: !339)
!339 = !{!340, !341, !342, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !338, file: !239, line: 55, baseType: !13, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !338, file: !239, line: 56, baseType: !37, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !338, file: !239, line: 57, baseType: !343, size: 16, offset: 64)
!343 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !338, file: !239, line: 58, baseType: !343, size: 16, offset: 80)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !338, file: !239, line: 59, baseType: !13, size: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !338, file: !239, line: 60, baseType: !13, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !338, file: !239, line: 61, baseType: !13, size: 32, offset: 160)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !338, file: !239, line: 62, baseType: !37, size: 32, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !338, file: !239, line: 63, baseType: !13, size: 32, offset: 224)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !338, file: !239, line: 64, baseType: !13, size: 32, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !338, file: !239, line: 65, baseType: !37, size: 32, offset: 288)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !338, file: !239, line: 66, baseType: !37, size: 32, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !338, file: !239, line: 67, baseType: !37, size: 32, offset: 352)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !338, file: !239, line: 68, baseType: !13, size: 32, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !338, file: !239, line: 69, baseType: !37, size: 32, offset: 416)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !338, file: !239, line: 70, baseType: !37, size: 32, offset: 448)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !338, file: !239, line: 71, baseType: !13, size: 32, offset: 480)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !338, file: !239, line: 72, baseType: !37, size: 32, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !338, file: !239, line: 73, baseType: !37, size: 32, offset: 544)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !338, file: !239, line: 74, baseType: !13, size: 32, offset: 576)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !338, file: !239, line: 75, baseType: !13, size: 32, offset: 608)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !338, file: !239, line: 76, baseType: !363, size: 3296, offset: 640)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !239, line: 50, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 38, size: 3296, elements: !365)
!365 = !{!366, !367, !368, !369, !373, !374, !375, !376, !377, !378}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !364, file: !239, line: 40, baseType: !37, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !364, file: !239, line: 41, baseType: !37, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !364, file: !239, line: 42, baseType: !37, size: 32, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !364, file: !239, line: 43, baseType: !370, size: 1024, offset: 96)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1024, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !364, file: !239, line: 44, baseType: !370, size: 1024, offset: 1120)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !364, file: !239, line: 45, baseType: !370, size: 1024, offset: 2144)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !364, file: !239, line: 46, baseType: !37, size: 32, offset: 3168)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !364, file: !239, line: 47, baseType: !37, size: 32, offset: 3200)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !364, file: !239, line: 48, baseType: !37, size: 32, offset: 3232)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !364, file: !239, line: 49, baseType: !37, size: 32, offset: 3264)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !338, file: !239, line: 77, baseType: !13, size: 32, offset: 3936)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !338, file: !239, line: 78, baseType: !363, size: 3296, offset: 3968)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !338, file: !239, line: 80, baseType: !13, size: 32, offset: 7264)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !338, file: !239, line: 81, baseType: !13, size: 32, offset: 7296)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !338, file: !239, line: 82, baseType: !13, size: 32, offset: 7328)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !338, file: !239, line: 83, baseType: !13, size: 32, offset: 7360)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !338, file: !239, line: 84, baseType: !37, size: 32, offset: 7392)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !338, file: !239, line: 85, baseType: !37, size: 32, offset: 7424)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !338, file: !239, line: 86, baseType: !37, size: 32, offset: 7456)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !338, file: !239, line: 87, baseType: !37, size: 32, offset: 7488)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !338, file: !239, line: 88, baseType: !37, size: 32, offset: 7520)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !338, file: !239, line: 89, baseType: !37, size: 32, offset: 7552)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !292, file: !239, line: 193, baseType: !37, size: 32, offset: 32960)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !292, file: !239, line: 195, baseType: !13, size: 32, offset: 32992)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !150, file: !108, line: 571, baseType: !394, size: 1056768, offset: 192)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 1056768, elements: !371)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !150, file: !108, line: 572, baseType: !396, size: 4538368, offset: 1056960)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 4538368, elements: !321)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !150, file: !108, line: 575, baseType: !398, size: 64, offset: 5595328)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !239, line: 256, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 228, size: 37312, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !422, !423, !424, !425}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !400, file: !239, line: 230, baseType: !291, size: 33024)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !400, file: !239, line: 232, baseType: !37, size: 32, offset: 33024)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !400, file: !239, line: 233, baseType: !13, size: 32, offset: 33056)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !400, file: !239, line: 234, baseType: !135, size: 64, offset: 33088)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !400, file: !239, line: 235, baseType: !135, size: 64, offset: 33152)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !400, file: !239, line: 236, baseType: !408, size: 64, offset: 33216)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !400, file: !239, line: 237, baseType: !135, size: 64, offset: 33280)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !400, file: !239, line: 238, baseType: !408, size: 64, offset: 33344)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !400, file: !239, line: 240, baseType: !135, size: 64, offset: 33408)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !400, file: !239, line: 241, baseType: !408, size: 64, offset: 33472)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !400, file: !239, line: 242, baseType: !135, size: 64, offset: 33536)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !400, file: !239, line: 243, baseType: !408, size: 64, offset: 33600)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !400, file: !239, line: 245, baseType: !13, size: 32, offset: 33664)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !400, file: !239, line: 246, baseType: !135, size: 64, offset: 33728)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !400, file: !239, line: 247, baseType: !135, size: 64, offset: 33792)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !400, file: !239, line: 248, baseType: !408, size: 64, offset: 33856)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !400, file: !239, line: 249, baseType: !408, size: 64, offset: 33920)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !400, file: !239, line: 250, baseType: !421, size: 64, offset: 33984)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !400, file: !239, line: 251, baseType: !408, size: 64, offset: 34048)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !400, file: !239, line: 253, baseType: !37, size: 32, offset: 34112)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !400, file: !239, line: 254, baseType: !13, size: 32, offset: 34144)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !400, file: !239, line: 255, baseType: !426, size: 3136, offset: 34176)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !239, line: 226, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !239, line: 200, size: 3136, elements: !428)
!428 = !{!429, !430, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !448, !449, !451, !452, !453, !454}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !427, file: !239, line: 202, baseType: !13, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !427, file: !239, line: 203, baseType: !431, size: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !427, file: !239, line: 204, baseType: !135, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !427, file: !239, line: 205, baseType: !408, size: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !427, file: !239, line: 206, baseType: !431, size: 64, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !427, file: !239, line: 207, baseType: !135, size: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !427, file: !239, line: 208, baseType: !135, size: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !427, file: !239, line: 209, baseType: !431, size: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !427, file: !239, line: 210, baseType: !431, size: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !427, file: !239, line: 211, baseType: !431, size: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !427, file: !239, line: 212, baseType: !431, size: 64, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !427, file: !239, line: 213, baseType: !431, size: 64, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !427, file: !239, line: 216, baseType: !432, size: 8, offset: 768)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !427, file: !239, line: 217, baseType: !432, size: 8, offset: 776)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !427, file: !239, line: 218, baseType: !432, size: 8, offset: 784)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !427, file: !239, line: 219, baseType: !447, size: 1024, offset: 800)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1024, elements: !371)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !427, file: !239, line: 220, baseType: !447, size: 1024, offset: 1824)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !427, file: !239, line: 221, baseType: !450, size: 256, offset: 2848)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 256, elements: !371)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !427, file: !239, line: 222, baseType: !432, size: 8, offset: 3104)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !427, file: !239, line: 223, baseType: !432, size: 8, offset: 3112)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !427, file: !239, line: 224, baseType: !432, size: 8, offset: 3120)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !427, file: !239, line: 225, baseType: !432, size: 8, offset: 3128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !150, file: !108, line: 577, baseType: !456, size: 1193984, offset: 5595392)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 1193984, elements: !371)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !150, file: !108, line: 578, baseType: !13, size: 32, offset: 6789376)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !150, file: !108, line: 579, baseType: !13, size: 32, offset: 6789408)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !150, file: !108, line: 580, baseType: !13, size: 32, offset: 6789440)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !150, file: !108, line: 581, baseType: !13, size: 32, offset: 6789472)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !150, file: !108, line: 584, baseType: !462, size: 64, offset: 6789504)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !108, line: 584, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !150, file: !108, line: 586, baseType: !465, size: 64, offset: 6789568)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !108, line: 902, size: 416, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !477, !478, !479, !480, !481, !482, !483}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !466, file: !108, line: 904, baseType: !37, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !466, file: !108, line: 905, baseType: !37, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !466, file: !108, line: 906, baseType: !13, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !466, file: !108, line: 907, baseType: !37, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !466, file: !108, line: 908, baseType: !13, size: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !466, file: !108, line: 909, baseType: !474, size: 64, offset: 160)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 2)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !466, file: !108, line: 910, baseType: !122, size: 8, offset: 224)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !466, file: !108, line: 911, baseType: !122, size: 8, offset: 232)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !466, file: !108, line: 912, baseType: !13, size: 32, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !466, file: !108, line: 913, baseType: !13, size: 32, offset: 288)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !466, file: !108, line: 915, baseType: !13, size: 32, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !466, file: !108, line: 916, baseType: !13, size: 32, offset: 352)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !466, file: !108, line: 917, baseType: !13, size: 32, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !150, file: !108, line: 587, baseType: !485, size: 64, offset: 6789632)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !108, line: 839, size: 512, elements: !487)
!487 = !{!488, !489, !492, !493, !494, !495}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !486, file: !108, line: 841, baseType: !13, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !486, file: !108, line: 842, baseType: !490, size: 96, offset: 32)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 96, elements: !180)
!491 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !486, file: !108, line: 843, baseType: !490, size: 96, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !486, file: !108, line: 844, baseType: !490, size: 96, offset: 224)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !486, file: !108, line: 845, baseType: !490, size: 96, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !486, file: !108, line: 846, baseType: !490, size: 96, offset: 416)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !150, file: !108, line: 588, baseType: !13, size: 32, offset: 6789696)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !150, file: !108, line: 591, baseType: !37, size: 32, offset: 6789728)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !150, file: !108, line: 592, baseType: !13, size: 32, offset: 6789760)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !150, file: !108, line: 593, baseType: !13, size: 32, offset: 6789792)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !150, file: !108, line: 594, baseType: !13, size: 32, offset: 6789824)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !150, file: !108, line: 595, baseType: !502, size: 64, offset: 6789888)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !108, line: 542, baseType: !146)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !150, file: !108, line: 596, baseType: !431, size: 64, offset: 6789952)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block_JV", scope: !150, file: !108, line: 597, baseType: !507, size: 192, offset: 6790016)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 192, elements: !180)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !150, file: !108, line: 601, baseType: !13, size: 32, offset: 6790208)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !150, file: !108, line: 602, baseType: !13, size: 32, offset: 6790240)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !150, file: !108, line: 603, baseType: !13, size: 32, offset: 6790272)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !150, file: !108, line: 604, baseType: !13, size: 32, offset: 6790304)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !150, file: !108, line: 605, baseType: !13, size: 32, offset: 6790336)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !150, file: !108, line: 607, baseType: !514, size: 64, offset: 6790400)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode_JV", scope: !150, file: !108, line: 608, baseType: !516, size: 192, offset: 6790464)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 192, elements: !180)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !150, file: !108, line: 609, baseType: !518, size: 64, offset: 6790656)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "siblock", scope: !150, file: !108, line: 610, baseType: !408, size: 64, offset: 6790720)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "siblock_JV", scope: !150, file: !108, line: 611, baseType: !522, size: 192, offset: 6790784)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 192, elements: !180)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "newframe", scope: !150, file: !108, line: 613, baseType: !13, size: 32, offset: 6790976)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !150, file: !108, line: 614, baseType: !13, size: 32, offset: 6791008)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pNextSlice", scope: !150, file: !108, line: 617, baseType: !503, size: 64, offset: 6791040)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !150, file: !108, line: 618, baseType: !140, size: 64, offset: 6791104)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data_JV", scope: !150, file: !108, line: 619, baseType: !528, size: 192, offset: 6791168)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 192, elements: !180)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaArrayType", scope: !150, file: !108, line: 621, baseType: !13, size: 32, offset: 6791360)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_head", scope: !150, file: !108, line: 626, baseType: !531, size: 64, offset: 6791424)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !533, line: 136, size: 192, elements: !534)
!533 = !DIFile(filename: "ldecod_src/inc/erc_api.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "9f38a583d5066807e951e2b61474101e")
!534 = !{!535, !660, !661}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !532, file: !533, line: 137, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !538, line: 138, baseType: !539)
!538 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !538, line: 46, size: 3328, elements: !540)
!540 = !{!541, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !580, !582, !583, !600, !602, !606, !608, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !539, file: !538, line: 48, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !36, line: 140, baseType: !35)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !539, file: !538, line: 50, baseType: !13, size: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !539, file: !538, line: 51, baseType: !13, size: 32, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !539, file: !538, line: 52, baseType: !13, size: 32, offset: 96)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !539, file: !538, line: 53, baseType: !13, size: 32, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !539, file: !538, line: 54, baseType: !37, size: 32, offset: 160)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !539, file: !538, line: 55, baseType: !37, size: 32, offset: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !539, file: !538, line: 57, baseType: !13, size: 32, offset: 224)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !539, file: !538, line: 58, baseType: !13, size: 32, offset: 256)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !539, file: !538, line: 59, baseType: !13, size: 32, offset: 288)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !539, file: !538, line: 61, baseType: !122, size: 8, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !539, file: !538, line: 62, baseType: !13, size: 32, offset: 352)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !539, file: !538, line: 63, baseType: !13, size: 32, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !539, file: !538, line: 64, baseType: !13, size: 32, offset: 416)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !539, file: !538, line: 65, baseType: !13, size: 32, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !539, file: !538, line: 67, baseType: !558, size: 16, offset: 480)
!558 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !539, file: !538, line: 69, baseType: !13, size: 32, offset: 512)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !539, file: !538, line: 69, baseType: !13, size: 32, offset: 544)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !539, file: !538, line: 69, baseType: !13, size: 32, offset: 576)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !539, file: !538, line: 69, baseType: !13, size: 32, offset: 608)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !539, file: !538, line: 70, baseType: !13, size: 32, offset: 640)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !539, file: !538, line: 70, baseType: !13, size: 32, offset: 672)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !539, file: !538, line: 70, baseType: !13, size: 32, offset: 704)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !539, file: !538, line: 70, baseType: !13, size: 32, offset: 736)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !539, file: !538, line: 71, baseType: !13, size: 32, offset: 768)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !539, file: !538, line: 72, baseType: !13, size: 32, offset: 800)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !539, file: !538, line: 73, baseType: !37, size: 32, offset: 832)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !539, file: !538, line: 74, baseType: !37, size: 32, offset: 864)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !539, file: !538, line: 75, baseType: !13, size: 32, offset: 896)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !539, file: !538, line: 75, baseType: !13, size: 32, offset: 928)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !539, file: !538, line: 76, baseType: !13, size: 32, offset: 960)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !539, file: !538, line: 76, baseType: !13, size: 32, offset: 992)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !539, file: !538, line: 79, baseType: !576, size: 64, offset: 1024)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !123, line: 41, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !123, line: 23, baseType: !343)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !539, file: !538, line: 80, baseType: !581, size: 64, offset: 1088)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !539, file: !538, line: 81, baseType: !581, size: 64, offset: 1152)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !539, file: !538, line: 84, baseType: !584, size: 64, offset: 1216)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !538, line: 36, size: 256, elements: !587)
!587 = !{!588, !591, !598}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !586, file: !538, line: 38, baseType: !589, size: 128)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 128, elements: !475)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !586, file: !538, line: 39, baseType: !592, size: 64, offset: 128)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 64, elements: !475)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !108, line: 104, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !108, line: 100, size: 32, elements: !595)
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !594, file: !108, line: 102, baseType: !558, size: 16)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !594, file: !108, line: 103, baseType: !558, size: 16, offset: 16)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !586, file: !538, line: 40, baseType: !599, size: 16, offset: 192)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 16, elements: !475)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !539, file: !538, line: 85, baseType: !601, size: 192, offset: 1280)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 192, elements: !180)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !539, file: !538, line: 87, baseType: !603, size: 64, offset: 1472)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !538, line: 29, size: 64, elements: !604)
!604 = !{!605}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !603, file: !538, line: 31, baseType: !121, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !539, file: !538, line: 88, baseType: !607, size: 192, offset: 1536)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 192, elements: !180)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !539, file: !538, line: 90, baseType: !609, size: 64, offset: 1728)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !539, file: !538, line: 92, baseType: !590, size: 64, offset: 1792)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !539, file: !538, line: 93, baseType: !590, size: 64, offset: 1856)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !539, file: !538, line: 94, baseType: !590, size: 64, offset: 1920)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !539, file: !538, line: 96, baseType: !13, size: 32, offset: 1984)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !539, file: !538, line: 97, baseType: !13, size: 32, offset: 2016)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !539, file: !538, line: 98, baseType: !13, size: 32, offset: 2048)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !539, file: !538, line: 99, baseType: !13, size: 32, offset: 2080)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !539, file: !538, line: 100, baseType: !13, size: 32, offset: 2112)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !539, file: !538, line: 102, baseType: !13, size: 32, offset: 2144)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !539, file: !538, line: 103, baseType: !13, size: 32, offset: 2176)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !539, file: !538, line: 104, baseType: !13, size: 32, offset: 2208)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !539, file: !538, line: 105, baseType: !13, size: 32, offset: 2240)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !539, file: !538, line: 106, baseType: !13, size: 32, offset: 2272)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !539, file: !538, line: 107, baseType: !13, size: 32, offset: 2304)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !539, file: !538, line: 108, baseType: !13, size: 32, offset: 2336)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !539, file: !538, line: 109, baseType: !13, size: 32, offset: 2368)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !539, file: !538, line: 110, baseType: !474, size: 64, offset: 2400)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !539, file: !538, line: 111, baseType: !13, size: 32, offset: 2464)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !539, file: !538, line: 112, baseType: !630, size: 64, offset: 2496)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !108, line: 194, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !108, line: 186, size: 256, elements: !633)
!633 = !{!634, !635, !636, !637, !638, !639}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !632, file: !108, line: 188, baseType: !13, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !632, file: !108, line: 189, baseType: !13, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !632, file: !108, line: 190, baseType: !13, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !632, file: !108, line: 191, baseType: !13, size: 32, offset: 96)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !632, file: !108, line: 192, baseType: !13, size: 32, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !632, file: !108, line: 193, baseType: !640, size: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !539, file: !538, line: 115, baseType: !13, size: 32, offset: 2560)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !539, file: !538, line: 118, baseType: !13, size: 32, offset: 2592)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !539, file: !538, line: 119, baseType: !13, size: 32, offset: 2624)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !539, file: !538, line: 120, baseType: !13, size: 32, offset: 2656)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !539, file: !538, line: 121, baseType: !577, size: 64, offset: 2688)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !539, file: !538, line: 124, baseType: !13, size: 32, offset: 2752)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !539, file: !538, line: 125, baseType: !13, size: 32, offset: 2784)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !539, file: !538, line: 126, baseType: !13, size: 32, offset: 2816)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !539, file: !538, line: 128, baseType: !13, size: 32, offset: 2848)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !539, file: !538, line: 129, baseType: !13, size: 32, offset: 2880)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !539, file: !538, line: 130, baseType: !13, size: 32, offset: 2912)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !539, file: !538, line: 131, baseType: !13, size: 32, offset: 2944)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !539, file: !538, line: 132, baseType: !576, size: 64, offset: 3008)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !539, file: !538, line: 133, baseType: !13, size: 32, offset: 3072)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !539, file: !538, line: 134, baseType: !13, size: 32, offset: 3104)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !539, file: !538, line: 136, baseType: !599, size: 16, offset: 3136)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !539, file: !538, line: 137, baseType: !658, size: 128, offset: 3200)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 128, elements: !475)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "missingpocs", scope: !532, file: !533, line: 138, baseType: !13, size: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !532, file: !533, line: 139, baseType: !531, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_end", scope: !150, file: !108, line: 627, baseType: !531, size: 64, offset: 6791488)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !150, file: !108, line: 629, baseType: !37, size: 32, offset: 6791552)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "non_conforming_stream", scope: !150, file: !108, line: 630, baseType: !13, size: 32, offset: 6791584)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntMsb", scope: !150, file: !108, line: 634, baseType: !13, size: 32, offset: 6791616)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntLsb", scope: !150, file: !108, line: 635, baseType: !37, size: 32, offset: 6791648)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedPicOrderCnt", scope: !150, file: !108, line: 638, baseType: !13, size: 32, offset: 6791680)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntCycleCnt", scope: !150, file: !108, line: 638, baseType: !13, size: 32, offset: 6791712)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumInPicOrderCntCycle", scope: !150, file: !108, line: 638, baseType: !13, size: 32, offset: 6791744)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNum", scope: !150, file: !108, line: 639, baseType: !37, size: 32, offset: 6791776)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumOffset", scope: !150, file: !108, line: 639, baseType: !37, size: 32, offset: 6791808)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDeltaPerPicOrderCntCycle", scope: !150, file: !108, line: 640, baseType: !13, size: 32, offset: 6791840)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !150, file: !108, line: 641, baseType: !13, size: 32, offset: 6791872)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNumOffset", scope: !150, file: !108, line: 642, baseType: !13, size: 32, offset: 6791904)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFrameNum", scope: !150, file: !108, line: 645, baseType: !13, size: 32, offset: 6791936)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !150, file: !108, line: 647, baseType: !37, size: 32, offset: 6791968)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !150, file: !108, line: 648, baseType: !37, size: 32, offset: 6792000)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !150, file: !108, line: 649, baseType: !37, size: 32, offset: 6792032)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !150, file: !108, line: 650, baseType: !37, size: 32, offset: 6792064)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !150, file: !108, line: 651, baseType: !37, size: 32, offset: 6792096)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !150, file: !108, line: 652, baseType: !37, size: 32, offset: 6792128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "oldFrameSizeInMbs", scope: !150, file: !108, line: 653, baseType: !37, size: 32, offset: 6792160)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !150, file: !108, line: 655, baseType: !13, size: 32, offset: 6792192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !150, file: !108, line: 657, baseType: !13, size: 32, offset: 6792224)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !150, file: !108, line: 658, baseType: !13, size: 32, offset: 6792256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_bitsize_on_disk", scope: !150, file: !108, line: 661, baseType: !13, size: 32, offset: 6792288)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !150, file: !108, line: 662, baseType: !558, size: 16, offset: 6792320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !150, file: !108, line: 663, baseType: !558, size: 16, offset: 6792336)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_scale", scope: !150, file: !108, line: 664, baseType: !474, size: 64, offset: 6792352)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !150, file: !108, line: 665, baseType: !13, size: 32, offset: 6792416)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !150, file: !108, line: 666, baseType: !13, size: 32, offset: 6792448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value_comp", scope: !150, file: !108, line: 667, baseType: !693, size: 96, offset: 6792480)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 96, elements: !180)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "max_pel_value_comp", scope: !150, file: !108, line: 668, baseType: !179, size: 96, offset: 6792576)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !150, file: !108, line: 670, baseType: !13, size: 32, offset: 6792672)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !150, file: !108, line: 671, baseType: !13, size: 32, offset: 6792704)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !150, file: !108, line: 672, baseType: !13, size: 32, offset: 6792736)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !150, file: !108, line: 673, baseType: !13, size: 32, offset: 6792768)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "num_uv_blocks", scope: !150, file: !108, line: 674, baseType: !13, size: 32, offset: 6792800)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !150, file: !108, line: 675, baseType: !13, size: 32, offset: 6792832)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !150, file: !108, line: 676, baseType: !13, size: 32, offset: 6792864)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !150, file: !108, line: 677, baseType: !13, size: 32, offset: 6792896)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x_blk", scope: !150, file: !108, line: 678, baseType: !13, size: 32, offset: 6792928)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y_blk", scope: !150, file: !108, line: 679, baseType: !13, size: 32, offset: 6792960)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !150, file: !108, line: 680, baseType: !706, size: 192, offset: 6792992)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 192, elements: !707)
!707 = !{!181, !476}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_blk", scope: !150, file: !108, line: 681, baseType: !706, size: 192, offset: 6793184)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_shift", scope: !150, file: !108, line: 682, baseType: !706, size: 192, offset: 6793376)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_x", scope: !150, file: !108, line: 683, baseType: !13, size: 32, offset: 6793568)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_y", scope: !150, file: !108, line: 684, baseType: !13, size: 32, offset: 6793600)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_x", scope: !150, file: !108, line: 685, baseType: !13, size: 32, offset: 6793632)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_y", scope: !150, file: !108, line: 686, baseType: !13, size: 32, offset: 6793664)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "total_scale", scope: !150, file: !108, line: 687, baseType: !13, size: 32, offset: 6793696)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "max_vmv_r", scope: !150, file: !108, line: 689, baseType: !13, size: 32, offset: 6793728)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "idr_psnr_number", scope: !150, file: !108, line: 692, baseType: !13, size: 32, offset: 6793760)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "psnr_number", scope: !150, file: !108, line: 693, baseType: !13, size: 32, offset: 6793792)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "last_ref_pic_poc", scope: !150, file: !108, line: 700, baseType: !13, size: 32, offset: 6793824)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !150, file: !108, line: 701, baseType: !13, size: 32, offset: 6793856)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !150, file: !108, line: 702, baseType: !13, size: 32, offset: 6793888)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !150, file: !108, line: 703, baseType: !13, size: 32, offset: 6793920)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "earlier_missing_poc", scope: !150, file: !108, line: 704, baseType: !13, size: 32, offset: 6793952)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_conceal", scope: !150, file: !108, line: 705, baseType: !37, size: 32, offset: 6793984)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "IDR_concealment_flag", scope: !150, file: !108, line: 706, baseType: !13, size: 32, offset: 6794016)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_slice_type", scope: !150, file: !108, line: 707, baseType: !13, size: 32, offset: 6794048)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point", scope: !150, file: !108, line: 710, baseType: !13, size: 32, offset: 6794080)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point_found", scope: !150, file: !108, line: 711, baseType: !13, size: 32, offset: 6794112)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_cnt", scope: !150, file: !108, line: 712, baseType: !13, size: 32, offset: 6794144)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_num", scope: !150, file: !108, line: 713, baseType: !13, size: 32, offset: 6794176)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_poc", scope: !150, file: !108, line: 714, baseType: !13, size: 32, offset: 6794208)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !150, file: !108, line: 716, baseType: !13, size: 32, offset: 6794240)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !150, file: !108, line: 717, baseType: !13, size: 32, offset: 6794272)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !150, file: !108, line: 719, baseType: !121, size: 64, offset: 6794304)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !150, file: !108, line: 720, baseType: !121, size: 64, offset: 6794368)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "imgData", scope: !150, file: !108, line: 722, baseType: !736, size: 2560, offset: 6794432)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageData", file: !737, line: 38, baseType: !738)
!737 = !DIFile(filename: "ldecod_src/inc/io_image.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "8caef624e6f5391b0c6ab2984e7f77c6")
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "image_data", file: !737, line: 20, size: 2560, elements: !739)
!739 = !{!740, !741, !743, !744, !745, !749, !750, !751, !752, !753}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !738, file: !737, line: 22, baseType: !169, size: 1088)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "frm_data", scope: !738, file: !737, line: 24, baseType: !742, size: 192, offset: 1088)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 192, elements: !180)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "top_data", scope: !738, file: !737, line: 25, baseType: !742, size: 192, offset: 1280)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bot_data", scope: !738, file: !737, line: 26, baseType: !742, size: 192, offset: 1472)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "frm_uint16", scope: !738, file: !737, line: 31, baseType: !746, size: 192, offset: 1664)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 192, elements: !180)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "top_uint16", scope: !738, file: !737, line: 32, baseType: !746, size: 192, offset: 1856)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "bot_uint16", scope: !738, file: !737, line: 33, baseType: !746, size: 192, offset: 2048)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "frm_stride", scope: !738, file: !737, line: 35, baseType: !179, size: 96, offset: 2240)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "top_stride", scope: !738, file: !737, line: 36, baseType: !179, size: 96, offset: 2336)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "bot_stride", scope: !738, file: !737, line: 37, baseType: !179, size: 96, offset: 2432)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "imgData0", scope: !150, file: !108, line: 723, baseType: !736, size: 2560, offset: 6796992)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "imgData1", scope: !150, file: !108, line: 724, baseType: !736, size: 2560, offset: 6799552)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "imgData2", scope: !150, file: !108, line: 725, baseType: !736, size: 2560, offset: 6802112)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "imgData32", scope: !150, file: !108, line: 728, baseType: !736, size: 2560, offset: 6804672)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "imgData4", scope: !150, file: !108, line: 729, baseType: !736, size: 2560, offset: 6807232)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "imgData5", scope: !150, file: !108, line: 730, baseType: !736, size: 2560, offset: 6809792)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "imgData6", scope: !150, file: !108, line: 731, baseType: !736, size: 2560, offset: 6812352)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "previous_frame_num", scope: !150, file: !108, line: 735, baseType: !37, size: 32, offset: 6814912)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Is_primary_correct", scope: !150, file: !108, line: 737, baseType: !13, size: 32, offset: 6814944)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "Is_redundant_correct", scope: !150, file: !108, line: 738, baseType: !13, size: 32, offset: 6814976)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "tot_time", scope: !150, file: !108, line: 741, baseType: !765, size: 64, offset: 6815040)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !766, line: 103, baseType: !767)
!766 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !768, line: 27, baseType: !769)
!768 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !770, line: 44, baseType: !771)
!770 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!771 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "p_out", scope: !150, file: !108, line: 744, baseType: !13, size: 32, offset: 6815104)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "p_out_mvc", scope: !150, file: !108, line: 746, baseType: !774, size: 32768, offset: 6815136)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 32768, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 1024)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "p_ref", scope: !150, file: !108, line: 748, baseType: !13, size: 32, offset: 6847904)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessUnitExists", scope: !150, file: !108, line: 751, baseType: !13, size: 32, offset: 6847936)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "NALUCount", scope: !150, file: !108, line: 752, baseType: !13, size: 32, offset: 6847968)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "Bframe_ctr", scope: !150, file: !108, line: 755, baseType: !13, size: 32, offset: 6848000)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "frame_no", scope: !150, file: !108, line: 756, baseType: !13, size: 32, offset: 6848032)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "g_nFrame", scope: !150, file: !108, line: 758, baseType: !13, size: 32, offset: 6848064)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "global_init_done", scope: !150, file: !108, line: 759, baseType: !13, size: 32, offset: 6848096)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ref", scope: !150, file: !108, line: 762, baseType: !576, size: 64, offset: 6848128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV_ref", scope: !150, file: !108, line: 763, baseType: !581, size: 64, offset: 6848192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "qp_per_matrix", scope: !150, file: !108, line: 765, baseType: !135, size: 64, offset: 6848256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "qp_rem_matrix", scope: !150, file: !108, line: 766, baseType: !135, size: 64, offset: 6848320)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "last_out_fs", scope: !150, file: !108, line: 768, baseType: !789, size: 64, offset: 6848384)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !538, line: 152, size: 768, elements: !791)
!791 = !{!792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !790, file: !538, line: 154, baseType: !13, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !790, file: !538, line: 155, baseType: !13, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !790, file: !538, line: 156, baseType: !13, size: 32, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !790, file: !538, line: 157, baseType: !13, size: 32, offset: 96)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !790, file: !538, line: 159, baseType: !13, size: 32, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !790, file: !538, line: 161, baseType: !37, size: 32, offset: 160)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !790, file: !538, line: 162, baseType: !37, size: 32, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !790, file: !538, line: 164, baseType: !13, size: 32, offset: 224)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !790, file: !538, line: 165, baseType: !13, size: 32, offset: 256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !790, file: !538, line: 166, baseType: !13, size: 32, offset: 288)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !790, file: !538, line: 167, baseType: !13, size: 32, offset: 320)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !790, file: !538, line: 170, baseType: !13, size: 32, offset: 352)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !790, file: !538, line: 172, baseType: !536, size: 64, offset: 384)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !790, file: !538, line: 173, baseType: !536, size: 64, offset: 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !790, file: !538, line: 174, baseType: !536, size: 64, offset: 512)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !790, file: !538, line: 177, baseType: !13, size: 32, offset: 576)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !790, file: !538, line: 178, baseType: !474, size: 64, offset: 608)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !790, file: !538, line: 179, baseType: !474, size: 64, offset: 672)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pocs_in_dpb", scope: !150, file: !108, line: 769, baseType: !811, size: 3200, offset: 6848448)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 3200, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 100)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture", scope: !150, file: !108, line: 771, baseType: !590, size: 64, offset: 6851648)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture_JV", scope: !150, file: !108, line: 772, baseType: !816, size: 192, offset: 6851712)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 192, elements: !180)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "no_reference_picture", scope: !150, file: !108, line: 773, baseType: !590, size: 64, offset: 6851904)
