; ModuleID = 'ldecod_src/loop_filter_normal.c'
source_filename = "ldecod_src/loop_filter_normal.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.BlockPos = type { i16, i16 }
%struct.pic_motion_params = type { [2 x ptr], [2 x %struct.MotionVector], [2 x i8] }
%struct.MotionVector = type { i16, i16 }

@PicPos = external local_unnamed_addr global ptr, align 8

!80 = !DILocalVariable(name: "x", arg: 1, scope: !75, file: !76, line: 116, type: !7)
!81 = !DILocalVariable(name: "y", scope: !75, file: !76, line: 119, type: !7)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "ALPHA_TABLE", scope: !2, file: !85, line: 36, type: !86, isLocal: true, isDefinition: true)
!85 = !DIFile(filename: "ldecod_src/inc/loop_filter.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "774c4ea00ab9834861f6c14263c9e78a")
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 416, elements: !88)
!87 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!88 = !{!89}
!89 = !DISubrange(count: 52)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "BETA_TABLE", scope: !2, file: !85, line: 37, type: !86, isLocal: true, isDefinition: true)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "CLIP_TAB", scope: !2, file: !85, line: 38, type: !94, isLocal: true, isDefinition: true)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 2080, elements: !95)
!95 = !{!89, !96}
!96 = !DISubrange(count: 5)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "pelnum_cr", scope: !2, file: !85, line: 60, type: !99, isLocal: true, isDefinition: true)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 256, elements: !100)
!100 = !{!101, !102}
!101 = !DISubrange(count: 2)
!102 = !DISubrange(count: 4)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 4096, elements: !112)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64", file: !106, line: 104, baseType: !107)
!106 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !108, line: 27, baseType: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !110, line: 45, baseType: !111)
!110 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!111 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!112 = !{!113}
!113 = !DISubrange(count: 64)
!114 = !{i32 7, !"Dwarf Version", i32 5}
!115 = !{i32 2, !"Debug Info Version", i32 3}
!116 = !{i32 1, !"wchar_size", i32 4}
!117 = !{i32 8, !"PIC Level", i32 2}
!118 = !{i32 7, !"PIE Level", i32 2}
!119 = !{i32 7, !"uwtable", i32 2}
!120 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!121 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!122 = distinct !DISubprogram(name: "set_loop_filter_functions_normal", scope: !3, file: !3, line: 37, type: !123, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1294)
!123 = !DISubroutineType(types: !124)
!124 = !{null, !125}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !127, line: 836, baseType: !128)
!127 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !127, line: 566, size: 6855040, elements: !129)
!129 = !{!130, !215, !268, !371, !373, !375, !433, !435, !436, !437, !438, !439, !442, !461, !473, !474, !475, !476, !477, !478, !1041, !1042, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1052, !1055, !1056, !1058, !1059, !1060, !1061, !1062, !1064, !1065, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1189, !1190, !1192, !1193, !1196, !1199, !1200, !1201, !1205, !1208, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1220, !1223, !1224, !1225, !1226, !1229, !1234, !1238, !1242, !1246, !1247, !1251, !1252, !1256, !1257, !1261, !1282, !1283, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !128, file: !127, line: 568, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !127, line: 850, size: 32128, elements: !133)
!133 = !{!134, !139, !140, !141, !142, !143, !144, !145, !146, !147, !177, !178, !179, !180, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !132, file: !127, line: 852, baseType: !135, size: 2040)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 2040, elements: !137)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!137 = !{!138}
!138 = !DISubrange(count: 255)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !132, file: !127, line: 853, baseType: !135, size: 2040, offset: 2040)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !132, file: !127, line: 854, baseType: !135, size: 2040, offset: 4080)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !132, file: !127, line: 856, baseType: !7, size: 32, offset: 6144)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !132, file: !127, line: 857, baseType: !7, size: 32, offset: 6176)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !132, file: !127, line: 858, baseType: !7, size: 32, offset: 6208)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !132, file: !127, line: 859, baseType: !7, size: 32, offset: 6240)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !132, file: !127, line: 860, baseType: !7, size: 32, offset: 6272)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !132, file: !127, line: 861, baseType: !7, size: 32, offset: 6304)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !132, file: !127, line: 864, baseType: !148, size: 1088, offset: 6336)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !6, line: 52, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !6, line: 30, size: 1088, elements: !150)
!150 = !{!151, !153, !155, !157, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !149, file: !6, line: 32, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !6, line: 28, baseType: !5)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !149, file: !6, line: 33, baseType: !154, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !6, line: 20, baseType: !14)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !149, file: !6, line: 34, baseType: !156, size: 64, offset: 64)
!156 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !149, file: !6, line: 35, baseType: !158, size: 96, offset: 128)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 3)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !149, file: !6, line: 36, baseType: !158, size: 96, offset: 224)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !149, file: !6, line: 37, baseType: !7, size: 32, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !149, file: !6, line: 38, baseType: !7, size: 32, offset: 352)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !149, file: !6, line: 39, baseType: !7, size: 32, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !149, file: !6, line: 40, baseType: !7, size: 32, offset: 416)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !149, file: !6, line: 41, baseType: !7, size: 32, offset: 448)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !149, file: !6, line: 42, baseType: !7, size: 32, offset: 480)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !149, file: !6, line: 43, baseType: !7, size: 32, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !149, file: !6, line: 44, baseType: !7, size: 32, offset: 544)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !149, file: !6, line: 45, baseType: !158, size: 96, offset: 576)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !149, file: !6, line: 46, baseType: !7, size: 32, offset: 672)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !149, file: !6, line: 47, baseType: !158, size: 96, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !149, file: !6, line: 48, baseType: !158, size: 96, offset: 800)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !149, file: !6, line: 49, baseType: !158, size: 96, offset: 896)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !149, file: !6, line: 50, baseType: !7, size: 32, offset: 992)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !149, file: !6, line: 51, baseType: !7, size: 32, offset: 1024)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !132, file: !127, line: 865, baseType: !148, size: 1088, offset: 7424)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !132, file: !127, line: 867, baseType: !7, size: 32, offset: 8512)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !132, file: !127, line: 868, baseType: !7, size: 32, offset: 8544)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !132, file: !127, line: 869, baseType: !181, size: 7744, offset: 8576)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !21, line: 60, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !21, line: 34, size: 7744, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !182, file: !21, line: 37, baseType: !135, size: 2040)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !182, file: !21, line: 38, baseType: !135, size: 2040, offset: 2040)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !182, file: !21, line: 39, baseType: !135, size: 2040, offset: 4080)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !182, file: !21, line: 40, baseType: !7, size: 32, offset: 6144)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !182, file: !21, line: 41, baseType: !189, size: 32, offset: 6176)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !21, line: 32, baseType: !20)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !182, file: !21, line: 42, baseType: !148, size: 1088, offset: 6208)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !182, file: !21, line: 43, baseType: !7, size: 32, offset: 7296)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !182, file: !21, line: 44, baseType: !7, size: 32, offset: 7328)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !182, file: !21, line: 45, baseType: !7, size: 32, offset: 7360)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !182, file: !21, line: 46, baseType: !7, size: 32, offset: 7392)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !182, file: !21, line: 47, baseType: !7, size: 32, offset: 7424)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !182, file: !21, line: 48, baseType: !7, size: 32, offset: 7456)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !182, file: !21, line: 49, baseType: !7, size: 32, offset: 7488)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !182, file: !21, line: 50, baseType: !7, size: 32, offset: 7520)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !182, file: !21, line: 51, baseType: !7, size: 32, offset: 7552)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !182, file: !21, line: 52, baseType: !7, size: 32, offset: 7584)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !182, file: !21, line: 53, baseType: !7, size: 32, offset: 7616)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !182, file: !21, line: 56, baseType: !68, size: 64, offset: 7680)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !132, file: !127, line: 870, baseType: !181, size: 7744, offset: 16320)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !132, file: !127, line: 871, baseType: !181, size: 7744, offset: 24064)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !132, file: !127, line: 873, baseType: !7, size: 32, offset: 31808)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !132, file: !127, line: 884, baseType: !7, size: 32, offset: 31840)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !132, file: !127, line: 885, baseType: !7, size: 32, offset: 31872)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !132, file: !127, line: 886, baseType: !7, size: 32, offset: 31904)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !132, file: !127, line: 890, baseType: !7, size: 32, offset: 31936)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !132, file: !127, line: 893, baseType: !7, size: 32, offset: 31968)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !132, file: !127, line: 894, baseType: !7, size: 32, offset: 32000)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !132, file: !127, line: 895, baseType: !7, size: 32, offset: 32032)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !132, file: !127, line: 897, baseType: !7, size: 32, offset: 32064)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !132, file: !127, line: 899, baseType: !7, size: 32, offset: 32096)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !128, file: !127, line: 569, baseType: !216, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !218, line: 138, baseType: !219)
!218 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !218, line: 94, size: 17728, elements: !220)
!220 = !{!221, !222, !223, !224, !225, !226, !227, !231, !236, !239, !242, !243, !244, !245, !246, !250, !251, !252, !253, !254, !255, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !219, file: !218, line: 96, baseType: !7, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !219, file: !218, line: 97, baseType: !31, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !219, file: !218, line: 98, baseType: !31, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !219, file: !218, line: 99, baseType: !7, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !219, file: !218, line: 100, baseType: !7, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !219, file: !218, line: 102, baseType: !7, size: 32, offset: 160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !219, file: !218, line: 103, baseType: !228, size: 384, offset: 192)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 384, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 12)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !219, file: !218, line: 104, baseType: !232, size: 3072, offset: 576)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3072, elements: !233)
!233 = !{!234, !235}
!234 = !DISubrange(count: 6)
!235 = !DISubrange(count: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !219, file: !218, line: 105, baseType: !237, size: 12288, offset: 3648)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 12288, elements: !238)
!238 = !{!234, !113}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !219, file: !218, line: 106, baseType: !240, size: 192, offset: 15936)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !241)
!241 = !{!234}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !219, file: !218, line: 107, baseType: !240, size: 192, offset: 16128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !219, file: !218, line: 110, baseType: !7, size: 32, offset: 16320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !219, file: !218, line: 111, baseType: !31, size: 32, offset: 16352)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !219, file: !218, line: 112, baseType: !31, size: 32, offset: 16384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !219, file: !218, line: 114, baseType: !247, size: 256, offset: 16416)
!247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 256, elements: !248)
!248 = !{!249}
!249 = !DISubrange(count: 8)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !219, file: !218, line: 116, baseType: !247, size: 256, offset: 16672)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !219, file: !218, line: 117, baseType: !247, size: 256, offset: 16928)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !219, file: !218, line: 119, baseType: !7, size: 32, offset: 17184)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !219, file: !218, line: 120, baseType: !31, size: 32, offset: 17216)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !219, file: !218, line: 122, baseType: !31, size: 32, offset: 17248)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !219, file: !218, line: 123, baseType: !256, size: 64, offset: 17280)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !219, file: !218, line: 125, baseType: !7, size: 32, offset: 17344)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !219, file: !218, line: 126, baseType: !7, size: 32, offset: 17376)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !219, file: !218, line: 127, baseType: !7, size: 32, offset: 17408)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !219, file: !218, line: 128, baseType: !31, size: 32, offset: 17440)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !219, file: !218, line: 129, baseType: !7, size: 32, offset: 17472)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !219, file: !218, line: 130, baseType: !7, size: 32, offset: 17504)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !219, file: !218, line: 131, baseType: !7, size: 32, offset: 17536)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !219, file: !218, line: 133, baseType: !7, size: 32, offset: 17568)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !219, file: !218, line: 135, baseType: !7, size: 32, offset: 17600)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !219, file: !218, line: 136, baseType: !7, size: 32, offset: 17632)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !219, file: !218, line: 137, baseType: !7, size: 32, offset: 17664)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !128, file: !127, line: 570, baseType: !269, size: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !218, line: 197, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !218, line: 142, size: 33024, elements: !272)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !369, !370}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !271, file: !218, line: 144, baseType: !7, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !271, file: !218, line: 146, baseType: !31, size: 32, offset: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !271, file: !218, line: 147, baseType: !7, size: 32, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !271, file: !218, line: 148, baseType: !7, size: 32, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !271, file: !218, line: 149, baseType: !7, size: 32, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !271, file: !218, line: 150, baseType: !7, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !271, file: !218, line: 152, baseType: !7, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !271, file: !218, line: 154, baseType: !31, size: 32, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !271, file: !218, line: 155, baseType: !31, size: 32, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !271, file: !218, line: 156, baseType: !31, size: 32, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !271, file: !218, line: 158, baseType: !7, size: 32, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !271, file: !218, line: 159, baseType: !228, size: 384, offset: 352)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !271, file: !218, line: 160, baseType: !232, size: 3072, offset: 736)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !271, file: !218, line: 161, baseType: !237, size: 12288, offset: 3808)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !271, file: !218, line: 162, baseType: !240, size: 192, offset: 16096)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !271, file: !218, line: 163, baseType: !240, size: 192, offset: 16288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !271, file: !218, line: 165, baseType: !31, size: 32, offset: 16480)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !271, file: !218, line: 166, baseType: !31, size: 32, offset: 16512)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !271, file: !218, line: 167, baseType: !31, size: 32, offset: 16544)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !271, file: !218, line: 168, baseType: !31, size: 32, offset: 16576)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !271, file: !218, line: 170, baseType: !31, size: 32, offset: 16608)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !271, file: !218, line: 172, baseType: !7, size: 32, offset: 16640)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !271, file: !218, line: 173, baseType: !7, size: 32, offset: 16672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !271, file: !218, line: 174, baseType: !7, size: 32, offset: 16704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !271, file: !218, line: 175, baseType: !31, size: 32, offset: 16736)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !271, file: !218, line: 177, baseType: !299, size: 8192, offset: 16768)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !271, file: !218, line: 178, baseType: !31, size: 32, offset: 24960)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !271, file: !218, line: 179, baseType: !7, size: 32, offset: 24992)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !271, file: !218, line: 180, baseType: !31, size: 32, offset: 25024)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !271, file: !218, line: 181, baseType: !31, size: 32, offset: 25056)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !271, file: !218, line: 182, baseType: !7, size: 32, offset: 25088)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !271, file: !218, line: 184, baseType: !7, size: 32, offset: 25120)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !271, file: !218, line: 185, baseType: !7, size: 32, offset: 25152)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !271, file: !218, line: 186, baseType: !7, size: 32, offset: 25184)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !271, file: !218, line: 187, baseType: !31, size: 32, offset: 25216)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !271, file: !218, line: 188, baseType: !31, size: 32, offset: 25248)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !271, file: !218, line: 189, baseType: !31, size: 32, offset: 25280)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !271, file: !218, line: 190, baseType: !31, size: 32, offset: 25312)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !271, file: !218, line: 191, baseType: !7, size: 32, offset: 25344)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !271, file: !218, line: 192, baseType: !316, size: 7584, offset: 25376)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !218, line: 90, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !218, line: 53, size: 7584, elements: !318)
!318 = !{!319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !317, file: !218, line: 55, baseType: !7, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !317, file: !218, line: 56, baseType: !31, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !317, file: !218, line: 57, baseType: !71, size: 16, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !317, file: !218, line: 58, baseType: !71, size: 16, offset: 80)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !317, file: !218, line: 59, baseType: !7, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !317, file: !218, line: 60, baseType: !7, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !317, file: !218, line: 61, baseType: !7, size: 32, offset: 160)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !317, file: !218, line: 62, baseType: !31, size: 32, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !317, file: !218, line: 63, baseType: !7, size: 32, offset: 224)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !317, file: !218, line: 64, baseType: !7, size: 32, offset: 256)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !317, file: !218, line: 65, baseType: !31, size: 32, offset: 288)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !317, file: !218, line: 66, baseType: !31, size: 32, offset: 320)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !317, file: !218, line: 67, baseType: !31, size: 32, offset: 352)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !317, file: !218, line: 68, baseType: !7, size: 32, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !317, file: !218, line: 69, baseType: !31, size: 32, offset: 416)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !317, file: !218, line: 70, baseType: !31, size: 32, offset: 448)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !317, file: !218, line: 71, baseType: !7, size: 32, offset: 480)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !317, file: !218, line: 72, baseType: !31, size: 32, offset: 512)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !317, file: !218, line: 73, baseType: !31, size: 32, offset: 544)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !317, file: !218, line: 74, baseType: !7, size: 32, offset: 576)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !317, file: !218, line: 75, baseType: !7, size: 32, offset: 608)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !317, file: !218, line: 76, baseType: !341, size: 3296, offset: 640)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !218, line: 50, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !218, line: 38, size: 3296, elements: !343)
!343 = !{!344, !345, !346, !347, !351, !352, !353, !354, !355, !356}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !342, file: !218, line: 40, baseType: !31, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !342, file: !218, line: 41, baseType: !31, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !342, file: !218, line: 42, baseType: !31, size: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !342, file: !218, line: 43, baseType: !348, size: 1024, offset: 96)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1024, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !342, file: !218, line: 44, baseType: !348, size: 1024, offset: 1120)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !342, file: !218, line: 45, baseType: !348, size: 1024, offset: 2144)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !342, file: !218, line: 46, baseType: !31, size: 32, offset: 3168)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !342, file: !218, line: 47, baseType: !31, size: 32, offset: 3200)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !342, file: !218, line: 48, baseType: !31, size: 32, offset: 3232)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !342, file: !218, line: 49, baseType: !31, size: 32, offset: 3264)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !317, file: !218, line: 77, baseType: !7, size: 32, offset: 3936)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !317, file: !218, line: 78, baseType: !341, size: 3296, offset: 3968)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !317, file: !218, line: 80, baseType: !7, size: 32, offset: 7264)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !317, file: !218, line: 81, baseType: !7, size: 32, offset: 7296)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !317, file: !218, line: 82, baseType: !7, size: 32, offset: 7328)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !317, file: !218, line: 83, baseType: !7, size: 32, offset: 7360)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !317, file: !218, line: 84, baseType: !31, size: 32, offset: 7392)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !317, file: !218, line: 85, baseType: !31, size: 32, offset: 7424)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !317, file: !218, line: 86, baseType: !31, size: 32, offset: 7456)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !317, file: !218, line: 87, baseType: !31, size: 32, offset: 7488)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !317, file: !218, line: 88, baseType: !31, size: 32, offset: 7520)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !317, file: !218, line: 89, baseType: !31, size: 32, offset: 7552)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !271, file: !218, line: 193, baseType: !31, size: 32, offset: 32960)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !271, file: !218, line: 195, baseType: !7, size: 32, offset: 32992)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !128, file: !127, line: 571, baseType: !372, size: 1056768, offset: 192)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 1056768, elements: !349)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !128, file: !127, line: 572, baseType: !374, size: 4538368, offset: 1056960)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 4538368, elements: !300)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !128, file: !127, line: 575, baseType: !376, size: 64, offset: 5595328)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !218, line: 256, baseType: !378)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !218, line: 228, size: 37312, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !400, !401, !402, !403}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !378, file: !218, line: 230, baseType: !270, size: 33024)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !378, file: !218, line: 232, baseType: !31, size: 32, offset: 33024)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !378, file: !218, line: 233, baseType: !7, size: 32, offset: 33056)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !378, file: !218, line: 234, baseType: !68, size: 64, offset: 33088)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !378, file: !218, line: 235, baseType: !68, size: 64, offset: 33152)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !378, file: !218, line: 236, baseType: !386, size: 64, offset: 33216)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !378, file: !218, line: 237, baseType: !68, size: 64, offset: 33280)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !378, file: !218, line: 238, baseType: !386, size: 64, offset: 33344)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !378, file: !218, line: 240, baseType: !68, size: 64, offset: 33408)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !378, file: !218, line: 241, baseType: !386, size: 64, offset: 33472)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !378, file: !218, line: 242, baseType: !68, size: 64, offset: 33536)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !378, file: !218, line: 243, baseType: !386, size: 64, offset: 33600)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !378, file: !218, line: 245, baseType: !7, size: 32, offset: 33664)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !378, file: !218, line: 246, baseType: !68, size: 64, offset: 33728)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !378, file: !218, line: 247, baseType: !68, size: 64, offset: 33792)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !378, file: !218, line: 248, baseType: !386, size: 64, offset: 33856)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !378, file: !218, line: 249, baseType: !386, size: 64, offset: 33920)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !378, file: !218, line: 250, baseType: !399, size: 64, offset: 33984)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !378, file: !218, line: 251, baseType: !386, size: 64, offset: 34048)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !378, file: !218, line: 253, baseType: !31, size: 32, offset: 34112)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !378, file: !218, line: 254, baseType: !7, size: 32, offset: 34144)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !378, file: !218, line: 255, baseType: !404, size: 3136, offset: 34176)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !218, line: 226, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !218, line: 200, size: 3136, elements: !406)
!406 = !{!407, !408, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !426, !427, !429, !430, !431, !432}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !405, file: !218, line: 202, baseType: !7, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !405, file: !218, line: 203, baseType: !409, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !405, file: !218, line: 204, baseType: !68, size: 64, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !405, file: !218, line: 205, baseType: !386, size: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !405, file: !218, line: 206, baseType: !409, size: 64, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !405, file: !218, line: 207, baseType: !68, size: 64, offset: 320)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !405, file: !218, line: 208, baseType: !68, size: 64, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !405, file: !218, line: 209, baseType: !409, size: 64, offset: 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !405, file: !218, line: 210, baseType: !409, size: 64, offset: 512)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !405, file: !218, line: 211, baseType: !409, size: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !405, file: !218, line: 212, baseType: !409, size: 64, offset: 640)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !405, file: !218, line: 213, baseType: !409, size: 64, offset: 704)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !405, file: !218, line: 216, baseType: !410, size: 8, offset: 768)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !405, file: !218, line: 217, baseType: !410, size: 8, offset: 776)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !405, file: !218, line: 218, baseType: !410, size: 8, offset: 784)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !405, file: !218, line: 219, baseType: !425, size: 1024, offset: 800)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !349)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !405, file: !218, line: 220, baseType: !425, size: 1024, offset: 1824)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !405, file: !218, line: 221, baseType: !428, size: 256, offset: 2848)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 256, elements: !349)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !405, file: !218, line: 222, baseType: !410, size: 8, offset: 3104)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !405, file: !218, line: 223, baseType: !410, size: 8, offset: 3112)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !405, file: !218, line: 224, baseType: !410, size: 8, offset: 3120)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !405, file: !218, line: 225, baseType: !410, size: 8, offset: 3128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !128, file: !127, line: 577, baseType: !434, size: 1193984, offset: 5595392)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 1193984, elements: !349)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !128, file: !127, line: 578, baseType: !7, size: 32, offset: 6789376)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !128, file: !127, line: 579, baseType: !7, size: 32, offset: 6789408)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !128, file: !127, line: 580, baseType: !7, size: 32, offset: 6789440)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !128, file: !127, line: 581, baseType: !7, size: 32, offset: 6789472)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !128, file: !127, line: 584, baseType: !440, size: 64, offset: 6789504)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !127, line: 584, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !128, file: !127, line: 586, baseType: !443, size: 64, offset: 6789568)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !127, line: 902, size: 416, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !454, !455, !456, !457, !458, !459, !460}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !444, file: !127, line: 904, baseType: !31, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !444, file: !127, line: 905, baseType: !31, size: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !444, file: !127, line: 906, baseType: !7, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !444, file: !127, line: 907, baseType: !31, size: 32, offset: 96)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !444, file: !127, line: 908, baseType: !7, size: 32, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !444, file: !127, line: 909, baseType: !452, size: 64, offset: 160)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !453)
!453 = !{!101}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !444, file: !127, line: 910, baseType: !64, size: 8, offset: 224)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !444, file: !127, line: 911, baseType: !64, size: 8, offset: 232)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !444, file: !127, line: 912, baseType: !7, size: 32, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !444, file: !127, line: 913, baseType: !7, size: 32, offset: 288)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !444, file: !127, line: 915, baseType: !7, size: 32, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !444, file: !127, line: 916, baseType: !7, size: 32, offset: 352)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !444, file: !127, line: 917, baseType: !7, size: 32, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !128, file: !127, line: 587, baseType: !462, size: 64, offset: 6789632)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !127, line: 839, size: 512, elements: !464)
!464 = !{!465, !466, !469, !470, !471, !472}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !463, file: !127, line: 841, baseType: !7, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !463, file: !127, line: 842, baseType: !467, size: 96, offset: 32)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 96, elements: !159)
!468 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !463, file: !127, line: 843, baseType: !467, size: 96, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !463, file: !127, line: 844, baseType: !467, size: 96, offset: 224)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !463, file: !127, line: 845, baseType: !467, size: 96, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !463, file: !127, line: 846, baseType: !467, size: 96, offset: 416)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !128, file: !127, line: 588, baseType: !7, size: 32, offset: 6789696)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !128, file: !127, line: 591, baseType: !31, size: 32, offset: 6789728)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !128, file: !127, line: 592, baseType: !7, size: 32, offset: 6789760)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !128, file: !127, line: 593, baseType: !7, size: 32, offset: 6789792)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !128, file: !127, line: 594, baseType: !7, size: 32, offset: 6789824)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !128, file: !127, line: 595, baseType: !479, size: 64, offset: 6789888)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !127, line: 542, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !127, line: 341, size: 109184, elements: !483)
!483 = !{!484, !486, !487, !488, !489, !490, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !709, !711, !871, !900, !926, !929, !930, !932, !933, !934, !935, !936, !937, !938, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !965, !966, !967, !968, !969, !970, !973, !974, !977, !978, !980, !982, !983, !984, !985, !986, !987, !988, !989, !990, !992, !993, !994, !995, !996, !999, !1000, !1001, !1005, !1009, !1013, !1017, !1021, !1022, !1023, !1024, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1038, !1039}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !482, file: !127, line: 343, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !482, file: !127, line: 344, baseType: !131, size: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !482, file: !127, line: 345, baseType: !216, size: 64, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !482, file: !127, line: 346, baseType: !269, size: 64, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "svc_extension_flag", scope: !482, file: !127, line: 347, baseType: !7, size: 32, offset: 256)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !482, file: !127, line: 350, baseType: !491, size: 64, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !493, line: 186, size: 33408, elements: !494)
!493 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!494 = !{!495, !496, !499, !643, !644, !645, !646, !647, !648, !649, !650, !651, !655, !656, !657}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !492, file: !493, line: 188, baseType: !125, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !492, file: !493, line: 189, baseType: !497, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !127, line: 900, baseType: !132)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !492, file: !493, line: 190, baseType: !500, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !493, line: 182, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !493, line: 152, size: 768, elements: !504)
!504 = !{!505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !638, !639, !640, !641, !642}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !503, file: !493, line: 154, baseType: !7, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !503, file: !493, line: 155, baseType: !7, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !503, file: !493, line: 156, baseType: !7, size: 32, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !503, file: !493, line: 157, baseType: !7, size: 32, offset: 96)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !503, file: !493, line: 159, baseType: !7, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !503, file: !493, line: 161, baseType: !31, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !503, file: !493, line: 162, baseType: !31, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !503, file: !493, line: 164, baseType: !7, size: 32, offset: 224)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !503, file: !493, line: 165, baseType: !7, size: 32, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !503, file: !493, line: 166, baseType: !7, size: 32, offset: 288)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !503, file: !493, line: 167, baseType: !7, size: 32, offset: 320)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !503, file: !493, line: 170, baseType: !7, size: 32, offset: 352)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !503, file: !493, line: 172, baseType: !518, size: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !493, line: 138, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !493, line: 46, size: 3328, elements: !521)
!521 = !{!522, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !558, !560, !561, !578, !580, !584, !586, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !520, file: !493, line: 48, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !30, line: 140, baseType: !29)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !520, file: !493, line: 50, baseType: !7, size: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !520, file: !493, line: 51, baseType: !7, size: 32, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !520, file: !493, line: 52, baseType: !7, size: 32, offset: 96)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !520, file: !493, line: 53, baseType: !7, size: 32, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !520, file: !493, line: 54, baseType: !31, size: 32, offset: 160)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !520, file: !493, line: 55, baseType: !31, size: 32, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !520, file: !493, line: 57, baseType: !7, size: 32, offset: 224)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !520, file: !493, line: 58, baseType: !7, size: 32, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !520, file: !493, line: 59, baseType: !7, size: 32, offset: 288)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !520, file: !493, line: 61, baseType: !64, size: 8, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !520, file: !493, line: 62, baseType: !7, size: 32, offset: 352)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !520, file: !493, line: 63, baseType: !7, size: 32, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !520, file: !493, line: 64, baseType: !7, size: 32, offset: 416)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !520, file: !493, line: 65, baseType: !7, size: 32, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !520, file: !493, line: 67, baseType: !67, size: 16, offset: 480)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !520, file: !493, line: 69, baseType: !7, size: 32, offset: 512)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !520, file: !493, line: 69, baseType: !7, size: 32, offset: 544)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !520, file: !493, line: 69, baseType: !7, size: 32, offset: 576)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !520, file: !493, line: 69, baseType: !7, size: 32, offset: 608)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !520, file: !493, line: 70, baseType: !7, size: 32, offset: 640)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !520, file: !493, line: 70, baseType: !7, size: 32, offset: 672)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !520, file: !493, line: 70, baseType: !7, size: 32, offset: 704)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !520, file: !493, line: 70, baseType: !7, size: 32, offset: 736)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !520, file: !493, line: 71, baseType: !7, size: 32, offset: 768)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !520, file: !493, line: 72, baseType: !7, size: 32, offset: 800)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !520, file: !493, line: 73, baseType: !31, size: 32, offset: 832)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !520, file: !493, line: 74, baseType: !31, size: 32, offset: 864)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !520, file: !493, line: 75, baseType: !7, size: 32, offset: 896)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !520, file: !493, line: 75, baseType: !7, size: 32, offset: 928)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !520, file: !493, line: 76, baseType: !7, size: 32, offset: 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !520, file: !493, line: 76, baseType: !7, size: 32, offset: 992)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !520, file: !493, line: 79, baseType: !556, size: 64, offset: 1024)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !520, file: !493, line: 80, baseType: !559, size: 64, offset: 1088)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !520, file: !493, line: 81, baseType: !559, size: 64, offset: 1152)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !520, file: !493, line: 84, baseType: !562, size: 64, offset: 1216)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !493, line: 36, size: 256, elements: !565)
!565 = !{!566, !569, !576}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !564, file: !493, line: 38, baseType: !567, size: 128)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 128, elements: !453)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !564, file: !493, line: 39, baseType: !570, size: 64, offset: 128)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 64, elements: !453)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !127, line: 104, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 100, size: 32, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !572, file: !127, line: 102, baseType: !67, size: 16)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !572, file: !127, line: 103, baseType: !67, size: 16, offset: 16)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !564, file: !493, line: 40, baseType: !577, size: 16, offset: 192)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 16, elements: !453)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !520, file: !493, line: 85, baseType: !579, size: 192, offset: 1280)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 192, elements: !159)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !520, file: !493, line: 87, baseType: !581, size: 64, offset: 1472)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !493, line: 29, size: 64, elements: !582)
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !581, file: !493, line: 31, baseType: !256, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !520, file: !493, line: 88, baseType: !585, size: 192, offset: 1536)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 192, elements: !159)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !520, file: !493, line: 90, baseType: !587, size: 64, offset: 1728)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !520, file: !493, line: 92, baseType: !568, size: 64, offset: 1792)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !520, file: !493, line: 93, baseType: !568, size: 64, offset: 1856)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !520, file: !493, line: 94, baseType: !568, size: 64, offset: 1920)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !520, file: !493, line: 96, baseType: !7, size: 32, offset: 1984)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !520, file: !493, line: 97, baseType: !7, size: 32, offset: 2016)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !520, file: !493, line: 98, baseType: !7, size: 32, offset: 2048)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !520, file: !493, line: 99, baseType: !7, size: 32, offset: 2080)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !520, file: !493, line: 100, baseType: !7, size: 32, offset: 2112)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !520, file: !493, line: 102, baseType: !7, size: 32, offset: 2144)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !520, file: !493, line: 103, baseType: !7, size: 32, offset: 2176)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !520, file: !493, line: 104, baseType: !7, size: 32, offset: 2208)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !520, file: !493, line: 105, baseType: !7, size: 32, offset: 2240)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !520, file: !493, line: 106, baseType: !7, size: 32, offset: 2272)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !520, file: !493, line: 107, baseType: !7, size: 32, offset: 2304)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !520, file: !493, line: 108, baseType: !7, size: 32, offset: 2336)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !520, file: !493, line: 109, baseType: !7, size: 32, offset: 2368)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !520, file: !493, line: 110, baseType: !452, size: 64, offset: 2400)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !520, file: !493, line: 111, baseType: !7, size: 32, offset: 2464)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !520, file: !493, line: 112, baseType: !608, size: 64, offset: 2496)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !127, line: 194, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !127, line: 186, size: 256, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !610, file: !127, line: 188, baseType: !7, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !610, file: !127, line: 189, baseType: !7, size: 32, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !610, file: !127, line: 190, baseType: !7, size: 32, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !610, file: !127, line: 191, baseType: !7, size: 32, offset: 96)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !610, file: !127, line: 192, baseType: !7, size: 32, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !610, file: !127, line: 193, baseType: !618, size: 64, offset: 192)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !520, file: !493, line: 115, baseType: !7, size: 32, offset: 2560)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !520, file: !493, line: 118, baseType: !7, size: 32, offset: 2592)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !520, file: !493, line: 119, baseType: !7, size: 32, offset: 2624)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !520, file: !493, line: 120, baseType: !7, size: 32, offset: 2656)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !520, file: !493, line: 121, baseType: !557, size: 64, offset: 2688)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !520, file: !493, line: 124, baseType: !7, size: 32, offset: 2752)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !520, file: !493, line: 125, baseType: !7, size: 32, offset: 2784)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !520, file: !493, line: 126, baseType: !7, size: 32, offset: 2816)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !520, file: !493, line: 128, baseType: !7, size: 32, offset: 2848)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !520, file: !493, line: 129, baseType: !7, size: 32, offset: 2880)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !520, file: !493, line: 130, baseType: !7, size: 32, offset: 2912)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !520, file: !493, line: 131, baseType: !7, size: 32, offset: 2944)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !520, file: !493, line: 132, baseType: !556, size: 64, offset: 3008)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !520, file: !493, line: 133, baseType: !7, size: 32, offset: 3072)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !520, file: !493, line: 134, baseType: !7, size: 32, offset: 3104)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !520, file: !493, line: 136, baseType: !577, size: 16, offset: 3136)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !520, file: !493, line: 137, baseType: !636, size: 128, offset: 3200)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 128, elements: !453)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !503, file: !493, line: 173, baseType: !518, size: 64, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !503, file: !493, line: 174, baseType: !518, size: 64, offset: 512)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !503, file: !493, line: 177, baseType: !7, size: 32, offset: 576)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !503, file: !493, line: 178, baseType: !452, size: 64, offset: 608)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !503, file: !493, line: 179, baseType: !452, size: 64, offset: 672)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ref", scope: !492, file: !493, line: 191, baseType: !500, size: 64, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ltref", scope: !492, file: !493, line: 192, baseType: !500, size: 64, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !492, file: !493, line: 193, baseType: !31, size: 32, offset: 320)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !492, file: !493, line: 194, baseType: !31, size: 32, offset: 352)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frames_in_buffer", scope: !492, file: !493, line: 195, baseType: !31, size: 32, offset: 384)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ltref_frames_in_buffer", scope: !492, file: !493, line: 196, baseType: !31, size: 32, offset: 416)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_poc", scope: !492, file: !493, line: 197, baseType: !7, size: 32, offset: 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_view_id", scope: !492, file: !493, line: 199, baseType: !7, size: 32, offset: 480)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_pic_idx", scope: !492, file: !493, line: 200, baseType: !652, size: 32768, offset: 512)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32768, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 1024)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "init_done", scope: !492, file: !493, line: 205, baseType: !7, size: 32, offset: 33280)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !492, file: !493, line: 206, baseType: !7, size: 32, offset: 33312)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "last_picture", scope: !492, file: !493, line: 208, baseType: !501, size: 64, offset: 33344)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !482, file: !127, line: 353, baseType: !7, size: 32, offset: 384)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !482, file: !127, line: 354, baseType: !7, size: 32, offset: 416)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !482, file: !127, line: 355, baseType: !7, size: 32, offset: 448)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Transform8x8Mode", scope: !482, file: !127, line: 356, baseType: !7, size: 32, offset: 480)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "is_not_independent", scope: !482, file: !127, line: 357, baseType: !7, size: 32, offset: 512)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "toppoc", scope: !482, file: !127, line: 359, baseType: !7, size: 32, offset: 544)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "bottompoc", scope: !482, file: !127, line: 360, baseType: !7, size: 32, offset: 576)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "framepoc", scope: !482, file: !127, line: 361, baseType: !7, size: 32, offset: 608)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !482, file: !127, line: 365, baseType: !31, size: 32, offset: 640)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !482, file: !127, line: 366, baseType: !7, size: 32, offset: 672)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !482, file: !127, line: 368, baseType: !452, size: 64, offset: 704)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntMsb", scope: !482, file: !127, line: 372, baseType: !7, size: 32, offset: 768)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "AbsFrameNum", scope: !482, file: !127, line: 378, baseType: !31, size: 32, offset: 800)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !482, file: !127, line: 379, baseType: !7, size: 32, offset: 832)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "current_mb_nr", scope: !482, file: !127, line: 387, baseType: !31, size: 32, offset: 864)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !482, file: !127, line: 388, baseType: !31, size: 32, offset: 896)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "current_slice_nr", scope: !482, file: !127, line: 389, baseType: !67, size: 16, offset: 928)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "cod_counter", scope: !482, file: !127, line: 396, baseType: !7, size: 32, offset: 960)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "allrefzero", scope: !482, file: !127, line: 397, baseType: !7, size: 32, offset: 992)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !482, file: !127, line: 400, baseType: !7, size: 32, offset: 1024)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !482, file: !127, line: 401, baseType: !7, size: 32, offset: 1056)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_active", scope: !482, file: !127, line: 402, baseType: !452, size: 64, offset: 1088)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !482, file: !127, line: 406, baseType: !7, size: 32, offset: 1152)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !482, file: !127, line: 407, baseType: !7, size: 32, offset: 1184)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !482, file: !127, line: 408, baseType: !7, size: 32, offset: 1216)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "qs", scope: !482, file: !127, line: 409, baseType: !7, size: 32, offset: 1248)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qs_delta", scope: !482, file: !127, line: 410, baseType: !7, size: 32, offset: 1280)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !482, file: !127, line: 411, baseType: !7, size: 32, offset: 1312)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "model_number", scope: !482, file: !127, line: 412, baseType: !7, size: 32, offset: 1344)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !482, file: !127, line: 413, baseType: !31, size: 32, offset: 1376)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !482, file: !127, line: 414, baseType: !31, size: 32, offset: 1408)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !482, file: !127, line: 415, baseType: !64, size: 8, offset: 1440)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !482, file: !127, line: 416, baseType: !523, size: 32, offset: 1472)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !482, file: !127, line: 417, baseType: !7, size: 32, offset: 1504)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "end_mb_nr_plus1", scope: !482, file: !127, line: 418, baseType: !7, size: 32, offset: 1536)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !482, file: !127, line: 419, baseType: !7, size: 32, offset: 1568)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "dp_mode", scope: !482, file: !127, line: 420, baseType: !7, size: 32, offset: 1600)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "current_header", scope: !482, file: !127, line: 421, baseType: !7, size: 32, offset: 1632)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "next_header", scope: !482, file: !127, line: 422, baseType: !7, size: 32, offset: 1664)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "last_dquant", scope: !482, file: !127, line: 423, baseType: !7, size: 32, offset: 1696)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "colour_plane_id", scope: !482, file: !127, line: 426, baseType: !7, size: 32, offset: 1728)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !482, file: !127, line: 427, baseType: !7, size: 32, offset: 1760)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "sp_switch", scope: !482, file: !127, line: 428, baseType: !7, size: 32, offset: 1792)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !482, file: !127, line: 429, baseType: !7, size: 32, offset: 1824)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_slice_ref_idx", scope: !482, file: !127, line: 430, baseType: !7, size: 32, offset: 1856)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !482, file: !127, line: 431, baseType: !7, size: 32, offset: 1888)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !482, file: !127, line: 432, baseType: !7, size: 32, offset: 1920)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !482, file: !127, line: 433, baseType: !7, size: 32, offset: 1952)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !482, file: !127, line: 434, baseType: !608, size: 64, offset: 1984)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !482, file: !127, line: 436, baseType: !708, size: 48, offset: 2048)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 48, elements: !241)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !482, file: !127, line: 437, baseType: !710, size: 384, offset: 2112)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 384, elements: !241)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !482, file: !127, line: 440, baseType: !712, size: 64, offset: 2496)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !127, line: 324, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !127, line: 314, size: 384, elements: !715)
!715 = !{!716, !727, !736}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !714, file: !127, line: 317, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !127, line: 47, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream", file: !127, line: 300, size: 256, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "read_len", scope: !719, file: !127, line: 303, baseType: !7, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !719, file: !127, line: 304, baseType: !7, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bitoffset", scope: !719, file: !127, line: 306, baseType: !7, size: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_length", scope: !719, file: !127, line: 307, baseType: !7, size: 32, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !719, file: !127, line: 309, baseType: !256, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !719, file: !127, line: 310, baseType: !7, size: 32, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "de_cabac", scope: !714, file: !127, line: 318, baseType: !728, size: 256, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !127, line: 95, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 88, size: 256, elements: !730)
!730 = !{!731, !732, !733, !734, !735}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !729, file: !127, line: 90, baseType: !31, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !729, file: !127, line: 91, baseType: !31, size: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !729, file: !127, line: 92, baseType: !7, size: 32, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !729, file: !127, line: 93, baseType: !256, size: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !729, file: !127, line: 94, baseType: !68, size: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "readSyntaxElement", scope: !714, file: !127, line: 320, baseType: !737, size: 64, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!7, !740, !869, !867}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !127, line: 273, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !127, line: 197, size: 3840, elements: !743)
!743 = !{!744, !746, !747, !748, !749, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !778, !779, !780, !781, !782, !785, !786, !793, !794, !795, !796, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !822, !823, !838, !844, !868}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !742, file: !127, line: 199, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !742, file: !127, line: 200, baseType: !485, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !742, file: !127, line: 201, baseType: !131, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrX", scope: !742, file: !127, line: 202, baseType: !7, size: 32, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !742, file: !127, line: 203, baseType: !750, size: 32, offset: 224)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockPos", file: !127, line: 112, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 108, size: 32, elements: !752)
!752 = !{!753, !754}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !751, file: !127, line: 110, baseType: !67, size: 16)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !751, file: !127, line: 111, baseType: !67, size: 16, offset: 16)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !742, file: !127, line: 204, baseType: !7, size: 32, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !742, file: !127, line: 205, baseType: !7, size: 32, offset: 288)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "block_y_aff", scope: !742, file: !127, line: 206, baseType: !7, size: 32, offset: 320)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !742, file: !127, line: 207, baseType: !7, size: 32, offset: 352)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !742, file: !127, line: 208, baseType: !7, size: 32, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !742, file: !127, line: 209, baseType: !7, size: 32, offset: 416)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !742, file: !127, line: 210, baseType: !7, size: 32, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !742, file: !127, line: 212, baseType: !7, size: 32, offset: 480)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !742, file: !127, line: 213, baseType: !7, size: 32, offset: 512)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !742, file: !127, line: 215, baseType: !7, size: 32, offset: 544)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "qpc", scope: !742, file: !127, line: 216, baseType: !452, size: 64, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "qp_scaled", scope: !742, file: !127, line: 217, baseType: !158, size: 96, offset: 640)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "is_lossless", scope: !742, file: !127, line: 218, baseType: !7, size: 32, offset: 736)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !742, file: !127, line: 219, baseType: !7, size: 32, offset: 768)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !742, file: !127, line: 220, baseType: !7, size: 32, offset: 800)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !742, file: !127, line: 221, baseType: !7, size: 32, offset: 832)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !742, file: !127, line: 223, baseType: !67, size: 16, offset: 864)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !742, file: !127, line: 224, baseType: !410, size: 8, offset: 880)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "dpl_flag", scope: !742, file: !127, line: 225, baseType: !410, size: 8, offset: 888)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "delta_quant", scope: !742, file: !127, line: 226, baseType: !67, size: 16, offset: 896)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "list_offset", scope: !742, file: !127, line: 227, baseType: !67, size: 16, offset: 912)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "mb_up", scope: !742, file: !127, line: 229, baseType: !777, size: 64, offset: 960)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mb_left", scope: !742, file: !127, line: 230, baseType: !777, size: 64, offset: 1024)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mbup", scope: !742, file: !127, line: 232, baseType: !777, size: 64, offset: 1088)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "mbleft", scope: !742, file: !127, line: 233, baseType: !777, size: 64, offset: 1152)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !742, file: !127, line: 236, baseType: !67, size: 16, offset: 1216)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !742, file: !127, line: 237, baseType: !783, size: 1024, offset: 1232)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 1024, elements: !784)
!784 = !{!101, !102, !102, !101}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !742, file: !127, line: 239, baseType: !7, size: 32, offset: 2272)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !742, file: !127, line: 240, baseType: !787, size: 192, offset: 2304)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 192, elements: !159)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !106, line: 103, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !790, line: 27, baseType: !791)
!790 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !110, line: 44, baseType: !792)
!792 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !742, file: !127, line: 241, baseType: !787, size: 192, offset: 2496)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits_8x8", scope: !742, file: !127, line: 242, baseType: !787, size: 192, offset: 2688)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "i16mode", scope: !742, file: !127, line: 244, baseType: !7, size: 32, offset: 2880)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !742, file: !127, line: 245, baseType: !797, size: 32, offset: 2912)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 32, elements: !798)
!798 = !{!102}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !742, file: !127, line: 246, baseType: !797, size: 32, offset: 2944)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ipmode_DPCM", scope: !742, file: !127, line: 247, baseType: !410, size: 8, offset: 2976)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !742, file: !127, line: 248, baseType: !410, size: 8, offset: 2984)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !742, file: !127, line: 249, baseType: !410, size: 8, offset: 2992)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "DFDisableIdc", scope: !742, file: !127, line: 250, baseType: !67, size: 16, offset: 3008)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "DFAlphaC0Offset", scope: !742, file: !127, line: 251, baseType: !67, size: 16, offset: 3024)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "DFBetaOffset", scope: !742, file: !127, line: 252, baseType: !67, size: 16, offset: 3040)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !742, file: !127, line: 254, baseType: !7, size: 32, offset: 3072)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !742, file: !127, line: 256, baseType: !7, size: 32, offset: 3104)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !742, file: !127, line: 256, baseType: !7, size: 32, offset: 3136)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !742, file: !127, line: 256, baseType: !7, size: 32, offset: 3168)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !742, file: !127, line: 256, baseType: !7, size: 32, offset: 3200)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !742, file: !127, line: 257, baseType: !7, size: 32, offset: 3232)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !742, file: !127, line: 257, baseType: !7, size: 32, offset: 3264)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !742, file: !127, line: 257, baseType: !7, size: 32, offset: 3296)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !742, file: !127, line: 257, baseType: !7, size: 32, offset: 3328)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !742, file: !127, line: 259, baseType: !7, size: 32, offset: 3360)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !742, file: !127, line: 260, baseType: !7, size: 32, offset: 3392)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_4x4", scope: !742, file: !127, line: 262, baseType: !818, size: 64, offset: 3456)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !777, !821, !7, !7}
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorPlane", file: !30, line: 32, baseType: !36)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_8x8", scope: !742, file: !127, line: 263, baseType: !818, size: 64, offset: 3520)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "GetMVPredictor", scope: !742, file: !127, line: 265, baseType: !824, size: 64, offset: 3584)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DISubroutineType(types: !826)
!826 = !{null, !777, !827, !837, !67, !562, !7, !7, !7, !7, !7}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !127, line: 85, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !127, line: 77, size: 128, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !829, file: !127, line: 79, baseType: !7, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !829, file: !127, line: 80, baseType: !7, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !829, file: !127, line: 81, baseType: !67, size: 16, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !829, file: !127, line: 82, baseType: !67, size: 16, offset: 80)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !829, file: !127, line: 83, baseType: !67, size: 16, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !829, file: !127, line: 84, baseType: !67, size: 16, offset: 112)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "read_and_store_CBP_block_bit", scope: !742, file: !127, line: 268, baseType: !839, size: 64, offset: 3648)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!7, !777, !842, !7}
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironmentPtr", file: !127, line: 97, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "readRefPictureIdx", scope: !742, file: !127, line: 269, baseType: !845, size: 64, offset: 3712)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!410, !777, !848, !867, !410, !7}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !127, line: 276, size: 384, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859, !863}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !849, file: !127, line: 278, baseType: !7, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !849, file: !127, line: 279, baseType: !7, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !849, file: !127, line: 280, baseType: !7, size: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !849, file: !127, line: 281, baseType: !7, size: 32, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !849, file: !127, line: 282, baseType: !7, size: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !849, file: !127, line: 283, baseType: !31, size: 32, offset: 160)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !849, file: !127, line: 284, baseType: !7, size: 32, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !849, file: !127, line: 285, baseType: !7, size: 32, offset: 224)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !849, file: !127, line: 293, baseType: !860, size: 64, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !7, !7, !68, !68}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !849, file: !127, line: 295, baseType: !864, size: 64, offset: 320)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !740, !848, !842}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "mixedModeEdgeFlag", scope: !742, file: !127, line: 272, baseType: !64, size: 8, offset: 3776)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !127, line: 296, baseType: !849)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "mot_ctx", scope: !482, file: !127, line: 441, baseType: !872, size: 64, offset: 2560)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionInfoContexts", file: !127, line: 153, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 145, size: 2912, elements: !875)
!875 = !{!876, !886, !890, !894, !897, !899}
