; ModuleID = 'ldecod_src/macroblock.c'
source_filename = "ldecod_src/macroblock.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.macroblock = type { ptr, ptr, ptr, i32, %struct.BlockPos, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], [3 x i32], i32, i32, i32, i32, i16, i8, i8, i16, i16, ptr, ptr, ptr, ptr, i16, [2 x [4 x [4 x [2 x i16]]]], i32, [3 x i64], [3 x i64], [3 x i64], i32, [4 x i8], [4 x i8], i8, i8, i8, i16, i16, i16, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, i8 }
%struct.BlockPos = type { i16, i16 }
%struct.syntaxelement = type { i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }
%struct.pic_motion_params = type { [2 x ptr], [2 x %struct.MotionVector], [2 x i8] }
%struct.MotionVector = type { i16, i16 }
%struct.datapartition = type { ptr, %struct.DecodingEnvironment, ptr }
%struct.DecodingEnvironment = type { i32, i32, i32, ptr, ptr }
%struct.pix_pos = type { i32, i32, i16, i16, i16, i16 }

@QP_SCALE_CR = internal unnamed_addr constant [52 x i8] c"\00\01\02\03\04\05\06\07\08\09\0A\0B\0C\0D\0E\0F\10\11\12\13\14\15\16\17\18\19\1A\1B\1C\1D\1D\1E\1F  !\22\22##$$%%%&&&''''", align 16, !dbg !0
@PicPos = external local_unnamed_addr global ptr, align 8
@SetB8Mode.p_v2b8 = internal unnamed_addr constant [5 x i8] c"\04\05\06\07\0B", align 1, !dbg !169

!154 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorPlane", file: !30, line: 32, baseType: !36)
!157 = !{!158, !164, !169, !1352, !1354, !1359, !1361, !0, !1366, !1376, !1384, !1393, !1397, !1399, !1401, !1407, !1410, !1416, !1418, !1420, !1426, !1430, !1432, !1437, !1441, !1443, !1448, !1450, !1453, !1455, !1459, !1462, !1506, !1511}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !3, line: 830, type: !160, isLocal: true, isDefinition: true)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 192, elements: !162)
!161 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!162 = !{!163}
!163 = !DISubrange(count: 24)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(scope: null, file: !3, line: 864, type: !166, isLocal: true, isDefinition: true)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 264, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 33)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "p_v2b8", scope: !171, file: !3, line: 902, type: !1349, isLocal: true, isDefinition: true)
!171 = distinct !DISubprogram(name: "SetB8Mode", scope: !3, file: !3, line: 899, type: !172, scopeLine: 900, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1344)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !174, !7, !7}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !176, line: 273, baseType: !177)
!176 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !176, line: 197, size: 3840, elements: !178)
!178 = !{!179, !1260, !1261, !1262, !1263, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1292, !1293, !1294, !1295, !1296, !1299, !1300, !1302, !1303, !1304, !1305, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1329, !1330, !1335, !1339, !1343}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !177, file: !176, line: 199, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !176, line: 341, size: 109184, elements: !182)
!182 = !{!183, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1034, !1036, !1089, !1119, !1146, !1149, !1150, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1185, !1186, !1187, !1188, !1189, !1190, !1193, !1194, !1197, !1198, !1200, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1213, !1214, !1215, !1216, !1217, !1219, !1220, !1221, !1225, !1229, !1233, !1237, !1241, !1242, !1243, !1244, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !181, file: !176, line: 343, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !176, line: 566, size: 6855040, elements: !186)
!186 = !{!187, !272, !326, !430, !432, !434, !491, !493, !494, !495, !496, !497, !500, !520, !532, !533, !534, !535, !536, !537, !541, !542, !544, !545, !546, !547, !548, !549, !551, !553, !556, !557, !559, !560, !561, !562, !563, !565, !566, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !681, !682, !683, !684, !685, !686, !687, !688, !689, !691, !692, !693, !833, !837, !838, !840, !841, !844, !847, !848, !849, !853, !856, !859, !860, !861, !862, !863, !864, !890, !891, !893, !897, !898, !899, !900, !903, !908, !922, !926, !930, !931, !935, !936, !940, !941, !945, !966, !967, !970, !971, !972, !973, !974, !975, !976, !977}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !185, file: !176, line: 568, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !176, line: 850, size: 32128, elements: !190)
!190 = !{!191, !195, !196, !197, !198, !199, !200, !201, !202, !203, !233, !234, !235, !236, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !189, file: !176, line: 852, baseType: !192, size: 2040)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 2040, elements: !193)
!193 = !{!194}
!194 = !DISubrange(count: 255)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !189, file: !176, line: 853, baseType: !192, size: 2040, offset: 2040)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !189, file: !176, line: 854, baseType: !192, size: 2040, offset: 4080)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !189, file: !176, line: 856, baseType: !7, size: 32, offset: 6144)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !189, file: !176, line: 857, baseType: !7, size: 32, offset: 6176)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !189, file: !176, line: 858, baseType: !7, size: 32, offset: 6208)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !189, file: !176, line: 859, baseType: !7, size: 32, offset: 6240)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !189, file: !176, line: 860, baseType: !7, size: 32, offset: 6272)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !189, file: !176, line: 861, baseType: !7, size: 32, offset: 6304)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !189, file: !176, line: 864, baseType: !204, size: 1088, offset: 6336)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !6, line: 52, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !6, line: 30, size: 1088, elements: !206)
!206 = !{!207, !209, !211, !213, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !205, file: !6, line: 32, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !6, line: 28, baseType: !5)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !205, file: !6, line: 33, baseType: !210, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !6, line: 20, baseType: !14)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !205, file: !6, line: 34, baseType: !212, size: 64, offset: 64)
!212 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !205, file: !6, line: 35, baseType: !214, size: 96, offset: 128)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 3)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !205, file: !6, line: 36, baseType: !214, size: 96, offset: 224)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !205, file: !6, line: 37, baseType: !7, size: 32, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !205, file: !6, line: 38, baseType: !7, size: 32, offset: 352)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !205, file: !6, line: 39, baseType: !7, size: 32, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !205, file: !6, line: 40, baseType: !7, size: 32, offset: 416)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !205, file: !6, line: 41, baseType: !7, size: 32, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !205, file: !6, line: 42, baseType: !7, size: 32, offset: 480)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !205, file: !6, line: 43, baseType: !7, size: 32, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !205, file: !6, line: 44, baseType: !7, size: 32, offset: 544)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !205, file: !6, line: 45, baseType: !214, size: 96, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !205, file: !6, line: 46, baseType: !7, size: 32, offset: 672)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !205, file: !6, line: 47, baseType: !214, size: 96, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !205, file: !6, line: 48, baseType: !214, size: 96, offset: 800)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !205, file: !6, line: 49, baseType: !214, size: 96, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !205, file: !6, line: 50, baseType: !7, size: 32, offset: 992)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !205, file: !6, line: 51, baseType: !7, size: 32, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !189, file: !176, line: 865, baseType: !204, size: 1088, offset: 7424)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !189, file: !176, line: 867, baseType: !7, size: 32, offset: 8512)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !189, file: !176, line: 868, baseType: !7, size: 32, offset: 8544)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !189, file: !176, line: 869, baseType: !237, size: 7744, offset: 8576)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !21, line: 60, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !21, line: 34, size: 7744, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !238, file: !21, line: 37, baseType: !192, size: 2040)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !238, file: !21, line: 38, baseType: !192, size: 2040, offset: 2040)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !238, file: !21, line: 39, baseType: !192, size: 2040, offset: 4080)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !238, file: !21, line: 40, baseType: !7, size: 32, offset: 6144)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !238, file: !21, line: 41, baseType: !245, size: 32, offset: 6176)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !21, line: 32, baseType: !20)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !238, file: !21, line: 42, baseType: !204, size: 1088, offset: 6208)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !238, file: !21, line: 43, baseType: !7, size: 32, offset: 7296)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !238, file: !21, line: 44, baseType: !7, size: 32, offset: 7328)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !238, file: !21, line: 45, baseType: !7, size: 32, offset: 7360)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !238, file: !21, line: 46, baseType: !7, size: 32, offset: 7392)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !238, file: !21, line: 47, baseType: !7, size: 32, offset: 7424)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !238, file: !21, line: 48, baseType: !7, size: 32, offset: 7456)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !238, file: !21, line: 49, baseType: !7, size: 32, offset: 7488)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !238, file: !21, line: 50, baseType: !7, size: 32, offset: 7520)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !238, file: !21, line: 51, baseType: !7, size: 32, offset: 7552)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !238, file: !21, line: 52, baseType: !7, size: 32, offset: 7584)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !238, file: !21, line: 53, baseType: !7, size: 32, offset: 7616)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !238, file: !21, line: 56, baseType: !259, size: 64, offset: 7680)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !189, file: !176, line: 870, baseType: !237, size: 7744, offset: 16320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !189, file: !176, line: 871, baseType: !237, size: 7744, offset: 24064)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !189, file: !176, line: 873, baseType: !7, size: 32, offset: 31808)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !189, file: !176, line: 884, baseType: !7, size: 32, offset: 31840)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !189, file: !176, line: 885, baseType: !7, size: 32, offset: 31872)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !189, file: !176, line: 886, baseType: !7, size: 32, offset: 31904)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !189, file: !176, line: 890, baseType: !7, size: 32, offset: 31936)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !189, file: !176, line: 893, baseType: !7, size: 32, offset: 31968)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !189, file: !176, line: 894, baseType: !7, size: 32, offset: 32000)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !189, file: !176, line: 895, baseType: !7, size: 32, offset: 32032)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !189, file: !176, line: 897, baseType: !7, size: 32, offset: 32064)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !189, file: !176, line: 899, baseType: !7, size: 32, offset: 32096)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !185, file: !176, line: 569, baseType: !273, size: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !275, line: 138, baseType: !276)
!275 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !275, line: 94, size: 17728, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !283, !284, !288, !293, !297, !300, !301, !302, !303, !304, !308, !309, !310, !311, !312, !313, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !276, file: !275, line: 96, baseType: !7, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !276, file: !275, line: 97, baseType: !31, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !276, file: !275, line: 98, baseType: !31, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !276, file: !275, line: 99, baseType: !7, size: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !276, file: !275, line: 100, baseType: !7, size: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !276, file: !275, line: 102, baseType: !7, size: 32, offset: 160)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !276, file: !275, line: 103, baseType: !285, size: 384, offset: 192)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 384, elements: !286)
!286 = !{!287}
!287 = !DISubrange(count: 12)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !276, file: !275, line: 104, baseType: !289, size: 3072, offset: 576)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3072, elements: !290)
!290 = !{!291, !292}
!291 = !DISubrange(count: 6)
!292 = !DISubrange(count: 16)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !276, file: !275, line: 105, baseType: !294, size: 12288, offset: 3648)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 12288, elements: !295)
!295 = !{!291, !296}
!296 = !DISubrange(count: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !276, file: !275, line: 106, baseType: !298, size: 192, offset: 15936)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !299)
!299 = !{!291}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !276, file: !275, line: 107, baseType: !298, size: 192, offset: 16128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !276, file: !275, line: 110, baseType: !7, size: 32, offset: 16320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !276, file: !275, line: 111, baseType: !31, size: 32, offset: 16352)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !276, file: !275, line: 112, baseType: !31, size: 32, offset: 16384)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !276, file: !275, line: 114, baseType: !305, size: 256, offset: 16416)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 256, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 8)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !276, file: !275, line: 116, baseType: !305, size: 256, offset: 16672)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !276, file: !275, line: 117, baseType: !305, size: 256, offset: 16928)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !276, file: !275, line: 119, baseType: !7, size: 32, offset: 17184)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !276, file: !275, line: 120, baseType: !31, size: 32, offset: 17216)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !276, file: !275, line: 122, baseType: !31, size: 32, offset: 17248)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !276, file: !275, line: 123, baseType: !314, size: 64, offset: 17280)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !276, file: !275, line: 125, baseType: !7, size: 32, offset: 17344)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !276, file: !275, line: 126, baseType: !7, size: 32, offset: 17376)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !276, file: !275, line: 127, baseType: !7, size: 32, offset: 17408)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !276, file: !275, line: 128, baseType: !31, size: 32, offset: 17440)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !276, file: !275, line: 129, baseType: !7, size: 32, offset: 17472)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !276, file: !275, line: 130, baseType: !7, size: 32, offset: 17504)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !276, file: !275, line: 131, baseType: !7, size: 32, offset: 17536)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !276, file: !275, line: 133, baseType: !7, size: 32, offset: 17568)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !276, file: !275, line: 135, baseType: !7, size: 32, offset: 17600)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !276, file: !275, line: 136, baseType: !7, size: 32, offset: 17632)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !276, file: !275, line: 137, baseType: !7, size: 32, offset: 17664)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !185, file: !176, line: 570, baseType: !327, size: 64, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !275, line: 197, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !275, line: 142, size: 33024, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !428, !429}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !329, file: !275, line: 144, baseType: !7, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !329, file: !275, line: 146, baseType: !31, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !329, file: !275, line: 147, baseType: !7, size: 32, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !329, file: !275, line: 148, baseType: !7, size: 32, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !329, file: !275, line: 149, baseType: !7, size: 32, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !329, file: !275, line: 150, baseType: !7, size: 32, offset: 160)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !329, file: !275, line: 152, baseType: !7, size: 32, offset: 192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !329, file: !275, line: 154, baseType: !31, size: 32, offset: 224)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !329, file: !275, line: 155, baseType: !31, size: 32, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !329, file: !275, line: 156, baseType: !31, size: 32, offset: 288)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !329, file: !275, line: 158, baseType: !7, size: 32, offset: 320)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !329, file: !275, line: 159, baseType: !285, size: 384, offset: 352)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !329, file: !275, line: 160, baseType: !289, size: 3072, offset: 736)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !329, file: !275, line: 161, baseType: !294, size: 12288, offset: 3808)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !329, file: !275, line: 162, baseType: !298, size: 192, offset: 16096)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !329, file: !275, line: 163, baseType: !298, size: 192, offset: 16288)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !329, file: !275, line: 165, baseType: !31, size: 32, offset: 16480)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !329, file: !275, line: 166, baseType: !31, size: 32, offset: 16512)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !329, file: !275, line: 167, baseType: !31, size: 32, offset: 16544)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !329, file: !275, line: 168, baseType: !31, size: 32, offset: 16576)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !329, file: !275, line: 170, baseType: !31, size: 32, offset: 16608)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !329, file: !275, line: 172, baseType: !7, size: 32, offset: 16640)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !329, file: !275, line: 173, baseType: !7, size: 32, offset: 16672)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !329, file: !275, line: 174, baseType: !7, size: 32, offset: 16704)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !329, file: !275, line: 175, baseType: !31, size: 32, offset: 16736)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !329, file: !275, line: 177, baseType: !357, size: 8192, offset: 16768)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !358)
!358 = !{!359}
!359 = !DISubrange(count: 256)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !329, file: !275, line: 178, baseType: !31, size: 32, offset: 24960)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !329, file: !275, line: 179, baseType: !7, size: 32, offset: 24992)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !329, file: !275, line: 180, baseType: !31, size: 32, offset: 25024)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !329, file: !275, line: 181, baseType: !31, size: 32, offset: 25056)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !329, file: !275, line: 182, baseType: !7, size: 32, offset: 25088)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !329, file: !275, line: 184, baseType: !7, size: 32, offset: 25120)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !329, file: !275, line: 185, baseType: !7, size: 32, offset: 25152)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !329, file: !275, line: 186, baseType: !7, size: 32, offset: 25184)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !329, file: !275, line: 187, baseType: !31, size: 32, offset: 25216)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !329, file: !275, line: 188, baseType: !31, size: 32, offset: 25248)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !329, file: !275, line: 189, baseType: !31, size: 32, offset: 25280)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !329, file: !275, line: 190, baseType: !31, size: 32, offset: 25312)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !329, file: !275, line: 191, baseType: !7, size: 32, offset: 25344)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !329, file: !275, line: 192, baseType: !374, size: 7584, offset: 25376)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !275, line: 90, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !275, line: 53, size: 7584, elements: !376)
!376 = !{!377, !378, !379, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !375, file: !275, line: 55, baseType: !7, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !375, file: !275, line: 56, baseType: !31, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !375, file: !275, line: 57, baseType: !380, size: 16, offset: 64)
!380 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !375, file: !275, line: 58, baseType: !380, size: 16, offset: 80)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !375, file: !275, line: 59, baseType: !7, size: 32, offset: 96)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !375, file: !275, line: 60, baseType: !7, size: 32, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !375, file: !275, line: 61, baseType: !7, size: 32, offset: 160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !375, file: !275, line: 62, baseType: !31, size: 32, offset: 192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !375, file: !275, line: 63, baseType: !7, size: 32, offset: 224)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !375, file: !275, line: 64, baseType: !7, size: 32, offset: 256)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !375, file: !275, line: 65, baseType: !31, size: 32, offset: 288)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !375, file: !275, line: 66, baseType: !31, size: 32, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !375, file: !275, line: 67, baseType: !31, size: 32, offset: 352)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !375, file: !275, line: 68, baseType: !7, size: 32, offset: 384)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !375, file: !275, line: 69, baseType: !31, size: 32, offset: 416)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !375, file: !275, line: 70, baseType: !31, size: 32, offset: 448)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !375, file: !275, line: 71, baseType: !7, size: 32, offset: 480)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !375, file: !275, line: 72, baseType: !31, size: 32, offset: 512)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !375, file: !275, line: 73, baseType: !31, size: 32, offset: 544)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !375, file: !275, line: 74, baseType: !7, size: 32, offset: 576)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !375, file: !275, line: 75, baseType: !7, size: 32, offset: 608)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !375, file: !275, line: 76, baseType: !400, size: 3296, offset: 640)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !275, line: 50, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !275, line: 38, size: 3296, elements: !402)
!402 = !{!403, !404, !405, !406, !410, !411, !412, !413, !414, !415}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !401, file: !275, line: 40, baseType: !31, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !401, file: !275, line: 41, baseType: !31, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !401, file: !275, line: 42, baseType: !31, size: 32, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !401, file: !275, line: 43, baseType: !407, size: 1024, offset: 96)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1024, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !401, file: !275, line: 44, baseType: !407, size: 1024, offset: 1120)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !401, file: !275, line: 45, baseType: !407, size: 1024, offset: 2144)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !401, file: !275, line: 46, baseType: !31, size: 32, offset: 3168)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !401, file: !275, line: 47, baseType: !31, size: 32, offset: 3200)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !401, file: !275, line: 48, baseType: !31, size: 32, offset: 3232)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !401, file: !275, line: 49, baseType: !31, size: 32, offset: 3264)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !375, file: !275, line: 77, baseType: !7, size: 32, offset: 3936)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !375, file: !275, line: 78, baseType: !400, size: 3296, offset: 3968)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !375, file: !275, line: 80, baseType: !7, size: 32, offset: 7264)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !375, file: !275, line: 81, baseType: !7, size: 32, offset: 7296)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !375, file: !275, line: 82, baseType: !7, size: 32, offset: 7328)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !375, file: !275, line: 83, baseType: !7, size: 32, offset: 7360)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !375, file: !275, line: 84, baseType: !31, size: 32, offset: 7392)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !375, file: !275, line: 85, baseType: !31, size: 32, offset: 7424)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !375, file: !275, line: 86, baseType: !31, size: 32, offset: 7456)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !375, file: !275, line: 87, baseType: !31, size: 32, offset: 7488)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !375, file: !275, line: 88, baseType: !31, size: 32, offset: 7520)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !375, file: !275, line: 89, baseType: !31, size: 32, offset: 7552)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !329, file: !275, line: 193, baseType: !31, size: 32, offset: 32960)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !329, file: !275, line: 195, baseType: !7, size: 32, offset: 32992)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !185, file: !176, line: 571, baseType: !431, size: 1056768, offset: 192)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 1056768, elements: !408)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !185, file: !176, line: 572, baseType: !433, size: 4538368, offset: 1056960)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 4538368, elements: !358)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !185, file: !176, line: 575, baseType: !435, size: 64, offset: 5595328)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !275, line: 256, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !275, line: 228, size: 37312, elements: !438)
!438 = !{!439, !440, !441, !442, !443, !444, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !459, !460, !461, !462}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !437, file: !275, line: 230, baseType: !328, size: 33024)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !437, file: !275, line: 232, baseType: !31, size: 32, offset: 33024)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !437, file: !275, line: 233, baseType: !7, size: 32, offset: 33056)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !437, file: !275, line: 234, baseType: !259, size: 64, offset: 33088)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !437, file: !275, line: 235, baseType: !259, size: 64, offset: 33152)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !437, file: !275, line: 236, baseType: !445, size: 64, offset: 33216)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !437, file: !275, line: 237, baseType: !259, size: 64, offset: 33280)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !437, file: !275, line: 238, baseType: !445, size: 64, offset: 33344)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !437, file: !275, line: 240, baseType: !259, size: 64, offset: 33408)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !437, file: !275, line: 241, baseType: !445, size: 64, offset: 33472)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !437, file: !275, line: 242, baseType: !259, size: 64, offset: 33536)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !437, file: !275, line: 243, baseType: !445, size: 64, offset: 33600)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !437, file: !275, line: 245, baseType: !7, size: 32, offset: 33664)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !437, file: !275, line: 246, baseType: !259, size: 64, offset: 33728)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !437, file: !275, line: 247, baseType: !259, size: 64, offset: 33792)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !437, file: !275, line: 248, baseType: !445, size: 64, offset: 33856)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !437, file: !275, line: 249, baseType: !445, size: 64, offset: 33920)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !437, file: !275, line: 250, baseType: !458, size: 64, offset: 33984)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !437, file: !275, line: 251, baseType: !445, size: 64, offset: 34048)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !437, file: !275, line: 253, baseType: !31, size: 32, offset: 34112)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !437, file: !275, line: 254, baseType: !7, size: 32, offset: 34144)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !437, file: !275, line: 255, baseType: !463, size: 3136, offset: 34176)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !275, line: 226, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !275, line: 200, size: 3136, elements: !465)
!465 = !{!466, !467, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !484, !485, !487, !488, !489, !490}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !464, file: !275, line: 202, baseType: !7, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !464, file: !275, line: 203, baseType: !468, size: 64, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !464, file: !275, line: 204, baseType: !259, size: 64, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !464, file: !275, line: 205, baseType: !445, size: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !464, file: !275, line: 206, baseType: !468, size: 64, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !464, file: !275, line: 207, baseType: !259, size: 64, offset: 320)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !464, file: !275, line: 208, baseType: !259, size: 64, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !464, file: !275, line: 209, baseType: !468, size: 64, offset: 448)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !464, file: !275, line: 210, baseType: !468, size: 64, offset: 512)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !464, file: !275, line: 211, baseType: !468, size: 64, offset: 576)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !464, file: !275, line: 212, baseType: !468, size: 64, offset: 640)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !464, file: !275, line: 213, baseType: !468, size: 64, offset: 704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !464, file: !275, line: 216, baseType: !145, size: 8, offset: 768)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !464, file: !275, line: 217, baseType: !145, size: 8, offset: 776)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !464, file: !275, line: 218, baseType: !145, size: 8, offset: 784)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !464, file: !275, line: 219, baseType: !483, size: 1024, offset: 800)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !408)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !464, file: !275, line: 220, baseType: !483, size: 1024, offset: 1824)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !464, file: !275, line: 221, baseType: !486, size: 256, offset: 2848)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 256, elements: !408)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !464, file: !275, line: 222, baseType: !145, size: 8, offset: 3104)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !464, file: !275, line: 223, baseType: !145, size: 8, offset: 3112)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !464, file: !275, line: 224, baseType: !145, size: 8, offset: 3120)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !464, file: !275, line: 225, baseType: !145, size: 8, offset: 3128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !185, file: !176, line: 577, baseType: !492, size: 1193984, offset: 5595392)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 1193984, elements: !408)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !185, file: !176, line: 578, baseType: !7, size: 32, offset: 6789376)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !185, file: !176, line: 579, baseType: !7, size: 32, offset: 6789408)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !185, file: !176, line: 580, baseType: !7, size: 32, offset: 6789440)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !185, file: !176, line: 581, baseType: !7, size: 32, offset: 6789472)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !185, file: !176, line: 584, baseType: !498, size: 64, offset: 6789504)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !176, line: 584, flags: DIFlagFwdDecl)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !185, file: !176, line: 586, baseType: !501, size: 64, offset: 6789568)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !176, line: 902, size: 416, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !509, !513, !514, !515, !516, !517, !518, !519}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !502, file: !176, line: 904, baseType: !31, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !502, file: !176, line: 905, baseType: !31, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !502, file: !176, line: 906, baseType: !7, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !502, file: !176, line: 907, baseType: !31, size: 32, offset: 96)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !502, file: !176, line: 908, baseType: !7, size: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !502, file: !176, line: 909, baseType: !510, size: 64, offset: 160)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 2)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !502, file: !176, line: 910, baseType: !153, size: 8, offset: 224)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !502, file: !176, line: 911, baseType: !153, size: 8, offset: 232)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !502, file: !176, line: 912, baseType: !7, size: 32, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !502, file: !176, line: 913, baseType: !7, size: 32, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !502, file: !176, line: 915, baseType: !7, size: 32, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !502, file: !176, line: 916, baseType: !7, size: 32, offset: 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !502, file: !176, line: 917, baseType: !7, size: 32, offset: 384)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !185, file: !176, line: 587, baseType: !521, size: 64, offset: 6789632)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !176, line: 839, size: 512, elements: !523)
!523 = !{!524, !525, !528, !529, !530, !531}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !522, file: !176, line: 841, baseType: !7, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !522, file: !176, line: 842, baseType: !526, size: 96, offset: 32)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 96, elements: !215)
!527 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !522, file: !176, line: 843, baseType: !526, size: 96, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !522, file: !176, line: 844, baseType: !526, size: 96, offset: 224)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !522, file: !176, line: 845, baseType: !526, size: 96, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !522, file: !176, line: 846, baseType: !526, size: 96, offset: 416)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !185, file: !176, line: 588, baseType: !7, size: 32, offset: 6789696)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !185, file: !176, line: 591, baseType: !31, size: 32, offset: 6789728)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !185, file: !176, line: 592, baseType: !7, size: 32, offset: 6789760)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !185, file: !176, line: 593, baseType: !7, size: 32, offset: 6789792)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !185, file: !176, line: 594, baseType: !7, size: 32, offset: 6789824)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !185, file: !176, line: 595, baseType: !538, size: 64, offset: 6789888)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !176, line: 542, baseType: !181)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !185, file: !176, line: 596, baseType: !468, size: 64, offset: 6789952)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block_JV", scope: !185, file: !176, line: 597, baseType: !543, size: 192, offset: 6790016)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 192, elements: !215)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !185, file: !176, line: 601, baseType: !7, size: 32, offset: 6790208)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !185, file: !176, line: 602, baseType: !7, size: 32, offset: 6790240)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !185, file: !176, line: 603, baseType: !7, size: 32, offset: 6790272)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !185, file: !176, line: 604, baseType: !7, size: 32, offset: 6790304)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !185, file: !176, line: 605, baseType: !7, size: 32, offset: 6790336)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !185, file: !176, line: 607, baseType: !550, size: 64, offset: 6790400)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode_JV", scope: !185, file: !176, line: 608, baseType: !552, size: 192, offset: 6790464)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 192, elements: !215)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !185, file: !176, line: 609, baseType: !554, size: 64, offset: 6790656)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "siblock", scope: !185, file: !176, line: 610, baseType: !445, size: 64, offset: 6790720)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "siblock_JV", scope: !185, file: !176, line: 611, baseType: !558, size: 192, offset: 6790784)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 192, elements: !215)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "newframe", scope: !185, file: !176, line: 613, baseType: !7, size: 32, offset: 6790976)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !185, file: !176, line: 614, baseType: !7, size: 32, offset: 6791008)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pNextSlice", scope: !185, file: !176, line: 617, baseType: !539, size: 64, offset: 6791040)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !185, file: !176, line: 618, baseType: !174, size: 64, offset: 6791104)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data_JV", scope: !185, file: !176, line: 619, baseType: !564, size: 192, offset: 6791168)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 192, elements: !215)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaArrayType", scope: !185, file: !176, line: 621, baseType: !7, size: 32, offset: 6791360)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_head", scope: !185, file: !176, line: 626, baseType: !567, size: 64, offset: 6791424)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !176, line: 626, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_end", scope: !185, file: !176, line: 627, baseType: !567, size: 64, offset: 6791488)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !185, file: !176, line: 629, baseType: !31, size: 32, offset: 6791552)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "non_conforming_stream", scope: !185, file: !176, line: 630, baseType: !7, size: 32, offset: 6791584)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntMsb", scope: !185, file: !176, line: 634, baseType: !7, size: 32, offset: 6791616)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntLsb", scope: !185, file: !176, line: 635, baseType: !31, size: 32, offset: 6791648)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedPicOrderCnt", scope: !185, file: !176, line: 638, baseType: !7, size: 32, offset: 6791680)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntCycleCnt", scope: !185, file: !176, line: 638, baseType: !7, size: 32, offset: 6791712)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumInPicOrderCntCycle", scope: !185, file: !176, line: 638, baseType: !7, size: 32, offset: 6791744)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNum", scope: !185, file: !176, line: 639, baseType: !31, size: 32, offset: 6791776)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumOffset", scope: !185, file: !176, line: 639, baseType: !31, size: 32, offset: 6791808)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDeltaPerPicOrderCntCycle", scope: !185, file: !176, line: 640, baseType: !7, size: 32, offset: 6791840)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !185, file: !176, line: 641, baseType: !7, size: 32, offset: 6791872)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNumOffset", scope: !185, file: !176, line: 642, baseType: !7, size: 32, offset: 6791904)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFrameNum", scope: !185, file: !176, line: 645, baseType: !7, size: 32, offset: 6791936)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !185, file: !176, line: 647, baseType: !31, size: 32, offset: 6791968)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !185, file: !176, line: 648, baseType: !31, size: 32, offset: 6792000)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !185, file: !176, line: 649, baseType: !31, size: 32, offset: 6792032)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !185, file: !176, line: 650, baseType: !31, size: 32, offset: 6792064)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !185, file: !176, line: 651, baseType: !31, size: 32, offset: 6792096)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !185, file: !176, line: 652, baseType: !31, size: 32, offset: 6792128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "oldFrameSizeInMbs", scope: !185, file: !176, line: 653, baseType: !31, size: 32, offset: 6792160)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !185, file: !176, line: 655, baseType: !7, size: 32, offset: 6792192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !185, file: !176, line: 657, baseType: !7, size: 32, offset: 6792224)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !185, file: !176, line: 658, baseType: !7, size: 32, offset: 6792256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_bitsize_on_disk", scope: !185, file: !176, line: 661, baseType: !7, size: 32, offset: 6792288)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !185, file: !176, line: 662, baseType: !144, size: 16, offset: 6792320)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !185, file: !176, line: 663, baseType: !144, size: 16, offset: 6792336)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_scale", scope: !185, file: !176, line: 664, baseType: !510, size: 64, offset: 6792352)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !185, file: !176, line: 665, baseType: !7, size: 32, offset: 6792416)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !185, file: !176, line: 666, baseType: !7, size: 32, offset: 6792448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value_comp", scope: !185, file: !176, line: 667, baseType: !600, size: 96, offset: 6792480)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 96, elements: !215)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "max_pel_value_comp", scope: !185, file: !176, line: 668, baseType: !214, size: 96, offset: 6792576)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !185, file: !176, line: 670, baseType: !7, size: 32, offset: 6792672)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !185, file: !176, line: 671, baseType: !7, size: 32, offset: 6792704)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !185, file: !176, line: 672, baseType: !7, size: 32, offset: 6792736)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !185, file: !176, line: 673, baseType: !7, size: 32, offset: 6792768)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "num_uv_blocks", scope: !185, file: !176, line: 674, baseType: !7, size: 32, offset: 6792800)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !185, file: !176, line: 675, baseType: !7, size: 32, offset: 6792832)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !185, file: !176, line: 676, baseType: !7, size: 32, offset: 6792864)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !185, file: !176, line: 677, baseType: !7, size: 32, offset: 6792896)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x_blk", scope: !185, file: !176, line: 678, baseType: !7, size: 32, offset: 6792928)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y_blk", scope: !185, file: !176, line: 679, baseType: !7, size: 32, offset: 6792960)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !185, file: !176, line: 680, baseType: !613, size: 192, offset: 6792992)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !614)
!614 = !{!216, !512}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_blk", scope: !185, file: !176, line: 681, baseType: !613, size: 192, offset: 6793184)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_shift", scope: !185, file: !176, line: 682, baseType: !613, size: 192, offset: 6793376)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_x", scope: !185, file: !176, line: 683, baseType: !7, size: 32, offset: 6793568)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_y", scope: !185, file: !176, line: 684, baseType: !7, size: 32, offset: 6793600)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_x", scope: !185, file: !176, line: 685, baseType: !7, size: 32, offset: 6793632)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_y", scope: !185, file: !176, line: 686, baseType: !7, size: 32, offset: 6793664)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "total_scale", scope: !185, file: !176, line: 687, baseType: !7, size: 32, offset: 6793696)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "max_vmv_r", scope: !185, file: !176, line: 689, baseType: !7, size: 32, offset: 6793728)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "idr_psnr_number", scope: !185, file: !176, line: 692, baseType: !7, size: 32, offset: 6793760)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "psnr_number", scope: !185, file: !176, line: 693, baseType: !7, size: 32, offset: 6793792)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "last_ref_pic_poc", scope: !185, file: !176, line: 700, baseType: !7, size: 32, offset: 6793824)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !185, file: !176, line: 701, baseType: !7, size: 32, offset: 6793856)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !185, file: !176, line: 702, baseType: !7, size: 32, offset: 6793888)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !185, file: !176, line: 703, baseType: !7, size: 32, offset: 6793920)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "earlier_missing_poc", scope: !185, file: !176, line: 704, baseType: !7, size: 32, offset: 6793952)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_conceal", scope: !185, file: !176, line: 705, baseType: !31, size: 32, offset: 6793984)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "IDR_concealment_flag", scope: !185, file: !176, line: 706, baseType: !7, size: 32, offset: 6794016)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_slice_type", scope: !185, file: !176, line: 707, baseType: !7, size: 32, offset: 6794048)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point", scope: !185, file: !176, line: 710, baseType: !7, size: 32, offset: 6794080)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point_found", scope: !185, file: !176, line: 711, baseType: !7, size: 32, offset: 6794112)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_cnt", scope: !185, file: !176, line: 712, baseType: !7, size: 32, offset: 6794144)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_num", scope: !185, file: !176, line: 713, baseType: !7, size: 32, offset: 6794176)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_poc", scope: !185, file: !176, line: 714, baseType: !7, size: 32, offset: 6794208)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !185, file: !176, line: 716, baseType: !7, size: 32, offset: 6794240)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !185, file: !176, line: 717, baseType: !7, size: 32, offset: 6794272)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !185, file: !176, line: 719, baseType: !314, size: 64, offset: 6794304)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !185, file: !176, line: 720, baseType: !314, size: 64, offset: 6794368)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "imgData", scope: !185, file: !176, line: 722, baseType: !643, size: 2560, offset: 6794432)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageData", file: !644, line: 38, baseType: !645)
!644 = !DIFile(filename: "ldecod_src/inc/io_image.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "8caef624e6f5391b0c6ab2984e7f77c6")
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "image_data", file: !644, line: 20, size: 2560, elements: !646)
!646 = !{!647, !648, !654, !655, !656, !660, !661, !662, !663, !664}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !645, file: !644, line: 22, baseType: !204, size: 1088)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "frm_data", scope: !645, file: !644, line: 24, baseType: !649, size: 192, offset: 1088)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 192, elements: !215)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !154, line: 41, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !154, line: 23, baseType: !380)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "top_data", scope: !645, file: !644, line: 25, baseType: !649, size: 192, offset: 1280)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bot_data", scope: !645, file: !644, line: 26, baseType: !649, size: 192, offset: 1472)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "frm_uint16", scope: !645, file: !644, line: 31, baseType: !657, size: 192, offset: 1664)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 192, elements: !215)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "top_uint16", scope: !645, file: !644, line: 32, baseType: !657, size: 192, offset: 1856)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "bot_uint16", scope: !645, file: !644, line: 33, baseType: !657, size: 192, offset: 2048)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "frm_stride", scope: !645, file: !644, line: 35, baseType: !214, size: 96, offset: 2240)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "top_stride", scope: !645, file: !644, line: 36, baseType: !214, size: 96, offset: 2336)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "bot_stride", scope: !645, file: !644, line: 37, baseType: !214, size: 96, offset: 2432)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "imgData0", scope: !185, file: !176, line: 723, baseType: !643, size: 2560, offset: 6796992)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "imgData1", scope: !185, file: !176, line: 724, baseType: !643, size: 2560, offset: 6799552)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "imgData2", scope: !185, file: !176, line: 725, baseType: !643, size: 2560, offset: 6802112)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "imgData32", scope: !185, file: !176, line: 728, baseType: !643, size: 2560, offset: 6804672)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "imgData4", scope: !185, file: !176, line: 729, baseType: !643, size: 2560, offset: 6807232)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "imgData5", scope: !185, file: !176, line: 730, baseType: !643, size: 2560, offset: 6809792)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "imgData6", scope: !185, file: !176, line: 731, baseType: !643, size: 2560, offset: 6812352)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "previous_frame_num", scope: !185, file: !176, line: 735, baseType: !31, size: 32, offset: 6814912)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Is_primary_correct", scope: !185, file: !176, line: 737, baseType: !7, size: 32, offset: 6814944)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "Is_redundant_correct", scope: !185, file: !176, line: 738, baseType: !7, size: 32, offset: 6814976)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "tot_time", scope: !185, file: !176, line: 741, baseType: !146, size: 64, offset: 6815040)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "p_out", scope: !185, file: !176, line: 744, baseType: !7, size: 32, offset: 6815104)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "p_out_mvc", scope: !185, file: !176, line: 746, baseType: !678, size: 32768, offset: 6815136)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32768, elements: !679)
!679 = !{!680}
!680 = !DISubrange(count: 1024)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "p_ref", scope: !185, file: !176, line: 748, baseType: !7, size: 32, offset: 6847904)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessUnitExists", scope: !185, file: !176, line: 751, baseType: !7, size: 32, offset: 6847936)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "NALUCount", scope: !185, file: !176, line: 752, baseType: !7, size: 32, offset: 6847968)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "Bframe_ctr", scope: !185, file: !176, line: 755, baseType: !7, size: 32, offset: 6848000)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "frame_no", scope: !185, file: !176, line: 756, baseType: !7, size: 32, offset: 6848032)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "g_nFrame", scope: !185, file: !176, line: 758, baseType: !7, size: 32, offset: 6848064)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "global_init_done", scope: !185, file: !176, line: 759, baseType: !7, size: 32, offset: 6848096)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ref", scope: !185, file: !176, line: 762, baseType: !650, size: 64, offset: 6848128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV_ref", scope: !185, file: !176, line: 763, baseType: !690, size: 64, offset: 6848192)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "qp_per_matrix", scope: !185, file: !176, line: 765, baseType: !259, size: 64, offset: 6848256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "qp_rem_matrix", scope: !185, file: !176, line: 766, baseType: !259, size: 64, offset: 6848320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "last_out_fs", scope: !185, file: !176, line: 768, baseType: !694, size: 64, offset: 6848384)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !696, line: 152, size: 768, elements: !697)
!696 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !828, !829, !830, !831, !832}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !695, file: !696, line: 154, baseType: !7, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !695, file: !696, line: 155, baseType: !7, size: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !695, file: !696, line: 156, baseType: !7, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !695, file: !696, line: 157, baseType: !7, size: 32, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !695, file: !696, line: 159, baseType: !7, size: 32, offset: 128)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !695, file: !696, line: 161, baseType: !31, size: 32, offset: 160)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !695, file: !696, line: 162, baseType: !31, size: 32, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !695, file: !696, line: 164, baseType: !7, size: 32, offset: 224)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !695, file: !696, line: 165, baseType: !7, size: 32, offset: 256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !695, file: !696, line: 166, baseType: !7, size: 32, offset: 288)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !695, file: !696, line: 167, baseType: !7, size: 32, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !695, file: !696, line: 170, baseType: !7, size: 32, offset: 352)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !695, file: !696, line: 172, baseType: !711, size: 64, offset: 384)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !696, line: 138, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !696, line: 46, size: 3328, elements: !714)
!714 = !{!715, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !768, !770, !774, !776, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !713, file: !696, line: 48, baseType: !716, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !30, line: 140, baseType: !29)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !713, file: !696, line: 50, baseType: !7, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !713, file: !696, line: 51, baseType: !7, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !713, file: !696, line: 52, baseType: !7, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !713, file: !696, line: 53, baseType: !7, size: 32, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !713, file: !696, line: 54, baseType: !31, size: 32, offset: 160)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !713, file: !696, line: 55, baseType: !31, size: 32, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !713, file: !696, line: 57, baseType: !7, size: 32, offset: 224)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !713, file: !696, line: 58, baseType: !7, size: 32, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !713, file: !696, line: 59, baseType: !7, size: 32, offset: 288)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !713, file: !696, line: 61, baseType: !153, size: 8, offset: 320)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !713, file: !696, line: 62, baseType: !7, size: 32, offset: 352)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !713, file: !696, line: 63, baseType: !7, size: 32, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !713, file: !696, line: 64, baseType: !7, size: 32, offset: 416)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !713, file: !696, line: 65, baseType: !7, size: 32, offset: 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !713, file: !696, line: 67, baseType: !144, size: 16, offset: 480)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !713, file: !696, line: 69, baseType: !7, size: 32, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !713, file: !696, line: 69, baseType: !7, size: 32, offset: 544)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !713, file: !696, line: 69, baseType: !7, size: 32, offset: 576)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !713, file: !696, line: 69, baseType: !7, size: 32, offset: 608)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !713, file: !696, line: 70, baseType: !7, size: 32, offset: 640)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !713, file: !696, line: 70, baseType: !7, size: 32, offset: 672)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !713, file: !696, line: 70, baseType: !7, size: 32, offset: 704)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !713, file: !696, line: 70, baseType: !7, size: 32, offset: 736)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !713, file: !696, line: 71, baseType: !7, size: 32, offset: 768)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !713, file: !696, line: 72, baseType: !7, size: 32, offset: 800)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !713, file: !696, line: 73, baseType: !31, size: 32, offset: 832)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !713, file: !696, line: 74, baseType: !31, size: 32, offset: 864)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !713, file: !696, line: 75, baseType: !7, size: 32, offset: 896)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !713, file: !696, line: 75, baseType: !7, size: 32, offset: 928)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !713, file: !696, line: 76, baseType: !7, size: 32, offset: 960)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !713, file: !696, line: 76, baseType: !7, size: 32, offset: 992)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !713, file: !696, line: 79, baseType: !650, size: 64, offset: 1024)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !713, file: !696, line: 80, baseType: !690, size: 64, offset: 1088)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !713, file: !696, line: 81, baseType: !690, size: 64, offset: 1152)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !713, file: !696, line: 84, baseType: !752, size: 64, offset: 1216)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !696, line: 36, size: 256, elements: !755)
!755 = !{!756, !759, !766}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !754, file: !696, line: 38, baseType: !757, size: 128)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 128, elements: !511)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !754, file: !696, line: 39, baseType: !760, size: 64, offset: 128)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 64, elements: !511)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !176, line: 104, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !176, line: 100, size: 32, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !762, file: !176, line: 102, baseType: !144, size: 16)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !762, file: !176, line: 103, baseType: !144, size: 16, offset: 16)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !754, file: !696, line: 40, baseType: !767, size: 16, offset: 192)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 16, elements: !511)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !713, file: !696, line: 85, baseType: !769, size: 192, offset: 1280)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 192, elements: !215)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !713, file: !696, line: 87, baseType: !771, size: 64, offset: 1472)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !696, line: 29, size: 64, elements: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !771, file: !696, line: 31, baseType: !314, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !713, file: !696, line: 88, baseType: !775, size: 192, offset: 1536)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 192, elements: !215)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !713, file: !696, line: 90, baseType: !777, size: 64, offset: 1728)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !713, file: !696, line: 92, baseType: !758, size: 64, offset: 1792)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !713, file: !696, line: 93, baseType: !758, size: 64, offset: 1856)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !713, file: !696, line: 94, baseType: !758, size: 64, offset: 1920)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !713, file: !696, line: 96, baseType: !7, size: 32, offset: 1984)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !713, file: !696, line: 97, baseType: !7, size: 32, offset: 2016)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !713, file: !696, line: 98, baseType: !7, size: 32, offset: 2048)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !713, file: !696, line: 99, baseType: !7, size: 32, offset: 2080)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !713, file: !696, line: 100, baseType: !7, size: 32, offset: 2112)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !713, file: !696, line: 102, baseType: !7, size: 32, offset: 2144)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !713, file: !696, line: 103, baseType: !7, size: 32, offset: 2176)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !713, file: !696, line: 104, baseType: !7, size: 32, offset: 2208)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !713, file: !696, line: 105, baseType: !7, size: 32, offset: 2240)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !713, file: !696, line: 106, baseType: !7, size: 32, offset: 2272)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !713, file: !696, line: 107, baseType: !7, size: 32, offset: 2304)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !713, file: !696, line: 108, baseType: !7, size: 32, offset: 2336)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !713, file: !696, line: 109, baseType: !7, size: 32, offset: 2368)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !713, file: !696, line: 110, baseType: !510, size: 64, offset: 2400)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !713, file: !696, line: 111, baseType: !7, size: 32, offset: 2464)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !713, file: !696, line: 112, baseType: !798, size: 64, offset: 2496)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !176, line: 194, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !176, line: 186, size: 256, elements: !801)
!801 = !{!802, !803, !804, !805, !806, !807}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !800, file: !176, line: 188, baseType: !7, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !800, file: !176, line: 189, baseType: !7, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !800, file: !176, line: 190, baseType: !7, size: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !800, file: !176, line: 191, baseType: !7, size: 32, offset: 96)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !800, file: !176, line: 192, baseType: !7, size: 32, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !800, file: !176, line: 193, baseType: !808, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !713, file: !696, line: 115, baseType: !7, size: 32, offset: 2560)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !713, file: !696, line: 118, baseType: !7, size: 32, offset: 2592)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !713, file: !696, line: 119, baseType: !7, size: 32, offset: 2624)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !713, file: !696, line: 120, baseType: !7, size: 32, offset: 2656)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !713, file: !696, line: 121, baseType: !651, size: 64, offset: 2688)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !713, file: !696, line: 124, baseType: !7, size: 32, offset: 2752)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !713, file: !696, line: 125, baseType: !7, size: 32, offset: 2784)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !713, file: !696, line: 126, baseType: !7, size: 32, offset: 2816)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !713, file: !696, line: 128, baseType: !7, size: 32, offset: 2848)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !713, file: !696, line: 129, baseType: !7, size: 32, offset: 2880)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !713, file: !696, line: 130, baseType: !7, size: 32, offset: 2912)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !713, file: !696, line: 131, baseType: !7, size: 32, offset: 2944)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !713, file: !696, line: 132, baseType: !650, size: 64, offset: 3008)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !713, file: !696, line: 133, baseType: !7, size: 32, offset: 3072)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !713, file: !696, line: 134, baseType: !7, size: 32, offset: 3104)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !713, file: !696, line: 136, baseType: !767, size: 16, offset: 3136)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !713, file: !696, line: 137, baseType: !826, size: 128, offset: 3200)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 128, elements: !511)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !695, file: !696, line: 173, baseType: !711, size: 64, offset: 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !695, file: !696, line: 174, baseType: !711, size: 64, offset: 512)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !695, file: !696, line: 177, baseType: !7, size: 32, offset: 576)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !695, file: !696, line: 178, baseType: !510, size: 64, offset: 608)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !695, file: !696, line: 179, baseType: !510, size: 64, offset: 672)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pocs_in_dpb", scope: !185, file: !176, line: 769, baseType: !834, size: 3200, offset: 6848448)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3200, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 100)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture", scope: !185, file: !176, line: 771, baseType: !758, size: 64, offset: 6851648)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture_JV", scope: !185, file: !176, line: 772, baseType: !839, size: 192, offset: 6851712)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 192, elements: !215)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "no_reference_picture", scope: !185, file: !176, line: 773, baseType: !758, size: 64, offset: 6851904)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "erc_object_list", scope: !185, file: !176, line: 776, baseType: !842, size: 64, offset: 6851968)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "object_buffer", file: !176, line: 776, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "erc_errorVar", scope: !185, file: !176, line: 777, baseType: !845, size: 64, offset: 6852032)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "ercVariables_s", file: !176, line: 777, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "erc_mvperMB", scope: !185, file: !176, line: 779, baseType: !7, size: 32, offset: 6852096)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "erc_img", scope: !185, file: !176, line: 780, baseType: !184, size: 64, offset: 6852160)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ec_flag", scope: !185, file: !176, line: 781, baseType: !850, size: 640, offset: 6852224)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 640, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 20)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "annex_b", scope: !185, file: !176, line: 783, baseType: !854, size: 64, offset: 6852864)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "annex_b_struct", file: !176, line: 783, flags: DIFlagFwdDecl)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "bitsfile", scope: !185, file: !176, line: 784, baseType: !857, size: 64, offset: 6852928)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "sBitsFile", file: !176, line: 784, flags: DIFlagFwdDecl)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "out_buffer", scope: !185, file: !176, line: 786, baseType: !694, size: 64, offset: 6852992)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output", scope: !185, file: !176, line: 788, baseType: !758, size: 64, offset: 6853056)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output_state", scope: !185, file: !176, line: 789, baseType: !7, size: 32, offset: 6853120)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_flag", scope: !185, file: !176, line: 790, baseType: !7, size: 32, offset: 6853152)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "BitStreamFile", scope: !185, file: !176, line: 792, baseType: !7, size: 32, offset: 6853184)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !185, file: !176, line: 794, baseType: !865, size: 64, offset: 6853248)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !696, line: 186, size: 33408, elements: !867)
!867 = !{!868, !871, !874, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !866, file: !696, line: 188, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !176, line: 836, baseType: !185)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !866, file: !696, line: 189, baseType: !872, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !176, line: 900, baseType: !189)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !866, file: !696, line: 190, baseType: !875, size: 64, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !696, line: 182, baseType: !695)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ref", scope: !866, file: !696, line: 191, baseType: !875, size: 64, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ltref", scope: !866, file: !696, line: 192, baseType: !875, size: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !866, file: !696, line: 193, baseType: !31, size: 32, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !866, file: !696, line: 194, baseType: !31, size: 32, offset: 352)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frames_in_buffer", scope: !866, file: !696, line: 195, baseType: !31, size: 32, offset: 384)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ltref_frames_in_buffer", scope: !866, file: !696, line: 196, baseType: !31, size: 32, offset: 416)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_poc", scope: !866, file: !696, line: 197, baseType: !7, size: 32, offset: 448)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_view_id", scope: !866, file: !696, line: 199, baseType: !7, size: 32, offset: 480)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_pic_idx", scope: !866, file: !696, line: 200, baseType: !678, size: 32768, offset: 512)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "init_done", scope: !866, file: !696, line: 205, baseType: !7, size: 32, offset: 33280)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !866, file: !696, line: 206, baseType: !7, size: 32, offset: 33312)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "last_picture", scope: !866, file: !696, line: 208, baseType: !876, size: 64, offset: 33344)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb_legacy", scope: !185, file: !176, line: 795, baseType: !865, size: 64, offset: 6853312)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb_layer", scope: !185, file: !176, line: 796, baseType: !892, size: 128, offset: 6853376)
!892 = !DICompositeType(tag: DW_TAG_array_type, baseType: !865, size: 128, elements: !511)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "cslice_type", scope: !185, file: !176, line: 800, baseType: !894, size: 72, offset: 6853504)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 72, elements: !895)
!895 = !{!896}
!896 = !DISubrange(count: 9)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "MbToSliceGroupMap", scope: !185, file: !176, line: 802, baseType: !259, size: 64, offset: 6853632)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "MapUnitToSliceGroupMap", scope: !185, file: !176, line: 803, baseType: !259, size: 64, offset: 6853696)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSliceGroups", scope: !185, file: !176, line: 804, baseType: !7, size: 32, offset: 6853760)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "seiToneMapping", scope: !185, file: !176, line: 807, baseType: !901, size: 64, offset: 6853824)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DICompositeType(tag: DW_TAG_structure_type, name: "tone_mapping_struct_s", file: !176, line: 807, flags: DIFlagFwdDecl)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "buf2img", scope: !185, file: !176, line: 810, baseType: !904, size: 64, offset: 6853888)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{null, !650, !907, !7, !7, !7, !7, !7, !7}
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "getNeighbour", scope: !185, file: !176, line: 811, baseType: !909, size: 64, offset: 6853952)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{null, !174, !7, !7, !259, !912}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !176, line: 85, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !176, line: 77, size: 128, elements: !915)
!915 = !{!916, !917, !918, !919, !920, !921}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !914, file: !176, line: 79, baseType: !7, size: 32)
