; ModuleID = 'ldecod_src/mb_access.c'
source_filename = "ldecod_src/mb_access.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.macroblock = type { ptr, ptr, ptr, i32, %struct.BlockPos, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], [3 x i32], i32, i32, i32, i32, i16, i8, i8, i16, i16, ptr, ptr, ptr, ptr, i16, [2 x [4 x [4 x [2 x i16]]]], i32, [3 x i64], [3 x i64], [3 x i64], i32, [4 x i8], [4 x i8], i8, i8, i8, i16, i16, i16, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, i8 }
%struct.BlockPos = type { i16, i16 }

@PicPos = external local_unnamed_addr global ptr, align 8

; Function Attrs: mustprogress nofree norecurse nosync nounwind willreturn memory(read, inaccessiblemem: none) uwtable
define dso_local range(i32 0, 2) i32 @mb_is_available(i32 noundef %mbAddr, ptr nocapture noundef readonly %currMB) local_unnamed_addr #0 !dbg !52 {
entry:
    #dbg_value(i32 %mbAddr, !1239, !DIExpression(), !1241)
    #dbg_value(ptr %currMB, !1240, !DIExpression(), !1241)
  %cmp = icmp slt i32 %mbAddr, 0, !dbg !1242
  br i1 %cmp, label %return, label %lor.lhs.false, !dbg !1244

lor.lhs.false:                                    ; preds = %entry
  %0 = load ptr, ptr %currMB, align 8, !dbg !1245
  %dec_picture = getelementptr inbounds i8, ptr %0, i64 13520, !dbg !1246
  %1 = load ptr, ptr %dec_picture, align 8, !dbg !1246

!27 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 135, baseType: !29, size: 32, elements: !30)
!28 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!29 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!30 = !{!31, !32, !33}
!31 = !DIEnumerator(name: "FRAME", value: 0)
!32 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!33 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !28, line: 22, baseType: !29, size: 32, elements: !35)
!35 = !{!36, !37, !38, !39, !40, !41}
!36 = !DIEnumerator(name: "PLANE_Y", value: 0)
!37 = !DIEnumerator(name: "PLANE_U", value: 1)
!38 = !DIEnumerator(name: "PLANE_V", value: 2)
!39 = !DIEnumerator(name: "PLANE_G", value: 0)
!40 = !DIEnumerator(name: "PLANE_B", value: 1)
!41 = !DIEnumerator(name: "PLANE_R", value: 2)
!42 = !{!5, !43}
!43 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!44 = !{i32 7, !"Dwarf Version", i32 5}
!45 = !{i32 2, !"Debug Info Version", i32 3}
!46 = !{i32 1, !"wchar_size", i32 4}
!47 = !{i32 8, !"PIC Level", i32 2}
!48 = !{i32 7, !"PIE Level", i32 2}
!49 = !{i32 7, !"uwtable", i32 2}
!50 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!51 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!52 = distinct !DISubprogram(name: "mb_is_available", scope: !1, file: !1, line: 25, type: !53, scopeLine: 26, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1238)
!53 = !DISubroutineType(types: !54)
!54 = !{!5, !5, !55}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !57, line: 273, baseType: !58)
!57 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !57, line: 197, size: 3840, elements: !59)
!59 = !{!60, !1154, !1155, !1156, !1157, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1186, !1187, !1188, !1189, !1190, !1193, !1194, !1196, !1197, !1198, !1199, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1223, !1224, !1229, !1233, !1237}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !58, file: !57, line: 199, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !57, line: 341, size: 109184, elements: !63)
!63 = !{!64, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !928, !930, !983, !1013, !1040, !1043, !1044, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1079, !1080, !1081, !1082, !1083, !1084, !1087, !1088, !1091, !1092, !1094, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1107, !1108, !1109, !1110, !1111, !1113, !1114, !1115, !1119, !1123, !1127, !1131, !1135, !1136, !1137, !1138, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !62, file: !57, line: 343, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !57, line: 566, size: 6855040, elements: !67)
!67 = !{!68, !154, !211, !315, !317, !319, !377, !379, !380, !381, !382, !383, !386, !406, !418, !419, !420, !421, !422, !423, !427, !428, !430, !431, !432, !433, !434, !435, !437, !439, !442, !443, !445, !446, !447, !448, !449, !451, !452, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !569, !570, !574, !575, !576, !577, !578, !579, !580, !581, !582, !584, !585, !586, !726, !730, !731, !733, !734, !737, !740, !741, !742, !746, !749, !752, !753, !754, !755, !756, !757, !783, !784, !786, !790, !791, !792, !793, !796, !801, !815, !819, !823, !824, !829, !830, !834, !835, !839, !860, !861, !864, !865, !866, !867, !868, !869, !870, !871}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !66, file: !57, line: 568, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !57, line: 850, size: 32128, elements: !71)
!71 = !{!72, !77, !78, !79, !80, !81, !82, !83, !84, !85, !115, !116, !117, !118, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !70, file: !57, line: 852, baseType: !73, size: 2040)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 2040, elements: !75)
!74 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!75 = !{!76}
!76 = !DISubrange(count: 255)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !70, file: !57, line: 853, baseType: !73, size: 2040, offset: 2040)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !70, file: !57, line: 854, baseType: !73, size: 2040, offset: 4080)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !70, file: !57, line: 856, baseType: !5, size: 32, offset: 6144)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !70, file: !57, line: 857, baseType: !5, size: 32, offset: 6176)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !70, file: !57, line: 858, baseType: !5, size: 32, offset: 6208)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !70, file: !57, line: 859, baseType: !5, size: 32, offset: 6240)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !70, file: !57, line: 860, baseType: !5, size: 32, offset: 6272)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !70, file: !57, line: 861, baseType: !5, size: 32, offset: 6304)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !70, file: !57, line: 864, baseType: !86, size: 1088, offset: 6336)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !4, line: 52, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !4, line: 30, size: 1088, elements: !88)
!88 = !{!89, !91, !93, !95, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !87, file: !4, line: 32, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !4, line: 28, baseType: !3)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !87, file: !4, line: 33, baseType: !92, size: 32, offset: 32)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !4, line: 20, baseType: !12)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !87, file: !4, line: 34, baseType: !94, size: 64, offset: 64)
!94 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !87, file: !4, line: 35, baseType: !96, size: 96, offset: 128)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 96, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 3)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !87, file: !4, line: 36, baseType: !96, size: 96, offset: 224)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !87, file: !4, line: 37, baseType: !5, size: 32, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !87, file: !4, line: 38, baseType: !5, size: 32, offset: 352)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !87, file: !4, line: 39, baseType: !5, size: 32, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !87, file: !4, line: 40, baseType: !5, size: 32, offset: 416)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !87, file: !4, line: 41, baseType: !5, size: 32, offset: 448)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !87, file: !4, line: 42, baseType: !5, size: 32, offset: 480)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !87, file: !4, line: 43, baseType: !5, size: 32, offset: 512)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !87, file: !4, line: 44, baseType: !5, size: 32, offset: 544)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !87, file: !4, line: 45, baseType: !96, size: 96, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !87, file: !4, line: 46, baseType: !5, size: 32, offset: 672)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !87, file: !4, line: 47, baseType: !96, size: 96, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !87, file: !4, line: 48, baseType: !96, size: 96, offset: 800)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !87, file: !4, line: 49, baseType: !96, size: 96, offset: 896)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !87, file: !4, line: 50, baseType: !5, size: 32, offset: 992)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !87, file: !4, line: 51, baseType: !5, size: 32, offset: 1024)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !70, file: !57, line: 865, baseType: !86, size: 1088, offset: 7424)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !70, file: !57, line: 867, baseType: !5, size: 32, offset: 8512)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !70, file: !57, line: 868, baseType: !5, size: 32, offset: 8544)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !70, file: !57, line: 869, baseType: !119, size: 7744, offset: 8576)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !19, line: 60, baseType: !120)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !19, line: 34, size: 7744, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !120, file: !19, line: 37, baseType: !73, size: 2040)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !120, file: !19, line: 38, baseType: !73, size: 2040, offset: 2040)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !120, file: !19, line: 39, baseType: !73, size: 2040, offset: 4080)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !120, file: !19, line: 40, baseType: !5, size: 32, offset: 6144)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !120, file: !19, line: 41, baseType: !127, size: 32, offset: 6176)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !19, line: 32, baseType: !18)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !120, file: !19, line: 42, baseType: !86, size: 1088, offset: 6208)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !120, file: !19, line: 43, baseType: !5, size: 32, offset: 7296)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !120, file: !19, line: 44, baseType: !5, size: 32, offset: 7328)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !120, file: !19, line: 45, baseType: !5, size: 32, offset: 7360)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !120, file: !19, line: 46, baseType: !5, size: 32, offset: 7392)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !120, file: !19, line: 47, baseType: !5, size: 32, offset: 7424)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !120, file: !19, line: 48, baseType: !5, size: 32, offset: 7456)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !120, file: !19, line: 49, baseType: !5, size: 32, offset: 7488)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !120, file: !19, line: 50, baseType: !5, size: 32, offset: 7520)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !120, file: !19, line: 51, baseType: !5, size: 32, offset: 7552)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !120, file: !19, line: 52, baseType: !5, size: 32, offset: 7584)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !120, file: !19, line: 53, baseType: !5, size: 32, offset: 7616)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !120, file: !19, line: 56, baseType: !141, size: 64, offset: 7680)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !70, file: !57, line: 870, baseType: !119, size: 7744, offset: 16320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !70, file: !57, line: 871, baseType: !119, size: 7744, offset: 24064)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !70, file: !57, line: 873, baseType: !5, size: 32, offset: 31808)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !70, file: !57, line: 884, baseType: !5, size: 32, offset: 31840)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !70, file: !57, line: 885, baseType: !5, size: 32, offset: 31872)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !70, file: !57, line: 886, baseType: !5, size: 32, offset: 31904)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !70, file: !57, line: 890, baseType: !5, size: 32, offset: 31936)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !70, file: !57, line: 893, baseType: !5, size: 32, offset: 31968)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !70, file: !57, line: 894, baseType: !5, size: 32, offset: 32000)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !70, file: !57, line: 895, baseType: !5, size: 32, offset: 32032)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !70, file: !57, line: 897, baseType: !5, size: 32, offset: 32064)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !70, file: !57, line: 899, baseType: !5, size: 32, offset: 32096)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !66, file: !57, line: 569, baseType: !155, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !157, line: 138, baseType: !158)
!157 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 94, size: 17728, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !170, !175, !179, !182, !183, !184, !185, !186, !190, !191, !192, !193, !194, !195, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !158, file: !157, line: 96, baseType: !5, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !158, file: !157, line: 97, baseType: !29, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !158, file: !157, line: 98, baseType: !29, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !158, file: !157, line: 99, baseType: !5, size: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !158, file: !157, line: 100, baseType: !5, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !158, file: !157, line: 102, baseType: !5, size: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !158, file: !157, line: 103, baseType: !167, size: 384, offset: 192)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 384, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 12)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !158, file: !157, line: 104, baseType: !171, size: 3072, offset: 576)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 3072, elements: !172)
!172 = !{!173, !174}
!173 = !DISubrange(count: 6)
!174 = !DISubrange(count: 16)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !158, file: !157, line: 105, baseType: !176, size: 12288, offset: 3648)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 12288, elements: !177)
!177 = !{!173, !178}
!178 = !DISubrange(count: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !158, file: !157, line: 106, baseType: !180, size: 192, offset: 15936)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 192, elements: !181)
!181 = !{!173}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !158, file: !157, line: 107, baseType: !180, size: 192, offset: 16128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !158, file: !157, line: 110, baseType: !5, size: 32, offset: 16320)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !158, file: !157, line: 111, baseType: !29, size: 32, offset: 16352)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !158, file: !157, line: 112, baseType: !29, size: 32, offset: 16384)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !158, file: !157, line: 114, baseType: !187, size: 256, offset: 16416)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 256, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 8)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !158, file: !157, line: 116, baseType: !187, size: 256, offset: 16672)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !158, file: !157, line: 117, baseType: !187, size: 256, offset: 16928)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !158, file: !157, line: 119, baseType: !5, size: 32, offset: 17184)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !158, file: !157, line: 120, baseType: !29, size: 32, offset: 17216)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !158, file: !157, line: 122, baseType: !29, size: 32, offset: 17248)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !158, file: !157, line: 123, baseType: !196, size: 64, offset: 17280)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !198, line: 21, baseType: !199)
!198 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!199 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !158, file: !157, line: 125, baseType: !5, size: 32, offset: 17344)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !158, file: !157, line: 126, baseType: !5, size: 32, offset: 17376)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !158, file: !157, line: 127, baseType: !5, size: 32, offset: 17408)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !158, file: !157, line: 128, baseType: !29, size: 32, offset: 17440)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !158, file: !157, line: 129, baseType: !5, size: 32, offset: 17472)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !158, file: !157, line: 130, baseType: !5, size: 32, offset: 17504)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !158, file: !157, line: 131, baseType: !5, size: 32, offset: 17536)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !158, file: !157, line: 133, baseType: !5, size: 32, offset: 17568)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !158, file: !157, line: 135, baseType: !5, size: 32, offset: 17600)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !158, file: !157, line: 136, baseType: !5, size: 32, offset: 17632)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !158, file: !157, line: 137, baseType: !5, size: 32, offset: 17664)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !66, file: !57, line: 570, baseType: !212, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !157, line: 197, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 142, size: 33024, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !313, !314}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !214, file: !157, line: 144, baseType: !5, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !214, file: !157, line: 146, baseType: !29, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !214, file: !157, line: 147, baseType: !5, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !214, file: !157, line: 148, baseType: !5, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !214, file: !157, line: 149, baseType: !5, size: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !214, file: !157, line: 150, baseType: !5, size: 32, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !214, file: !157, line: 152, baseType: !5, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !214, file: !157, line: 154, baseType: !29, size: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !214, file: !157, line: 155, baseType: !29, size: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !214, file: !157, line: 156, baseType: !29, size: 32, offset: 288)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !214, file: !157, line: 158, baseType: !5, size: 32, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !214, file: !157, line: 159, baseType: !167, size: 384, offset: 352)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !214, file: !157, line: 160, baseType: !171, size: 3072, offset: 736)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !214, file: !157, line: 161, baseType: !176, size: 12288, offset: 3808)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !214, file: !157, line: 162, baseType: !180, size: 192, offset: 16096)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !214, file: !157, line: 163, baseType: !180, size: 192, offset: 16288)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !214, file: !157, line: 165, baseType: !29, size: 32, offset: 16480)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !214, file: !157, line: 166, baseType: !29, size: 32, offset: 16512)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !214, file: !157, line: 167, baseType: !29, size: 32, offset: 16544)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !214, file: !157, line: 168, baseType: !29, size: 32, offset: 16576)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !214, file: !157, line: 170, baseType: !29, size: 32, offset: 16608)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !214, file: !157, line: 172, baseType: !5, size: 32, offset: 16640)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !214, file: !157, line: 173, baseType: !5, size: 32, offset: 16672)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !214, file: !157, line: 174, baseType: !5, size: 32, offset: 16704)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !214, file: !157, line: 175, baseType: !29, size: 32, offset: 16736)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !214, file: !157, line: 177, baseType: !242, size: 8192, offset: 16768)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8192, elements: !243)
!243 = !{!244}
!244 = !DISubrange(count: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !214, file: !157, line: 178, baseType: !29, size: 32, offset: 24960)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !214, file: !157, line: 179, baseType: !5, size: 32, offset: 24992)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !214, file: !157, line: 180, baseType: !29, size: 32, offset: 25024)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !214, file: !157, line: 181, baseType: !29, size: 32, offset: 25056)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !214, file: !157, line: 182, baseType: !5, size: 32, offset: 25088)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !214, file: !157, line: 184, baseType: !5, size: 32, offset: 25120)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !214, file: !157, line: 185, baseType: !5, size: 32, offset: 25152)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !214, file: !157, line: 186, baseType: !5, size: 32, offset: 25184)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !214, file: !157, line: 187, baseType: !29, size: 32, offset: 25216)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !214, file: !157, line: 188, baseType: !29, size: 32, offset: 25248)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !214, file: !157, line: 189, baseType: !29, size: 32, offset: 25280)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !214, file: !157, line: 190, baseType: !29, size: 32, offset: 25312)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !214, file: !157, line: 191, baseType: !5, size: 32, offset: 25344)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !214, file: !157, line: 192, baseType: !259, size: 7584, offset: 25376)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !157, line: 90, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 53, size: 7584, elements: !261)
!261 = !{!262, !263, !264, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !260, file: !157, line: 55, baseType: !5, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !260, file: !157, line: 56, baseType: !29, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !260, file: !157, line: 57, baseType: !265, size: 16, offset: 64)
!265 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !260, file: !157, line: 58, baseType: !265, size: 16, offset: 80)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !260, file: !157, line: 59, baseType: !5, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !260, file: !157, line: 60, baseType: !5, size: 32, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !260, file: !157, line: 61, baseType: !5, size: 32, offset: 160)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !260, file: !157, line: 62, baseType: !29, size: 32, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !260, file: !157, line: 63, baseType: !5, size: 32, offset: 224)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !260, file: !157, line: 64, baseType: !5, size: 32, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !260, file: !157, line: 65, baseType: !29, size: 32, offset: 288)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !260, file: !157, line: 66, baseType: !29, size: 32, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !260, file: !157, line: 67, baseType: !29, size: 32, offset: 352)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !260, file: !157, line: 68, baseType: !5, size: 32, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !260, file: !157, line: 69, baseType: !29, size: 32, offset: 416)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !260, file: !157, line: 70, baseType: !29, size: 32, offset: 448)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !260, file: !157, line: 71, baseType: !5, size: 32, offset: 480)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !260, file: !157, line: 72, baseType: !29, size: 32, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !260, file: !157, line: 73, baseType: !29, size: 32, offset: 544)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !260, file: !157, line: 74, baseType: !5, size: 32, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !260, file: !157, line: 75, baseType: !5, size: 32, offset: 608)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !260, file: !157, line: 76, baseType: !285, size: 3296, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !157, line: 50, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 38, size: 3296, elements: !287)
!287 = !{!288, !289, !290, !291, !295, !296, !297, !298, !299, !300}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !286, file: !157, line: 40, baseType: !29, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !286, file: !157, line: 41, baseType: !29, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !286, file: !157, line: 42, baseType: !29, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !286, file: !157, line: 43, baseType: !292, size: 1024, offset: 96)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1024, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !286, file: !157, line: 44, baseType: !292, size: 1024, offset: 1120)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !286, file: !157, line: 45, baseType: !292, size: 1024, offset: 2144)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !286, file: !157, line: 46, baseType: !29, size: 32, offset: 3168)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !286, file: !157, line: 47, baseType: !29, size: 32, offset: 3200)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !286, file: !157, line: 48, baseType: !29, size: 32, offset: 3232)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !286, file: !157, line: 49, baseType: !29, size: 32, offset: 3264)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !260, file: !157, line: 77, baseType: !5, size: 32, offset: 3936)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !260, file: !157, line: 78, baseType: !285, size: 3296, offset: 3968)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !260, file: !157, line: 80, baseType: !5, size: 32, offset: 7264)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !260, file: !157, line: 81, baseType: !5, size: 32, offset: 7296)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !260, file: !157, line: 82, baseType: !5, size: 32, offset: 7328)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !260, file: !157, line: 83, baseType: !5, size: 32, offset: 7360)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !260, file: !157, line: 84, baseType: !29, size: 32, offset: 7392)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !260, file: !157, line: 85, baseType: !29, size: 32, offset: 7424)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !260, file: !157, line: 86, baseType: !29, size: 32, offset: 7456)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !260, file: !157, line: 87, baseType: !29, size: 32, offset: 7488)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !260, file: !157, line: 88, baseType: !29, size: 32, offset: 7520)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !260, file: !157, line: 89, baseType: !29, size: 32, offset: 7552)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !214, file: !157, line: 193, baseType: !29, size: 32, offset: 32960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !214, file: !157, line: 195, baseType: !5, size: 32, offset: 32992)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !66, file: !57, line: 571, baseType: !316, size: 1056768, offset: 192)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 1056768, elements: !293)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !66, file: !57, line: 572, baseType: !318, size: 4538368, offset: 1056960)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 4538368, elements: !243)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !66, file: !57, line: 575, baseType: !320, size: 64, offset: 5595328)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !157, line: 256, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 228, size: 37312, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !329, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !344, !345, !346, !347}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !322, file: !157, line: 230, baseType: !213, size: 33024)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !322, file: !157, line: 232, baseType: !29, size: 32, offset: 33024)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !322, file: !157, line: 233, baseType: !5, size: 32, offset: 33056)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !322, file: !157, line: 234, baseType: !141, size: 64, offset: 33088)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !322, file: !157, line: 235, baseType: !141, size: 64, offset: 33152)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !322, file: !157, line: 236, baseType: !330, size: 64, offset: 33216)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !322, file: !157, line: 237, baseType: !141, size: 64, offset: 33280)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !322, file: !157, line: 238, baseType: !330, size: 64, offset: 33344)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !322, file: !157, line: 240, baseType: !141, size: 64, offset: 33408)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !322, file: !157, line: 241, baseType: !330, size: 64, offset: 33472)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !322, file: !157, line: 242, baseType: !141, size: 64, offset: 33536)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !322, file: !157, line: 243, baseType: !330, size: 64, offset: 33600)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !322, file: !157, line: 245, baseType: !5, size: 32, offset: 33664)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !322, file: !157, line: 246, baseType: !141, size: 64, offset: 33728)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !322, file: !157, line: 247, baseType: !141, size: 64, offset: 33792)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !322, file: !157, line: 248, baseType: !330, size: 64, offset: 33856)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !322, file: !157, line: 249, baseType: !330, size: 64, offset: 33920)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !322, file: !157, line: 250, baseType: !343, size: 64, offset: 33984)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !322, file: !157, line: 251, baseType: !330, size: 64, offset: 34048)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !322, file: !157, line: 253, baseType: !29, size: 32, offset: 34112)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !322, file: !157, line: 254, baseType: !5, size: 32, offset: 34144)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !322, file: !157, line: 255, baseType: !348, size: 3136, offset: 34176)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !157, line: 226, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !157, line: 200, size: 3136, elements: !350)
!350 = !{!351, !352, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !370, !371, !373, !374, !375, !376}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !349, file: !157, line: 202, baseType: !5, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !349, file: !157, line: 203, baseType: !353, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !349, file: !157, line: 204, baseType: !141, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !349, file: !157, line: 205, baseType: !330, size: 64, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !349, file: !157, line: 206, baseType: !353, size: 64, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !349, file: !157, line: 207, baseType: !141, size: 64, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !349, file: !157, line: 208, baseType: !141, size: 64, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !349, file: !157, line: 209, baseType: !353, size: 64, offset: 448)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !349, file: !157, line: 210, baseType: !353, size: 64, offset: 512)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !349, file: !157, line: 211, baseType: !353, size: 64, offset: 576)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !349, file: !157, line: 212, baseType: !353, size: 64, offset: 640)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !349, file: !157, line: 213, baseType: !353, size: 64, offset: 704)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !349, file: !157, line: 216, baseType: !354, size: 8, offset: 768)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !349, file: !157, line: 217, baseType: !354, size: 8, offset: 776)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !349, file: !157, line: 218, baseType: !354, size: 8, offset: 784)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !349, file: !157, line: 219, baseType: !369, size: 1024, offset: 800)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 1024, elements: !293)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !349, file: !157, line: 220, baseType: !369, size: 1024, offset: 1824)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !349, file: !157, line: 221, baseType: !372, size: 256, offset: 2848)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 256, elements: !293)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !349, file: !157, line: 222, baseType: !354, size: 8, offset: 3104)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !349, file: !157, line: 223, baseType: !354, size: 8, offset: 3112)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !349, file: !157, line: 224, baseType: !354, size: 8, offset: 3120)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !349, file: !157, line: 225, baseType: !354, size: 8, offset: 3128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !66, file: !57, line: 577, baseType: !378, size: 1193984, offset: 5595392)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 1193984, elements: !293)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !66, file: !57, line: 578, baseType: !5, size: 32, offset: 6789376)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !66, file: !57, line: 579, baseType: !5, size: 32, offset: 6789408)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !66, file: !57, line: 580, baseType: !5, size: 32, offset: 6789440)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !66, file: !57, line: 581, baseType: !5, size: 32, offset: 6789472)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !66, file: !57, line: 584, baseType: !384, size: 64, offset: 6789504)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !57, line: 584, flags: DIFlagFwdDecl)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !66, file: !57, line: 586, baseType: !387, size: 64, offset: 6789568)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !57, line: 902, size: 416, elements: !389)
!389 = !{!390, !391, !392, !393, !394, !395, !399, !400, !401, !402, !403, !404, !405}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !388, file: !57, line: 904, baseType: !29, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !388, file: !57, line: 905, baseType: !29, size: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !388, file: !57, line: 906, baseType: !5, size: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !388, file: !57, line: 907, baseType: !29, size: 32, offset: 96)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !388, file: !57, line: 908, baseType: !5, size: 32, offset: 128)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !388, file: !57, line: 909, baseType: !396, size: 64, offset: 160)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 2)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !388, file: !57, line: 910, baseType: !197, size: 8, offset: 224)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !388, file: !57, line: 911, baseType: !197, size: 8, offset: 232)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !388, file: !57, line: 912, baseType: !5, size: 32, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !388, file: !57, line: 913, baseType: !5, size: 32, offset: 288)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !388, file: !57, line: 915, baseType: !5, size: 32, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !388, file: !57, line: 916, baseType: !5, size: 32, offset: 352)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !388, file: !57, line: 917, baseType: !5, size: 32, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !66, file: !57, line: 587, baseType: !407, size: 64, offset: 6789632)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !57, line: 839, size: 512, elements: !409)
!409 = !{!410, !411, !414, !415, !416, !417}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !408, file: !57, line: 841, baseType: !5, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !408, file: !57, line: 842, baseType: !412, size: 96, offset: 32)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 96, elements: !97)
!413 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !408, file: !57, line: 843, baseType: !412, size: 96, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !408, file: !57, line: 844, baseType: !412, size: 96, offset: 224)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !408, file: !57, line: 845, baseType: !412, size: 96, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !408, file: !57, line: 846, baseType: !412, size: 96, offset: 416)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !66, file: !57, line: 588, baseType: !5, size: 32, offset: 6789696)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !66, file: !57, line: 591, baseType: !29, size: 32, offset: 6789728)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !66, file: !57, line: 592, baseType: !5, size: 32, offset: 6789760)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !66, file: !57, line: 593, baseType: !5, size: 32, offset: 6789792)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !66, file: !57, line: 594, baseType: !5, size: 32, offset: 6789824)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !66, file: !57, line: 595, baseType: !424, size: 64, offset: 6789888)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !57, line: 542, baseType: !62)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !66, file: !57, line: 596, baseType: !353, size: 64, offset: 6789952)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block_JV", scope: !66, file: !57, line: 597, baseType: !429, size: 192, offset: 6790016)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 192, elements: !97)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !57, line: 601, baseType: !5, size: 32, offset: 6790208)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !66, file: !57, line: 602, baseType: !5, size: 32, offset: 6790240)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !66, file: !57, line: 603, baseType: !5, size: 32, offset: 6790272)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !66, file: !57, line: 604, baseType: !5, size: 32, offset: 6790304)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !66, file: !57, line: 605, baseType: !5, size: 32, offset: 6790336)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !66, file: !57, line: 607, baseType: !436, size: 64, offset: 6790400)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode_JV", scope: !66, file: !57, line: 608, baseType: !438, size: 192, offset: 6790464)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 192, elements: !97)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !66, file: !57, line: 609, baseType: !440, size: 64, offset: 6790656)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "siblock", scope: !66, file: !57, line: 610, baseType: !330, size: 64, offset: 6790720)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "siblock_JV", scope: !66, file: !57, line: 611, baseType: !444, size: 192, offset: 6790784)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 192, elements: !97)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "newframe", scope: !66, file: !57, line: 613, baseType: !5, size: 32, offset: 6790976)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !66, file: !57, line: 614, baseType: !5, size: 32, offset: 6791008)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pNextSlice", scope: !66, file: !57, line: 617, baseType: !425, size: 64, offset: 6791040)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !66, file: !57, line: 618, baseType: !55, size: 64, offset: 6791104)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data_JV", scope: !66, file: !57, line: 619, baseType: !450, size: 192, offset: 6791168)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 192, elements: !97)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaArrayType", scope: !66, file: !57, line: 621, baseType: !5, size: 32, offset: 6791360)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_head", scope: !66, file: !57, line: 626, baseType: !453, size: 64, offset: 6791424)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !57, line: 626, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_end", scope: !66, file: !57, line: 627, baseType: !453, size: 64, offset: 6791488)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !66, file: !57, line: 629, baseType: !29, size: 32, offset: 6791552)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "non_conforming_stream", scope: !66, file: !57, line: 630, baseType: !5, size: 32, offset: 6791584)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntMsb", scope: !66, file: !57, line: 634, baseType: !5, size: 32, offset: 6791616)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntLsb", scope: !66, file: !57, line: 635, baseType: !29, size: 32, offset: 6791648)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedPicOrderCnt", scope: !66, file: !57, line: 638, baseType: !5, size: 32, offset: 6791680)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntCycleCnt", scope: !66, file: !57, line: 638, baseType: !5, size: 32, offset: 6791712)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumInPicOrderCntCycle", scope: !66, file: !57, line: 638, baseType: !5, size: 32, offset: 6791744)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNum", scope: !66, file: !57, line: 639, baseType: !29, size: 32, offset: 6791776)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumOffset", scope: !66, file: !57, line: 639, baseType: !29, size: 32, offset: 6791808)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDeltaPerPicOrderCntCycle", scope: !66, file: !57, line: 640, baseType: !5, size: 32, offset: 6791840)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !66, file: !57, line: 641, baseType: !5, size: 32, offset: 6791872)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNumOffset", scope: !66, file: !57, line: 642, baseType: !5, size: 32, offset: 6791904)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFrameNum", scope: !66, file: !57, line: 645, baseType: !5, size: 32, offset: 6791936)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !66, file: !57, line: 647, baseType: !29, size: 32, offset: 6791968)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !66, file: !57, line: 648, baseType: !29, size: 32, offset: 6792000)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !66, file: !57, line: 649, baseType: !29, size: 32, offset: 6792032)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !66, file: !57, line: 650, baseType: !29, size: 32, offset: 6792064)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !66, file: !57, line: 651, baseType: !29, size: 32, offset: 6792096)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !66, file: !57, line: 652, baseType: !29, size: 32, offset: 6792128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "oldFrameSizeInMbs", scope: !66, file: !57, line: 653, baseType: !29, size: 32, offset: 6792160)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !66, file: !57, line: 655, baseType: !5, size: 32, offset: 6792192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !66, file: !57, line: 657, baseType: !5, size: 32, offset: 6792224)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !66, file: !57, line: 658, baseType: !5, size: 32, offset: 6792256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_bitsize_on_disk", scope: !66, file: !57, line: 661, baseType: !5, size: 32, offset: 6792288)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !66, file: !57, line: 662, baseType: !43, size: 16, offset: 6792320)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !66, file: !57, line: 663, baseType: !43, size: 16, offset: 6792336)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_scale", scope: !66, file: !57, line: 664, baseType: !396, size: 64, offset: 6792352)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !66, file: !57, line: 665, baseType: !5, size: 32, offset: 6792416)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !66, file: !57, line: 666, baseType: !5, size: 32, offset: 6792448)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value_comp", scope: !66, file: !57, line: 667, baseType: !486, size: 96, offset: 6792480)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 96, elements: !97)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "max_pel_value_comp", scope: !66, file: !57, line: 668, baseType: !96, size: 96, offset: 6792576)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !66, file: !57, line: 670, baseType: !5, size: 32, offset: 6792672)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !66, file: !57, line: 671, baseType: !5, size: 32, offset: 6792704)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !66, file: !57, line: 672, baseType: !5, size: 32, offset: 6792736)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !66, file: !57, line: 673, baseType: !5, size: 32, offset: 6792768)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "num_uv_blocks", scope: !66, file: !57, line: 674, baseType: !5, size: 32, offset: 6792800)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !66, file: !57, line: 675, baseType: !5, size: 32, offset: 6792832)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !66, file: !57, line: 676, baseType: !5, size: 32, offset: 6792864)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !66, file: !57, line: 677, baseType: !5, size: 32, offset: 6792896)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x_blk", scope: !66, file: !57, line: 678, baseType: !5, size: 32, offset: 6792928)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y_blk", scope: !66, file: !57, line: 679, baseType: !5, size: 32, offset: 6792960)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !66, file: !57, line: 680, baseType: !499, size: 192, offset: 6792992)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 192, elements: !500)
!500 = !{!98, !398}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_blk", scope: !66, file: !57, line: 681, baseType: !499, size: 192, offset: 6793184)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_shift", scope: !66, file: !57, line: 682, baseType: !499, size: 192, offset: 6793376)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_x", scope: !66, file: !57, line: 683, baseType: !5, size: 32, offset: 6793568)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_y", scope: !66, file: !57, line: 684, baseType: !5, size: 32, offset: 6793600)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_x", scope: !66, file: !57, line: 685, baseType: !5, size: 32, offset: 6793632)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_y", scope: !66, file: !57, line: 686, baseType: !5, size: 32, offset: 6793664)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "total_scale", scope: !66, file: !57, line: 687, baseType: !5, size: 32, offset: 6793696)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "max_vmv_r", scope: !66, file: !57, line: 689, baseType: !5, size: 32, offset: 6793728)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "idr_psnr_number", scope: !66, file: !57, line: 692, baseType: !5, size: 32, offset: 6793760)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "psnr_number", scope: !66, file: !57, line: 693, baseType: !5, size: 32, offset: 6793792)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "last_ref_pic_poc", scope: !66, file: !57, line: 700, baseType: !5, size: 32, offset: 6793824)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !66, file: !57, line: 701, baseType: !5, size: 32, offset: 6793856)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !66, file: !57, line: 702, baseType: !5, size: 32, offset: 6793888)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !66, file: !57, line: 703, baseType: !5, size: 32, offset: 6793920)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "earlier_missing_poc", scope: !66, file: !57, line: 704, baseType: !5, size: 32, offset: 6793952)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_conceal", scope: !66, file: !57, line: 705, baseType: !29, size: 32, offset: 6793984)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "IDR_concealment_flag", scope: !66, file: !57, line: 706, baseType: !5, size: 32, offset: 6794016)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_slice_type", scope: !66, file: !57, line: 707, baseType: !5, size: 32, offset: 6794048)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point", scope: !66, file: !57, line: 710, baseType: !5, size: 32, offset: 6794080)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point_found", scope: !66, file: !57, line: 711, baseType: !5, size: 32, offset: 6794112)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_cnt", scope: !66, file: !57, line: 712, baseType: !5, size: 32, offset: 6794144)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_num", scope: !66, file: !57, line: 713, baseType: !5, size: 32, offset: 6794176)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_poc", scope: !66, file: !57, line: 714, baseType: !5, size: 32, offset: 6794208)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !66, file: !57, line: 716, baseType: !5, size: 32, offset: 6794240)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !66, file: !57, line: 717, baseType: !5, size: 32, offset: 6794272)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !66, file: !57, line: 719, baseType: !196, size: 64, offset: 6794304)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !66, file: !57, line: 720, baseType: !196, size: 64, offset: 6794368)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "imgData", scope: !66, file: !57, line: 722, baseType: !529, size: 2560, offset: 6794432)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageData", file: !530, line: 38, baseType: !531)
!530 = !DIFile(filename: "ldecod_src/inc/io_image.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "8caef624e6f5391b0c6ab2984e7f77c6")
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "image_data", file: !530, line: 20, size: 2560, elements: !532)
!532 = !{!533, !534, !540, !541, !542, !546, !547, !548, !549, !550}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !531, file: !530, line: 22, baseType: !86, size: 1088)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "frm_data", scope: !531, file: !530, line: 24, baseType: !535, size: 192, offset: 1088)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 192, elements: !97)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !198, line: 41, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !198, line: 23, baseType: !265)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "top_data", scope: !531, file: !530, line: 25, baseType: !535, size: 192, offset: 1280)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bot_data", scope: !531, file: !530, line: 26, baseType: !535, size: 192, offset: 1472)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "frm_uint16", scope: !531, file: !530, line: 31, baseType: !543, size: 192, offset: 1664)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 192, elements: !97)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "top_uint16", scope: !531, file: !530, line: 32, baseType: !543, size: 192, offset: 1856)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "bot_uint16", scope: !531, file: !530, line: 33, baseType: !543, size: 192, offset: 2048)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "frm_stride", scope: !531, file: !530, line: 35, baseType: !96, size: 96, offset: 2240)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "top_stride", scope: !531, file: !530, line: 36, baseType: !96, size: 96, offset: 2336)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "bot_stride", scope: !531, file: !530, line: 37, baseType: !96, size: 96, offset: 2432)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "imgData0", scope: !66, file: !57, line: 723, baseType: !529, size: 2560, offset: 6796992)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "imgData1", scope: !66, file: !57, line: 724, baseType: !529, size: 2560, offset: 6799552)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "imgData2", scope: !66, file: !57, line: 725, baseType: !529, size: 2560, offset: 6802112)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "imgData32", scope: !66, file: !57, line: 728, baseType: !529, size: 2560, offset: 6804672)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "imgData4", scope: !66, file: !57, line: 729, baseType: !529, size: 2560, offset: 6807232)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "imgData5", scope: !66, file: !57, line: 730, baseType: !529, size: 2560, offset: 6809792)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "imgData6", scope: !66, file: !57, line: 731, baseType: !529, size: 2560, offset: 6812352)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "previous_frame_num", scope: !66, file: !57, line: 735, baseType: !29, size: 32, offset: 6814912)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "Is_primary_correct", scope: !66, file: !57, line: 737, baseType: !5, size: 32, offset: 6814944)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Is_redundant_correct", scope: !66, file: !57, line: 738, baseType: !5, size: 32, offset: 6814976)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tot_time", scope: !66, file: !57, line: 741, baseType: !562, size: 64, offset: 6815040)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !563, line: 103, baseType: !564)
!563 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !565, line: 27, baseType: !566)
!565 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !567, line: 44, baseType: !568)
!567 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!568 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "p_out", scope: !66, file: !57, line: 744, baseType: !5, size: 32, offset: 6815104)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "p_out_mvc", scope: !66, file: !57, line: 746, baseType: !571, size: 32768, offset: 6815136)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 32768, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 1024)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "p_ref", scope: !66, file: !57, line: 748, baseType: !5, size: 32, offset: 6847904)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessUnitExists", scope: !66, file: !57, line: 751, baseType: !5, size: 32, offset: 6847936)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "NALUCount", scope: !66, file: !57, line: 752, baseType: !5, size: 32, offset: 6847968)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Bframe_ctr", scope: !66, file: !57, line: 755, baseType: !5, size: 32, offset: 6848000)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "frame_no", scope: !66, file: !57, line: 756, baseType: !5, size: 32, offset: 6848032)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "g_nFrame", scope: !66, file: !57, line: 758, baseType: !5, size: 32, offset: 6848064)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "global_init_done", scope: !66, file: !57, line: 759, baseType: !5, size: 32, offset: 6848096)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ref", scope: !66, file: !57, line: 762, baseType: !536, size: 64, offset: 6848128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV_ref", scope: !66, file: !57, line: 763, baseType: !583, size: 64, offset: 6848192)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "qp_per_matrix", scope: !66, file: !57, line: 765, baseType: !141, size: 64, offset: 6848256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "qp_rem_matrix", scope: !66, file: !57, line: 766, baseType: !141, size: 64, offset: 6848320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "last_out_fs", scope: !66, file: !57, line: 768, baseType: !587, size: 64, offset: 6848384)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !589, line: 152, size: 768, elements: !590)
!589 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !721, !722, !723, !724, !725}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !588, file: !589, line: 154, baseType: !5, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !588, file: !589, line: 155, baseType: !5, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !588, file: !589, line: 156, baseType: !5, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !588, file: !589, line: 157, baseType: !5, size: 32, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !588, file: !589, line: 159, baseType: !5, size: 32, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !588, file: !589, line: 161, baseType: !29, size: 32, offset: 160)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !588, file: !589, line: 162, baseType: !29, size: 32, offset: 192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !588, file: !589, line: 164, baseType: !5, size: 32, offset: 224)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !588, file: !589, line: 165, baseType: !5, size: 32, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !588, file: !589, line: 166, baseType: !5, size: 32, offset: 288)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !588, file: !589, line: 167, baseType: !5, size: 32, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !588, file: !589, line: 170, baseType: !5, size: 32, offset: 352)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !588, file: !589, line: 172, baseType: !604, size: 64, offset: 384)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !589, line: 138, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !589, line: 46, size: 3328, elements: !607)
!607 = !{!608, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !661, !663, !667, !669, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !606, file: !589, line: 48, baseType: !609, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !28, line: 140, baseType: !27)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !606, file: !589, line: 50, baseType: !5, size: 32, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !606, file: !589, line: 51, baseType: !5, size: 32, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !606, file: !589, line: 52, baseType: !5, size: 32, offset: 96)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !606, file: !589, line: 53, baseType: !5, size: 32, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !606, file: !589, line: 54, baseType: !29, size: 32, offset: 160)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !606, file: !589, line: 55, baseType: !29, size: 32, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !606, file: !589, line: 57, baseType: !5, size: 32, offset: 224)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !606, file: !589, line: 58, baseType: !5, size: 32, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !606, file: !589, line: 59, baseType: !5, size: 32, offset: 288)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !606, file: !589, line: 61, baseType: !197, size: 8, offset: 320)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !606, file: !589, line: 62, baseType: !5, size: 32, offset: 352)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !606, file: !589, line: 63, baseType: !5, size: 32, offset: 384)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !606, file: !589, line: 64, baseType: !5, size: 32, offset: 416)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !606, file: !589, line: 65, baseType: !5, size: 32, offset: 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !606, file: !589, line: 67, baseType: !43, size: 16, offset: 480)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !606, file: !589, line: 69, baseType: !5, size: 32, offset: 512)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !606, file: !589, line: 69, baseType: !5, size: 32, offset: 544)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !606, file: !589, line: 69, baseType: !5, size: 32, offset: 576)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !606, file: !589, line: 69, baseType: !5, size: 32, offset: 608)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !606, file: !589, line: 70, baseType: !5, size: 32, offset: 640)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !606, file: !589, line: 70, baseType: !5, size: 32, offset: 672)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !606, file: !589, line: 70, baseType: !5, size: 32, offset: 704)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !606, file: !589, line: 70, baseType: !5, size: 32, offset: 736)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !606, file: !589, line: 71, baseType: !5, size: 32, offset: 768)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !606, file: !589, line: 72, baseType: !5, size: 32, offset: 800)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !606, file: !589, line: 73, baseType: !29, size: 32, offset: 832)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !606, file: !589, line: 74, baseType: !29, size: 32, offset: 864)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !606, file: !589, line: 75, baseType: !5, size: 32, offset: 896)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !606, file: !589, line: 75, baseType: !5, size: 32, offset: 928)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !606, file: !589, line: 76, baseType: !5, size: 32, offset: 960)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !606, file: !589, line: 76, baseType: !5, size: 32, offset: 992)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !606, file: !589, line: 79, baseType: !536, size: 64, offset: 1024)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !606, file: !589, line: 80, baseType: !583, size: 64, offset: 1088)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !606, file: !589, line: 81, baseType: !583, size: 64, offset: 1152)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !606, file: !589, line: 84, baseType: !645, size: 64, offset: 1216)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !589, line: 36, size: 256, elements: !648)
!648 = !{!649, !652, !659}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !647, file: !589, line: 38, baseType: !650, size: 128)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 128, elements: !397)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !647, file: !589, line: 39, baseType: !653, size: 64, offset: 128)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 64, elements: !397)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !57, line: 104, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !57, line: 100, size: 32, elements: !656)
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !655, file: !57, line: 102, baseType: !43, size: 16)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !655, file: !57, line: 103, baseType: !43, size: 16, offset: 16)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !647, file: !589, line: 40, baseType: !660, size: 16, offset: 192)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 16, elements: !397)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !606, file: !589, line: 85, baseType: !662, size: 192, offset: 1280)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 192, elements: !97)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !606, file: !589, line: 87, baseType: !664, size: 64, offset: 1472)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !589, line: 29, size: 64, elements: !665)
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !664, file: !589, line: 31, baseType: !196, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !606, file: !589, line: 88, baseType: !668, size: 192, offset: 1536)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 192, elements: !97)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !606, file: !589, line: 90, baseType: !670, size: 64, offset: 1728)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !606, file: !589, line: 92, baseType: !651, size: 64, offset: 1792)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !606, file: !589, line: 93, baseType: !651, size: 64, offset: 1856)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !606, file: !589, line: 94, baseType: !651, size: 64, offset: 1920)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !606, file: !589, line: 96, baseType: !5, size: 32, offset: 1984)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !606, file: !589, line: 97, baseType: !5, size: 32, offset: 2016)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !606, file: !589, line: 98, baseType: !5, size: 32, offset: 2048)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !606, file: !589, line: 99, baseType: !5, size: 32, offset: 2080)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !606, file: !589, line: 100, baseType: !5, size: 32, offset: 2112)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !606, file: !589, line: 102, baseType: !5, size: 32, offset: 2144)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !606, file: !589, line: 103, baseType: !5, size: 32, offset: 2176)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !606, file: !589, line: 104, baseType: !5, size: 32, offset: 2208)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !606, file: !589, line: 105, baseType: !5, size: 32, offset: 2240)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !606, file: !589, line: 106, baseType: !5, size: 32, offset: 2272)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !606, file: !589, line: 107, baseType: !5, size: 32, offset: 2304)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !606, file: !589, line: 108, baseType: !5, size: 32, offset: 2336)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !606, file: !589, line: 109, baseType: !5, size: 32, offset: 2368)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !606, file: !589, line: 110, baseType: !396, size: 64, offset: 2400)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !606, file: !589, line: 111, baseType: !5, size: 32, offset: 2464)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !606, file: !589, line: 112, baseType: !691, size: 64, offset: 2496)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !57, line: 194, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !57, line: 186, size: 256, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !693, file: !57, line: 188, baseType: !5, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !693, file: !57, line: 189, baseType: !5, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !693, file: !57, line: 190, baseType: !5, size: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !693, file: !57, line: 191, baseType: !5, size: 32, offset: 96)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !693, file: !57, line: 192, baseType: !5, size: 32, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !693, file: !57, line: 193, baseType: !701, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !606, file: !589, line: 115, baseType: !5, size: 32, offset: 2560)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !606, file: !589, line: 118, baseType: !5, size: 32, offset: 2592)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !606, file: !589, line: 119, baseType: !5, size: 32, offset: 2624)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !606, file: !589, line: 120, baseType: !5, size: 32, offset: 2656)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !606, file: !589, line: 121, baseType: !537, size: 64, offset: 2688)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !606, file: !589, line: 124, baseType: !5, size: 32, offset: 2752)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !606, file: !589, line: 125, baseType: !5, size: 32, offset: 2784)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !606, file: !589, line: 126, baseType: !5, size: 32, offset: 2816)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !606, file: !589, line: 128, baseType: !5, size: 32, offset: 2848)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !606, file: !589, line: 129, baseType: !5, size: 32, offset: 2880)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !606, file: !589, line: 130, baseType: !5, size: 32, offset: 2912)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !606, file: !589, line: 131, baseType: !5, size: 32, offset: 2944)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !606, file: !589, line: 132, baseType: !536, size: 64, offset: 3008)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !606, file: !589, line: 133, baseType: !5, size: 32, offset: 3072)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !606, file: !589, line: 134, baseType: !5, size: 32, offset: 3104)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !606, file: !589, line: 136, baseType: !660, size: 16, offset: 3136)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !606, file: !589, line: 137, baseType: !719, size: 128, offset: 3200)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 128, elements: !397)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !588, file: !589, line: 173, baseType: !604, size: 64, offset: 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !588, file: !589, line: 174, baseType: !604, size: 64, offset: 512)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !588, file: !589, line: 177, baseType: !5, size: 32, offset: 576)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !588, file: !589, line: 178, baseType: !396, size: 64, offset: 608)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !588, file: !589, line: 179, baseType: !396, size: 64, offset: 672)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "pocs_in_dpb", scope: !66, file: !57, line: 769, baseType: !727, size: 3200, offset: 6848448)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 3200, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 100)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture", scope: !66, file: !57, line: 771, baseType: !651, size: 64, offset: 6851648)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture_JV", scope: !66, file: !57, line: 772, baseType: !732, size: 192, offset: 6851712)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 192, elements: !97)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "no_reference_picture", scope: !66, file: !57, line: 773, baseType: !651, size: 64, offset: 6851904)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "erc_object_list", scope: !66, file: !57, line: 776, baseType: !735, size: 64, offset: 6851968)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "object_buffer", file: !57, line: 776, flags: DIFlagFwdDecl)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "erc_errorVar", scope: !66, file: !57, line: 777, baseType: !738, size: 64, offset: 6852032)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "ercVariables_s", file: !57, line: 777, flags: DIFlagFwdDecl)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "erc_mvperMB", scope: !66, file: !57, line: 779, baseType: !5, size: 32, offset: 6852096)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "erc_img", scope: !66, file: !57, line: 780, baseType: !65, size: 64, offset: 6852160)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ec_flag", scope: !66, file: !57, line: 781, baseType: !743, size: 640, offset: 6852224)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 640, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 20)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "annex_b", scope: !66, file: !57, line: 783, baseType: !747, size: 64, offset: 6852864)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "annex_b_struct", file: !57, line: 783, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "bitsfile", scope: !66, file: !57, line: 784, baseType: !750, size: 64, offset: 6852928)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "sBitsFile", file: !57, line: 784, flags: DIFlagFwdDecl)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "out_buffer", scope: !66, file: !57, line: 786, baseType: !587, size: 64, offset: 6852992)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output", scope: !66, file: !57, line: 788, baseType: !651, size: 64, offset: 6853056)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output_state", scope: !66, file: !57, line: 789, baseType: !5, size: 32, offset: 6853120)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_flag", scope: !66, file: !57, line: 790, baseType: !5, size: 32, offset: 6853152)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "BitStreamFile", scope: !66, file: !57, line: 792, baseType: !5, size: 32, offset: 6853184)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !66, file: !57, line: 794, baseType: !758, size: 64, offset: 6853248)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !589, line: 186, size: 33408, elements: !760)
!760 = !{!761, !764, !767, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !759, file: !589, line: 188, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !57, line: 836, baseType: !66)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !759, file: !589, line: 189, baseType: !765, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !57, line: 900, baseType: !70)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !759, file: !589, line: 190, baseType: !768, size: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !589, line: 182, baseType: !588)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ref", scope: !759, file: !589, line: 191, baseType: !768, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ltref", scope: !759, file: !589, line: 192, baseType: !768, size: 64, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !759, file: !589, line: 193, baseType: !29, size: 32, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !759, file: !589, line: 194, baseType: !29, size: 32, offset: 352)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frames_in_buffer", scope: !759, file: !589, line: 195, baseType: !29, size: 32, offset: 384)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ltref_frames_in_buffer", scope: !759, file: !589, line: 196, baseType: !29, size: 32, offset: 416)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_poc", scope: !759, file: !589, line: 197, baseType: !5, size: 32, offset: 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_view_id", scope: !759, file: !589, line: 199, baseType: !5, size: 32, offset: 480)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_pic_idx", scope: !759, file: !589, line: 200, baseType: !571, size: 32768, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "init_done", scope: !759, file: !589, line: 205, baseType: !5, size: 32, offset: 33280)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !759, file: !589, line: 206, baseType: !5, size: 32, offset: 33312)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "last_picture", scope: !759, file: !589, line: 208, baseType: !769, size: 64, offset: 33344)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb_legacy", scope: !66, file: !57, line: 795, baseType: !758, size: 64, offset: 6853312)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb_layer", scope: !66, file: !57, line: 796, baseType: !785, size: 128, offset: 6853376)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 128, elements: !397)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cslice_type", scope: !66, file: !57, line: 800, baseType: !787, size: 72, offset: 6853504)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 72, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 9)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "MbToSliceGroupMap", scope: !66, file: !57, line: 802, baseType: !141, size: 64, offset: 6853632)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "MapUnitToSliceGroupMap", scope: !66, file: !57, line: 803, baseType: !141, size: 64, offset: 6853696)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSliceGroups", scope: !66, file: !57, line: 804, baseType: !5, size: 32, offset: 6853760)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "seiToneMapping", scope: !66, file: !57, line: 807, baseType: !794, size: 64, offset: 6853824)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = !DICompositeType(tag: DW_TAG_structure_type, name: "tone_mapping_struct_s", file: !57, line: 807, flags: DIFlagFwdDecl)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "buf2img", scope: !66, file: !57, line: 810, baseType: !797, size: 64, offset: 6853888)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DISubroutineType(types: !799)
!799 = !{null, !536, !800, !5, !5, !5, !5, !5, !5}
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "getNeighbour", scope: !66, file: !57, line: 811, baseType: !802, size: 64, offset: 6853952)
