; ModuleID = 'ldecod_src/mb_prediction.c'
source_filename = "ldecod_src/mb_prediction.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.pic_motion_params = type { [2 x ptr], [2 x %struct.MotionVector], [2 x i8] }
%struct.MotionVector = type { i16, i16 }

@decode_block_scan = internal unnamed_addr constant [16 x i8] c"\00\01\04\05\02\03\06\07\08\09\0C\0D\0A\0B\0E\0F", align 16, !dbg !0
@.str = private unnamed_addr constant [67 x i8] c"temporal direct error: colocated block has ref that is unavailable\00", align 1, !dbg !98

; Function Attrs: nounwind uwtable
define dso_local noundef i32 @mb_pred_intra4x4(ptr noundef %currMB, i32 noundef %curr_plane, ptr noundef %currImg, ptr nocapture noundef readonly %dec_picture) local_unnamed_addr #0 !dbg !138 {
entry:
    #dbg_value(ptr %currMB, !1309, !DIExpression(), !1325)
    #dbg_value(i32 %curr_plane, !1310, !DIExpression(), !1325)
    #dbg_value(ptr %currImg, !1311, !DIExpression(), !1325)
    #dbg_value(ptr %dec_picture, !1312, !DIExpression(), !1325)
  %0 = load ptr, ptr %currMB, align 8, !dbg !1326
    #dbg_value(ptr %0, !1313, !DIExpression(), !1325)
  %chroma_format_idc = getelementptr inbounds i8, ptr %dec_picture, i64 268, !dbg !1327
  %1 = load i32, ptr %chroma_format_idc, align 4, !dbg !1327
  %sub = add nsw i32 %1, -1, !dbg !1328
    #dbg_value(i32 %sub, !1314, !DIExpression(), !1325)

!33 = !DIEnumerator(name: "FRAME", value: 0)
!34 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!35 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 22, baseType: !31, size: 32, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43}
!38 = !DIEnumerator(name: "PLANE_Y", value: 0)
!39 = !DIEnumerator(name: "PLANE_U", value: 1)
!40 = !DIEnumerator(name: "PLANE_V", value: 2)
!41 = !DIEnumerator(name: "PLANE_G", value: 0)
!42 = !DIEnumerator(name: "PLANE_B", value: 1)
!43 = !DIEnumerator(name: "PLANE_R", value: 2)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 246, baseType: !31, size: 32, elements: !46)
!45 = !DIFile(filename: "ldecod_src/inc/defines.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "f06de374c735b286d10ba4ea0c8c0a5d")
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "DECODING_OK", value: 0)
!48 = !DIEnumerator(name: "SEARCH_SYNC", value: 1)
!49 = !DIEnumerator(name: "PICTURE_DECODED", value: 2)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 34, baseType: !31, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55, !56}
!52 = !DIEnumerator(name: "LIST_0", value: 0)
!53 = !DIEnumerator(name: "LIST_1", value: 1)
!54 = !DIEnumerator(name: "BI_PRED", value: 2)
!55 = !DIEnumerator(name: "BI_PRED_L0", value: 3)
!56 = !DIEnumerator(name: "BI_PRED_L1", value: 4)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 142, baseType: !31, size: 32, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !64}
!59 = !DIEnumerator(name: "P_SLICE", value: 0)
!60 = !DIEnumerator(name: "B_SLICE", value: 1)
!61 = !DIEnumerator(name: "I_SLICE", value: 2)
!62 = !DIEnumerator(name: "SP_SLICE", value: 3)
!63 = !DIEnumerator(name: "SI_SLICE", value: 4)
!64 = !DIEnumerator(name: "NUM_SLICE_TYPES", value: 5)
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 117, baseType: !31, size: 32, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83}
!67 = !DIEnumerator(name: "PSKIP", value: 0)
!68 = !DIEnumerator(name: "BSKIP_DIRECT", value: 0)
!69 = !DIEnumerator(name: "P16x16", value: 1)
!70 = !DIEnumerator(name: "P16x8", value: 2)
!71 = !DIEnumerator(name: "P8x16", value: 3)
!72 = !DIEnumerator(name: "SMB8x8", value: 4)
!73 = !DIEnumerator(name: "SMB8x4", value: 5)
!74 = !DIEnumerator(name: "SMB4x8", value: 6)
!75 = !DIEnumerator(name: "SMB4x4", value: 7)
!76 = !DIEnumerator(name: "P8x8", value: 8)
!77 = !DIEnumerator(name: "I4MB", value: 9)
!78 = !DIEnumerator(name: "I16MB", value: 10)
!79 = !DIEnumerator(name: "IBLOCK", value: 11)
!80 = !DIEnumerator(name: "SI4MB", value: 12)
!81 = !DIEnumerator(name: "I8MB", value: 13)
!82 = !DIEnumerator(name: "IPCM", value: 14)
!83 = !DIEnumerator(name: "MAXMODE", value: 15)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 77, baseType: !31, size: 32, elements: !85)
!85 = !{!86, !87, !88, !89}
!86 = !DIEnumerator(name: "FRAME_CODING", value: 0)
!87 = !DIEnumerator(name: "FIELD_CODING", value: 1)
!88 = !DIEnumerator(name: "ADAPTIVE_CODING", value: 2)
!89 = !DIEnumerator(name: "FRAME_MB_PAIR_CODING", value: 3)
!90 = !{!91, !92, !93, !7}
!91 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!92 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !94, line: 41, baseType: !95)
!94 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !94, line: 23, baseType: !96)
!96 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!97 = !{!98, !0, !104, !114}
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(scope: null, file: !3, line: 515, type: !100, isLocal: true, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 536, elements: !102)
!101 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!102 = !{!103}
!103 = !DISubrange(count: 67)
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "INT_BITS", scope: !106, file: !107, line: 118, type: !113, isLocal: true, isDefinition: true)
!106 = distinct !DISubprogram(name: "iabs", scope: !107, file: !107, line: 116, type: !108, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !110)
!107 = !DIFile(filename: "ldecod_src/inc/ifunctions.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "279401589ed56df99e287ad9e5fc564b")
!108 = !DISubroutineType(types: !109)
!109 = !{!7, !7}
!110 = !{!111, !112}
!111 = !DILocalVariable(name: "x", arg: 1, scope: !106, file: !107, line: 116, type: !7)
!112 = !DILocalVariable(name: "y", scope: !106, file: !107, line: 119, type: !7)
!113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "zero_mv", scope: !2, file: !116, line: 106, type: !117, isLocal: true, isDefinition: true)
!116 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !116, line: 104, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 100, size: 32, elements: !120)
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !119, file: !116, line: 102, baseType: !92, size: 16)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !119, file: !116, line: 103, baseType: !92, size: 16, offset: 16)
!123 = !DIFile(filename: "ldecod_src/inc/block.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e90b7727b4f0f4492b5dc2d8d9d6a429")
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 128, elements: !128)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !94, line: 21, baseType: !127)
!127 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!128 = !{!129}
!129 = !DISubrange(count: 16)
!130 = !{i32 7, !"Dwarf Version", i32 5}
!131 = !{i32 2, !"Debug Info Version", i32 3}
!132 = !{i32 1, !"wchar_size", i32 4}
!133 = !{i32 8, !"PIC Level", i32 2}
!134 = !{i32 7, !"PIE Level", i32 2}
!135 = !{i32 7, !"uwtable", i32 2}
!136 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!137 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!138 = distinct !DISubprogram(name: "mb_pred_intra4x4", scope: !3, file: !3, line: 42, type: !139, scopeLine: 43, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1308)
!139 = !DISubroutineType(types: !140)
!140 = !{!7, !141, !899, !614, !680}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !116, line: 273, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !116, line: 197, size: 3840, elements: !144)
!144 = !{!145, !1224, !1225, !1226, !1227, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1256, !1257, !1258, !1259, !1260, !1263, !1264, !1266, !1267, !1268, !1269, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1293, !1294, !1299, !1303, !1307}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !143, file: !116, line: 199, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !116, line: 341, size: 109184, elements: !148)
!148 = !{!149, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !999, !1001, !1054, !1084, !1111, !1114, !1115, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1149, !1150, !1151, !1152, !1153, !1154, !1157, !1158, !1161, !1162, !1164, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1177, !1178, !1179, !1180, !1181, !1183, !1184, !1185, !1189, !1193, !1197, !1201, !1205, !1206, !1207, !1208, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !147, file: !116, line: 343, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !116, line: 566, size: 6855040, elements: !152)
!152 = !{!153, !238, !291, !394, !396, !398, !455, !457, !458, !459, !460, !461, !464, !484, !496, !497, !498, !499, !500, !501, !505, !506, !508, !509, !510, !511, !512, !513, !515, !517, !520, !521, !523, !524, !525, !526, !527, !529, !530, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !645, !646, !650, !651, !652, !653, !654, !655, !656, !657, !658, !660, !661, !662, !797, !801, !802, !804, !805, !808, !811, !812, !813, !817, !820, !823, !824, !825, !826, !827, !828, !854, !855, !857, !861, !862, !863, !864, !867, !872, !886, !890, !894, !895, !900, !901, !905, !906, !910, !931, !932, !935, !936, !937, !938, !939, !940, !941, !942}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !151, file: !116, line: 568, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !116, line: 850, size: 32128, elements: !156)
!156 = !{!157, !161, !162, !163, !164, !165, !166, !167, !168, !169, !199, !200, !201, !202, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !155, file: !116, line: 852, baseType: !158, size: 2040)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 2040, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 255)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !155, file: !116, line: 853, baseType: !158, size: 2040, offset: 2040)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !155, file: !116, line: 854, baseType: !158, size: 2040, offset: 4080)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !155, file: !116, line: 856, baseType: !7, size: 32, offset: 6144)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !155, file: !116, line: 857, baseType: !7, size: 32, offset: 6176)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !155, file: !116, line: 858, baseType: !7, size: 32, offset: 6208)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !155, file: !116, line: 859, baseType: !7, size: 32, offset: 6240)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !155, file: !116, line: 860, baseType: !7, size: 32, offset: 6272)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !155, file: !116, line: 861, baseType: !7, size: 32, offset: 6304)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !155, file: !116, line: 864, baseType: !170, size: 1088, offset: 6336)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !6, line: 52, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !6, line: 30, size: 1088, elements: !172)
!172 = !{!173, !175, !177, !179, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !171, file: !6, line: 32, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !6, line: 28, baseType: !5)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !171, file: !6, line: 33, baseType: !176, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !6, line: 20, baseType: !14)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !171, file: !6, line: 34, baseType: !178, size: 64, offset: 64)
!178 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !171, file: !6, line: 35, baseType: !180, size: 96, offset: 128)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 3)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !171, file: !6, line: 36, baseType: !180, size: 96, offset: 224)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !171, file: !6, line: 37, baseType: !7, size: 32, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !171, file: !6, line: 38, baseType: !7, size: 32, offset: 352)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !171, file: !6, line: 39, baseType: !7, size: 32, offset: 384)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !171, file: !6, line: 40, baseType: !7, size: 32, offset: 416)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !171, file: !6, line: 41, baseType: !7, size: 32, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !171, file: !6, line: 42, baseType: !7, size: 32, offset: 480)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !171, file: !6, line: 43, baseType: !7, size: 32, offset: 512)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !171, file: !6, line: 44, baseType: !7, size: 32, offset: 544)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !171, file: !6, line: 45, baseType: !180, size: 96, offset: 576)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !171, file: !6, line: 46, baseType: !7, size: 32, offset: 672)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !171, file: !6, line: 47, baseType: !180, size: 96, offset: 704)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !171, file: !6, line: 48, baseType: !180, size: 96, offset: 800)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !171, file: !6, line: 49, baseType: !180, size: 96, offset: 896)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !171, file: !6, line: 50, baseType: !7, size: 32, offset: 992)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !171, file: !6, line: 51, baseType: !7, size: 32, offset: 1024)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !155, file: !116, line: 865, baseType: !170, size: 1088, offset: 7424)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !155, file: !116, line: 867, baseType: !7, size: 32, offset: 8512)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !155, file: !116, line: 868, baseType: !7, size: 32, offset: 8544)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !155, file: !116, line: 869, baseType: !203, size: 7744, offset: 8576)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !21, line: 60, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !21, line: 34, size: 7744, elements: !205)
!205 = !{!206, !207, !208, !209, !210, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !204, file: !21, line: 37, baseType: !158, size: 2040)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !204, file: !21, line: 38, baseType: !158, size: 2040, offset: 2040)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !204, file: !21, line: 39, baseType: !158, size: 2040, offset: 4080)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !204, file: !21, line: 40, baseType: !7, size: 32, offset: 6144)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !204, file: !21, line: 41, baseType: !211, size: 32, offset: 6176)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !21, line: 32, baseType: !20)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !204, file: !21, line: 42, baseType: !170, size: 1088, offset: 6208)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !204, file: !21, line: 43, baseType: !7, size: 32, offset: 7296)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !204, file: !21, line: 44, baseType: !7, size: 32, offset: 7328)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !204, file: !21, line: 45, baseType: !7, size: 32, offset: 7360)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !204, file: !21, line: 46, baseType: !7, size: 32, offset: 7392)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !204, file: !21, line: 47, baseType: !7, size: 32, offset: 7424)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !204, file: !21, line: 48, baseType: !7, size: 32, offset: 7456)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !204, file: !21, line: 49, baseType: !7, size: 32, offset: 7488)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !204, file: !21, line: 50, baseType: !7, size: 32, offset: 7520)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !204, file: !21, line: 51, baseType: !7, size: 32, offset: 7552)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !204, file: !21, line: 52, baseType: !7, size: 32, offset: 7584)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !204, file: !21, line: 53, baseType: !7, size: 32, offset: 7616)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !204, file: !21, line: 56, baseType: !225, size: 64, offset: 7680)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !155, file: !116, line: 870, baseType: !203, size: 7744, offset: 16320)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !155, file: !116, line: 871, baseType: !203, size: 7744, offset: 24064)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !155, file: !116, line: 873, baseType: !7, size: 32, offset: 31808)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !155, file: !116, line: 884, baseType: !7, size: 32, offset: 31840)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !155, file: !116, line: 885, baseType: !7, size: 32, offset: 31872)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !155, file: !116, line: 886, baseType: !7, size: 32, offset: 31904)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !155, file: !116, line: 890, baseType: !7, size: 32, offset: 31936)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !155, file: !116, line: 893, baseType: !7, size: 32, offset: 31968)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !155, file: !116, line: 894, baseType: !7, size: 32, offset: 32000)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !155, file: !116, line: 895, baseType: !7, size: 32, offset: 32032)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !155, file: !116, line: 897, baseType: !7, size: 32, offset: 32064)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !155, file: !116, line: 899, baseType: !7, size: 32, offset: 32096)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !151, file: !116, line: 569, baseType: !239, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !241, line: 138, baseType: !242)
!241 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !241, line: 94, size: 17728, elements: !243)
!243 = !{!244, !245, !246, !247, !248, !249, !250, !254, !258, !262, !265, !266, !267, !268, !269, !273, !274, !275, !276, !277, !278, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !242, file: !241, line: 96, baseType: !7, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !242, file: !241, line: 97, baseType: !31, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !242, file: !241, line: 98, baseType: !31, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !242, file: !241, line: 99, baseType: !7, size: 32, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !242, file: !241, line: 100, baseType: !7, size: 32, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !242, file: !241, line: 102, baseType: !7, size: 32, offset: 160)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !242, file: !241, line: 103, baseType: !251, size: 384, offset: 192)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 384, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 12)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !242, file: !241, line: 104, baseType: !255, size: 3072, offset: 576)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3072, elements: !256)
!256 = !{!257, !129}
!257 = !DISubrange(count: 6)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !242, file: !241, line: 105, baseType: !259, size: 12288, offset: 3648)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 12288, elements: !260)
!260 = !{!257, !261}
!261 = !DISubrange(count: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !242, file: !241, line: 106, baseType: !263, size: 192, offset: 15936)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !264)
!264 = !{!257}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !242, file: !241, line: 107, baseType: !263, size: 192, offset: 16128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !242, file: !241, line: 110, baseType: !7, size: 32, offset: 16320)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !242, file: !241, line: 111, baseType: !31, size: 32, offset: 16352)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !242, file: !241, line: 112, baseType: !31, size: 32, offset: 16384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !242, file: !241, line: 114, baseType: !270, size: 256, offset: 16416)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 256, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 8)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !242, file: !241, line: 116, baseType: !270, size: 256, offset: 16672)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !242, file: !241, line: 117, baseType: !270, size: 256, offset: 16928)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !242, file: !241, line: 119, baseType: !7, size: 32, offset: 17184)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !242, file: !241, line: 120, baseType: !31, size: 32, offset: 17216)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !242, file: !241, line: 122, baseType: !31, size: 32, offset: 17248)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !242, file: !241, line: 123, baseType: !279, size: 64, offset: 17280)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !242, file: !241, line: 125, baseType: !7, size: 32, offset: 17344)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !242, file: !241, line: 126, baseType: !7, size: 32, offset: 17376)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !242, file: !241, line: 127, baseType: !7, size: 32, offset: 17408)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !242, file: !241, line: 128, baseType: !31, size: 32, offset: 17440)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !242, file: !241, line: 129, baseType: !7, size: 32, offset: 17472)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !242, file: !241, line: 130, baseType: !7, size: 32, offset: 17504)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !242, file: !241, line: 131, baseType: !7, size: 32, offset: 17536)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !242, file: !241, line: 133, baseType: !7, size: 32, offset: 17568)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !242, file: !241, line: 135, baseType: !7, size: 32, offset: 17600)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !242, file: !241, line: 136, baseType: !7, size: 32, offset: 17632)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !242, file: !241, line: 137, baseType: !7, size: 32, offset: 17664)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !151, file: !116, line: 570, baseType: !292, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !241, line: 197, baseType: !294)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !241, line: 142, size: 33024, elements: !295)
!295 = !{!296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !392, !393}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !294, file: !241, line: 144, baseType: !7, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !294, file: !241, line: 146, baseType: !31, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !294, file: !241, line: 147, baseType: !7, size: 32, offset: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !294, file: !241, line: 148, baseType: !7, size: 32, offset: 96)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !294, file: !241, line: 149, baseType: !7, size: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !294, file: !241, line: 150, baseType: !7, size: 32, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !294, file: !241, line: 152, baseType: !7, size: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !294, file: !241, line: 154, baseType: !31, size: 32, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !294, file: !241, line: 155, baseType: !31, size: 32, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !294, file: !241, line: 156, baseType: !31, size: 32, offset: 288)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !294, file: !241, line: 158, baseType: !7, size: 32, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !294, file: !241, line: 159, baseType: !251, size: 384, offset: 352)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !294, file: !241, line: 160, baseType: !255, size: 3072, offset: 736)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !294, file: !241, line: 161, baseType: !259, size: 12288, offset: 3808)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !294, file: !241, line: 162, baseType: !263, size: 192, offset: 16096)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !294, file: !241, line: 163, baseType: !263, size: 192, offset: 16288)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !294, file: !241, line: 165, baseType: !31, size: 32, offset: 16480)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !294, file: !241, line: 166, baseType: !31, size: 32, offset: 16512)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !294, file: !241, line: 167, baseType: !31, size: 32, offset: 16544)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !294, file: !241, line: 168, baseType: !31, size: 32, offset: 16576)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !294, file: !241, line: 170, baseType: !31, size: 32, offset: 16608)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !294, file: !241, line: 172, baseType: !7, size: 32, offset: 16640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !294, file: !241, line: 173, baseType: !7, size: 32, offset: 16672)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !294, file: !241, line: 174, baseType: !7, size: 32, offset: 16704)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !294, file: !241, line: 175, baseType: !31, size: 32, offset: 16736)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !294, file: !241, line: 177, baseType: !322, size: 8192, offset: 16768)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !294, file: !241, line: 178, baseType: !31, size: 32, offset: 24960)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !294, file: !241, line: 179, baseType: !7, size: 32, offset: 24992)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !294, file: !241, line: 180, baseType: !31, size: 32, offset: 25024)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !294, file: !241, line: 181, baseType: !31, size: 32, offset: 25056)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !294, file: !241, line: 182, baseType: !7, size: 32, offset: 25088)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !294, file: !241, line: 184, baseType: !7, size: 32, offset: 25120)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !294, file: !241, line: 185, baseType: !7, size: 32, offset: 25152)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !294, file: !241, line: 186, baseType: !7, size: 32, offset: 25184)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !294, file: !241, line: 187, baseType: !31, size: 32, offset: 25216)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !294, file: !241, line: 188, baseType: !31, size: 32, offset: 25248)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !294, file: !241, line: 189, baseType: !31, size: 32, offset: 25280)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !294, file: !241, line: 190, baseType: !31, size: 32, offset: 25312)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !294, file: !241, line: 191, baseType: !7, size: 32, offset: 25344)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !294, file: !241, line: 192, baseType: !339, size: 7584, offset: 25376)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !241, line: 90, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !241, line: 53, size: 7584, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !340, file: !241, line: 55, baseType: !7, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !340, file: !241, line: 56, baseType: !31, size: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !340, file: !241, line: 57, baseType: !96, size: 16, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !340, file: !241, line: 58, baseType: !96, size: 16, offset: 80)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !340, file: !241, line: 59, baseType: !7, size: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !340, file: !241, line: 60, baseType: !7, size: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !340, file: !241, line: 61, baseType: !7, size: 32, offset: 160)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !340, file: !241, line: 62, baseType: !31, size: 32, offset: 192)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !340, file: !241, line: 63, baseType: !7, size: 32, offset: 224)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !340, file: !241, line: 64, baseType: !7, size: 32, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !340, file: !241, line: 65, baseType: !31, size: 32, offset: 288)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !340, file: !241, line: 66, baseType: !31, size: 32, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !340, file: !241, line: 67, baseType: !31, size: 32, offset: 352)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !340, file: !241, line: 68, baseType: !7, size: 32, offset: 384)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !340, file: !241, line: 69, baseType: !31, size: 32, offset: 416)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !340, file: !241, line: 70, baseType: !31, size: 32, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !340, file: !241, line: 71, baseType: !7, size: 32, offset: 480)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !340, file: !241, line: 72, baseType: !31, size: 32, offset: 512)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !340, file: !241, line: 73, baseType: !31, size: 32, offset: 544)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !340, file: !241, line: 74, baseType: !7, size: 32, offset: 576)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !340, file: !241, line: 75, baseType: !7, size: 32, offset: 608)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !340, file: !241, line: 76, baseType: !364, size: 3296, offset: 640)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !241, line: 50, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !241, line: 38, size: 3296, elements: !366)
!366 = !{!367, !368, !369, !370, !374, !375, !376, !377, !378, !379}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !365, file: !241, line: 40, baseType: !31, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !365, file: !241, line: 41, baseType: !31, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !365, file: !241, line: 42, baseType: !31, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !365, file: !241, line: 43, baseType: !371, size: 1024, offset: 96)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1024, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !365, file: !241, line: 44, baseType: !371, size: 1024, offset: 1120)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !365, file: !241, line: 45, baseType: !371, size: 1024, offset: 2144)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !365, file: !241, line: 46, baseType: !31, size: 32, offset: 3168)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !365, file: !241, line: 47, baseType: !31, size: 32, offset: 3200)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !365, file: !241, line: 48, baseType: !31, size: 32, offset: 3232)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !365, file: !241, line: 49, baseType: !31, size: 32, offset: 3264)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !340, file: !241, line: 77, baseType: !7, size: 32, offset: 3936)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !340, file: !241, line: 78, baseType: !364, size: 3296, offset: 3968)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !340, file: !241, line: 80, baseType: !7, size: 32, offset: 7264)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !340, file: !241, line: 81, baseType: !7, size: 32, offset: 7296)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !340, file: !241, line: 82, baseType: !7, size: 32, offset: 7328)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !340, file: !241, line: 83, baseType: !7, size: 32, offset: 7360)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !340, file: !241, line: 84, baseType: !31, size: 32, offset: 7392)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !340, file: !241, line: 85, baseType: !31, size: 32, offset: 7424)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !340, file: !241, line: 86, baseType: !31, size: 32, offset: 7456)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !340, file: !241, line: 87, baseType: !31, size: 32, offset: 7488)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !340, file: !241, line: 88, baseType: !31, size: 32, offset: 7520)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !340, file: !241, line: 89, baseType: !31, size: 32, offset: 7552)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !294, file: !241, line: 193, baseType: !31, size: 32, offset: 32960)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !294, file: !241, line: 195, baseType: !7, size: 32, offset: 32992)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !151, file: !116, line: 571, baseType: !395, size: 1056768, offset: 192)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 1056768, elements: !372)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !151, file: !116, line: 572, baseType: !397, size: 4538368, offset: 1056960)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 4538368, elements: !323)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !151, file: !116, line: 575, baseType: !399, size: 64, offset: 5595328)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !241, line: 256, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !241, line: 228, size: 37312, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !423, !424, !425, !426}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !401, file: !241, line: 230, baseType: !293, size: 33024)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !401, file: !241, line: 232, baseType: !31, size: 32, offset: 33024)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !401, file: !241, line: 233, baseType: !7, size: 32, offset: 33056)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !401, file: !241, line: 234, baseType: !225, size: 64, offset: 33088)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !401, file: !241, line: 235, baseType: !225, size: 64, offset: 33152)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !401, file: !241, line: 236, baseType: !409, size: 64, offset: 33216)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !401, file: !241, line: 237, baseType: !225, size: 64, offset: 33280)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !401, file: !241, line: 238, baseType: !409, size: 64, offset: 33344)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !401, file: !241, line: 240, baseType: !225, size: 64, offset: 33408)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !401, file: !241, line: 241, baseType: !409, size: 64, offset: 33472)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !401, file: !241, line: 242, baseType: !225, size: 64, offset: 33536)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !401, file: !241, line: 243, baseType: !409, size: 64, offset: 33600)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !401, file: !241, line: 245, baseType: !7, size: 32, offset: 33664)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !401, file: !241, line: 246, baseType: !225, size: 64, offset: 33728)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !401, file: !241, line: 247, baseType: !225, size: 64, offset: 33792)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !401, file: !241, line: 248, baseType: !409, size: 64, offset: 33856)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !401, file: !241, line: 249, baseType: !409, size: 64, offset: 33920)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !401, file: !241, line: 250, baseType: !422, size: 64, offset: 33984)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !401, file: !241, line: 251, baseType: !409, size: 64, offset: 34048)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !401, file: !241, line: 253, baseType: !31, size: 32, offset: 34112)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !401, file: !241, line: 254, baseType: !7, size: 32, offset: 34144)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !401, file: !241, line: 255, baseType: !427, size: 3136, offset: 34176)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !241, line: 226, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !241, line: 200, size: 3136, elements: !429)
!429 = !{!430, !431, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !448, !449, !451, !452, !453, !454}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !428, file: !241, line: 202, baseType: !7, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !428, file: !241, line: 203, baseType: !432, size: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !428, file: !241, line: 204, baseType: !225, size: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !428, file: !241, line: 205, baseType: !409, size: 64, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !428, file: !241, line: 206, baseType: !432, size: 64, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !428, file: !241, line: 207, baseType: !225, size: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !428, file: !241, line: 208, baseType: !225, size: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !428, file: !241, line: 209, baseType: !432, size: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !428, file: !241, line: 210, baseType: !432, size: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !428, file: !241, line: 211, baseType: !432, size: 64, offset: 576)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !428, file: !241, line: 212, baseType: !432, size: 64, offset: 640)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !428, file: !241, line: 213, baseType: !432, size: 64, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !428, file: !241, line: 216, baseType: !91, size: 8, offset: 768)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !428, file: !241, line: 217, baseType: !91, size: 8, offset: 776)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !428, file: !241, line: 218, baseType: !91, size: 8, offset: 784)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !428, file: !241, line: 219, baseType: !447, size: 1024, offset: 800)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !372)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !428, file: !241, line: 220, baseType: !447, size: 1024, offset: 1824)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !428, file: !241, line: 221, baseType: !450, size: 256, offset: 2848)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 256, elements: !372)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !428, file: !241, line: 222, baseType: !91, size: 8, offset: 3104)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !428, file: !241, line: 223, baseType: !91, size: 8, offset: 3112)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !428, file: !241, line: 224, baseType: !91, size: 8, offset: 3120)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !428, file: !241, line: 225, baseType: !91, size: 8, offset: 3128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !151, file: !116, line: 577, baseType: !456, size: 1193984, offset: 5595392)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 1193984, elements: !372)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !151, file: !116, line: 578, baseType: !7, size: 32, offset: 6789376)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !151, file: !116, line: 579, baseType: !7, size: 32, offset: 6789408)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !151, file: !116, line: 580, baseType: !7, size: 32, offset: 6789440)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !151, file: !116, line: 581, baseType: !7, size: 32, offset: 6789472)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !151, file: !116, line: 584, baseType: !462, size: 64, offset: 6789504)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !116, line: 584, flags: DIFlagFwdDecl)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !151, file: !116, line: 586, baseType: !465, size: 64, offset: 6789568)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !116, line: 902, size: 416, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !477, !478, !479, !480, !481, !482, !483}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !466, file: !116, line: 904, baseType: !31, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !466, file: !116, line: 905, baseType: !31, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !466, file: !116, line: 906, baseType: !7, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !466, file: !116, line: 907, baseType: !31, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !466, file: !116, line: 908, baseType: !7, size: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !466, file: !116, line: 909, baseType: !474, size: 64, offset: 160)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 2)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !466, file: !116, line: 910, baseType: !126, size: 8, offset: 224)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !466, file: !116, line: 911, baseType: !126, size: 8, offset: 232)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !466, file: !116, line: 912, baseType: !7, size: 32, offset: 256)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !466, file: !116, line: 913, baseType: !7, size: 32, offset: 288)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !466, file: !116, line: 915, baseType: !7, size: 32, offset: 320)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !466, file: !116, line: 916, baseType: !7, size: 32, offset: 352)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !466, file: !116, line: 917, baseType: !7, size: 32, offset: 384)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !151, file: !116, line: 587, baseType: !485, size: 64, offset: 6789632)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !116, line: 839, size: 512, elements: !487)
!487 = !{!488, !489, !492, !493, !494, !495}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !486, file: !116, line: 841, baseType: !7, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !486, file: !116, line: 842, baseType: !490, size: 96, offset: 32)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !491, size: 96, elements: !181)
!491 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !486, file: !116, line: 843, baseType: !490, size: 96, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !486, file: !116, line: 844, baseType: !490, size: 96, offset: 224)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !486, file: !116, line: 845, baseType: !490, size: 96, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !486, file: !116, line: 846, baseType: !490, size: 96, offset: 416)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !151, file: !116, line: 588, baseType: !7, size: 32, offset: 6789696)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !151, file: !116, line: 591, baseType: !31, size: 32, offset: 6789728)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !151, file: !116, line: 592, baseType: !7, size: 32, offset: 6789760)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !151, file: !116, line: 593, baseType: !7, size: 32, offset: 6789792)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !151, file: !116, line: 594, baseType: !7, size: 32, offset: 6789824)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !151, file: !116, line: 595, baseType: !502, size: 64, offset: 6789888)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !116, line: 542, baseType: !147)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !151, file: !116, line: 596, baseType: !432, size: 64, offset: 6789952)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block_JV", scope: !151, file: !116, line: 597, baseType: !507, size: 192, offset: 6790016)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 192, elements: !181)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !151, file: !116, line: 601, baseType: !7, size: 32, offset: 6790208)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !151, file: !116, line: 602, baseType: !7, size: 32, offset: 6790240)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !151, file: !116, line: 603, baseType: !7, size: 32, offset: 6790272)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !151, file: !116, line: 604, baseType: !7, size: 32, offset: 6790304)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !151, file: !116, line: 605, baseType: !7, size: 32, offset: 6790336)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !151, file: !116, line: 607, baseType: !514, size: 64, offset: 6790400)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode_JV", scope: !151, file: !116, line: 608, baseType: !516, size: 192, offset: 6790464)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 192, elements: !181)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !151, file: !116, line: 609, baseType: !518, size: 64, offset: 6790656)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "siblock", scope: !151, file: !116, line: 610, baseType: !409, size: 64, offset: 6790720)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "siblock_JV", scope: !151, file: !116, line: 611, baseType: !522, size: 192, offset: 6790784)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 192, elements: !181)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "newframe", scope: !151, file: !116, line: 613, baseType: !7, size: 32, offset: 6790976)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !151, file: !116, line: 614, baseType: !7, size: 32, offset: 6791008)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "pNextSlice", scope: !151, file: !116, line: 617, baseType: !503, size: 64, offset: 6791040)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !151, file: !116, line: 618, baseType: !141, size: 64, offset: 6791104)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data_JV", scope: !151, file: !116, line: 619, baseType: !528, size: 192, offset: 6791168)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !141, size: 192, elements: !181)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaArrayType", scope: !151, file: !116, line: 621, baseType: !7, size: 32, offset: 6791360)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_head", scope: !151, file: !116, line: 626, baseType: !531, size: 64, offset: 6791424)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !116, line: 626, flags: DIFlagFwdDecl)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_end", scope: !151, file: !116, line: 627, baseType: !531, size: 64, offset: 6791488)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !151, file: !116, line: 629, baseType: !31, size: 32, offset: 6791552)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "non_conforming_stream", scope: !151, file: !116, line: 630, baseType: !7, size: 32, offset: 6791584)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntMsb", scope: !151, file: !116, line: 634, baseType: !7, size: 32, offset: 6791616)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntLsb", scope: !151, file: !116, line: 635, baseType: !31, size: 32, offset: 6791648)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedPicOrderCnt", scope: !151, file: !116, line: 638, baseType: !7, size: 32, offset: 6791680)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntCycleCnt", scope: !151, file: !116, line: 638, baseType: !7, size: 32, offset: 6791712)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumInPicOrderCntCycle", scope: !151, file: !116, line: 638, baseType: !7, size: 32, offset: 6791744)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNum", scope: !151, file: !116, line: 639, baseType: !31, size: 32, offset: 6791776)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumOffset", scope: !151, file: !116, line: 639, baseType: !31, size: 32, offset: 6791808)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDeltaPerPicOrderCntCycle", scope: !151, file: !116, line: 640, baseType: !7, size: 32, offset: 6791840)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !151, file: !116, line: 641, baseType: !7, size: 32, offset: 6791872)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNumOffset", scope: !151, file: !116, line: 642, baseType: !7, size: 32, offset: 6791904)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFrameNum", scope: !151, file: !116, line: 645, baseType: !7, size: 32, offset: 6791936)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !151, file: !116, line: 647, baseType: !31, size: 32, offset: 6791968)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !151, file: !116, line: 648, baseType: !31, size: 32, offset: 6792000)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !151, file: !116, line: 649, baseType: !31, size: 32, offset: 6792032)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !151, file: !116, line: 650, baseType: !31, size: 32, offset: 6792064)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !151, file: !116, line: 651, baseType: !31, size: 32, offset: 6792096)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !151, file: !116, line: 652, baseType: !31, size: 32, offset: 6792128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "oldFrameSizeInMbs", scope: !151, file: !116, line: 653, baseType: !31, size: 32, offset: 6792160)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !151, file: !116, line: 655, baseType: !7, size: 32, offset: 6792192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !151, file: !116, line: 657, baseType: !7, size: 32, offset: 6792224)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !151, file: !116, line: 658, baseType: !7, size: 32, offset: 6792256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_bitsize_on_disk", scope: !151, file: !116, line: 661, baseType: !7, size: 32, offset: 6792288)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !151, file: !116, line: 662, baseType: !92, size: 16, offset: 6792320)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !151, file: !116, line: 663, baseType: !92, size: 16, offset: 6792336)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_scale", scope: !151, file: !116, line: 664, baseType: !474, size: 64, offset: 6792352)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !151, file: !116, line: 665, baseType: !7, size: 32, offset: 6792416)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !151, file: !116, line: 666, baseType: !7, size: 32, offset: 6792448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value_comp", scope: !151, file: !116, line: 667, baseType: !564, size: 96, offset: 6792480)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 96, elements: !181)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "max_pel_value_comp", scope: !151, file: !116, line: 668, baseType: !180, size: 96, offset: 6792576)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !151, file: !116, line: 670, baseType: !7, size: 32, offset: 6792672)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !151, file: !116, line: 671, baseType: !7, size: 32, offset: 6792704)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !151, file: !116, line: 672, baseType: !7, size: 32, offset: 6792736)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !151, file: !116, line: 673, baseType: !7, size: 32, offset: 6792768)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "num_uv_blocks", scope: !151, file: !116, line: 674, baseType: !7, size: 32, offset: 6792800)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !151, file: !116, line: 675, baseType: !7, size: 32, offset: 6792832)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !151, file: !116, line: 676, baseType: !7, size: 32, offset: 6792864)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !151, file: !116, line: 677, baseType: !7, size: 32, offset: 6792896)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x_blk", scope: !151, file: !116, line: 678, baseType: !7, size: 32, offset: 6792928)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y_blk", scope: !151, file: !116, line: 679, baseType: !7, size: 32, offset: 6792960)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !151, file: !116, line: 680, baseType: !577, size: 192, offset: 6792992)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !578)
!578 = !{!182, !476}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_blk", scope: !151, file: !116, line: 681, baseType: !577, size: 192, offset: 6793184)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_shift", scope: !151, file: !116, line: 682, baseType: !577, size: 192, offset: 6793376)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_x", scope: !151, file: !116, line: 683, baseType: !7, size: 32, offset: 6793568)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_y", scope: !151, file: !116, line: 684, baseType: !7, size: 32, offset: 6793600)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_x", scope: !151, file: !116, line: 685, baseType: !7, size: 32, offset: 6793632)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_y", scope: !151, file: !116, line: 686, baseType: !7, size: 32, offset: 6793664)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "total_scale", scope: !151, file: !116, line: 687, baseType: !7, size: 32, offset: 6793696)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "max_vmv_r", scope: !151, file: !116, line: 689, baseType: !7, size: 32, offset: 6793728)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "idr_psnr_number", scope: !151, file: !116, line: 692, baseType: !7, size: 32, offset: 6793760)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "psnr_number", scope: !151, file: !116, line: 693, baseType: !7, size: 32, offset: 6793792)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "last_ref_pic_poc", scope: !151, file: !116, line: 700, baseType: !7, size: 32, offset: 6793824)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !151, file: !116, line: 701, baseType: !7, size: 32, offset: 6793856)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !151, file: !116, line: 702, baseType: !7, size: 32, offset: 6793888)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !151, file: !116, line: 703, baseType: !7, size: 32, offset: 6793920)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "earlier_missing_poc", scope: !151, file: !116, line: 704, baseType: !7, size: 32, offset: 6793952)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_conceal", scope: !151, file: !116, line: 705, baseType: !31, size: 32, offset: 6793984)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "IDR_concealment_flag", scope: !151, file: !116, line: 706, baseType: !7, size: 32, offset: 6794016)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_slice_type", scope: !151, file: !116, line: 707, baseType: !7, size: 32, offset: 6794048)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point", scope: !151, file: !116, line: 710, baseType: !7, size: 32, offset: 6794080)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point_found", scope: !151, file: !116, line: 711, baseType: !7, size: 32, offset: 6794112)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_cnt", scope: !151, file: !116, line: 712, baseType: !7, size: 32, offset: 6794144)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_num", scope: !151, file: !116, line: 713, baseType: !7, size: 32, offset: 6794176)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_poc", scope: !151, file: !116, line: 714, baseType: !7, size: 32, offset: 6794208)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !151, file: !116, line: 716, baseType: !7, size: 32, offset: 6794240)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !151, file: !116, line: 717, baseType: !7, size: 32, offset: 6794272)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !151, file: !116, line: 719, baseType: !279, size: 64, offset: 6794304)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !151, file: !116, line: 720, baseType: !279, size: 64, offset: 6794368)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "imgData", scope: !151, file: !116, line: 722, baseType: !607, size: 2560, offset: 6794432)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageData", file: !608, line: 38, baseType: !609)
!608 = !DIFile(filename: "ldecod_src/inc/io_image.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "8caef624e6f5391b0c6ab2984e7f77c6")
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "image_data", file: !608, line: 20, size: 2560, elements: !610)
!610 = !{!611, !612, !616, !617, !618, !622, !623, !624, !625, !626}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !609, file: !608, line: 22, baseType: !170, size: 1088)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "frm_data", scope: !609, file: !608, line: 24, baseType: !613, size: 192, offset: 1088)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 192, elements: !181)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "top_data", scope: !609, file: !608, line: 25, baseType: !613, size: 192, offset: 1280)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "bot_data", scope: !609, file: !608, line: 26, baseType: !613, size: 192, offset: 1472)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "frm_uint16", scope: !609, file: !608, line: 31, baseType: !619, size: 192, offset: 1664)
!619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 192, elements: !181)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "top_uint16", scope: !609, file: !608, line: 32, baseType: !619, size: 192, offset: 1856)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "bot_uint16", scope: !609, file: !608, line: 33, baseType: !619, size: 192, offset: 2048)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "frm_stride", scope: !609, file: !608, line: 35, baseType: !180, size: 96, offset: 2240)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "top_stride", scope: !609, file: !608, line: 36, baseType: !180, size: 96, offset: 2336)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bot_stride", scope: !609, file: !608, line: 37, baseType: !180, size: 96, offset: 2432)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "imgData0", scope: !151, file: !116, line: 723, baseType: !607, size: 2560, offset: 6796992)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "imgData1", scope: !151, file: !116, line: 724, baseType: !607, size: 2560, offset: 6799552)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "imgData2", scope: !151, file: !116, line: 725, baseType: !607, size: 2560, offset: 6802112)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "imgData32", scope: !151, file: !116, line: 728, baseType: !607, size: 2560, offset: 6804672)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "imgData4", scope: !151, file: !116, line: 729, baseType: !607, size: 2560, offset: 6807232)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "imgData5", scope: !151, file: !116, line: 730, baseType: !607, size: 2560, offset: 6809792)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "imgData6", scope: !151, file: !116, line: 731, baseType: !607, size: 2560, offset: 6812352)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "previous_frame_num", scope: !151, file: !116, line: 735, baseType: !31, size: 32, offset: 6814912)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "Is_primary_correct", scope: !151, file: !116, line: 737, baseType: !7, size: 32, offset: 6814944)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Is_redundant_correct", scope: !151, file: !116, line: 738, baseType: !7, size: 32, offset: 6814976)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tot_time", scope: !151, file: !116, line: 741, baseType: !638, size: 64, offset: 6815040)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !639, line: 103, baseType: !640)
!639 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !641, line: 27, baseType: !642)
!641 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !643, line: 44, baseType: !644)
!643 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!644 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "p_out", scope: !151, file: !116, line: 744, baseType: !7, size: 32, offset: 6815104)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "p_out_mvc", scope: !151, file: !116, line: 746, baseType: !647, size: 32768, offset: 6815136)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32768, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 1024)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "p_ref", scope: !151, file: !116, line: 748, baseType: !7, size: 32, offset: 6847904)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessUnitExists", scope: !151, file: !116, line: 751, baseType: !7, size: 32, offset: 6847936)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "NALUCount", scope: !151, file: !116, line: 752, baseType: !7, size: 32, offset: 6847968)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "Bframe_ctr", scope: !151, file: !116, line: 755, baseType: !7, size: 32, offset: 6848000)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "frame_no", scope: !151, file: !116, line: 756, baseType: !7, size: 32, offset: 6848032)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "g_nFrame", scope: !151, file: !116, line: 758, baseType: !7, size: 32, offset: 6848064)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "global_init_done", scope: !151, file: !116, line: 759, baseType: !7, size: 32, offset: 6848096)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ref", scope: !151, file: !116, line: 762, baseType: !614, size: 64, offset: 6848128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV_ref", scope: !151, file: !116, line: 763, baseType: !659, size: 64, offset: 6848192)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "qp_per_matrix", scope: !151, file: !116, line: 765, baseType: !225, size: 64, offset: 6848256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "qp_rem_matrix", scope: !151, file: !116, line: 766, baseType: !225, size: 64, offset: 6848320)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "last_out_fs", scope: !151, file: !116, line: 768, baseType: !663, size: 64, offset: 6848384)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !665, line: 152, size: 768, elements: !666)
!665 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!666 = !{!667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !792, !793, !794, !795, !796}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !664, file: !665, line: 154, baseType: !7, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !664, file: !665, line: 155, baseType: !7, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !664, file: !665, line: 156, baseType: !7, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !664, file: !665, line: 157, baseType: !7, size: 32, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !664, file: !665, line: 159, baseType: !7, size: 32, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !664, file: !665, line: 161, baseType: !31, size: 32, offset: 160)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !664, file: !665, line: 162, baseType: !31, size: 32, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !664, file: !665, line: 164, baseType: !7, size: 32, offset: 224)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !664, file: !665, line: 165, baseType: !7, size: 32, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !664, file: !665, line: 166, baseType: !7, size: 32, offset: 288)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !664, file: !665, line: 167, baseType: !7, size: 32, offset: 320)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !664, file: !665, line: 170, baseType: !7, size: 32, offset: 352)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !664, file: !665, line: 172, baseType: !680, size: 64, offset: 384)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !665, line: 138, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !665, line: 46, size: 3328, elements: !683)
!683 = !{!684, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !732, !734, !738, !740, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !682, file: !665, line: 48, baseType: !685, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !30, line: 140, baseType: !29)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !682, file: !665, line: 50, baseType: !7, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !682, file: !665, line: 51, baseType: !7, size: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !682, file: !665, line: 52, baseType: !7, size: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !682, file: !665, line: 53, baseType: !7, size: 32, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !682, file: !665, line: 54, baseType: !31, size: 32, offset: 160)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !682, file: !665, line: 55, baseType: !31, size: 32, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !682, file: !665, line: 57, baseType: !7, size: 32, offset: 224)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !682, file: !665, line: 58, baseType: !7, size: 32, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !682, file: !665, line: 59, baseType: !7, size: 32, offset: 288)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !682, file: !665, line: 61, baseType: !126, size: 8, offset: 320)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !682, file: !665, line: 62, baseType: !7, size: 32, offset: 352)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !682, file: !665, line: 63, baseType: !7, size: 32, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !682, file: !665, line: 64, baseType: !7, size: 32, offset: 416)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !682, file: !665, line: 65, baseType: !7, size: 32, offset: 448)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !682, file: !665, line: 67, baseType: !92, size: 16, offset: 480)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !682, file: !665, line: 69, baseType: !7, size: 32, offset: 512)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !682, file: !665, line: 69, baseType: !7, size: 32, offset: 544)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !682, file: !665, line: 69, baseType: !7, size: 32, offset: 576)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !682, file: !665, line: 69, baseType: !7, size: 32, offset: 608)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !682, file: !665, line: 70, baseType: !7, size: 32, offset: 640)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !682, file: !665, line: 70, baseType: !7, size: 32, offset: 672)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !682, file: !665, line: 70, baseType: !7, size: 32, offset: 704)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !682, file: !665, line: 70, baseType: !7, size: 32, offset: 736)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !682, file: !665, line: 71, baseType: !7, size: 32, offset: 768)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !682, file: !665, line: 72, baseType: !7, size: 32, offset: 800)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !682, file: !665, line: 73, baseType: !31, size: 32, offset: 832)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !682, file: !665, line: 74, baseType: !31, size: 32, offset: 864)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !682, file: !665, line: 75, baseType: !7, size: 32, offset: 896)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !682, file: !665, line: 75, baseType: !7, size: 32, offset: 928)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !682, file: !665, line: 76, baseType: !7, size: 32, offset: 960)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !682, file: !665, line: 76, baseType: !7, size: 32, offset: 992)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !682, file: !665, line: 79, baseType: !614, size: 64, offset: 1024)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !682, file: !665, line: 80, baseType: !659, size: 64, offset: 1088)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !682, file: !665, line: 81, baseType: !659, size: 64, offset: 1152)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !682, file: !665, line: 84, baseType: !721, size: 64, offset: 1216)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !665, line: 36, size: 256, elements: !724)
!724 = !{!725, !728, !730}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !723, file: !665, line: 38, baseType: !726, size: 128)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 128, elements: !475)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !723, file: !665, line: 39, baseType: !729, size: 64, offset: 128)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 64, elements: !475)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !723, file: !665, line: 40, baseType: !731, size: 16, offset: 192)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 16, elements: !475)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !682, file: !665, line: 85, baseType: !733, size: 192, offset: 1280)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, size: 192, elements: !181)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !682, file: !665, line: 87, baseType: !735, size: 64, offset: 1472)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !665, line: 29, size: 64, elements: !736)
!736 = !{!737}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !735, file: !665, line: 31, baseType: !279, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !682, file: !665, line: 88, baseType: !739, size: 192, offset: 1536)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 192, elements: !181)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !682, file: !665, line: 90, baseType: !741, size: 64, offset: 1728)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !682, file: !665, line: 92, baseType: !727, size: 64, offset: 1792)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !682, file: !665, line: 93, baseType: !727, size: 64, offset: 1856)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !682, file: !665, line: 94, baseType: !727, size: 64, offset: 1920)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !682, file: !665, line: 96, baseType: !7, size: 32, offset: 1984)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !682, file: !665, line: 97, baseType: !7, size: 32, offset: 2016)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !682, file: !665, line: 98, baseType: !7, size: 32, offset: 2048)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !682, file: !665, line: 99, baseType: !7, size: 32, offset: 2080)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !682, file: !665, line: 100, baseType: !7, size: 32, offset: 2112)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !682, file: !665, line: 102, baseType: !7, size: 32, offset: 2144)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !682, file: !665, line: 103, baseType: !7, size: 32, offset: 2176)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !682, file: !665, line: 104, baseType: !7, size: 32, offset: 2208)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !682, file: !665, line: 105, baseType: !7, size: 32, offset: 2240)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !682, file: !665, line: 106, baseType: !7, size: 32, offset: 2272)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !682, file: !665, line: 107, baseType: !7, size: 32, offset: 2304)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !682, file: !665, line: 108, baseType: !7, size: 32, offset: 2336)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !682, file: !665, line: 109, baseType: !7, size: 32, offset: 2368)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !682, file: !665, line: 110, baseType: !474, size: 64, offset: 2400)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !682, file: !665, line: 111, baseType: !7, size: 32, offset: 2464)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !682, file: !665, line: 112, baseType: !762, size: 64, offset: 2496)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !116, line: 194, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !116, line: 186, size: 256, elements: !765)
!765 = !{!766, !767, !768, !769, !770, !771}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !764, file: !116, line: 188, baseType: !7, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !764, file: !116, line: 189, baseType: !7, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !764, file: !116, line: 190, baseType: !7, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !764, file: !116, line: 191, baseType: !7, size: 32, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !764, file: !116, line: 192, baseType: !7, size: 32, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !764, file: !116, line: 193, baseType: !772, size: 64, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !682, file: !665, line: 115, baseType: !7, size: 32, offset: 2560)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !682, file: !665, line: 118, baseType: !7, size: 32, offset: 2592)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !682, file: !665, line: 119, baseType: !7, size: 32, offset: 2624)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !682, file: !665, line: 120, baseType: !7, size: 32, offset: 2656)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !682, file: !665, line: 121, baseType: !615, size: 64, offset: 2688)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !682, file: !665, line: 124, baseType: !7, size: 32, offset: 2752)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !682, file: !665, line: 125, baseType: !7, size: 32, offset: 2784)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !682, file: !665, line: 126, baseType: !7, size: 32, offset: 2816)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !682, file: !665, line: 128, baseType: !7, size: 32, offset: 2848)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !682, file: !665, line: 129, baseType: !7, size: 32, offset: 2880)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !682, file: !665, line: 130, baseType: !7, size: 32, offset: 2912)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !682, file: !665, line: 131, baseType: !7, size: 32, offset: 2944)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !682, file: !665, line: 132, baseType: !614, size: 64, offset: 3008)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !682, file: !665, line: 133, baseType: !7, size: 32, offset: 3072)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !682, file: !665, line: 134, baseType: !7, size: 32, offset: 3104)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !682, file: !665, line: 136, baseType: !731, size: 16, offset: 3136)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !682, file: !665, line: 137, baseType: !790, size: 128, offset: 3200)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 128, elements: !475)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !664, file: !665, line: 173, baseType: !680, size: 64, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !664, file: !665, line: 174, baseType: !680, size: 64, offset: 512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !664, file: !665, line: 177, baseType: !7, size: 32, offset: 576)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !664, file: !665, line: 178, baseType: !474, size: 64, offset: 608)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !664, file: !665, line: 179, baseType: !474, size: 64, offset: 672)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "pocs_in_dpb", scope: !151, file: !116, line: 769, baseType: !798, size: 3200, offset: 6848448)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3200, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 100)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture", scope: !151, file: !116, line: 771, baseType: !727, size: 64, offset: 6851648)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture_JV", scope: !151, file: !116, line: 772, baseType: !803, size: 192, offset: 6851712)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 192, elements: !181)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "no_reference_picture", scope: !151, file: !116, line: 773, baseType: !727, size: 64, offset: 6851904)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "erc_object_list", scope: !151, file: !116, line: 776, baseType: !806, size: 64, offset: 6851968)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "object_buffer", file: !116, line: 776, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "erc_errorVar", scope: !151, file: !116, line: 777, baseType: !809, size: 64, offset: 6852032)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "ercVariables_s", file: !116, line: 777, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "erc_mvperMB", scope: !151, file: !116, line: 779, baseType: !7, size: 32, offset: 6852096)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "erc_img", scope: !151, file: !116, line: 780, baseType: !150, size: 64, offset: 6852160)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ec_flag", scope: !151, file: !116, line: 781, baseType: !814, size: 640, offset: 6852224)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 640, elements: !815)
!815 = !{!816}
!816 = !DISubrange(count: 20)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "annex_b", scope: !151, file: !116, line: 783, baseType: !818, size: 64, offset: 6852864)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "annex_b_struct", file: !116, line: 783, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "bitsfile", scope: !151, file: !116, line: 784, baseType: !821, size: 64, offset: 6852928)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "sBitsFile", file: !116, line: 784, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "out_buffer", scope: !151, file: !116, line: 786, baseType: !663, size: 64, offset: 6852992)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output", scope: !151, file: !116, line: 788, baseType: !727, size: 64, offset: 6853056)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output_state", scope: !151, file: !116, line: 789, baseType: !7, size: 32, offset: 6853120)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_flag", scope: !151, file: !116, line: 790, baseType: !7, size: 32, offset: 6853152)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "BitStreamFile", scope: !151, file: !116, line: 792, baseType: !7, size: 32, offset: 6853184)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !151, file: !116, line: 794, baseType: !829, size: 64, offset: 6853248)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !665, line: 186, size: 33408, elements: !831)
