; ModuleID = 'ldecod_src/mbuffer_mvc.c'
source_filename = "ldecod_src/mbuffer_mvc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [21 x i8] c"init_lists: fs_list0\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [22 x i8] c"init_lists: fs_listlt\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [30 x i8] c"init_lists: fs_listinterview0\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [21 x i8] c"init_lists: fs_list1\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [30 x i8] c"init_lists: fs_listinterview1\00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [42 x i8] c"Invalid remapping_of_pic_nums_idc command\00", align 1, !dbg !21
@.str.7 = private unnamed_addr constant [98 x i8] c"RefPicList0[ num_ref_idx_l0_active_minus1 ] is equal to 'no reference picture', invalid bitstream\00", align 1, !dbg !26
@.str.9 = private unnamed_addr constant [98 x i8] c"RefPicList1[ num_ref_idx_l1_active_minus1 ] is equal to 'no reference picture', invalid bitstream\00", align 1, !dbg !31
@str = private unnamed_addr constant [79 x i8] c"RefPicList0[ num_ref_idx_l0_active_minus1 ] is equal to 'no reference picture'\00", align 1
@str.10 = private unnamed_addr constant [79 x i8] c"RefPicList1[ num_ref_idx_l1_active_minus1 ] is equal to 'no reference picture'\00", align 1


!22 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1202, type: !23, isLocal: true, isDefinition: true)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !24)
!24 = !{!25}
!25 = !DISubrange(count: 42)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1279, type: !28, isLocal: true, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 784, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 98)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1298, type: !28, isLocal: true, isDefinition: true)
!33 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !34, retainedTypes: !89, globals: !251, splitDebugInlining: false, nameTableKind: None)
!34 = !{!35, !44, !50, !59, !69, !74, !81}
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 22, baseType: !37, size: 32, elements: !38)
!36 = !DIFile(filename: "ldecod_src/inc/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "fd6ca9e1c707932f749220576db72b57")
!37 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!38 = !{!39, !40, !41, !42, !43}
!39 = !DIEnumerator(name: "CF_UNKNOWN", value: -1)
!40 = !DIEnumerator(name: "YUV400", value: 0)
!41 = !DIEnumerator(name: "YUV420", value: 1)
!42 = !DIEnumerator(name: "YUV422", value: 2)
!43 = !DIEnumerator(name: "YUV444", value: 3)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 15, baseType: !37, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49}
!46 = !DIEnumerator(name: "CM_UNKNOWN", value: -1)
!47 = !DIEnumerator(name: "CM_YUV", value: 0)
!48 = !DIEnumerator(name: "CM_RGB", value: 1)
!49 = !DIEnumerator(name: "CM_XYZ", value: 2)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !51, line: 25, baseType: !37, size: 32, elements: !52)
!51 = !DIFile(filename: "ldecod_src/inc/io_video.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1141c07f1801ad27d87214c419749431")
!52 = !{!53, !54, !55, !56, !57, !58}
!53 = !DIEnumerator(name: "VIDEO_UNKNOWN", value: -1)
!54 = !DIEnumerator(name: "VIDEO_YUV", value: 0)
!55 = !DIEnumerator(name: "VIDEO_RGB", value: 1)
!56 = !DIEnumerator(name: "VIDEO_XYZ", value: 2)
!57 = !DIEnumerator(name: "VIDEO_TIFF", value: 3)
!58 = !DIEnumerator(name: "VIDEO_AVI", value: 4)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 22, baseType: !61, size: 32, elements: !62)
!60 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!61 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!62 = !{!63, !64, !65, !66, !67, !68}
!63 = !DIEnumerator(name: "PLANE_Y", value: 0)
!64 = !DIEnumerator(name: "PLANE_U", value: 1)
!65 = !DIEnumerator(name: "PLANE_V", value: 2)
!66 = !DIEnumerator(name: "PLANE_G", value: 0)
!67 = !DIEnumerator(name: "PLANE_B", value: 1)
!68 = !DIEnumerator(name: "PLANE_R", value: 2)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 135, baseType: !61, size: 32, elements: !70)
!70 = !{!71, !72, !73}
!71 = !DIEnumerator(name: "FRAME", value: 0)
!72 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!73 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!74 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 34, baseType: !61, size: 32, elements: !75)
!75 = !{!76, !77, !78, !79, !80}
!76 = !DIEnumerator(name: "LIST_0", value: 0)
!77 = !DIEnumerator(name: "LIST_1", value: 1)
!78 = !DIEnumerator(name: "BI_PRED", value: 2)
!79 = !DIEnumerator(name: "BI_PRED_L0", value: 3)
!80 = !DIEnumerator(name: "BI_PRED_L1", value: 4)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !60, line: 142, baseType: !61, size: 32, elements: !82)
!82 = !{!83, !84, !85, !86, !87, !88}
!83 = !DIEnumerator(name: "P_SLICE", value: 0)
!84 = !DIEnumerator(name: "B_SLICE", value: 1)
!85 = !DIEnumerator(name: "I_SLICE", value: 2)
!86 = !DIEnumerator(name: "SP_SLICE", value: 3)
!87 = !DIEnumerator(name: "SI_SLICE", value: 4)
!88 = !DIEnumerator(name: "NUM_SLICE_TYPES", value: 5)
!89 = !{!90, !91, !92, !61, !93, !228, !37}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!91 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!92 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !96, line: 138, baseType: !97)
!96 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !96, line: 46, size: 3328, elements: !98)
!98 = !{!99, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !141, !143, !144, !164, !168, !173, !175, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !196, !197, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !97, file: !96, line: 48, baseType: !100, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !60, line: 140, baseType: !69)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !97, file: !96, line: 50, baseType: !37, size: 32, offset: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !97, file: !96, line: 51, baseType: !37, size: 32, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !97, file: !96, line: 52, baseType: !37, size: 32, offset: 96)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !97, file: !96, line: 53, baseType: !37, size: 32, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !97, file: !96, line: 54, baseType: !61, size: 32, offset: 160)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !97, file: !96, line: 55, baseType: !61, size: 32, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !97, file: !96, line: 57, baseType: !37, size: 32, offset: 224)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !97, file: !96, line: 58, baseType: !37, size: 32, offset: 256)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !97, file: !96, line: 59, baseType: !37, size: 32, offset: 288)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !97, file: !96, line: 61, baseType: !111, size: 8, offset: 320)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !112, line: 21, baseType: !113)
!112 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!113 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !97, file: !96, line: 62, baseType: !37, size: 32, offset: 352)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !97, file: !96, line: 63, baseType: !37, size: 32, offset: 384)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !97, file: !96, line: 64, baseType: !37, size: 32, offset: 416)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !97, file: !96, line: 65, baseType: !37, size: 32, offset: 448)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !97, file: !96, line: 67, baseType: !92, size: 16, offset: 480)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !97, file: !96, line: 69, baseType: !37, size: 32, offset: 512)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !97, file: !96, line: 69, baseType: !37, size: 32, offset: 544)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !97, file: !96, line: 69, baseType: !37, size: 32, offset: 576)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !97, file: !96, line: 69, baseType: !37, size: 32, offset: 608)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !97, file: !96, line: 70, baseType: !37, size: 32, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !97, file: !96, line: 70, baseType: !37, size: 32, offset: 672)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !97, file: !96, line: 70, baseType: !37, size: 32, offset: 704)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !97, file: !96, line: 70, baseType: !37, size: 32, offset: 736)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !97, file: !96, line: 71, baseType: !37, size: 32, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !97, file: !96, line: 72, baseType: !37, size: 32, offset: 800)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !97, file: !96, line: 73, baseType: !61, size: 32, offset: 832)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !97, file: !96, line: 74, baseType: !61, size: 32, offset: 864)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !97, file: !96, line: 75, baseType: !37, size: 32, offset: 896)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !97, file: !96, line: 75, baseType: !37, size: 32, offset: 928)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !97, file: !96, line: 76, baseType: !37, size: 32, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !97, file: !96, line: 76, baseType: !37, size: 32, offset: 992)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !97, file: !96, line: 79, baseType: !136, size: 64, offset: 1024)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !112, line: 41, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !112, line: 23, baseType: !140)
!140 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !97, file: !96, line: 80, baseType: !142, size: 64, offset: 1088)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !97, file: !96, line: 81, baseType: !142, size: 64, offset: 1152)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !97, file: !96, line: 84, baseType: !145, size: 64, offset: 1216)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !96, line: 36, size: 256, elements: !148)
!148 = !{!149, !154, !162}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !147, file: !96, line: 38, baseType: !150, size: 128)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 128, elements: !152)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!152 = !{!153}
!153 = !DISubrange(count: 2)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !147, file: !96, line: 39, baseType: !155, size: 64, offset: 128)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 64, elements: !152)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !157, line: 104, baseType: !158)
!157 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 100, size: 32, elements: !159)
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !158, file: !157, line: 102, baseType: !92, size: 16)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !158, file: !157, line: 103, baseType: !92, size: 16, offset: 16)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !147, file: !96, line: 40, baseType: !163, size: 16, offset: 192)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 16, elements: !152)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !97, file: !96, line: 85, baseType: !165, size: 192, offset: 1280)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 192, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 3)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !97, file: !96, line: 87, baseType: !169, size: 64, offset: 1472)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !96, line: 29, size: 64, elements: !170)
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !169, file: !96, line: 31, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !97, file: !96, line: 88, baseType: !174, size: 192, offset: 1536)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 192, elements: !166)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !97, file: !96, line: 90, baseType: !176, size: 64, offset: 1728)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !97, file: !96, line: 92, baseType: !151, size: 64, offset: 1792)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !97, file: !96, line: 93, baseType: !151, size: 64, offset: 1856)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !97, file: !96, line: 94, baseType: !151, size: 64, offset: 1920)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !97, file: !96, line: 96, baseType: !37, size: 32, offset: 1984)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !97, file: !96, line: 97, baseType: !37, size: 32, offset: 2016)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !97, file: !96, line: 98, baseType: !37, size: 32, offset: 2048)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !97, file: !96, line: 99, baseType: !37, size: 32, offset: 2080)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !97, file: !96, line: 100, baseType: !37, size: 32, offset: 2112)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !97, file: !96, line: 102, baseType: !37, size: 32, offset: 2144)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !97, file: !96, line: 103, baseType: !37, size: 32, offset: 2176)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !97, file: !96, line: 104, baseType: !37, size: 32, offset: 2208)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !97, file: !96, line: 105, baseType: !37, size: 32, offset: 2240)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !97, file: !96, line: 106, baseType: !37, size: 32, offset: 2272)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !97, file: !96, line: 107, baseType: !37, size: 32, offset: 2304)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !97, file: !96, line: 108, baseType: !37, size: 32, offset: 2336)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !97, file: !96, line: 109, baseType: !37, size: 32, offset: 2368)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !97, file: !96, line: 110, baseType: !195, size: 64, offset: 2400)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 64, elements: !152)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !97, file: !96, line: 111, baseType: !37, size: 32, offset: 2464)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !97, file: !96, line: 112, baseType: !198, size: 64, offset: 2496)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !157, line: 194, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !157, line: 186, size: 256, elements: !201)
!201 = !{!202, !203, !204, !205, !206, !207}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !200, file: !157, line: 188, baseType: !37, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !200, file: !157, line: 189, baseType: !37, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !200, file: !157, line: 190, baseType: !37, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !200, file: !157, line: 191, baseType: !37, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !200, file: !157, line: 192, baseType: !37, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !200, file: !157, line: 193, baseType: !208, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !97, file: !96, line: 115, baseType: !37, size: 32, offset: 2560)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !97, file: !96, line: 118, baseType: !37, size: 32, offset: 2592)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !97, file: !96, line: 119, baseType: !37, size: 32, offset: 2624)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !97, file: !96, line: 120, baseType: !37, size: 32, offset: 2656)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !97, file: !96, line: 121, baseType: !137, size: 64, offset: 2688)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !97, file: !96, line: 124, baseType: !37, size: 32, offset: 2752)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !97, file: !96, line: 125, baseType: !37, size: 32, offset: 2784)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !97, file: !96, line: 126, baseType: !37, size: 32, offset: 2816)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !97, file: !96, line: 128, baseType: !37, size: 32, offset: 2848)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !97, file: !96, line: 129, baseType: !37, size: 32, offset: 2880)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !97, file: !96, line: 130, baseType: !37, size: 32, offset: 2912)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !97, file: !96, line: 131, baseType: !37, size: 32, offset: 2944)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !97, file: !96, line: 132, baseType: !136, size: 64, offset: 3008)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !97, file: !96, line: 133, baseType: !37, size: 32, offset: 3072)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !97, file: !96, line: 134, baseType: !37, size: 32, offset: 3104)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !97, file: !96, line: 136, baseType: !163, size: 16, offset: 3136)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !97, file: !96, line: 137, baseType: !226, size: 128, offset: 3200)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 128, elements: !152)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !96, line: 182, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !96, line: 152, size: 768, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !231, file: !96, line: 154, baseType: !37, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !231, file: !96, line: 155, baseType: !37, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !231, file: !96, line: 156, baseType: !37, size: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !231, file: !96, line: 157, baseType: !37, size: 32, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !231, file: !96, line: 159, baseType: !37, size: 32, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !231, file: !96, line: 161, baseType: !61, size: 32, offset: 160)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !231, file: !96, line: 162, baseType: !61, size: 32, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !231, file: !96, line: 164, baseType: !37, size: 32, offset: 224)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !231, file: !96, line: 165, baseType: !37, size: 32, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !231, file: !96, line: 166, baseType: !37, size: 32, offset: 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !231, file: !96, line: 167, baseType: !37, size: 32, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !231, file: !96, line: 170, baseType: !37, size: 32, offset: 352)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !231, file: !96, line: 172, baseType: !94, size: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !231, file: !96, line: 173, baseType: !94, size: 64, offset: 448)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !231, file: !96, line: 174, baseType: !94, size: 64, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !231, file: !96, line: 177, baseType: !37, size: 32, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !231, file: !96, line: 178, baseType: !195, size: 64, offset: 608)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !231, file: !96, line: 179, baseType: !195, size: 64, offset: 672)
!251 = !{!0, !7, !12, !17, !19, !21, !252, !26, !257, !31}
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1277, type: !254, isLocal: true, isDefinition: true)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 640, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 80)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1296, type: !254, isLocal: true, isDefinition: true)
!259 = !{i32 7, !"Dwarf Version", i32 5}
!260 = !{i32 2, !"Debug Info Version", i32 3}
!261 = !{i32 1, !"wchar_size", i32 4}
!262 = !{i32 8, !"PIC Level", i32 2}
!263 = !{i32 7, !"PIE Level", i32 2}
!264 = !{i32 7, !"uwtable", i32 2}
!265 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!266 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!267 = distinct !DISubprogram(name: "reorder_short_term", scope: !2, file: !2, line: 38, type: !268, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !33, retainedNodes: !1293)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !270, !37, !37, !37, !348, !37}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !157, line: 542, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !157, line: 341, size: 109184, elements: !273)
!273 = !{!274, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1120, !1122, !1125, !1153, !1179, !1182, !1183, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1218, !1219, !1220, !1221, !1222, !1223, !1226, !1227, !1230, !1231, !1233, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1246, !1247, !1248, !1249, !1250, !1252, !1253, !1254, !1258, !1262, !1266, !1270, !1274, !1275, !1276, !1277, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !272, file: !157, line: 343, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !157, line: 566, size: 6855040, elements: !277)
!277 = !{!278, !361, !414, !517, !519, !521, !578, !580, !581, !582, !583, !584, !587, !604, !616, !617, !618, !619, !620, !621, !623, !624, !626, !627, !628, !629, !630, !631, !633, !635, !638, !639, !641, !642, !643, !644, !805, !807, !808, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !932, !936, !937, !939, !940, !943, !946, !947, !948, !952, !955, !958, !959, !960, !961, !962, !963, !986, !987, !989, !993, !994, !995, !996, !999, !1004, !1008, !1012, !1016, !1017, !1021, !1022, !1026, !1027, !1031, !1052, !1053, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !276, file: !157, line: 568, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !157, line: 850, size: 32128, elements: !281)
!281 = !{!282, !286, !287, !288, !289, !290, !291, !292, !293, !294, !322, !323, !324, !325, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !280, file: !157, line: 852, baseType: !283, size: 2040)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 255)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !280, file: !157, line: 853, baseType: !283, size: 2040, offset: 2040)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !280, file: !157, line: 854, baseType: !283, size: 2040, offset: 4080)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !280, file: !157, line: 856, baseType: !37, size: 32, offset: 6144)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !280, file: !157, line: 857, baseType: !37, size: 32, offset: 6176)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !280, file: !157, line: 858, baseType: !37, size: 32, offset: 6208)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !280, file: !157, line: 859, baseType: !37, size: 32, offset: 6240)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !280, file: !157, line: 860, baseType: !37, size: 32, offset: 6272)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !280, file: !157, line: 861, baseType: !37, size: 32, offset: 6304)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !280, file: !157, line: 864, baseType: !295, size: 1088, offset: 6336)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !36, line: 52, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !36, line: 30, size: 1088, elements: !297)
!297 = !{!298, !300, !302, !304, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !296, file: !36, line: 32, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !36, line: 28, baseType: !35)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !296, file: !36, line: 33, baseType: !301, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !36, line: 20, baseType: !44)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !296, file: !36, line: 34, baseType: !303, size: 64, offset: 64)
!303 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !296, file: !36, line: 35, baseType: !305, size: 96, offset: 128)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 96, elements: !166)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !296, file: !36, line: 36, baseType: !305, size: 96, offset: 224)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !296, file: !36, line: 37, baseType: !37, size: 32, offset: 320)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !296, file: !36, line: 38, baseType: !37, size: 32, offset: 352)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !296, file: !36, line: 39, baseType: !37, size: 32, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !296, file: !36, line: 40, baseType: !37, size: 32, offset: 416)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !296, file: !36, line: 41, baseType: !37, size: 32, offset: 448)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !296, file: !36, line: 42, baseType: !37, size: 32, offset: 480)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !296, file: !36, line: 43, baseType: !37, size: 32, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !296, file: !36, line: 44, baseType: !37, size: 32, offset: 544)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !296, file: !36, line: 45, baseType: !305, size: 96, offset: 576)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !296, file: !36, line: 46, baseType: !37, size: 32, offset: 672)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !296, file: !36, line: 47, baseType: !305, size: 96, offset: 704)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !296, file: !36, line: 48, baseType: !305, size: 96, offset: 800)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !296, file: !36, line: 49, baseType: !305, size: 96, offset: 896)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !296, file: !36, line: 50, baseType: !37, size: 32, offset: 992)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !296, file: !36, line: 51, baseType: !37, size: 32, offset: 1024)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !280, file: !157, line: 865, baseType: !295, size: 1088, offset: 7424)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !280, file: !157, line: 867, baseType: !37, size: 32, offset: 8512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !280, file: !157, line: 868, baseType: !37, size: 32, offset: 8544)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !280, file: !157, line: 869, baseType: !326, size: 7744, offset: 8576)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !51, line: 60, baseType: !327)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !51, line: 34, size: 7744, elements: !328)
!328 = !{!329, !330, !331, !332, !333, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !327, file: !51, line: 37, baseType: !283, size: 2040)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !327, file: !51, line: 38, baseType: !283, size: 2040, offset: 2040)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !327, file: !51, line: 39, baseType: !283, size: 2040, offset: 4080)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !327, file: !51, line: 40, baseType: !37, size: 32, offset: 6144)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !327, file: !51, line: 41, baseType: !334, size: 32, offset: 6176)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !51, line: 32, baseType: !50)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !327, file: !51, line: 42, baseType: !295, size: 1088, offset: 6208)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !327, file: !51, line: 43, baseType: !37, size: 32, offset: 7296)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !327, file: !51, line: 44, baseType: !37, size: 32, offset: 7328)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !327, file: !51, line: 45, baseType: !37, size: 32, offset: 7360)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !327, file: !51, line: 46, baseType: !37, size: 32, offset: 7392)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !327, file: !51, line: 47, baseType: !37, size: 32, offset: 7424)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !327, file: !51, line: 48, baseType: !37, size: 32, offset: 7456)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !327, file: !51, line: 49, baseType: !37, size: 32, offset: 7488)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !327, file: !51, line: 50, baseType: !37, size: 32, offset: 7520)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !327, file: !51, line: 51, baseType: !37, size: 32, offset: 7552)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !327, file: !51, line: 52, baseType: !37, size: 32, offset: 7584)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !327, file: !51, line: 53, baseType: !37, size: 32, offset: 7616)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !327, file: !51, line: 56, baseType: !348, size: 64, offset: 7680)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !280, file: !157, line: 870, baseType: !326, size: 7744, offset: 16320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !280, file: !157, line: 871, baseType: !326, size: 7744, offset: 24064)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !280, file: !157, line: 873, baseType: !37, size: 32, offset: 31808)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !280, file: !157, line: 884, baseType: !37, size: 32, offset: 31840)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !280, file: !157, line: 885, baseType: !37, size: 32, offset: 31872)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !280, file: !157, line: 886, baseType: !37, size: 32, offset: 31904)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !280, file: !157, line: 890, baseType: !37, size: 32, offset: 31936)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !280, file: !157, line: 893, baseType: !37, size: 32, offset: 31968)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !280, file: !157, line: 894, baseType: !37, size: 32, offset: 32000)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !280, file: !157, line: 895, baseType: !37, size: 32, offset: 32032)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !280, file: !157, line: 897, baseType: !37, size: 32, offset: 32064)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !280, file: !157, line: 899, baseType: !37, size: 32, offset: 32096)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !276, file: !157, line: 569, baseType: !362, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !364, line: 138, baseType: !365)
!364 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 94, size: 17728, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372, !373, !377, !382, !386, !389, !390, !391, !392, !393, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !365, file: !364, line: 96, baseType: !37, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !365, file: !364, line: 97, baseType: !61, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !365, file: !364, line: 98, baseType: !61, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !365, file: !364, line: 99, baseType: !37, size: 32, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !365, file: !364, line: 100, baseType: !37, size: 32, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !365, file: !364, line: 102, baseType: !37, size: 32, offset: 160)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !365, file: !364, line: 103, baseType: !374, size: 384, offset: 192)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 384, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 12)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !365, file: !364, line: 104, baseType: !378, size: 3072, offset: 576)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 3072, elements: !379)
!379 = !{!380, !381}
!380 = !DISubrange(count: 6)
!381 = !DISubrange(count: 16)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !365, file: !364, line: 105, baseType: !383, size: 12288, offset: 3648)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 12288, elements: !384)
!384 = !{!380, !385}
!385 = !DISubrange(count: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !365, file: !364, line: 106, baseType: !387, size: 192, offset: 15936)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 192, elements: !388)
!388 = !{!380}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !365, file: !364, line: 107, baseType: !387, size: 192, offset: 16128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !365, file: !364, line: 110, baseType: !37, size: 32, offset: 16320)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !365, file: !364, line: 111, baseType: !61, size: 32, offset: 16352)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !365, file: !364, line: 112, baseType: !61, size: 32, offset: 16384)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !365, file: !364, line: 114, baseType: !394, size: 256, offset: 16416)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 256, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 8)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !365, file: !364, line: 116, baseType: !394, size: 256, offset: 16672)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !365, file: !364, line: 117, baseType: !394, size: 256, offset: 16928)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !365, file: !364, line: 119, baseType: !37, size: 32, offset: 17184)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !365, file: !364, line: 120, baseType: !61, size: 32, offset: 17216)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !365, file: !364, line: 122, baseType: !61, size: 32, offset: 17248)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !365, file: !364, line: 123, baseType: !172, size: 64, offset: 17280)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !365, file: !364, line: 125, baseType: !37, size: 32, offset: 17344)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !365, file: !364, line: 126, baseType: !37, size: 32, offset: 17376)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !365, file: !364, line: 127, baseType: !37, size: 32, offset: 17408)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !365, file: !364, line: 128, baseType: !61, size: 32, offset: 17440)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !365, file: !364, line: 129, baseType: !37, size: 32, offset: 17472)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !365, file: !364, line: 130, baseType: !37, size: 32, offset: 17504)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !365, file: !364, line: 131, baseType: !37, size: 32, offset: 17536)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !365, file: !364, line: 133, baseType: !37, size: 32, offset: 17568)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !365, file: !364, line: 135, baseType: !37, size: 32, offset: 17600)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !365, file: !364, line: 136, baseType: !37, size: 32, offset: 17632)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !365, file: !364, line: 137, baseType: !37, size: 32, offset: 17664)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !276, file: !157, line: 570, baseType: !415, size: 64, offset: 128)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !364, line: 197, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 142, size: 33024, elements: !418)
!418 = !{!419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !515, !516}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !417, file: !364, line: 144, baseType: !37, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !417, file: !364, line: 146, baseType: !61, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !417, file: !364, line: 147, baseType: !37, size: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !417, file: !364, line: 148, baseType: !37, size: 32, offset: 96)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !417, file: !364, line: 149, baseType: !37, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !417, file: !364, line: 150, baseType: !37, size: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !417, file: !364, line: 152, baseType: !37, size: 32, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !417, file: !364, line: 154, baseType: !61, size: 32, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !417, file: !364, line: 155, baseType: !61, size: 32, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !417, file: !364, line: 156, baseType: !61, size: 32, offset: 288)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !417, file: !364, line: 158, baseType: !37, size: 32, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !417, file: !364, line: 159, baseType: !374, size: 384, offset: 352)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !417, file: !364, line: 160, baseType: !378, size: 3072, offset: 736)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !417, file: !364, line: 161, baseType: !383, size: 12288, offset: 3808)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !417, file: !364, line: 162, baseType: !387, size: 192, offset: 16096)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !417, file: !364, line: 163, baseType: !387, size: 192, offset: 16288)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !417, file: !364, line: 165, baseType: !61, size: 32, offset: 16480)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !417, file: !364, line: 166, baseType: !61, size: 32, offset: 16512)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !417, file: !364, line: 167, baseType: !61, size: 32, offset: 16544)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !417, file: !364, line: 168, baseType: !61, size: 32, offset: 16576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !417, file: !364, line: 170, baseType: !61, size: 32, offset: 16608)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !417, file: !364, line: 172, baseType: !37, size: 32, offset: 16640)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !417, file: !364, line: 173, baseType: !37, size: 32, offset: 16672)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !417, file: !364, line: 174, baseType: !37, size: 32, offset: 16704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !417, file: !364, line: 175, baseType: !61, size: 32, offset: 16736)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !417, file: !364, line: 177, baseType: !445, size: 8192, offset: 16768)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 8192, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !417, file: !364, line: 178, baseType: !61, size: 32, offset: 24960)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !417, file: !364, line: 179, baseType: !37, size: 32, offset: 24992)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !417, file: !364, line: 180, baseType: !61, size: 32, offset: 25024)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !417, file: !364, line: 181, baseType: !61, size: 32, offset: 25056)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !417, file: !364, line: 182, baseType: !37, size: 32, offset: 25088)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !417, file: !364, line: 184, baseType: !37, size: 32, offset: 25120)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !417, file: !364, line: 185, baseType: !37, size: 32, offset: 25152)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !417, file: !364, line: 186, baseType: !37, size: 32, offset: 25184)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !417, file: !364, line: 187, baseType: !61, size: 32, offset: 25216)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !417, file: !364, line: 188, baseType: !61, size: 32, offset: 25248)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !417, file: !364, line: 189, baseType: !61, size: 32, offset: 25280)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !417, file: !364, line: 190, baseType: !61, size: 32, offset: 25312)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !417, file: !364, line: 191, baseType: !37, size: 32, offset: 25344)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !417, file: !364, line: 192, baseType: !462, size: 7584, offset: 25376)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !364, line: 90, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 53, size: 7584, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !463, file: !364, line: 55, baseType: !37, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !463, file: !364, line: 56, baseType: !61, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !463, file: !364, line: 57, baseType: !140, size: 16, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !463, file: !364, line: 58, baseType: !140, size: 16, offset: 80)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !463, file: !364, line: 59, baseType: !37, size: 32, offset: 96)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !463, file: !364, line: 60, baseType: !37, size: 32, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !463, file: !364, line: 61, baseType: !37, size: 32, offset: 160)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !463, file: !364, line: 62, baseType: !61, size: 32, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !463, file: !364, line: 63, baseType: !37, size: 32, offset: 224)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !463, file: !364, line: 64, baseType: !37, size: 32, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !463, file: !364, line: 65, baseType: !61, size: 32, offset: 288)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !463, file: !364, line: 66, baseType: !61, size: 32, offset: 320)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !463, file: !364, line: 67, baseType: !61, size: 32, offset: 352)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !463, file: !364, line: 68, baseType: !37, size: 32, offset: 384)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !463, file: !364, line: 69, baseType: !61, size: 32, offset: 416)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !463, file: !364, line: 70, baseType: !61, size: 32, offset: 448)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !463, file: !364, line: 71, baseType: !37, size: 32, offset: 480)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !463, file: !364, line: 72, baseType: !61, size: 32, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !463, file: !364, line: 73, baseType: !61, size: 32, offset: 544)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !463, file: !364, line: 74, baseType: !37, size: 32, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !463, file: !364, line: 75, baseType: !37, size: 32, offset: 608)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !463, file: !364, line: 76, baseType: !487, size: 3296, offset: 640)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !364, line: 50, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 38, size: 3296, elements: !489)
!489 = !{!490, !491, !492, !493, !497, !498, !499, !500, !501, !502}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !488, file: !364, line: 40, baseType: !61, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !488, file: !364, line: 41, baseType: !61, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !488, file: !364, line: 42, baseType: !61, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !488, file: !364, line: 43, baseType: !494, size: 1024, offset: 96)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 1024, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !488, file: !364, line: 44, baseType: !494, size: 1024, offset: 1120)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !488, file: !364, line: 45, baseType: !494, size: 1024, offset: 2144)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !488, file: !364, line: 46, baseType: !61, size: 32, offset: 3168)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !488, file: !364, line: 47, baseType: !61, size: 32, offset: 3200)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !488, file: !364, line: 48, baseType: !61, size: 32, offset: 3232)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !488, file: !364, line: 49, baseType: !61, size: 32, offset: 3264)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !463, file: !364, line: 77, baseType: !37, size: 32, offset: 3936)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !463, file: !364, line: 78, baseType: !487, size: 3296, offset: 3968)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !463, file: !364, line: 80, baseType: !37, size: 32, offset: 7264)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !463, file: !364, line: 81, baseType: !37, size: 32, offset: 7296)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !463, file: !364, line: 82, baseType: !37, size: 32, offset: 7328)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !463, file: !364, line: 83, baseType: !37, size: 32, offset: 7360)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !463, file: !364, line: 84, baseType: !61, size: 32, offset: 7392)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !463, file: !364, line: 85, baseType: !61, size: 32, offset: 7424)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !463, file: !364, line: 86, baseType: !61, size: 32, offset: 7456)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !463, file: !364, line: 87, baseType: !61, size: 32, offset: 7488)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !463, file: !364, line: 88, baseType: !61, size: 32, offset: 7520)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !463, file: !364, line: 89, baseType: !61, size: 32, offset: 7552)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !417, file: !364, line: 193, baseType: !61, size: 32, offset: 32960)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !417, file: !364, line: 195, baseType: !37, size: 32, offset: 32992)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !276, file: !157, line: 571, baseType: !518, size: 1056768, offset: 192)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 1056768, elements: !495)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !276, file: !157, line: 572, baseType: !520, size: 4538368, offset: 1056960)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 4538368, elements: !446)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !276, file: !157, line: 575, baseType: !522, size: 64, offset: 5595328)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !364, line: 256, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 228, size: 37312, elements: !525)
!525 = !{!526, !527, !528, !529, !530, !531, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !546, !547, !548, !549}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !524, file: !364, line: 230, baseType: !416, size: 33024)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !524, file: !364, line: 232, baseType: !61, size: 32, offset: 33024)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !524, file: !364, line: 233, baseType: !37, size: 32, offset: 33056)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !524, file: !364, line: 234, baseType: !348, size: 64, offset: 33088)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !524, file: !364, line: 235, baseType: !348, size: 64, offset: 33152)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !524, file: !364, line: 236, baseType: !532, size: 64, offset: 33216)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !524, file: !364, line: 237, baseType: !348, size: 64, offset: 33280)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !524, file: !364, line: 238, baseType: !532, size: 64, offset: 33344)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !524, file: !364, line: 240, baseType: !348, size: 64, offset: 33408)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !524, file: !364, line: 241, baseType: !532, size: 64, offset: 33472)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !524, file: !364, line: 242, baseType: !348, size: 64, offset: 33536)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !524, file: !364, line: 243, baseType: !532, size: 64, offset: 33600)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !524, file: !364, line: 245, baseType: !37, size: 32, offset: 33664)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !524, file: !364, line: 246, baseType: !348, size: 64, offset: 33728)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !524, file: !364, line: 247, baseType: !348, size: 64, offset: 33792)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !524, file: !364, line: 248, baseType: !532, size: 64, offset: 33856)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !524, file: !364, line: 249, baseType: !532, size: 64, offset: 33920)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !524, file: !364, line: 250, baseType: !545, size: 64, offset: 33984)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !524, file: !364, line: 251, baseType: !532, size: 64, offset: 34048)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !524, file: !364, line: 253, baseType: !61, size: 32, offset: 34112)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !524, file: !364, line: 254, baseType: !37, size: 32, offset: 34144)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !524, file: !364, line: 255, baseType: !550, size: 3136, offset: 34176)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !364, line: 226, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !364, line: 200, size: 3136, elements: !552)
!552 = !{!553, !554, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !571, !572, !574, !575, !576, !577}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !551, file: !364, line: 202, baseType: !37, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !551, file: !364, line: 203, baseType: !555, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !551, file: !364, line: 204, baseType: !348, size: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !551, file: !364, line: 205, baseType: !532, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !551, file: !364, line: 206, baseType: !555, size: 64, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !551, file: !364, line: 207, baseType: !348, size: 64, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !551, file: !364, line: 208, baseType: !348, size: 64, offset: 384)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !551, file: !364, line: 209, baseType: !555, size: 64, offset: 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !551, file: !364, line: 210, baseType: !555, size: 64, offset: 512)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !551, file: !364, line: 211, baseType: !555, size: 64, offset: 576)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !551, file: !364, line: 212, baseType: !555, size: 64, offset: 640)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !551, file: !364, line: 213, baseType: !555, size: 64, offset: 704)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !551, file: !364, line: 216, baseType: !91, size: 8, offset: 768)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !551, file: !364, line: 217, baseType: !91, size: 8, offset: 776)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !551, file: !364, line: 218, baseType: !91, size: 8, offset: 784)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !551, file: !364, line: 219, baseType: !570, size: 1024, offset: 800)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 1024, elements: !495)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !551, file: !364, line: 220, baseType: !570, size: 1024, offset: 1824)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !551, file: !364, line: 221, baseType: !573, size: 256, offset: 2848)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 256, elements: !495)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !551, file: !364, line: 222, baseType: !91, size: 8, offset: 3104)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !551, file: !364, line: 223, baseType: !91, size: 8, offset: 3112)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !551, file: !364, line: 224, baseType: !91, size: 8, offset: 3120)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !551, file: !364, line: 225, baseType: !91, size: 8, offset: 3128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !276, file: !157, line: 577, baseType: !579, size: 1193984, offset: 5595392)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 1193984, elements: !495)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !276, file: !157, line: 578, baseType: !37, size: 32, offset: 6789376)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !276, file: !157, line: 579, baseType: !37, size: 32, offset: 6789408)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !276, file: !157, line: 580, baseType: !37, size: 32, offset: 6789440)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !276, file: !157, line: 581, baseType: !37, size: 32, offset: 6789472)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !276, file: !157, line: 584, baseType: !585, size: 64, offset: 6789504)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !157, line: 584, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !276, file: !157, line: 586, baseType: !588, size: 64, offset: 6789568)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !157, line: 902, size: 416, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !589, file: !157, line: 904, baseType: !61, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !589, file: !157, line: 905, baseType: !61, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !589, file: !157, line: 906, baseType: !37, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !589, file: !157, line: 907, baseType: !61, size: 32, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !589, file: !157, line: 908, baseType: !37, size: 32, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !589, file: !157, line: 909, baseType: !195, size: 64, offset: 160)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !589, file: !157, line: 910, baseType: !111, size: 8, offset: 224)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !589, file: !157, line: 911, baseType: !111, size: 8, offset: 232)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !589, file: !157, line: 912, baseType: !37, size: 32, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !589, file: !157, line: 913, baseType: !37, size: 32, offset: 288)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !589, file: !157, line: 915, baseType: !37, size: 32, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !589, file: !157, line: 916, baseType: !37, size: 32, offset: 352)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !589, file: !157, line: 917, baseType: !37, size: 32, offset: 384)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !276, file: !157, line: 587, baseType: !605, size: 64, offset: 6789632)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !157, line: 839, size: 512, elements: !607)
!607 = !{!608, !609, !612, !613, !614, !615}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !606, file: !157, line: 841, baseType: !37, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !606, file: !157, line: 842, baseType: !610, size: 96, offset: 32)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 96, elements: !166)
!611 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !606, file: !157, line: 843, baseType: !610, size: 96, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !606, file: !157, line: 844, baseType: !610, size: 96, offset: 224)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !606, file: !157, line: 845, baseType: !610, size: 96, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !606, file: !157, line: 846, baseType: !610, size: 96, offset: 416)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !276, file: !157, line: 588, baseType: !37, size: 32, offset: 6789696)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !276, file: !157, line: 591, baseType: !61, size: 32, offset: 6789728)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !276, file: !157, line: 592, baseType: !37, size: 32, offset: 6789760)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !276, file: !157, line: 593, baseType: !37, size: 32, offset: 6789792)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !276, file: !157, line: 594, baseType: !37, size: 32, offset: 6789824)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !276, file: !157, line: 595, baseType: !622, size: 64, offset: 6789888)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !276, file: !157, line: 596, baseType: !555, size: 64, offset: 6789952)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block_JV", scope: !276, file: !157, line: 597, baseType: !625, size: 192, offset: 6790016)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 192, elements: !166)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !157, line: 601, baseType: !37, size: 32, offset: 6790208)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !276, file: !157, line: 602, baseType: !37, size: 32, offset: 6790240)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !276, file: !157, line: 603, baseType: !37, size: 32, offset: 6790272)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !276, file: !157, line: 604, baseType: !37, size: 32, offset: 6790304)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !276, file: !157, line: 605, baseType: !37, size: 32, offset: 6790336)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !276, file: !157, line: 607, baseType: !632, size: 64, offset: 6790400)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode_JV", scope: !276, file: !157, line: 608, baseType: !634, size: 192, offset: 6790464)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 192, elements: !166)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !276, file: !157, line: 609, baseType: !636, size: 64, offset: 6790656)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "siblock", scope: !276, file: !157, line: 610, baseType: !532, size: 64, offset: 6790720)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "siblock_JV", scope: !276, file: !157, line: 611, baseType: !640, size: 192, offset: 6790784)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 192, elements: !166)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "newframe", scope: !276, file: !157, line: 613, baseType: !37, size: 32, offset: 6790976)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !276, file: !157, line: 614, baseType: !37, size: 32, offset: 6791008)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pNextSlice", scope: !276, file: !157, line: 617, baseType: !270, size: 64, offset: 6791040)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !276, file: !157, line: 618, baseType: !645, size: 64, offset: 6791104)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !157, line: 273, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !157, line: 197, size: 3840, elements: !648)
!648 = !{!649, !651, !652, !653, !654, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !683, !684, !685, !686, !687, !691, !692, !701, !702, !703, !704, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !730, !731, !746, !760, !804}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !647, file: !157, line: 199, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !647, file: !157, line: 200, baseType: !275, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !647, file: !157, line: 201, baseType: !279, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrX", scope: !647, file: !157, line: 202, baseType: !37, size: 32, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !647, file: !157, line: 203, baseType: !655, size: 32, offset: 224)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockPos", file: !157, line: 112, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 108, size: 32, elements: !657)
!657 = !{!658, !659}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !656, file: !157, line: 110, baseType: !92, size: 16)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !656, file: !157, line: 111, baseType: !92, size: 16, offset: 16)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !647, file: !157, line: 204, baseType: !37, size: 32, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !647, file: !157, line: 205, baseType: !37, size: 32, offset: 288)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "block_y_aff", scope: !647, file: !157, line: 206, baseType: !37, size: 32, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !647, file: !157, line: 207, baseType: !37, size: 32, offset: 352)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !647, file: !157, line: 208, baseType: !37, size: 32, offset: 384)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !647, file: !157, line: 209, baseType: !37, size: 32, offset: 416)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !647, file: !157, line: 210, baseType: !37, size: 32, offset: 448)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !647, file: !157, line: 212, baseType: !37, size: 32, offset: 480)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !647, file: !157, line: 213, baseType: !37, size: 32, offset: 512)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !647, file: !157, line: 215, baseType: !37, size: 32, offset: 544)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "qpc", scope: !647, file: !157, line: 216, baseType: !195, size: 64, offset: 576)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "qp_scaled", scope: !647, file: !157, line: 217, baseType: !305, size: 96, offset: 640)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "is_lossless", scope: !647, file: !157, line: 218, baseType: !37, size: 32, offset: 736)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !647, file: !157, line: 219, baseType: !37, size: 32, offset: 768)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !647, file: !157, line: 220, baseType: !37, size: 32, offset: 800)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !647, file: !157, line: 221, baseType: !37, size: 32, offset: 832)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !647, file: !157, line: 223, baseType: !92, size: 16, offset: 864)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !647, file: !157, line: 224, baseType: !91, size: 8, offset: 880)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dpl_flag", scope: !647, file: !157, line: 225, baseType: !91, size: 8, offset: 888)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "delta_quant", scope: !647, file: !157, line: 226, baseType: !92, size: 16, offset: 896)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "list_offset", scope: !647, file: !157, line: 227, baseType: !92, size: 16, offset: 912)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "mb_up", scope: !647, file: !157, line: 229, baseType: !682, size: 64, offset: 960)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mb_left", scope: !647, file: !157, line: 230, baseType: !682, size: 64, offset: 1024)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "mbup", scope: !647, file: !157, line: 232, baseType: !682, size: 64, offset: 1088)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "mbleft", scope: !647, file: !157, line: 233, baseType: !682, size: 64, offset: 1152)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !647, file: !157, line: 236, baseType: !92, size: 16, offset: 1216)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !647, file: !157, line: 237, baseType: !688, size: 1024, offset: 1232)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 1024, elements: !689)
!689 = !{!153, !690, !690, !153}
!690 = !DISubrange(count: 4)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !647, file: !157, line: 239, baseType: !37, size: 32, offset: 2272)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !647, file: !157, line: 240, baseType: !693, size: 192, offset: 2304)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 192, elements: !166)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !695, line: 103, baseType: !696)
!695 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !697, line: 27, baseType: !698)
!697 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !699, line: 44, baseType: !700)
!699 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!700 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !647, file: !157, line: 241, baseType: !693, size: 192, offset: 2496)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits_8x8", scope: !647, file: !157, line: 242, baseType: !693, size: 192, offset: 2688)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "i16mode", scope: !647, file: !157, line: 244, baseType: !37, size: 32, offset: 2880)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !647, file: !157, line: 245, baseType: !705, size: 32, offset: 2912)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 32, elements: !706)
!706 = !{!690}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !647, file: !157, line: 246, baseType: !705, size: 32, offset: 2944)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ipmode_DPCM", scope: !647, file: !157, line: 247, baseType: !91, size: 8, offset: 2976)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !647, file: !157, line: 248, baseType: !91, size: 8, offset: 2984)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !647, file: !157, line: 249, baseType: !91, size: 8, offset: 2992)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "DFDisableIdc", scope: !647, file: !157, line: 250, baseType: !92, size: 16, offset: 3008)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "DFAlphaC0Offset", scope: !647, file: !157, line: 251, baseType: !92, size: 16, offset: 3024)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "DFBetaOffset", scope: !647, file: !157, line: 252, baseType: !92, size: 16, offset: 3040)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !647, file: !157, line: 254, baseType: !37, size: 32, offset: 3072)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !647, file: !157, line: 256, baseType: !37, size: 32, offset: 3104)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !647, file: !157, line: 256, baseType: !37, size: 32, offset: 3136)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !647, file: !157, line: 256, baseType: !37, size: 32, offset: 3168)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !647, file: !157, line: 256, baseType: !37, size: 32, offset: 3200)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !647, file: !157, line: 257, baseType: !37, size: 32, offset: 3232)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !647, file: !157, line: 257, baseType: !37, size: 32, offset: 3264)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !647, file: !157, line: 257, baseType: !37, size: 32, offset: 3296)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !647, file: !157, line: 257, baseType: !37, size: 32, offset: 3328)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !647, file: !157, line: 259, baseType: !37, size: 32, offset: 3360)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !647, file: !157, line: 260, baseType: !37, size: 32, offset: 3392)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_4x4", scope: !647, file: !157, line: 262, baseType: !726, size: 64, offset: 3456)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !682, !729, !37, !37}
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorPlane", file: !60, line: 32, baseType: !59)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_8x8", scope: !647, file: !157, line: 263, baseType: !726, size: 64, offset: 3520)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "GetMVPredictor", scope: !647, file: !157, line: 265, baseType: !732, size: 64, offset: 3584)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{null, !682, !735, !745, !92, !145, !37, !37, !37, !37, !37}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !157, line: 85, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !157, line: 77, size: 128, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !737, file: !157, line: 79, baseType: !37, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !737, file: !157, line: 80, baseType: !37, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !737, file: !157, line: 81, baseType: !92, size: 16, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !737, file: !157, line: 82, baseType: !92, size: 16, offset: 80)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !737, file: !157, line: 83, baseType: !92, size: 16, offset: 96)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !737, file: !157, line: 84, baseType: !92, size: 16, offset: 112)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "read_and_store_CBP_block_bit", scope: !647, file: !157, line: 268, baseType: !747, size: 64, offset: 3648)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!37, !682, !750, !37}
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironmentPtr", file: !157, line: 97, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !157, line: 95, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !157, line: 88, size: 256, elements: !754)
!754 = !{!755, !756, !757, !758, !759}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !753, file: !157, line: 90, baseType: !61, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !753, file: !157, line: 91, baseType: !61, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !753, file: !157, line: 92, baseType: !37, size: 32, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !753, file: !157, line: 93, baseType: !172, size: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !753, file: !157, line: 94, baseType: !348, size: 64, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "readRefPictureIdx", scope: !647, file: !157, line: 269, baseType: !761, size: 64, offset: 3712)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!91, !682, !764, !783, !91, !37}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !157, line: 276, size: 384, elements: !766)
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775, !779}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !765, file: !157, line: 278, baseType: !37, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !765, file: !157, line: 279, baseType: !37, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !765, file: !157, line: 280, baseType: !37, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !765, file: !157, line: 281, baseType: !37, size: 32, offset: 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !765, file: !157, line: 282, baseType: !37, size: 32, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !765, file: !157, line: 283, baseType: !61, size: 32, offset: 160)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !765, file: !157, line: 284, baseType: !37, size: 32, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !765, file: !157, line: 285, baseType: !37, size: 32, offset: 224)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !765, file: !157, line: 293, baseType: !776, size: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !37, !37, !348, !348}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !765, file: !157, line: 295, baseType: !780, size: 64, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !645, !764, !750}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !157, line: 314, size: 384, elements: !785)
!785 = !{!786, !797, !798}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !784, file: !157, line: 317, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !157, line: 47, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream", file: !157, line: 300, size: 256, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "read_len", scope: !789, file: !157, line: 303, baseType: !37, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !789, file: !157, line: 304, baseType: !37, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bitoffset", scope: !789, file: !157, line: 306, baseType: !37, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_length", scope: !789, file: !157, line: 307, baseType: !37, size: 32, offset: 96)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !789, file: !157, line: 309, baseType: !172, size: 64, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !789, file: !157, line: 310, baseType: !37, size: 32, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "de_cabac", scope: !784, file: !157, line: 318, baseType: !752, size: 256, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "readSyntaxElement", scope: !784, file: !157, line: 320, baseType: !799, size: 64, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DISubroutineType(types: !801)
!801 = !{!37, !645, !802, !783}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !157, line: 296, baseType: !765)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mixedModeEdgeFlag", scope: !647, file: !157, line: 272, baseType: !111, size: 8, offset: 3776)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data_JV", scope: !276, file: !157, line: 619, baseType: !806, size: 192, offset: 6791168)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 192, elements: !166)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaArrayType", scope: !276, file: !157, line: 621, baseType: !37, size: 32, offset: 6791360)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_head", scope: !276, file: !157, line: 626, baseType: !809, size: 64, offset: 6791424)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !157, line: 626, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_end", scope: !276, file: !157, line: 627, baseType: !809, size: 64, offset: 6791488)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !276, file: !157, line: 629, baseType: !61, size: 32, offset: 6791552)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "non_conforming_stream", scope: !276, file: !157, line: 630, baseType: !37, size: 32, offset: 6791584)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntMsb", scope: !276, file: !157, line: 634, baseType: !37, size: 32, offset: 6791616)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntLsb", scope: !276, file: !157, line: 635, baseType: !61, size: 32, offset: 6791648)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedPicOrderCnt", scope: !276, file: !157, line: 638, baseType: !37, size: 32, offset: 6791680)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntCycleCnt", scope: !276, file: !157, line: 638, baseType: !37, size: 32, offset: 6791712)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumInPicOrderCntCycle", scope: !276, file: !157, line: 638, baseType: !37, size: 32, offset: 6791744)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNum", scope: !276, file: !157, line: 639, baseType: !61, size: 32, offset: 6791776)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumOffset", scope: !276, file: !157, line: 639, baseType: !61, size: 32, offset: 6791808)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDeltaPerPicOrderCntCycle", scope: !276, file: !157, line: 640, baseType: !37, size: 32, offset: 6791840)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !276, file: !157, line: 641, baseType: !37, size: 32, offset: 6791872)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNumOffset", scope: !276, file: !157, line: 642, baseType: !37, size: 32, offset: 6791904)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFrameNum", scope: !276, file: !157, line: 645, baseType: !37, size: 32, offset: 6791936)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !276, file: !157, line: 647, baseType: !61, size: 32, offset: 6791968)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !276, file: !157, line: 648, baseType: !61, size: 32, offset: 6792000)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !276, file: !157, line: 649, baseType: !61, size: 32, offset: 6792032)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !276, file: !157, line: 650, baseType: !61, size: 32, offset: 6792064)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !276, file: !157, line: 651, baseType: !61, size: 32, offset: 6792096)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !276, file: !157, line: 652, baseType: !61, size: 32, offset: 6792128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "oldFrameSizeInMbs", scope: !276, file: !157, line: 653, baseType: !61, size: 32, offset: 6792160)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !276, file: !157, line: 655, baseType: !37, size: 32, offset: 6792192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !276, file: !157, line: 657, baseType: !37, size: 32, offset: 6792224)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !276, file: !157, line: 658, baseType: !37, size: 32, offset: 6792256)
