; ModuleID = 'ldecod_src/mbuffer.c'
source_filename = "ldecod_src/mbuffer.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.pic_motion_params = type { [2 x ptr], [2 x %struct.MotionVector], [2 x i8] }
%struct.MotionVector = type { i16, i16 }

@.str = private unnamed_addr constant [16 x i8] c"undefined level\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [47 x i8] c"max_dec_frame_buffering larger than MaxDpbSize\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [58 x i8] c"Max. number of reference frames exceeded. Invalid stream.\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [108 x i8] c"DPB size at specified level is smaller than the specified number of reference frames. This is not allowed.\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [20 x i8] c"init_dpb: p_Dpb->fs\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [24 x i8] c"init_dpb: p_Dpb->fs_ref\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [26 x i8] c"init_dpb: p_Dpb->fs_ltref\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [23 x i8] c"re_init_dpb: p_Dpb->fs\00", align 1, !dbg !37
@.str.8 = private unnamed_addr constant [27 x i8] c"re_init_dpb: p_Dpb->fs_ref\00", align 1, !dbg !42
@.str.9 = private unnamed_addr constant [29 x i8] c"re_init_dpb: p_Dpb->fs_ltref\00", align 1, !dbg !47

!156 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !157, retainedTypes: !225, globals: !387, splitDebugInlining: false, nameTableKind: None)
!157 = !{!158, !167, !173, !182, !189, !197, !210, !217}
!158 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !159, line: 22, baseType: !160, size: 32, elements: !161)
!159 = !DIFile(filename: "ldecod_src/inc/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "fd6ca9e1c707932f749220576db72b57")
!160 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!161 = !{!162, !163, !164, !165, !166}
!162 = !DIEnumerator(name: "CF_UNKNOWN", value: -1)
!163 = !DIEnumerator(name: "YUV400", value: 0)
!164 = !DIEnumerator(name: "YUV420", value: 1)
!165 = !DIEnumerator(name: "YUV422", value: 2)
!166 = !DIEnumerator(name: "YUV444", value: 3)
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !159, line: 15, baseType: !160, size: 32, elements: !168)
!168 = !{!169, !170, !171, !172}
!169 = !DIEnumerator(name: "CM_UNKNOWN", value: -1)
!170 = !DIEnumerator(name: "CM_YUV", value: 0)
!171 = !DIEnumerator(name: "CM_RGB", value: 1)
!172 = !DIEnumerator(name: "CM_XYZ", value: 2)
!173 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !174, line: 25, baseType: !160, size: 32, elements: !175)
!174 = !DIFile(filename: "ldecod_src/inc/io_video.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1141c07f1801ad27d87214c419749431")
!175 = !{!176, !177, !178, !179, !180, !181}
!176 = !DIEnumerator(name: "VIDEO_UNKNOWN", value: -1)
!177 = !DIEnumerator(name: "VIDEO_YUV", value: 0)
!178 = !DIEnumerator(name: "VIDEO_RGB", value: 1)
!179 = !DIEnumerator(name: "VIDEO_XYZ", value: 2)
!180 = !DIEnumerator(name: "VIDEO_TIFF", value: 3)
!181 = !DIEnumerator(name: "VIDEO_AVI", value: 4)
!182 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !183, line: 135, baseType: !184, size: 32, elements: !185)
!183 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!184 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!185 = !{!186, !187, !188}
!186 = !DIEnumerator(name: "FRAME", value: 0)
!187 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!188 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!189 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !183, line: 22, baseType: !184, size: 32, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196}
!191 = !DIEnumerator(name: "PLANE_Y", value: 0)
!192 = !DIEnumerator(name: "PLANE_U", value: 1)
!193 = !DIEnumerator(name: "PLANE_V", value: 2)
!194 = !DIEnumerator(name: "PLANE_G", value: 0)
!195 = !DIEnumerator(name: "PLANE_B", value: 1)
!196 = !DIEnumerator(name: "PLANE_R", value: 2)
!197 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !198, line: 74, baseType: !184, size: 32, elements: !199)
!198 = !DIFile(filename: "ldecod_src/inc/defines.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "f06de374c735b286d10ba4ea0c8c0a5d")
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208, !209}
!200 = !DIEnumerator(name: "FREXT_CAVLC444", value: 44)
!201 = !DIEnumerator(name: "BASELINE", value: 66)
!202 = !DIEnumerator(name: "MAIN", value: 77)
!203 = !DIEnumerator(name: "EXTENDED", value: 88)
!204 = !DIEnumerator(name: "FREXT_HP", value: 100)
!205 = !DIEnumerator(name: "FREXT_Hi10P", value: 110)
!206 = !DIEnumerator(name: "FREXT_Hi422", value: 122)
!207 = !DIEnumerator(name: "FREXT_Hi444", value: 244)
!208 = !DIEnumerator(name: "MVC_HIGH", value: 118)
!209 = !DIEnumerator(name: "STEREO_HIGH", value: 128)
!210 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !183, line: 34, baseType: !184, size: 32, elements: !211)
!211 = !{!212, !213, !214, !215, !216}
!212 = !DIEnumerator(name: "LIST_0", value: 0)
!213 = !DIEnumerator(name: "LIST_1", value: 1)
!214 = !DIEnumerator(name: "BI_PRED", value: 2)
!215 = !DIEnumerator(name: "BI_PRED_L0", value: 3)
!216 = !DIEnumerator(name: "BI_PRED_L1", value: 4)
!217 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !183, line: 142, baseType: !184, size: 32, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224}
!219 = !DIEnumerator(name: "P_SLICE", value: 0)
!220 = !DIEnumerator(name: "B_SLICE", value: 1)
!221 = !DIEnumerator(name: "I_SLICE", value: 2)
!222 = !DIEnumerator(name: "SP_SLICE", value: 3)
!223 = !DIEnumerator(name: "SI_SLICE", value: 4)
!224 = !DIEnumerator(name: "NUM_SLICE_TYPES", value: 5)
!225 = !{!160, !184, !226, !227, !228, !229, !364}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!227 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!228 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !232, line: 138, baseType: !233)
!232 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !232, line: 46, size: 3328, elements: !234)
!234 = !{!235, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !277, !279, !280, !300, !304, !309, !311, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !332, !333, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !233, file: !232, line: 48, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !183, line: 140, baseType: !182)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !233, file: !232, line: 50, baseType: !160, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !233, file: !232, line: 51, baseType: !160, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !233, file: !232, line: 52, baseType: !160, size: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !233, file: !232, line: 53, baseType: !160, size: 32, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !233, file: !232, line: 54, baseType: !184, size: 32, offset: 160)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !233, file: !232, line: 55, baseType: !184, size: 32, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !233, file: !232, line: 57, baseType: !160, size: 32, offset: 224)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !233, file: !232, line: 58, baseType: !160, size: 32, offset: 256)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !233, file: !232, line: 59, baseType: !160, size: 32, offset: 288)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !233, file: !232, line: 61, baseType: !247, size: 8, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !248, line: 21, baseType: !249)
!248 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!249 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !233, file: !232, line: 62, baseType: !160, size: 32, offset: 352)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !233, file: !232, line: 63, baseType: !160, size: 32, offset: 384)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !233, file: !232, line: 64, baseType: !160, size: 32, offset: 416)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !233, file: !232, line: 65, baseType: !160, size: 32, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !233, file: !232, line: 67, baseType: !227, size: 16, offset: 480)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !233, file: !232, line: 69, baseType: !160, size: 32, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !233, file: !232, line: 69, baseType: !160, size: 32, offset: 544)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !233, file: !232, line: 69, baseType: !160, size: 32, offset: 576)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !233, file: !232, line: 69, baseType: !160, size: 32, offset: 608)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !233, file: !232, line: 70, baseType: !160, size: 32, offset: 640)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !233, file: !232, line: 70, baseType: !160, size: 32, offset: 672)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !233, file: !232, line: 70, baseType: !160, size: 32, offset: 704)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !233, file: !232, line: 70, baseType: !160, size: 32, offset: 736)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !233, file: !232, line: 71, baseType: !160, size: 32, offset: 768)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !233, file: !232, line: 72, baseType: !160, size: 32, offset: 800)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !233, file: !232, line: 73, baseType: !184, size: 32, offset: 832)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !233, file: !232, line: 74, baseType: !184, size: 32, offset: 864)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !233, file: !232, line: 75, baseType: !160, size: 32, offset: 896)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !233, file: !232, line: 75, baseType: !160, size: 32, offset: 928)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !233, file: !232, line: 76, baseType: !160, size: 32, offset: 960)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !233, file: !232, line: 76, baseType: !160, size: 32, offset: 992)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !233, file: !232, line: 79, baseType: !272, size: 64, offset: 1024)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !248, line: 41, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !248, line: 23, baseType: !276)
!276 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !233, file: !232, line: 80, baseType: !278, size: 64, offset: 1088)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !233, file: !232, line: 81, baseType: !278, size: 64, offset: 1152)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !233, file: !232, line: 84, baseType: !281, size: 64, offset: 1216)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !232, line: 36, size: 256, elements: !284)
!284 = !{!285, !290, !298}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !283, file: !232, line: 38, baseType: !286, size: 128)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 128, elements: !288)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!288 = !{!289}
!289 = !DISubrange(count: 2)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !283, file: !232, line: 39, baseType: !291, size: 64, offset: 128)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 64, elements: !288)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !293, line: 104, baseType: !294)
!293 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 100, size: 32, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !294, file: !293, line: 102, baseType: !227, size: 16)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !294, file: !293, line: 103, baseType: !227, size: 16, offset: 16)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !283, file: !232, line: 40, baseType: !299, size: 16, offset: 192)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 16, elements: !288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !233, file: !232, line: 85, baseType: !301, size: 192, offset: 1280)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 192, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 3)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !233, file: !232, line: 87, baseType: !305, size: 64, offset: 1472)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !232, line: 29, size: 64, elements: !306)
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !305, file: !232, line: 31, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !233, file: !232, line: 88, baseType: !310, size: 192, offset: 1536)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !305, size: 192, elements: !302)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !233, file: !232, line: 90, baseType: !312, size: 64, offset: 1728)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !233, file: !232, line: 92, baseType: !287, size: 64, offset: 1792)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !233, file: !232, line: 93, baseType: !287, size: 64, offset: 1856)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !233, file: !232, line: 94, baseType: !287, size: 64, offset: 1920)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !233, file: !232, line: 96, baseType: !160, size: 32, offset: 1984)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !233, file: !232, line: 97, baseType: !160, size: 32, offset: 2016)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !233, file: !232, line: 98, baseType: !160, size: 32, offset: 2048)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !233, file: !232, line: 99, baseType: !160, size: 32, offset: 2080)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !233, file: !232, line: 100, baseType: !160, size: 32, offset: 2112)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !233, file: !232, line: 102, baseType: !160, size: 32, offset: 2144)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !233, file: !232, line: 103, baseType: !160, size: 32, offset: 2176)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !233, file: !232, line: 104, baseType: !160, size: 32, offset: 2208)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !233, file: !232, line: 105, baseType: !160, size: 32, offset: 2240)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !233, file: !232, line: 106, baseType: !160, size: 32, offset: 2272)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !233, file: !232, line: 107, baseType: !160, size: 32, offset: 2304)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !233, file: !232, line: 108, baseType: !160, size: 32, offset: 2336)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !233, file: !232, line: 109, baseType: !160, size: 32, offset: 2368)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !233, file: !232, line: 110, baseType: !331, size: 64, offset: 2400)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 64, elements: !288)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !233, file: !232, line: 111, baseType: !160, size: 32, offset: 2464)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !233, file: !232, line: 112, baseType: !334, size: 64, offset: 2496)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !293, line: 194, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !293, line: 186, size: 256, elements: !337)
!337 = !{!338, !339, !340, !341, !342, !343}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !336, file: !293, line: 188, baseType: !160, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !336, file: !293, line: 189, baseType: !160, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !336, file: !293, line: 190, baseType: !160, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !336, file: !293, line: 191, baseType: !160, size: 32, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !336, file: !293, line: 192, baseType: !160, size: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !336, file: !293, line: 193, baseType: !344, size: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !233, file: !232, line: 115, baseType: !160, size: 32, offset: 2560)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !233, file: !232, line: 118, baseType: !160, size: 32, offset: 2592)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !233, file: !232, line: 119, baseType: !160, size: 32, offset: 2624)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !233, file: !232, line: 120, baseType: !160, size: 32, offset: 2656)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !233, file: !232, line: 121, baseType: !273, size: 64, offset: 2688)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !233, file: !232, line: 124, baseType: !160, size: 32, offset: 2752)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !233, file: !232, line: 125, baseType: !160, size: 32, offset: 2784)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !233, file: !232, line: 126, baseType: !160, size: 32, offset: 2816)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !233, file: !232, line: 128, baseType: !160, size: 32, offset: 2848)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !233, file: !232, line: 129, baseType: !160, size: 32, offset: 2880)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !233, file: !232, line: 130, baseType: !160, size: 32, offset: 2912)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !233, file: !232, line: 131, baseType: !160, size: 32, offset: 2944)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !233, file: !232, line: 132, baseType: !272, size: 64, offset: 3008)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !233, file: !232, line: 133, baseType: !160, size: 32, offset: 3072)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !233, file: !232, line: 134, baseType: !160, size: 32, offset: 3104)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !233, file: !232, line: 136, baseType: !299, size: 16, offset: 3136)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !233, file: !232, line: 137, baseType: !362, size: 128, offset: 3200)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 128, elements: !288)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !232, line: 182, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !232, line: 152, size: 768, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !367, file: !232, line: 154, baseType: !160, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !367, file: !232, line: 155, baseType: !160, size: 32, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !367, file: !232, line: 156, baseType: !160, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !367, file: !232, line: 157, baseType: !160, size: 32, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !367, file: !232, line: 159, baseType: !160, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !367, file: !232, line: 161, baseType: !184, size: 32, offset: 160)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !367, file: !232, line: 162, baseType: !184, size: 32, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !367, file: !232, line: 164, baseType: !160, size: 32, offset: 224)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !367, file: !232, line: 165, baseType: !160, size: 32, offset: 256)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !367, file: !232, line: 166, baseType: !160, size: 32, offset: 288)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !367, file: !232, line: 167, baseType: !160, size: 32, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !367, file: !232, line: 170, baseType: !160, size: 32, offset: 352)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !367, file: !232, line: 172, baseType: !230, size: 64, offset: 384)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !367, file: !232, line: 173, baseType: !230, size: 64, offset: 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !367, file: !232, line: 174, baseType: !230, size: 64, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !367, file: !232, line: 177, baseType: !160, size: 32, offset: 576)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !367, file: !232, line: 178, baseType: !331, size: 64, offset: 608)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !367, file: !232, line: 179, baseType: !331, size: 64, offset: 672)
!387 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !47, !52, !57, !62, !64, !69, !71, !76, !81, !83, !85, !90, !95, !100, !105, !107, !112, !114, !116, !118, !388, !120, !125, !130, !135, !393, !395, !400, !137, !139, !144, !149, !154, !402}
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !2, line: 4602, type: !390, isLocal: true, isDefinition: true)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 392, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 49)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2917, type: !14, isLocal: true, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2943, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 536, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 67)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2985, type: !14, isLocal: true, isDefinition: true)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "INT_BITS", scope: !404, file: !405, line: 118, type: !411, isLocal: true, isDefinition: true)
!404 = distinct !DISubprogram(name: "iabs", scope: !405, file: !405, line: 116, type: !406, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !156, retainedNodes: !408)
!405 = !DIFile(filename: "ldecod_src/inc/ifunctions.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "279401589ed56df99e287ad9e5fc564b")
!406 = !DISubroutineType(types: !407)
!407 = !{!160, !160}
!408 = !{!409, !410}
!409 = !DILocalVariable(name: "x", arg: 1, scope: !404, file: !405, line: 116, type: !160)
!410 = !DILocalVariable(name: "y", scope: !404, file: !405, line: 119, type: !160)
!411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!412 = !{i32 7, !"Dwarf Version", i32 5}
!413 = !{i32 2, !"Debug Info Version", i32 3}
!414 = !{i32 1, !"wchar_size", i32 4}
!415 = !{i32 8, !"PIC Level", i32 2}
!416 = !{i32 7, !"PIE Level", i32 2}
!417 = !{i32 7, !"uwtable", i32 2}
!418 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!419 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!420 = distinct !DISubprogram(name: "dump_dpb", scope: !2, file: !2, line: 59, type: !421, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !156, retainedNodes: !1472)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !423}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodedPictureBuffer", file: !232, line: 209, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !232, line: 186, size: 33408, elements: !426)
!426 = !{!427, !1456, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !425, file: !232, line: 188, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !293, line: 836, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !293, line: 566, size: 6855040, elements: !431)
!431 = !{!432, !515, !567, !668, !670, !672, !729, !731, !732, !733, !734, !735, !738, !755, !767, !768, !769, !770, !771, !772, !1172, !1173, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1183, !1186, !1187, !1189, !1190, !1191, !1192, !1193, !1195, !1196, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1328, !1329, !1331, !1332, !1341, !1363, !1364, !1365, !1367, !1370, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1382, !1385, !1386, !1387, !1388, !1391, !1396, !1400, !1404, !1408, !1409, !1413, !1414, !1418, !1419, !1423, !1444, !1445, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !430, file: !293, line: 568, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !293, line: 850, size: 32128, elements: !435)
!435 = !{!436, !440, !441, !442, !443, !444, !445, !446, !447, !448, !476, !477, !478, !479, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !434, file: !293, line: 852, baseType: !437, size: 2040)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 255)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !434, file: !293, line: 853, baseType: !437, size: 2040, offset: 2040)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !434, file: !293, line: 854, baseType: !437, size: 2040, offset: 4080)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !434, file: !293, line: 856, baseType: !160, size: 32, offset: 6144)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !434, file: !293, line: 857, baseType: !160, size: 32, offset: 6176)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !434, file: !293, line: 858, baseType: !160, size: 32, offset: 6208)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !434, file: !293, line: 859, baseType: !160, size: 32, offset: 6240)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !434, file: !293, line: 860, baseType: !160, size: 32, offset: 6272)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !434, file: !293, line: 861, baseType: !160, size: 32, offset: 6304)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !434, file: !293, line: 864, baseType: !449, size: 1088, offset: 6336)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !159, line: 52, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !159, line: 30, size: 1088, elements: !451)
!451 = !{!452, !454, !456, !458, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !450, file: !159, line: 32, baseType: !453, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !159, line: 28, baseType: !158)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !450, file: !159, line: 33, baseType: !455, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !159, line: 20, baseType: !167)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !450, file: !159, line: 34, baseType: !457, size: 64, offset: 64)
!457 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !450, file: !159, line: 35, baseType: !459, size: 96, offset: 128)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 96, elements: !302)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !450, file: !159, line: 36, baseType: !459, size: 96, offset: 224)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !450, file: !159, line: 37, baseType: !160, size: 32, offset: 320)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !450, file: !159, line: 38, baseType: !160, size: 32, offset: 352)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !450, file: !159, line: 39, baseType: !160, size: 32, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !450, file: !159, line: 40, baseType: !160, size: 32, offset: 416)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !450, file: !159, line: 41, baseType: !160, size: 32, offset: 448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !450, file: !159, line: 42, baseType: !160, size: 32, offset: 480)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !450, file: !159, line: 43, baseType: !160, size: 32, offset: 512)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !450, file: !159, line: 44, baseType: !160, size: 32, offset: 544)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !450, file: !159, line: 45, baseType: !459, size: 96, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !450, file: !159, line: 46, baseType: !160, size: 32, offset: 672)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !450, file: !159, line: 47, baseType: !459, size: 96, offset: 704)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !450, file: !159, line: 48, baseType: !459, size: 96, offset: 800)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !450, file: !159, line: 49, baseType: !459, size: 96, offset: 896)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !450, file: !159, line: 50, baseType: !160, size: 32, offset: 992)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !450, file: !159, line: 51, baseType: !160, size: 32, offset: 1024)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !434, file: !293, line: 865, baseType: !449, size: 1088, offset: 7424)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !434, file: !293, line: 867, baseType: !160, size: 32, offset: 8512)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !434, file: !293, line: 868, baseType: !160, size: 32, offset: 8544)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !434, file: !293, line: 869, baseType: !480, size: 7744, offset: 8576)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !174, line: 60, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !174, line: 34, size: 7744, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !481, file: !174, line: 37, baseType: !437, size: 2040)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !481, file: !174, line: 38, baseType: !437, size: 2040, offset: 2040)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !481, file: !174, line: 39, baseType: !437, size: 2040, offset: 4080)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !481, file: !174, line: 40, baseType: !160, size: 32, offset: 6144)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !481, file: !174, line: 41, baseType: !488, size: 32, offset: 6176)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !174, line: 32, baseType: !173)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !481, file: !174, line: 42, baseType: !449, size: 1088, offset: 6208)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !481, file: !174, line: 43, baseType: !160, size: 32, offset: 7296)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !481, file: !174, line: 44, baseType: !160, size: 32, offset: 7328)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !481, file: !174, line: 45, baseType: !160, size: 32, offset: 7360)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !481, file: !174, line: 46, baseType: !160, size: 32, offset: 7392)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !481, file: !174, line: 47, baseType: !160, size: 32, offset: 7424)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !481, file: !174, line: 48, baseType: !160, size: 32, offset: 7456)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !481, file: !174, line: 49, baseType: !160, size: 32, offset: 7488)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !481, file: !174, line: 50, baseType: !160, size: 32, offset: 7520)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !481, file: !174, line: 51, baseType: !160, size: 32, offset: 7552)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !481, file: !174, line: 52, baseType: !160, size: 32, offset: 7584)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !481, file: !174, line: 53, baseType: !160, size: 32, offset: 7616)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !481, file: !174, line: 56, baseType: !502, size: 64, offset: 7680)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !434, file: !293, line: 870, baseType: !480, size: 7744, offset: 16320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !434, file: !293, line: 871, baseType: !480, size: 7744, offset: 24064)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !434, file: !293, line: 873, baseType: !160, size: 32, offset: 31808)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !434, file: !293, line: 884, baseType: !160, size: 32, offset: 31840)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !434, file: !293, line: 885, baseType: !160, size: 32, offset: 31872)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !434, file: !293, line: 886, baseType: !160, size: 32, offset: 31904)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !434, file: !293, line: 890, baseType: !160, size: 32, offset: 31936)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !434, file: !293, line: 893, baseType: !160, size: 32, offset: 31968)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !434, file: !293, line: 894, baseType: !160, size: 32, offset: 32000)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !434, file: !293, line: 895, baseType: !160, size: 32, offset: 32032)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !434, file: !293, line: 897, baseType: !160, size: 32, offset: 32064)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !434, file: !293, line: 899, baseType: !160, size: 32, offset: 32096)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !430, file: !293, line: 569, baseType: !516, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !518, line: 138, baseType: !519)
!518 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !518, line: 94, size: 17728, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !526, !527, !531, !535, !539, !542, !543, !544, !545, !546, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !519, file: !518, line: 96, baseType: !160, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !519, file: !518, line: 97, baseType: !184, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !519, file: !518, line: 98, baseType: !184, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !519, file: !518, line: 99, baseType: !160, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !519, file: !518, line: 100, baseType: !160, size: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !519, file: !518, line: 102, baseType: !160, size: 32, offset: 160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !519, file: !518, line: 103, baseType: !528, size: 384, offset: 192)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 384, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 12)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !519, file: !518, line: 104, baseType: !532, size: 3072, offset: 576)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 3072, elements: !533)
!533 = !{!534, !6}
!534 = !DISubrange(count: 6)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !519, file: !518, line: 105, baseType: !536, size: 12288, offset: 3648)
!536 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 12288, elements: !537)
!537 = !{!534, !538}
!538 = !DISubrange(count: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !519, file: !518, line: 106, baseType: !540, size: 192, offset: 15936)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 192, elements: !541)
!541 = !{!534}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !519, file: !518, line: 107, baseType: !540, size: 192, offset: 16128)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !519, file: !518, line: 110, baseType: !160, size: 32, offset: 16320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !519, file: !518, line: 111, baseType: !184, size: 32, offset: 16352)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !519, file: !518, line: 112, baseType: !184, size: 32, offset: 16384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !519, file: !518, line: 114, baseType: !547, size: 256, offset: 16416)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 256, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 8)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !519, file: !518, line: 116, baseType: !547, size: 256, offset: 16672)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !519, file: !518, line: 117, baseType: !547, size: 256, offset: 16928)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !519, file: !518, line: 119, baseType: !160, size: 32, offset: 17184)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !519, file: !518, line: 120, baseType: !184, size: 32, offset: 17216)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !519, file: !518, line: 122, baseType: !184, size: 32, offset: 17248)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !519, file: !518, line: 123, baseType: !308, size: 64, offset: 17280)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !519, file: !518, line: 125, baseType: !160, size: 32, offset: 17344)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !519, file: !518, line: 126, baseType: !160, size: 32, offset: 17376)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !519, file: !518, line: 127, baseType: !160, size: 32, offset: 17408)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !519, file: !518, line: 128, baseType: !184, size: 32, offset: 17440)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !519, file: !518, line: 129, baseType: !160, size: 32, offset: 17472)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !519, file: !518, line: 130, baseType: !160, size: 32, offset: 17504)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !519, file: !518, line: 131, baseType: !160, size: 32, offset: 17536)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !519, file: !518, line: 133, baseType: !160, size: 32, offset: 17568)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !519, file: !518, line: 135, baseType: !160, size: 32, offset: 17600)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !519, file: !518, line: 136, baseType: !160, size: 32, offset: 17632)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !519, file: !518, line: 137, baseType: !160, size: 32, offset: 17664)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !430, file: !293, line: 570, baseType: !568, size: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !518, line: 197, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !518, line: 142, size: 33024, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !666, !667}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !570, file: !518, line: 144, baseType: !160, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !570, file: !518, line: 146, baseType: !184, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !570, file: !518, line: 147, baseType: !160, size: 32, offset: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !570, file: !518, line: 148, baseType: !160, size: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !570, file: !518, line: 149, baseType: !160, size: 32, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !570, file: !518, line: 150, baseType: !160, size: 32, offset: 160)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !570, file: !518, line: 152, baseType: !160, size: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !570, file: !518, line: 154, baseType: !184, size: 32, offset: 224)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !570, file: !518, line: 155, baseType: !184, size: 32, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !570, file: !518, line: 156, baseType: !184, size: 32, offset: 288)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !570, file: !518, line: 158, baseType: !160, size: 32, offset: 320)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !570, file: !518, line: 159, baseType: !528, size: 384, offset: 352)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !570, file: !518, line: 160, baseType: !532, size: 3072, offset: 736)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !570, file: !518, line: 161, baseType: !536, size: 12288, offset: 3808)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !570, file: !518, line: 162, baseType: !540, size: 192, offset: 16096)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !570, file: !518, line: 163, baseType: !540, size: 192, offset: 16288)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !570, file: !518, line: 165, baseType: !184, size: 32, offset: 16480)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !570, file: !518, line: 166, baseType: !184, size: 32, offset: 16512)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !570, file: !518, line: 167, baseType: !184, size: 32, offset: 16544)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !570, file: !518, line: 168, baseType: !184, size: 32, offset: 16576)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !570, file: !518, line: 170, baseType: !184, size: 32, offset: 16608)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !570, file: !518, line: 172, baseType: !160, size: 32, offset: 16640)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !570, file: !518, line: 173, baseType: !160, size: 32, offset: 16672)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !570, file: !518, line: 174, baseType: !160, size: 32, offset: 16704)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !570, file: !518, line: 175, baseType: !184, size: 32, offset: 16736)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !570, file: !518, line: 177, baseType: !598, size: 8192, offset: 16768)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 8192, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !570, file: !518, line: 178, baseType: !184, size: 32, offset: 24960)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !570, file: !518, line: 179, baseType: !160, size: 32, offset: 24992)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !570, file: !518, line: 180, baseType: !184, size: 32, offset: 25024)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !570, file: !518, line: 181, baseType: !184, size: 32, offset: 25056)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !570, file: !518, line: 182, baseType: !160, size: 32, offset: 25088)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !570, file: !518, line: 184, baseType: !160, size: 32, offset: 25120)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !570, file: !518, line: 185, baseType: !160, size: 32, offset: 25152)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !570, file: !518, line: 186, baseType: !160, size: 32, offset: 25184)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !570, file: !518, line: 187, baseType: !184, size: 32, offset: 25216)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !570, file: !518, line: 188, baseType: !184, size: 32, offset: 25248)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !570, file: !518, line: 189, baseType: !184, size: 32, offset: 25280)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !570, file: !518, line: 190, baseType: !184, size: 32, offset: 25312)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !570, file: !518, line: 191, baseType: !160, size: 32, offset: 25344)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !570, file: !518, line: 192, baseType: !615, size: 7584, offset: 25376)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !518, line: 90, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !518, line: 53, size: 7584, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !616, file: !518, line: 55, baseType: !160, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !616, file: !518, line: 56, baseType: !184, size: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !616, file: !518, line: 57, baseType: !276, size: 16, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !616, file: !518, line: 58, baseType: !276, size: 16, offset: 80)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !616, file: !518, line: 59, baseType: !160, size: 32, offset: 96)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !616, file: !518, line: 60, baseType: !160, size: 32, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !616, file: !518, line: 61, baseType: !160, size: 32, offset: 160)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !616, file: !518, line: 62, baseType: !184, size: 32, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !616, file: !518, line: 63, baseType: !160, size: 32, offset: 224)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !616, file: !518, line: 64, baseType: !160, size: 32, offset: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !616, file: !518, line: 65, baseType: !184, size: 32, offset: 288)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !616, file: !518, line: 66, baseType: !184, size: 32, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !616, file: !518, line: 67, baseType: !184, size: 32, offset: 352)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !616, file: !518, line: 68, baseType: !160, size: 32, offset: 384)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !616, file: !518, line: 69, baseType: !184, size: 32, offset: 416)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !616, file: !518, line: 70, baseType: !184, size: 32, offset: 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !616, file: !518, line: 71, baseType: !160, size: 32, offset: 480)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !616, file: !518, line: 72, baseType: !184, size: 32, offset: 512)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !616, file: !518, line: 73, baseType: !184, size: 32, offset: 544)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !616, file: !518, line: 74, baseType: !160, size: 32, offset: 576)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !616, file: !518, line: 75, baseType: !160, size: 32, offset: 608)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !616, file: !518, line: 76, baseType: !640, size: 3296, offset: 640)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !518, line: 50, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !518, line: 38, size: 3296, elements: !642)
!642 = !{!643, !644, !645, !646, !648, !649, !650, !651, !652, !653}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !641, file: !518, line: 40, baseType: !184, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !641, file: !518, line: 41, baseType: !184, size: 32, offset: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !641, file: !518, line: 42, baseType: !184, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !641, file: !518, line: 43, baseType: !647, size: 1024, offset: 96)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 1024, elements: !147)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !641, file: !518, line: 44, baseType: !647, size: 1024, offset: 1120)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !641, file: !518, line: 45, baseType: !647, size: 1024, offset: 2144)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !641, file: !518, line: 46, baseType: !184, size: 32, offset: 3168)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !641, file: !518, line: 47, baseType: !184, size: 32, offset: 3200)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !641, file: !518, line: 48, baseType: !184, size: 32, offset: 3232)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !641, file: !518, line: 49, baseType: !184, size: 32, offset: 3264)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !616, file: !518, line: 77, baseType: !160, size: 32, offset: 3936)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !616, file: !518, line: 78, baseType: !640, size: 3296, offset: 3968)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !616, file: !518, line: 80, baseType: !160, size: 32, offset: 7264)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !616, file: !518, line: 81, baseType: !160, size: 32, offset: 7296)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !616, file: !518, line: 82, baseType: !160, size: 32, offset: 7328)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !616, file: !518, line: 83, baseType: !160, size: 32, offset: 7360)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !616, file: !518, line: 84, baseType: !184, size: 32, offset: 7392)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !616, file: !518, line: 85, baseType: !184, size: 32, offset: 7424)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !616, file: !518, line: 86, baseType: !184, size: 32, offset: 7456)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !616, file: !518, line: 87, baseType: !184, size: 32, offset: 7488)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !616, file: !518, line: 88, baseType: !184, size: 32, offset: 7520)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !616, file: !518, line: 89, baseType: !184, size: 32, offset: 7552)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !570, file: !518, line: 193, baseType: !184, size: 32, offset: 32960)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !570, file: !518, line: 195, baseType: !160, size: 32, offset: 32992)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !430, file: !293, line: 571, baseType: !669, size: 1056768, offset: 192)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 1056768, elements: !147)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !430, file: !293, line: 572, baseType: !671, size: 4538368, offset: 1056960)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !517, size: 4538368, elements: !599)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !430, file: !293, line: 575, baseType: !673, size: 64, offset: 5595328)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !518, line: 256, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !518, line: 228, size: 37312, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !697, !698, !699, !700}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !675, file: !518, line: 230, baseType: !569, size: 33024)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !675, file: !518, line: 232, baseType: !184, size: 32, offset: 33024)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !675, file: !518, line: 233, baseType: !160, size: 32, offset: 33056)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !675, file: !518, line: 234, baseType: !502, size: 64, offset: 33088)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !675, file: !518, line: 235, baseType: !502, size: 64, offset: 33152)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !675, file: !518, line: 236, baseType: !683, size: 64, offset: 33216)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !675, file: !518, line: 237, baseType: !502, size: 64, offset: 33280)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !675, file: !518, line: 238, baseType: !683, size: 64, offset: 33344)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !675, file: !518, line: 240, baseType: !502, size: 64, offset: 33408)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !675, file: !518, line: 241, baseType: !683, size: 64, offset: 33472)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !675, file: !518, line: 242, baseType: !502, size: 64, offset: 33536)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !675, file: !518, line: 243, baseType: !683, size: 64, offset: 33600)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !675, file: !518, line: 245, baseType: !160, size: 32, offset: 33664)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !675, file: !518, line: 246, baseType: !502, size: 64, offset: 33728)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !675, file: !518, line: 247, baseType: !502, size: 64, offset: 33792)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !675, file: !518, line: 248, baseType: !683, size: 64, offset: 33856)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !675, file: !518, line: 249, baseType: !683, size: 64, offset: 33920)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !675, file: !518, line: 250, baseType: !696, size: 64, offset: 33984)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !675, file: !518, line: 251, baseType: !683, size: 64, offset: 34048)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !675, file: !518, line: 253, baseType: !184, size: 32, offset: 34112)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !675, file: !518, line: 254, baseType: !160, size: 32, offset: 34144)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !675, file: !518, line: 255, baseType: !701, size: 3136, offset: 34176)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !518, line: 226, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !518, line: 200, size: 3136, elements: !703)
!703 = !{!704, !705, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !722, !723, !725, !726, !727, !728}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !702, file: !518, line: 202, baseType: !160, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !702, file: !518, line: 203, baseType: !706, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !702, file: !518, line: 204, baseType: !502, size: 64, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !702, file: !518, line: 205, baseType: !683, size: 64, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !702, file: !518, line: 206, baseType: !706, size: 64, offset: 256)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !702, file: !518, line: 207, baseType: !502, size: 64, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !702, file: !518, line: 208, baseType: !502, size: 64, offset: 384)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !702, file: !518, line: 209, baseType: !706, size: 64, offset: 448)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !702, file: !518, line: 210, baseType: !706, size: 64, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !702, file: !518, line: 211, baseType: !706, size: 64, offset: 576)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !702, file: !518, line: 212, baseType: !706, size: 64, offset: 640)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !702, file: !518, line: 213, baseType: !706, size: 64, offset: 704)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !702, file: !518, line: 216, baseType: !228, size: 8, offset: 768)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !702, file: !518, line: 217, baseType: !228, size: 8, offset: 776)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !702, file: !518, line: 218, baseType: !228, size: 8, offset: 784)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !702, file: !518, line: 219, baseType: !721, size: 1024, offset: 800)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 1024, elements: !147)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !702, file: !518, line: 220, baseType: !721, size: 1024, offset: 1824)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !702, file: !518, line: 221, baseType: !724, size: 256, offset: 2848)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 256, elements: !147)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !702, file: !518, line: 222, baseType: !228, size: 8, offset: 3104)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !702, file: !518, line: 223, baseType: !228, size: 8, offset: 3112)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !702, file: !518, line: 224, baseType: !228, size: 8, offset: 3120)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !702, file: !518, line: 225, baseType: !228, size: 8, offset: 3128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !430, file: !293, line: 577, baseType: !730, size: 1193984, offset: 5595392)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 1193984, elements: !147)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !430, file: !293, line: 578, baseType: !160, size: 32, offset: 6789376)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !430, file: !293, line: 579, baseType: !160, size: 32, offset: 6789408)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !430, file: !293, line: 580, baseType: !160, size: 32, offset: 6789440)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !430, file: !293, line: 581, baseType: !160, size: 32, offset: 6789472)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !430, file: !293, line: 584, baseType: !736, size: 64, offset: 6789504)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !293, line: 584, flags: DIFlagFwdDecl)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !430, file: !293, line: 586, baseType: !739, size: 64, offset: 6789568)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !293, line: 902, size: 416, elements: !741)
!741 = !{!742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !740, file: !293, line: 904, baseType: !184, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !740, file: !293, line: 905, baseType: !184, size: 32, offset: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !740, file: !293, line: 906, baseType: !160, size: 32, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !740, file: !293, line: 907, baseType: !184, size: 32, offset: 96)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !740, file: !293, line: 908, baseType: !160, size: 32, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !740, file: !293, line: 909, baseType: !331, size: 64, offset: 160)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !740, file: !293, line: 910, baseType: !247, size: 8, offset: 224)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !740, file: !293, line: 911, baseType: !247, size: 8, offset: 232)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !740, file: !293, line: 912, baseType: !160, size: 32, offset: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !740, file: !293, line: 913, baseType: !160, size: 32, offset: 288)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !740, file: !293, line: 915, baseType: !160, size: 32, offset: 320)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !740, file: !293, line: 916, baseType: !160, size: 32, offset: 352)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !740, file: !293, line: 917, baseType: !160, size: 32, offset: 384)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !430, file: !293, line: 587, baseType: !756, size: 64, offset: 6789632)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !293, line: 839, size: 512, elements: !758)
!758 = !{!759, !760, !763, !764, !765, !766}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !757, file: !293, line: 841, baseType: !160, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !757, file: !293, line: 842, baseType: !761, size: 96, offset: 32)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 96, elements: !302)
!762 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !757, file: !293, line: 843, baseType: !761, size: 96, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !757, file: !293, line: 844, baseType: !761, size: 96, offset: 224)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !757, file: !293, line: 845, baseType: !761, size: 96, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !757, file: !293, line: 846, baseType: !761, size: 96, offset: 416)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !430, file: !293, line: 588, baseType: !160, size: 32, offset: 6789696)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !430, file: !293, line: 591, baseType: !184, size: 32, offset: 6789728)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !430, file: !293, line: 592, baseType: !160, size: 32, offset: 6789760)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !430, file: !293, line: 593, baseType: !160, size: 32, offset: 6789792)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !430, file: !293, line: 594, baseType: !160, size: 32, offset: 6789824)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !430, file: !293, line: 595, baseType: !773, size: 64, offset: 6789888)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !293, line: 542, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !293, line: 341, size: 109184, elements: !777)
!777 = !{!778, !780, !781, !782, !783, !784, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !837, !839, !1002, !1031, !1057, !1060, !1061, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1095, !1096, !1097, !1098, !1099, !1100, !1103, !1104, !1107, !1108, !1110, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1123, !1124, !1125, !1126, !1127, !1130, !1131, !1132, !1136, !1140, !1144, !1148, !1152, !1153, !1154, !1155, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1169, !1170}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !776, file: !293, line: 343, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !776, file: !293, line: 344, baseType: !433, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !776, file: !293, line: 345, baseType: !516, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !776, file: !293, line: 346, baseType: !568, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "svc_extension_flag", scope: !776, file: !293, line: 347, baseType: !160, size: 32, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !776, file: !293, line: 350, baseType: !785, size: 64, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !776, file: !293, line: 353, baseType: !160, size: 32, offset: 384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !776, file: !293, line: 354, baseType: !160, size: 32, offset: 416)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !776, file: !293, line: 355, baseType: !160, size: 32, offset: 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Transform8x8Mode", scope: !776, file: !293, line: 356, baseType: !160, size: 32, offset: 480)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "is_not_independent", scope: !776, file: !293, line: 357, baseType: !160, size: 32, offset: 512)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "toppoc", scope: !776, file: !293, line: 359, baseType: !160, size: 32, offset: 544)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "bottompoc", scope: !776, file: !293, line: 360, baseType: !160, size: 32, offset: 576)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "framepoc", scope: !776, file: !293, line: 361, baseType: !160, size: 32, offset: 608)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !776, file: !293, line: 365, baseType: !184, size: 32, offset: 640)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !776, file: !293, line: 366, baseType: !160, size: 32, offset: 672)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !776, file: !293, line: 368, baseType: !331, size: 64, offset: 704)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntMsb", scope: !776, file: !293, line: 372, baseType: !160, size: 32, offset: 768)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "AbsFrameNum", scope: !776, file: !293, line: 378, baseType: !184, size: 32, offset: 800)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !776, file: !293, line: 379, baseType: !160, size: 32, offset: 832)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "current_mb_nr", scope: !776, file: !293, line: 387, baseType: !184, size: 32, offset: 864)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !776, file: !293, line: 388, baseType: !184, size: 32, offset: 896)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "current_slice_nr", scope: !776, file: !293, line: 389, baseType: !227, size: 16, offset: 928)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "cod_counter", scope: !776, file: !293, line: 396, baseType: !160, size: 32, offset: 960)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "allrefzero", scope: !776, file: !293, line: 397, baseType: !160, size: 32, offset: 992)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !776, file: !293, line: 400, baseType: !160, size: 32, offset: 1024)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !776, file: !293, line: 401, baseType: !160, size: 32, offset: 1056)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_active", scope: !776, file: !293, line: 402, baseType: !331, size: 64, offset: 1088)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !776, file: !293, line: 406, baseType: !160, size: 32, offset: 1152)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !776, file: !293, line: 407, baseType: !160, size: 32, offset: 1184)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !776, file: !293, line: 408, baseType: !160, size: 32, offset: 1216)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "qs", scope: !776, file: !293, line: 409, baseType: !160, size: 32, offset: 1248)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qs_delta", scope: !776, file: !293, line: 410, baseType: !160, size: 32, offset: 1280)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !776, file: !293, line: 411, baseType: !160, size: 32, offset: 1312)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "model_number", scope: !776, file: !293, line: 412, baseType: !160, size: 32, offset: 1344)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !776, file: !293, line: 413, baseType: !184, size: 32, offset: 1376)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !776, file: !293, line: 414, baseType: !184, size: 32, offset: 1408)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !776, file: !293, line: 415, baseType: !247, size: 8, offset: 1440)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !776, file: !293, line: 416, baseType: !236, size: 32, offset: 1472)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !776, file: !293, line: 417, baseType: !160, size: 32, offset: 1504)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "end_mb_nr_plus1", scope: !776, file: !293, line: 418, baseType: !160, size: 32, offset: 1536)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !776, file: !293, line: 419, baseType: !160, size: 32, offset: 1568)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "dp_mode", scope: !776, file: !293, line: 420, baseType: !160, size: 32, offset: 1600)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "current_header", scope: !776, file: !293, line: 421, baseType: !160, size: 32, offset: 1632)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "next_header", scope: !776, file: !293, line: 422, baseType: !160, size: 32, offset: 1664)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "last_dquant", scope: !776, file: !293, line: 423, baseType: !160, size: 32, offset: 1696)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "colour_plane_id", scope: !776, file: !293, line: 426, baseType: !160, size: 32, offset: 1728)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !776, file: !293, line: 427, baseType: !160, size: 32, offset: 1760)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "sp_switch", scope: !776, file: !293, line: 428, baseType: !160, size: 32, offset: 1792)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !776, file: !293, line: 429, baseType: !160, size: 32, offset: 1824)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_slice_ref_idx", scope: !776, file: !293, line: 430, baseType: !160, size: 32, offset: 1856)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !776, file: !293, line: 431, baseType: !160, size: 32, offset: 1888)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !776, file: !293, line: 432, baseType: !160, size: 32, offset: 1920)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !776, file: !293, line: 433, baseType: !160, size: 32, offset: 1952)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !776, file: !293, line: 434, baseType: !334, size: 64, offset: 1984)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !776, file: !293, line: 436, baseType: !836, size: 48, offset: 2048)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 48, elements: !541)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !776, file: !293, line: 437, baseType: !838, size: 384, offset: 2112)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 384, elements: !541)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !776, file: !293, line: 440, baseType: !840, size: 64, offset: 2496)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !293, line: 324, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !293, line: 314, size: 384, elements: !843)
!843 = !{!844, !855, !864}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !842, file: !293, line: 317, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !293, line: 47, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream", file: !293, line: 300, size: 256, elements: !848)
!848 = !{!849, !850, !851, !852, !853, !854}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "read_len", scope: !847, file: !293, line: 303, baseType: !160, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !847, file: !293, line: 304, baseType: !160, size: 32, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bitoffset", scope: !847, file: !293, line: 306, baseType: !160, size: 32, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_length", scope: !847, file: !293, line: 307, baseType: !160, size: 32, offset: 96)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !847, file: !293, line: 309, baseType: !308, size: 64, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !847, file: !293, line: 310, baseType: !160, size: 32, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "de_cabac", scope: !842, file: !293, line: 318, baseType: !856, size: 256, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !293, line: 95, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 88, size: 256, elements: !858)
!858 = !{!859, !860, !861, !862, !863}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !857, file: !293, line: 90, baseType: !184, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !857, file: !293, line: 91, baseType: !184, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !857, file: !293, line: 92, baseType: !160, size: 32, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !857, file: !293, line: 93, baseType: !308, size: 64, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !857, file: !293, line: 94, baseType: !502, size: 64, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "readSyntaxElement", scope: !842, file: !293, line: 320, baseType: !865, size: 64, offset: 320)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!160, !868, !1000, !998}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !293, line: 273, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !293, line: 197, size: 3840, elements: !871)
!871 = !{!872, !874, !875, !876, !877, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !906, !907, !908, !909, !910, !914, !915, !924, !925, !926, !927, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !953, !954, !969, !975, !999}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !870, file: !293, line: 199, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !870, file: !293, line: 200, baseType: !779, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !870, file: !293, line: 201, baseType: !433, size: 64, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrX", scope: !870, file: !293, line: 202, baseType: !160, size: 32, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !870, file: !293, line: 203, baseType: !878, size: 32, offset: 224)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockPos", file: !293, line: 112, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !293, line: 108, size: 32, elements: !880)
!880 = !{!881, !882}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !879, file: !293, line: 110, baseType: !227, size: 16)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !879, file: !293, line: 111, baseType: !227, size: 16, offset: 16)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !870, file: !293, line: 204, baseType: !160, size: 32, offset: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !870, file: !293, line: 205, baseType: !160, size: 32, offset: 288)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "block_y_aff", scope: !870, file: !293, line: 206, baseType: !160, size: 32, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !870, file: !293, line: 207, baseType: !160, size: 32, offset: 352)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !870, file: !293, line: 208, baseType: !160, size: 32, offset: 384)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !870, file: !293, line: 209, baseType: !160, size: 32, offset: 416)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !870, file: !293, line: 210, baseType: !160, size: 32, offset: 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !870, file: !293, line: 212, baseType: !160, size: 32, offset: 480)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !870, file: !293, line: 213, baseType: !160, size: 32, offset: 512)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !870, file: !293, line: 215, baseType: !160, size: 32, offset: 544)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "qpc", scope: !870, file: !293, line: 216, baseType: !331, size: 64, offset: 576)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "qp_scaled", scope: !870, file: !293, line: 217, baseType: !459, size: 96, offset: 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "is_lossless", scope: !870, file: !293, line: 218, baseType: !160, size: 32, offset: 736)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !870, file: !293, line: 219, baseType: !160, size: 32, offset: 768)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !870, file: !293, line: 220, baseType: !160, size: 32, offset: 800)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !870, file: !293, line: 221, baseType: !160, size: 32, offset: 832)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !870, file: !293, line: 223, baseType: !227, size: 16, offset: 864)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !870, file: !293, line: 224, baseType: !228, size: 8, offset: 880)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "dpl_flag", scope: !870, file: !293, line: 225, baseType: !228, size: 8, offset: 888)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "delta_quant", scope: !870, file: !293, line: 226, baseType: !227, size: 16, offset: 896)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "list_offset", scope: !870, file: !293, line: 227, baseType: !227, size: 16, offset: 912)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "mb_up", scope: !870, file: !293, line: 229, baseType: !905, size: 64, offset: 960)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "mb_left", scope: !870, file: !293, line: 230, baseType: !905, size: 64, offset: 1024)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "mbup", scope: !870, file: !293, line: 232, baseType: !905, size: 64, offset: 1088)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "mbleft", scope: !870, file: !293, line: 233, baseType: !905, size: 64, offset: 1152)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !870, file: !293, line: 236, baseType: !227, size: 16, offset: 1216)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !870, file: !293, line: 237, baseType: !911, size: 1024, offset: 1232)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 1024, elements: !912)
!912 = !{!289, !913, !913, !289}
!913 = !DISubrange(count: 4)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !870, file: !293, line: 239, baseType: !160, size: 32, offset: 2272)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !870, file: !293, line: 240, baseType: !916, size: 192, offset: 2304)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 192, elements: !302)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !918, line: 103, baseType: !919)
!918 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !920, line: 27, baseType: !921)
!920 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !922, line: 44, baseType: !923)
!922 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!923 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !870, file: !293, line: 241, baseType: !916, size: 192, offset: 2496)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits_8x8", scope: !870, file: !293, line: 242, baseType: !916, size: 192, offset: 2688)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "i16mode", scope: !870, file: !293, line: 244, baseType: !160, size: 32, offset: 2880)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !870, file: !293, line: 245, baseType: !928, size: 32, offset: 2912)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 32, elements: !929)
!929 = !{!913}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !870, file: !293, line: 246, baseType: !928, size: 32, offset: 2944)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "ipmode_DPCM", scope: !870, file: !293, line: 247, baseType: !228, size: 8, offset: 2976)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !870, file: !293, line: 248, baseType: !228, size: 8, offset: 2984)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !870, file: !293, line: 249, baseType: !228, size: 8, offset: 2992)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "DFDisableIdc", scope: !870, file: !293, line: 250, baseType: !227, size: 16, offset: 3008)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "DFAlphaC0Offset", scope: !870, file: !293, line: 251, baseType: !227, size: 16, offset: 3024)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "DFBetaOffset", scope: !870, file: !293, line: 252, baseType: !227, size: 16, offset: 3040)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !870, file: !293, line: 254, baseType: !160, size: 32, offset: 3072)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !870, file: !293, line: 256, baseType: !160, size: 32, offset: 3104)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !870, file: !293, line: 256, baseType: !160, size: 32, offset: 3136)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !870, file: !293, line: 256, baseType: !160, size: 32, offset: 3168)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !870, file: !293, line: 256, baseType: !160, size: 32, offset: 3200)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !870, file: !293, line: 257, baseType: !160, size: 32, offset: 3232)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !870, file: !293, line: 257, baseType: !160, size: 32, offset: 3264)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !870, file: !293, line: 257, baseType: !160, size: 32, offset: 3296)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !870, file: !293, line: 257, baseType: !160, size: 32, offset: 3328)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !870, file: !293, line: 259, baseType: !160, size: 32, offset: 3360)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !870, file: !293, line: 260, baseType: !160, size: 32, offset: 3392)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_4x4", scope: !870, file: !293, line: 262, baseType: !949, size: 64, offset: 3456)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{null, !905, !952, !160, !160}
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorPlane", file: !183, line: 32, baseType: !189)
