; ModuleID = 'ldecod_src/mc_direct.c'
source_filename = "ldecod_src/mc_direct.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.pic_motion_params = type { [2 x ptr], [2 x %struct.MotionVector], [2 x i8] }
%struct.MotionVector = type { i16, i16 }

@BLOCK_STEP = internal unnamed_addr constant [8 x [2 x i32]] [[2 x i32] zeroinitializer, [2 x i32] [i32 4, i32 4], [2 x i32] [i32 4, i32 2], [2 x i32] [i32 2, i32 4], [2 x i32] [i32 2, i32 2], [2 x i32] [i32 2, i32 1], [2 x i32] [i32 1, i32 2], [2 x i32] [i32 1, i32 1]], align 16, !dbg !0
@.str = private unnamed_addr constant [67 x i8] c"temporal direct error: colocated block has ref that is unavailable\00", align 1, !dbg !100

; Function Attrs: mustprogress nofree norecurse nosync nounwind willreturn memory(read, inaccessiblemem: none) uwtable
define dso_local range(i32 0, 2) i32 @get_colocated_info_4x4(ptr nocapture noundef readnone %currMB, ptr nocapture noundef readonly %list1, i32 noundef %i, i32 noundef %j) local_unnamed_addr #0 !dbg !119 {
entry:
    #dbg_value(ptr %currMB, !1296, !DIExpression(), !1306)
    #dbg_value(ptr %list1, !1297, !DIExpression(), !1306)
    #dbg_value(i32 %i, !1298, !DIExpression(), !1306)
    #dbg_value(i32 %j, !1299, !DIExpression(), !1306)
  %is_long_term = getelementptr inbounds i8, ptr %list1, i64 40, !dbg !1307
  %0 = load i8, ptr %is_long_term, align 8, !dbg !1307

!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "CF_UNKNOWN", value: -1)
!10 = !DIEnumerator(name: "YUV400", value: 0)
!11 = !DIEnumerator(name: "YUV420", value: 1)
!12 = !DIEnumerator(name: "YUV422", value: 2)
!13 = !DIEnumerator(name: "YUV444", value: 3)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 15, baseType: !7, size: 32, elements: !15)
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "CM_UNKNOWN", value: -1)
!17 = !DIEnumerator(name: "CM_YUV", value: 0)
!18 = !DIEnumerator(name: "CM_RGB", value: 1)
!19 = !DIEnumerator(name: "CM_XYZ", value: 2)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 25, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "ldecod_src/inc/io_video.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1141c07f1801ad27d87214c419749431")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "VIDEO_UNKNOWN", value: -1)
!24 = !DIEnumerator(name: "VIDEO_YUV", value: 0)
!25 = !DIEnumerator(name: "VIDEO_RGB", value: 1)
!26 = !DIEnumerator(name: "VIDEO_XYZ", value: 2)
!27 = !DIEnumerator(name: "VIDEO_TIFF", value: 3)
!28 = !DIEnumerator(name: "VIDEO_AVI", value: 4)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 135, baseType: !31, size: 32, elements: !32)
!30 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!31 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!32 = !{!33, !34, !35}
!33 = !DIEnumerator(name: "FRAME", value: 0)
!34 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!35 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 22, baseType: !31, size: 32, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43}
!38 = !DIEnumerator(name: "PLANE_Y", value: 0)
!39 = !DIEnumerator(name: "PLANE_U", value: 1)
!40 = !DIEnumerator(name: "PLANE_V", value: 2)
!41 = !DIEnumerator(name: "PLANE_G", value: 0)
!42 = !DIEnumerator(name: "PLANE_B", value: 1)
!43 = !DIEnumerator(name: "PLANE_R", value: 2)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 34, baseType: !31, size: 32, elements: !45)
!45 = !{!46, !47, !48, !49, !50}
!46 = !DIEnumerator(name: "LIST_0", value: 0)
!47 = !DIEnumerator(name: "LIST_1", value: 1)
!48 = !DIEnumerator(name: "BI_PRED", value: 2)
!49 = !DIEnumerator(name: "BI_PRED_L0", value: 3)
!50 = !DIEnumerator(name: "BI_PRED_L1", value: 4)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 77, baseType: !31, size: 32, elements: !52)
!52 = !{!53, !54, !55, !56}
!53 = !DIEnumerator(name: "FRAME_CODING", value: 0)
!54 = !DIEnumerator(name: "FIELD_CODING", value: 1)
!55 = !DIEnumerator(name: "ADAPTIVE_CODING", value: 2)
!56 = !DIEnumerator(name: "FRAME_MB_PAIR_CODING", value: 3)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !58, line: 117, baseType: !31, size: 32, elements: !59)
!58 = !DIFile(filename: "ldecod_src/inc/defines.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "f06de374c735b286d10ba4ea0c8c0a5d")
!59 = !{!60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76}
!60 = !DIEnumerator(name: "PSKIP", value: 0)
!61 = !DIEnumerator(name: "BSKIP_DIRECT", value: 0)
!62 = !DIEnumerator(name: "P16x16", value: 1)
!63 = !DIEnumerator(name: "P16x8", value: 2)
!64 = !DIEnumerator(name: "P8x16", value: 3)
!65 = !DIEnumerator(name: "SMB8x8", value: 4)
!66 = !DIEnumerator(name: "SMB8x4", value: 5)
!67 = !DIEnumerator(name: "SMB4x8", value: 6)
!68 = !DIEnumerator(name: "SMB4x4", value: 7)
!69 = !DIEnumerator(name: "P8x8", value: 8)
!70 = !DIEnumerator(name: "I4MB", value: 9)
!71 = !DIEnumerator(name: "I16MB", value: 10)
!72 = !DIEnumerator(name: "IBLOCK", value: 11)
!73 = !DIEnumerator(name: "SI4MB", value: 12)
!74 = !DIEnumerator(name: "I8MB", value: 13)
!75 = !DIEnumerator(name: "IPCM", value: 14)
!76 = !DIEnumerator(name: "MAXMODE", value: 15)
!77 = !{!78, !79}
!78 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!79 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!80 = !{!81, !91, !100, !0}
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "INT_BITS", scope: !83, file: !84, line: 118, type: !90, isLocal: true, isDefinition: true)
!83 = distinct !DISubprogram(name: "iabs", scope: !84, file: !84, line: 116, type: !85, scopeLine: 117, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !87)
!84 = !DIFile(filename: "ldecod_src/inc/ifunctions.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "279401589ed56df99e287ad9e5fc564b")
!85 = !DISubroutineType(types: !86)
!86 = !{!7, !7}
!87 = !{!88, !89}
!88 = !DILocalVariable(name: "x", arg: 1, scope: !83, file: !84, line: 116, type: !7)
!89 = !DILocalVariable(name: "y", scope: !83, file: !84, line: 119, type: !7)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "zero_mv", scope: !2, file: !93, line: 106, type: !94, isLocal: true, isDefinition: true)
!93 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !93, line: 104, baseType: !96)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !93, line: 100, size: 32, elements: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !96, file: !93, line: 102, baseType: !78, size: 16)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !96, file: !93, line: 103, baseType: !78, size: 16, offset: 16)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(scope: null, file: !3, line: 255, type: !102, isLocal: true, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 536, elements: !104)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!104 = !{!105}
!105 = !DISubrange(count: 67)
!106 = !DIFile(filename: "ldecod_src/inc/macroblock.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "17b4b8d6c8aaa60d7374ecd392230b5d")
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 512, elements: !108)
!108 = !{!109, !110}
!109 = !DISubrange(count: 8)
!110 = !DISubrange(count: 2)
!111 = !{i32 7, !"Dwarf Version", i32 5}
!112 = !{i32 2, !"Debug Info Version", i32 3}
!113 = !{i32 1, !"wchar_size", i32 4}
!114 = !{i32 8, !"PIC Level", i32 2}
!115 = !{i32 7, !"PIE Level", i32 2}
!116 = !{i32 7, !"uwtable", i32 2}
!117 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!118 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!119 = distinct !DISubprogram(name: "get_colocated_info_4x4", scope: !3, file: !3, line: 279, type: !120, scopeLine: 280, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1295)
!120 = !DISubroutineType(types: !121)
!121 = !{!7, !122, !666, !7, !7}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !93, line: 273, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !93, line: 197, size: 3840, elements: !125)
!125 = !{!126, !1211, !1212, !1213, !1214, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1243, !1244, !1245, !1246, !1247, !1250, !1251, !1253, !1254, !1255, !1256, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1280, !1281, !1286, !1290, !1294}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !124, file: !93, line: 199, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !93, line: 341, size: 109184, elements: !129)
!129 = !{!130, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !985, !987, !1040, !1070, !1097, !1100, !1101, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1136, !1137, !1138, !1139, !1140, !1141, !1144, !1145, !1148, !1149, !1151, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1164, !1165, !1166, !1167, !1168, !1170, !1171, !1172, !1176, !1180, !1184, !1188, !1192, !1193, !1194, !1195, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !128, file: !93, line: 343, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !93, line: 566, size: 6855040, elements: !133)
!133 = !{!134, !219, !275, !379, !381, !383, !440, !442, !443, !444, !445, !446, !449, !468, !480, !481, !482, !483, !484, !485, !489, !490, !492, !493, !494, !495, !496, !497, !499, !501, !504, !505, !507, !508, !509, !510, !511, !513, !514, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !631, !632, !636, !637, !638, !639, !640, !641, !642, !643, !644, !646, !647, !648, !783, !787, !788, !790, !791, !794, !797, !798, !799, !803, !806, !809, !810, !811, !812, !813, !814, !840, !841, !843, !847, !848, !849, !850, !853, !858, !872, !876, !880, !881, !886, !887, !891, !892, !896, !917, !918, !921, !922, !923, !924, !925, !926, !927, !928}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !132, file: !93, line: 568, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !93, line: 850, size: 32128, elements: !137)
!137 = !{!138, !142, !143, !144, !145, !146, !147, !148, !149, !150, !180, !181, !182, !183, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !136, file: !93, line: 852, baseType: !139, size: 2040)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 2040, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 255)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !136, file: !93, line: 853, baseType: !139, size: 2040, offset: 2040)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !136, file: !93, line: 854, baseType: !139, size: 2040, offset: 4080)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !136, file: !93, line: 856, baseType: !7, size: 32, offset: 6144)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !136, file: !93, line: 857, baseType: !7, size: 32, offset: 6176)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !136, file: !93, line: 858, baseType: !7, size: 32, offset: 6208)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !136, file: !93, line: 859, baseType: !7, size: 32, offset: 6240)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !136, file: !93, line: 860, baseType: !7, size: 32, offset: 6272)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !136, file: !93, line: 861, baseType: !7, size: 32, offset: 6304)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !136, file: !93, line: 864, baseType: !151, size: 1088, offset: 6336)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !6, line: 52, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !6, line: 30, size: 1088, elements: !153)
!153 = !{!154, !156, !158, !160, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !152, file: !6, line: 32, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !6, line: 28, baseType: !5)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !152, file: !6, line: 33, baseType: !157, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !6, line: 20, baseType: !14)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !152, file: !6, line: 34, baseType: !159, size: 64, offset: 64)
!159 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !152, file: !6, line: 35, baseType: !161, size: 96, offset: 128)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 3)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !152, file: !6, line: 36, baseType: !161, size: 96, offset: 224)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !152, file: !6, line: 37, baseType: !7, size: 32, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !152, file: !6, line: 38, baseType: !7, size: 32, offset: 352)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !152, file: !6, line: 39, baseType: !7, size: 32, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !152, file: !6, line: 40, baseType: !7, size: 32, offset: 416)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !152, file: !6, line: 41, baseType: !7, size: 32, offset: 448)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !152, file: !6, line: 42, baseType: !7, size: 32, offset: 480)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !152, file: !6, line: 43, baseType: !7, size: 32, offset: 512)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !152, file: !6, line: 44, baseType: !7, size: 32, offset: 544)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !152, file: !6, line: 45, baseType: !161, size: 96, offset: 576)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !152, file: !6, line: 46, baseType: !7, size: 32, offset: 672)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !152, file: !6, line: 47, baseType: !161, size: 96, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !152, file: !6, line: 48, baseType: !161, size: 96, offset: 800)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !152, file: !6, line: 49, baseType: !161, size: 96, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !152, file: !6, line: 50, baseType: !7, size: 32, offset: 992)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !152, file: !6, line: 51, baseType: !7, size: 32, offset: 1024)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !136, file: !93, line: 865, baseType: !151, size: 1088, offset: 7424)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !136, file: !93, line: 867, baseType: !7, size: 32, offset: 8512)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !136, file: !93, line: 868, baseType: !7, size: 32, offset: 8544)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !136, file: !93, line: 869, baseType: !184, size: 7744, offset: 8576)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !21, line: 60, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !21, line: 34, size: 7744, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !185, file: !21, line: 37, baseType: !139, size: 2040)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !185, file: !21, line: 38, baseType: !139, size: 2040, offset: 2040)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !185, file: !21, line: 39, baseType: !139, size: 2040, offset: 4080)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !185, file: !21, line: 40, baseType: !7, size: 32, offset: 6144)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !185, file: !21, line: 41, baseType: !192, size: 32, offset: 6176)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !21, line: 32, baseType: !20)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !185, file: !21, line: 42, baseType: !151, size: 1088, offset: 6208)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !185, file: !21, line: 43, baseType: !7, size: 32, offset: 7296)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !185, file: !21, line: 44, baseType: !7, size: 32, offset: 7328)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !185, file: !21, line: 45, baseType: !7, size: 32, offset: 7360)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !185, file: !21, line: 46, baseType: !7, size: 32, offset: 7392)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !185, file: !21, line: 47, baseType: !7, size: 32, offset: 7424)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !185, file: !21, line: 48, baseType: !7, size: 32, offset: 7456)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !185, file: !21, line: 49, baseType: !7, size: 32, offset: 7488)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !185, file: !21, line: 50, baseType: !7, size: 32, offset: 7520)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !185, file: !21, line: 51, baseType: !7, size: 32, offset: 7552)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !185, file: !21, line: 52, baseType: !7, size: 32, offset: 7584)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !185, file: !21, line: 53, baseType: !7, size: 32, offset: 7616)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !185, file: !21, line: 56, baseType: !206, size: 64, offset: 7680)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !136, file: !93, line: 870, baseType: !184, size: 7744, offset: 16320)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !136, file: !93, line: 871, baseType: !184, size: 7744, offset: 24064)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !136, file: !93, line: 873, baseType: !7, size: 32, offset: 31808)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !136, file: !93, line: 884, baseType: !7, size: 32, offset: 31840)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !136, file: !93, line: 885, baseType: !7, size: 32, offset: 31872)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !136, file: !93, line: 886, baseType: !7, size: 32, offset: 31904)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !136, file: !93, line: 890, baseType: !7, size: 32, offset: 31936)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !136, file: !93, line: 893, baseType: !7, size: 32, offset: 31968)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !136, file: !93, line: 894, baseType: !7, size: 32, offset: 32000)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !136, file: !93, line: 895, baseType: !7, size: 32, offset: 32032)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !136, file: !93, line: 897, baseType: !7, size: 32, offset: 32064)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !136, file: !93, line: 899, baseType: !7, size: 32, offset: 32096)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !132, file: !93, line: 569, baseType: !220, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !222, line: 138, baseType: !223)
!222 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !222, line: 94, size: 17728, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !235, !240, !244, !247, !248, !249, !250, !251, !254, !255, !256, !257, !258, !259, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !223, file: !222, line: 96, baseType: !7, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !223, file: !222, line: 97, baseType: !31, size: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !223, file: !222, line: 98, baseType: !31, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !223, file: !222, line: 99, baseType: !7, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !223, file: !222, line: 100, baseType: !7, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !223, file: !222, line: 102, baseType: !7, size: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !223, file: !222, line: 103, baseType: !232, size: 384, offset: 192)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 384, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 12)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !223, file: !222, line: 104, baseType: !236, size: 3072, offset: 576)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3072, elements: !237)
!237 = !{!238, !239}
!238 = !DISubrange(count: 6)
!239 = !DISubrange(count: 16)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !223, file: !222, line: 105, baseType: !241, size: 12288, offset: 3648)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 12288, elements: !242)
!242 = !{!238, !243}
!243 = !DISubrange(count: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !223, file: !222, line: 106, baseType: !245, size: 192, offset: 15936)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !246)
!246 = !{!238}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !223, file: !222, line: 107, baseType: !245, size: 192, offset: 16128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !223, file: !222, line: 110, baseType: !7, size: 32, offset: 16320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !223, file: !222, line: 111, baseType: !31, size: 32, offset: 16352)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !223, file: !222, line: 112, baseType: !31, size: 32, offset: 16384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !223, file: !222, line: 114, baseType: !252, size: 256, offset: 16416)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 256, elements: !253)
!253 = !{!109}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !223, file: !222, line: 116, baseType: !252, size: 256, offset: 16672)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !223, file: !222, line: 117, baseType: !252, size: 256, offset: 16928)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !223, file: !222, line: 119, baseType: !7, size: 32, offset: 17184)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !223, file: !222, line: 120, baseType: !31, size: 32, offset: 17216)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !223, file: !222, line: 122, baseType: !31, size: 32, offset: 17248)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !223, file: !222, line: 123, baseType: !260, size: 64, offset: 17280)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !262, line: 21, baseType: !263)
!262 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!263 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !223, file: !222, line: 125, baseType: !7, size: 32, offset: 17344)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !223, file: !222, line: 126, baseType: !7, size: 32, offset: 17376)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !223, file: !222, line: 127, baseType: !7, size: 32, offset: 17408)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !223, file: !222, line: 128, baseType: !31, size: 32, offset: 17440)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !223, file: !222, line: 129, baseType: !7, size: 32, offset: 17472)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !223, file: !222, line: 130, baseType: !7, size: 32, offset: 17504)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !223, file: !222, line: 131, baseType: !7, size: 32, offset: 17536)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !223, file: !222, line: 133, baseType: !7, size: 32, offset: 17568)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !223, file: !222, line: 135, baseType: !7, size: 32, offset: 17600)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !223, file: !222, line: 136, baseType: !7, size: 32, offset: 17632)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !223, file: !222, line: 137, baseType: !7, size: 32, offset: 17664)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !132, file: !93, line: 570, baseType: !276, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !222, line: 197, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !222, line: 142, size: 33024, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !377, !378}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !278, file: !222, line: 144, baseType: !7, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !278, file: !222, line: 146, baseType: !31, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !278, file: !222, line: 147, baseType: !7, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !278, file: !222, line: 148, baseType: !7, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !278, file: !222, line: 149, baseType: !7, size: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !278, file: !222, line: 150, baseType: !7, size: 32, offset: 160)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !278, file: !222, line: 152, baseType: !7, size: 32, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !278, file: !222, line: 154, baseType: !31, size: 32, offset: 224)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !278, file: !222, line: 155, baseType: !31, size: 32, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !278, file: !222, line: 156, baseType: !31, size: 32, offset: 288)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !278, file: !222, line: 158, baseType: !7, size: 32, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !278, file: !222, line: 159, baseType: !232, size: 384, offset: 352)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !278, file: !222, line: 160, baseType: !236, size: 3072, offset: 736)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !278, file: !222, line: 161, baseType: !241, size: 12288, offset: 3808)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !278, file: !222, line: 162, baseType: !245, size: 192, offset: 16096)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !278, file: !222, line: 163, baseType: !245, size: 192, offset: 16288)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !278, file: !222, line: 165, baseType: !31, size: 32, offset: 16480)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !278, file: !222, line: 166, baseType: !31, size: 32, offset: 16512)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !278, file: !222, line: 167, baseType: !31, size: 32, offset: 16544)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !278, file: !222, line: 168, baseType: !31, size: 32, offset: 16576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !278, file: !222, line: 170, baseType: !31, size: 32, offset: 16608)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !278, file: !222, line: 172, baseType: !7, size: 32, offset: 16640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !278, file: !222, line: 173, baseType: !7, size: 32, offset: 16672)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !278, file: !222, line: 174, baseType: !7, size: 32, offset: 16704)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !278, file: !222, line: 175, baseType: !31, size: 32, offset: 16736)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !278, file: !222, line: 177, baseType: !306, size: 8192, offset: 16768)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !278, file: !222, line: 178, baseType: !31, size: 32, offset: 24960)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !278, file: !222, line: 179, baseType: !7, size: 32, offset: 24992)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !278, file: !222, line: 180, baseType: !31, size: 32, offset: 25024)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !278, file: !222, line: 181, baseType: !31, size: 32, offset: 25056)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !278, file: !222, line: 182, baseType: !7, size: 32, offset: 25088)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !278, file: !222, line: 184, baseType: !7, size: 32, offset: 25120)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !278, file: !222, line: 185, baseType: !7, size: 32, offset: 25152)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !278, file: !222, line: 186, baseType: !7, size: 32, offset: 25184)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !278, file: !222, line: 187, baseType: !31, size: 32, offset: 25216)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !278, file: !222, line: 188, baseType: !31, size: 32, offset: 25248)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !278, file: !222, line: 189, baseType: !31, size: 32, offset: 25280)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !278, file: !222, line: 190, baseType: !31, size: 32, offset: 25312)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !278, file: !222, line: 191, baseType: !7, size: 32, offset: 25344)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !278, file: !222, line: 192, baseType: !323, size: 7584, offset: 25376)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !222, line: 90, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !222, line: 53, size: 7584, elements: !325)
!325 = !{!326, !327, !328, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !324, file: !222, line: 55, baseType: !7, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !324, file: !222, line: 56, baseType: !31, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !324, file: !222, line: 57, baseType: !329, size: 16, offset: 64)
!329 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !324, file: !222, line: 58, baseType: !329, size: 16, offset: 80)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !324, file: !222, line: 59, baseType: !7, size: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !324, file: !222, line: 60, baseType: !7, size: 32, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !324, file: !222, line: 61, baseType: !7, size: 32, offset: 160)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !324, file: !222, line: 62, baseType: !31, size: 32, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !324, file: !222, line: 63, baseType: !7, size: 32, offset: 224)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !324, file: !222, line: 64, baseType: !7, size: 32, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !324, file: !222, line: 65, baseType: !31, size: 32, offset: 288)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !324, file: !222, line: 66, baseType: !31, size: 32, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !324, file: !222, line: 67, baseType: !31, size: 32, offset: 352)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !324, file: !222, line: 68, baseType: !7, size: 32, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !324, file: !222, line: 69, baseType: !31, size: 32, offset: 416)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !324, file: !222, line: 70, baseType: !31, size: 32, offset: 448)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !324, file: !222, line: 71, baseType: !7, size: 32, offset: 480)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !324, file: !222, line: 72, baseType: !31, size: 32, offset: 512)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !324, file: !222, line: 73, baseType: !31, size: 32, offset: 544)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !324, file: !222, line: 74, baseType: !7, size: 32, offset: 576)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !324, file: !222, line: 75, baseType: !7, size: 32, offset: 608)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !324, file: !222, line: 76, baseType: !349, size: 3296, offset: 640)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !222, line: 50, baseType: !350)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !222, line: 38, size: 3296, elements: !351)
!351 = !{!352, !353, !354, !355, !359, !360, !361, !362, !363, !364}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !350, file: !222, line: 40, baseType: !31, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !350, file: !222, line: 41, baseType: !31, size: 32, offset: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !350, file: !222, line: 42, baseType: !31, size: 32, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !350, file: !222, line: 43, baseType: !356, size: 1024, offset: 96)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1024, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !350, file: !222, line: 44, baseType: !356, size: 1024, offset: 1120)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !350, file: !222, line: 45, baseType: !356, size: 1024, offset: 2144)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !350, file: !222, line: 46, baseType: !31, size: 32, offset: 3168)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !350, file: !222, line: 47, baseType: !31, size: 32, offset: 3200)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !350, file: !222, line: 48, baseType: !31, size: 32, offset: 3232)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !350, file: !222, line: 49, baseType: !31, size: 32, offset: 3264)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !324, file: !222, line: 77, baseType: !7, size: 32, offset: 3936)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !324, file: !222, line: 78, baseType: !349, size: 3296, offset: 3968)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !324, file: !222, line: 80, baseType: !7, size: 32, offset: 7264)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !324, file: !222, line: 81, baseType: !7, size: 32, offset: 7296)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !324, file: !222, line: 82, baseType: !7, size: 32, offset: 7328)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !324, file: !222, line: 83, baseType: !7, size: 32, offset: 7360)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !324, file: !222, line: 84, baseType: !31, size: 32, offset: 7392)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !324, file: !222, line: 85, baseType: !31, size: 32, offset: 7424)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !324, file: !222, line: 86, baseType: !31, size: 32, offset: 7456)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !324, file: !222, line: 87, baseType: !31, size: 32, offset: 7488)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !324, file: !222, line: 88, baseType: !31, size: 32, offset: 7520)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !324, file: !222, line: 89, baseType: !31, size: 32, offset: 7552)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !278, file: !222, line: 193, baseType: !31, size: 32, offset: 32960)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !278, file: !222, line: 195, baseType: !7, size: 32, offset: 32992)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !132, file: !93, line: 571, baseType: !380, size: 1056768, offset: 192)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !277, size: 1056768, elements: !357)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !132, file: !93, line: 572, baseType: !382, size: 4538368, offset: 1056960)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !221, size: 4538368, elements: !307)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !132, file: !93, line: 575, baseType: !384, size: 64, offset: 5595328)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !222, line: 256, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !222, line: 228, size: 37312, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !393, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !408, !409, !410, !411}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !386, file: !222, line: 230, baseType: !277, size: 33024)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !386, file: !222, line: 232, baseType: !31, size: 32, offset: 33024)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !386, file: !222, line: 233, baseType: !7, size: 32, offset: 33056)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !386, file: !222, line: 234, baseType: !206, size: 64, offset: 33088)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !386, file: !222, line: 235, baseType: !206, size: 64, offset: 33152)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !386, file: !222, line: 236, baseType: !394, size: 64, offset: 33216)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !386, file: !222, line: 237, baseType: !206, size: 64, offset: 33280)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !386, file: !222, line: 238, baseType: !394, size: 64, offset: 33344)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !386, file: !222, line: 240, baseType: !206, size: 64, offset: 33408)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !386, file: !222, line: 241, baseType: !394, size: 64, offset: 33472)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !386, file: !222, line: 242, baseType: !206, size: 64, offset: 33536)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !386, file: !222, line: 243, baseType: !394, size: 64, offset: 33600)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !386, file: !222, line: 245, baseType: !7, size: 32, offset: 33664)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !386, file: !222, line: 246, baseType: !206, size: 64, offset: 33728)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !386, file: !222, line: 247, baseType: !206, size: 64, offset: 33792)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !386, file: !222, line: 248, baseType: !394, size: 64, offset: 33856)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !386, file: !222, line: 249, baseType: !394, size: 64, offset: 33920)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !386, file: !222, line: 250, baseType: !407, size: 64, offset: 33984)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !386, file: !222, line: 251, baseType: !394, size: 64, offset: 34048)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !386, file: !222, line: 253, baseType: !31, size: 32, offset: 34112)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !386, file: !222, line: 254, baseType: !7, size: 32, offset: 34144)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !386, file: !222, line: 255, baseType: !412, size: 3136, offset: 34176)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !222, line: 226, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !222, line: 200, size: 3136, elements: !414)
!414 = !{!415, !416, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !433, !434, !436, !437, !438, !439}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !413, file: !222, line: 202, baseType: !7, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !413, file: !222, line: 203, baseType: !417, size: 64, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !413, file: !222, line: 204, baseType: !206, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !413, file: !222, line: 205, baseType: !394, size: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !413, file: !222, line: 206, baseType: !417, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !413, file: !222, line: 207, baseType: !206, size: 64, offset: 320)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !413, file: !222, line: 208, baseType: !206, size: 64, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !413, file: !222, line: 209, baseType: !417, size: 64, offset: 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !413, file: !222, line: 210, baseType: !417, size: 64, offset: 512)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !413, file: !222, line: 211, baseType: !417, size: 64, offset: 576)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !413, file: !222, line: 212, baseType: !417, size: 64, offset: 640)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !413, file: !222, line: 213, baseType: !417, size: 64, offset: 704)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !413, file: !222, line: 216, baseType: !79, size: 8, offset: 768)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !413, file: !222, line: 217, baseType: !79, size: 8, offset: 776)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !413, file: !222, line: 218, baseType: !79, size: 8, offset: 784)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !413, file: !222, line: 219, baseType: !432, size: 1024, offset: 800)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !357)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !413, file: !222, line: 220, baseType: !432, size: 1024, offset: 1824)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !413, file: !222, line: 221, baseType: !435, size: 256, offset: 2848)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 256, elements: !357)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !413, file: !222, line: 222, baseType: !79, size: 8, offset: 3104)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !413, file: !222, line: 223, baseType: !79, size: 8, offset: 3112)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !413, file: !222, line: 224, baseType: !79, size: 8, offset: 3120)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !413, file: !222, line: 225, baseType: !79, size: 8, offset: 3128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !132, file: !93, line: 577, baseType: !441, size: 1193984, offset: 5595392)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 1193984, elements: !357)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !132, file: !93, line: 578, baseType: !7, size: 32, offset: 6789376)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !132, file: !93, line: 579, baseType: !7, size: 32, offset: 6789408)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !132, file: !93, line: 580, baseType: !7, size: 32, offset: 6789440)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !132, file: !93, line: 581, baseType: !7, size: 32, offset: 6789472)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !132, file: !93, line: 584, baseType: !447, size: 64, offset: 6789504)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !93, line: 584, flags: DIFlagFwdDecl)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !132, file: !93, line: 586, baseType: !450, size: 64, offset: 6789568)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !93, line: 902, size: 416, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !458, !461, !462, !463, !464, !465, !466, !467}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !451, file: !93, line: 904, baseType: !31, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !451, file: !93, line: 905, baseType: !31, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !451, file: !93, line: 906, baseType: !7, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !451, file: !93, line: 907, baseType: !31, size: 32, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !451, file: !93, line: 908, baseType: !7, size: 32, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !451, file: !93, line: 909, baseType: !459, size: 64, offset: 160)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !460)
!460 = !{!110}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !451, file: !93, line: 910, baseType: !261, size: 8, offset: 224)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !451, file: !93, line: 911, baseType: !261, size: 8, offset: 232)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !451, file: !93, line: 912, baseType: !7, size: 32, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !451, file: !93, line: 913, baseType: !7, size: 32, offset: 288)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !451, file: !93, line: 915, baseType: !7, size: 32, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !451, file: !93, line: 916, baseType: !7, size: 32, offset: 352)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !451, file: !93, line: 917, baseType: !7, size: 32, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !132, file: !93, line: 587, baseType: !469, size: 64, offset: 6789632)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !93, line: 839, size: 512, elements: !471)
!471 = !{!472, !473, !476, !477, !478, !479}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !470, file: !93, line: 841, baseType: !7, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !470, file: !93, line: 842, baseType: !474, size: 96, offset: 32)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 96, elements: !162)
!475 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !470, file: !93, line: 843, baseType: !474, size: 96, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !470, file: !93, line: 844, baseType: !474, size: 96, offset: 224)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !470, file: !93, line: 845, baseType: !474, size: 96, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !470, file: !93, line: 846, baseType: !474, size: 96, offset: 416)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !132, file: !93, line: 588, baseType: !7, size: 32, offset: 6789696)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !132, file: !93, line: 591, baseType: !31, size: 32, offset: 6789728)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !132, file: !93, line: 592, baseType: !7, size: 32, offset: 6789760)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !132, file: !93, line: 593, baseType: !7, size: 32, offset: 6789792)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !132, file: !93, line: 594, baseType: !7, size: 32, offset: 6789824)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !132, file: !93, line: 595, baseType: !486, size: 64, offset: 6789888)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !93, line: 542, baseType: !128)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !132, file: !93, line: 596, baseType: !417, size: 64, offset: 6789952)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block_JV", scope: !132, file: !93, line: 597, baseType: !491, size: 192, offset: 6790016)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 192, elements: !162)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !93, line: 601, baseType: !7, size: 32, offset: 6790208)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !132, file: !93, line: 602, baseType: !7, size: 32, offset: 6790240)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !132, file: !93, line: 603, baseType: !7, size: 32, offset: 6790272)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !132, file: !93, line: 604, baseType: !7, size: 32, offset: 6790304)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !132, file: !93, line: 605, baseType: !7, size: 32, offset: 6790336)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !132, file: !93, line: 607, baseType: !498, size: 64, offset: 6790400)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode_JV", scope: !132, file: !93, line: 608, baseType: !500, size: 192, offset: 6790464)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 192, elements: !162)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !132, file: !93, line: 609, baseType: !502, size: 64, offset: 6790656)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "siblock", scope: !132, file: !93, line: 610, baseType: !394, size: 64, offset: 6790720)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "siblock_JV", scope: !132, file: !93, line: 611, baseType: !506, size: 192, offset: 6790784)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 192, elements: !162)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "newframe", scope: !132, file: !93, line: 613, baseType: !7, size: 32, offset: 6790976)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !132, file: !93, line: 614, baseType: !7, size: 32, offset: 6791008)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pNextSlice", scope: !132, file: !93, line: 617, baseType: !487, size: 64, offset: 6791040)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !132, file: !93, line: 618, baseType: !122, size: 64, offset: 6791104)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data_JV", scope: !132, file: !93, line: 619, baseType: !512, size: 192, offset: 6791168)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 192, elements: !162)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaArrayType", scope: !132, file: !93, line: 621, baseType: !7, size: 32, offset: 6791360)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_head", scope: !132, file: !93, line: 626, baseType: !515, size: 64, offset: 6791424)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !93, line: 626, flags: DIFlagFwdDecl)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_end", scope: !132, file: !93, line: 627, baseType: !515, size: 64, offset: 6791488)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !132, file: !93, line: 629, baseType: !31, size: 32, offset: 6791552)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "non_conforming_stream", scope: !132, file: !93, line: 630, baseType: !7, size: 32, offset: 6791584)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntMsb", scope: !132, file: !93, line: 634, baseType: !7, size: 32, offset: 6791616)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntLsb", scope: !132, file: !93, line: 635, baseType: !31, size: 32, offset: 6791648)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedPicOrderCnt", scope: !132, file: !93, line: 638, baseType: !7, size: 32, offset: 6791680)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntCycleCnt", scope: !132, file: !93, line: 638, baseType: !7, size: 32, offset: 6791712)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumInPicOrderCntCycle", scope: !132, file: !93, line: 638, baseType: !7, size: 32, offset: 6791744)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNum", scope: !132, file: !93, line: 639, baseType: !31, size: 32, offset: 6791776)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumOffset", scope: !132, file: !93, line: 639, baseType: !31, size: 32, offset: 6791808)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDeltaPerPicOrderCntCycle", scope: !132, file: !93, line: 640, baseType: !7, size: 32, offset: 6791840)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !132, file: !93, line: 641, baseType: !7, size: 32, offset: 6791872)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNumOffset", scope: !132, file: !93, line: 642, baseType: !7, size: 32, offset: 6791904)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFrameNum", scope: !132, file: !93, line: 645, baseType: !7, size: 32, offset: 6791936)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !132, file: !93, line: 647, baseType: !31, size: 32, offset: 6791968)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !132, file: !93, line: 648, baseType: !31, size: 32, offset: 6792000)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !132, file: !93, line: 649, baseType: !31, size: 32, offset: 6792032)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !132, file: !93, line: 650, baseType: !31, size: 32, offset: 6792064)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !132, file: !93, line: 651, baseType: !31, size: 32, offset: 6792096)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !132, file: !93, line: 652, baseType: !31, size: 32, offset: 6792128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "oldFrameSizeInMbs", scope: !132, file: !93, line: 653, baseType: !31, size: 32, offset: 6792160)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !132, file: !93, line: 655, baseType: !7, size: 32, offset: 6792192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !132, file: !93, line: 657, baseType: !7, size: 32, offset: 6792224)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !132, file: !93, line: 658, baseType: !7, size: 32, offset: 6792256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_bitsize_on_disk", scope: !132, file: !93, line: 661, baseType: !7, size: 32, offset: 6792288)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !132, file: !93, line: 662, baseType: !78, size: 16, offset: 6792320)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !132, file: !93, line: 663, baseType: !78, size: 16, offset: 6792336)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_scale", scope: !132, file: !93, line: 664, baseType: !459, size: 64, offset: 6792352)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !132, file: !93, line: 665, baseType: !7, size: 32, offset: 6792416)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !132, file: !93, line: 666, baseType: !7, size: 32, offset: 6792448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value_comp", scope: !132, file: !93, line: 667, baseType: !548, size: 96, offset: 6792480)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 96, elements: !162)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "max_pel_value_comp", scope: !132, file: !93, line: 668, baseType: !161, size: 96, offset: 6792576)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !132, file: !93, line: 670, baseType: !7, size: 32, offset: 6792672)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !132, file: !93, line: 671, baseType: !7, size: 32, offset: 6792704)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !132, file: !93, line: 672, baseType: !7, size: 32, offset: 6792736)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !132, file: !93, line: 673, baseType: !7, size: 32, offset: 6792768)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "num_uv_blocks", scope: !132, file: !93, line: 674, baseType: !7, size: 32, offset: 6792800)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !132, file: !93, line: 675, baseType: !7, size: 32, offset: 6792832)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !132, file: !93, line: 676, baseType: !7, size: 32, offset: 6792864)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !132, file: !93, line: 677, baseType: !7, size: 32, offset: 6792896)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x_blk", scope: !132, file: !93, line: 678, baseType: !7, size: 32, offset: 6792928)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y_blk", scope: !132, file: !93, line: 679, baseType: !7, size: 32, offset: 6792960)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !132, file: !93, line: 680, baseType: !561, size: 192, offset: 6792992)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !562)
!562 = !{!163, !110}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_blk", scope: !132, file: !93, line: 681, baseType: !561, size: 192, offset: 6793184)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_shift", scope: !132, file: !93, line: 682, baseType: !561, size: 192, offset: 6793376)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_x", scope: !132, file: !93, line: 683, baseType: !7, size: 32, offset: 6793568)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_y", scope: !132, file: !93, line: 684, baseType: !7, size: 32, offset: 6793600)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_x", scope: !132, file: !93, line: 685, baseType: !7, size: 32, offset: 6793632)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_y", scope: !132, file: !93, line: 686, baseType: !7, size: 32, offset: 6793664)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "total_scale", scope: !132, file: !93, line: 687, baseType: !7, size: 32, offset: 6793696)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "max_vmv_r", scope: !132, file: !93, line: 689, baseType: !7, size: 32, offset: 6793728)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "idr_psnr_number", scope: !132, file: !93, line: 692, baseType: !7, size: 32, offset: 6793760)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "psnr_number", scope: !132, file: !93, line: 693, baseType: !7, size: 32, offset: 6793792)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "last_ref_pic_poc", scope: !132, file: !93, line: 700, baseType: !7, size: 32, offset: 6793824)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !132, file: !93, line: 701, baseType: !7, size: 32, offset: 6793856)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !132, file: !93, line: 702, baseType: !7, size: 32, offset: 6793888)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !132, file: !93, line: 703, baseType: !7, size: 32, offset: 6793920)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "earlier_missing_poc", scope: !132, file: !93, line: 704, baseType: !7, size: 32, offset: 6793952)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_conceal", scope: !132, file: !93, line: 705, baseType: !31, size: 32, offset: 6793984)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "IDR_concealment_flag", scope: !132, file: !93, line: 706, baseType: !7, size: 32, offset: 6794016)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_slice_type", scope: !132, file: !93, line: 707, baseType: !7, size: 32, offset: 6794048)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point", scope: !132, file: !93, line: 710, baseType: !7, size: 32, offset: 6794080)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point_found", scope: !132, file: !93, line: 711, baseType: !7, size: 32, offset: 6794112)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_cnt", scope: !132, file: !93, line: 712, baseType: !7, size: 32, offset: 6794144)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_num", scope: !132, file: !93, line: 713, baseType: !7, size: 32, offset: 6794176)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_poc", scope: !132, file: !93, line: 714, baseType: !7, size: 32, offset: 6794208)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !132, file: !93, line: 716, baseType: !7, size: 32, offset: 6794240)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !132, file: !93, line: 717, baseType: !7, size: 32, offset: 6794272)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !132, file: !93, line: 719, baseType: !260, size: 64, offset: 6794304)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !132, file: !93, line: 720, baseType: !260, size: 64, offset: 6794368)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "imgData", scope: !132, file: !93, line: 722, baseType: !591, size: 2560, offset: 6794432)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageData", file: !592, line: 38, baseType: !593)
!592 = !DIFile(filename: "ldecod_src/inc/io_image.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "8caef624e6f5391b0c6ab2984e7f77c6")
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "image_data", file: !592, line: 20, size: 2560, elements: !594)
!594 = !{!595, !596, !602, !603, !604, !608, !609, !610, !611, !612}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !593, file: !592, line: 22, baseType: !151, size: 1088)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "frm_data", scope: !593, file: !592, line: 24, baseType: !597, size: 192, offset: 1088)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 192, elements: !162)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !262, line: 41, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !262, line: 23, baseType: !329)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "top_data", scope: !593, file: !592, line: 25, baseType: !597, size: 192, offset: 1280)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "bot_data", scope: !593, file: !592, line: 26, baseType: !597, size: 192, offset: 1472)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "frm_uint16", scope: !593, file: !592, line: 31, baseType: !605, size: 192, offset: 1664)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 192, elements: !162)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "top_uint16", scope: !593, file: !592, line: 32, baseType: !605, size: 192, offset: 1856)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "bot_uint16", scope: !593, file: !592, line: 33, baseType: !605, size: 192, offset: 2048)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "frm_stride", scope: !593, file: !592, line: 35, baseType: !161, size: 96, offset: 2240)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "top_stride", scope: !593, file: !592, line: 36, baseType: !161, size: 96, offset: 2336)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bot_stride", scope: !593, file: !592, line: 37, baseType: !161, size: 96, offset: 2432)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "imgData0", scope: !132, file: !93, line: 723, baseType: !591, size: 2560, offset: 6796992)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "imgData1", scope: !132, file: !93, line: 724, baseType: !591, size: 2560, offset: 6799552)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "imgData2", scope: !132, file: !93, line: 725, baseType: !591, size: 2560, offset: 6802112)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "imgData32", scope: !132, file: !93, line: 728, baseType: !591, size: 2560, offset: 6804672)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "imgData4", scope: !132, file: !93, line: 729, baseType: !591, size: 2560, offset: 6807232)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "imgData5", scope: !132, file: !93, line: 730, baseType: !591, size: 2560, offset: 6809792)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "imgData6", scope: !132, file: !93, line: 731, baseType: !591, size: 2560, offset: 6812352)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "previous_frame_num", scope: !132, file: !93, line: 735, baseType: !31, size: 32, offset: 6814912)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Is_primary_correct", scope: !132, file: !93, line: 737, baseType: !7, size: 32, offset: 6814944)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "Is_redundant_correct", scope: !132, file: !93, line: 738, baseType: !7, size: 32, offset: 6814976)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tot_time", scope: !132, file: !93, line: 741, baseType: !624, size: 64, offset: 6815040)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !625, line: 103, baseType: !626)
!625 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !627, line: 27, baseType: !628)
!627 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !629, line: 44, baseType: !630)
!629 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!630 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "p_out", scope: !132, file: !93, line: 744, baseType: !7, size: 32, offset: 6815104)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "p_out_mvc", scope: !132, file: !93, line: 746, baseType: !633, size: 32768, offset: 6815136)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32768, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 1024)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "p_ref", scope: !132, file: !93, line: 748, baseType: !7, size: 32, offset: 6847904)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessUnitExists", scope: !132, file: !93, line: 751, baseType: !7, size: 32, offset: 6847936)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "NALUCount", scope: !132, file: !93, line: 752, baseType: !7, size: 32, offset: 6847968)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "Bframe_ctr", scope: !132, file: !93, line: 755, baseType: !7, size: 32, offset: 6848000)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "frame_no", scope: !132, file: !93, line: 756, baseType: !7, size: 32, offset: 6848032)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "g_nFrame", scope: !132, file: !93, line: 758, baseType: !7, size: 32, offset: 6848064)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "global_init_done", scope: !132, file: !93, line: 759, baseType: !7, size: 32, offset: 6848096)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ref", scope: !132, file: !93, line: 762, baseType: !598, size: 64, offset: 6848128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV_ref", scope: !132, file: !93, line: 763, baseType: !645, size: 64, offset: 6848192)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "qp_per_matrix", scope: !132, file: !93, line: 765, baseType: !206, size: 64, offset: 6848256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "qp_rem_matrix", scope: !132, file: !93, line: 766, baseType: !206, size: 64, offset: 6848320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "last_out_fs", scope: !132, file: !93, line: 768, baseType: !649, size: 64, offset: 6848384)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !651, line: 152, size: 768, elements: !652)
!651 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!652 = !{!653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !778, !779, !780, !781, !782}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !650, file: !651, line: 154, baseType: !7, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !650, file: !651, line: 155, baseType: !7, size: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !650, file: !651, line: 156, baseType: !7, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !650, file: !651, line: 157, baseType: !7, size: 32, offset: 96)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !650, file: !651, line: 159, baseType: !7, size: 32, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !650, file: !651, line: 161, baseType: !31, size: 32, offset: 160)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !650, file: !651, line: 162, baseType: !31, size: 32, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !650, file: !651, line: 164, baseType: !7, size: 32, offset: 224)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !650, file: !651, line: 165, baseType: !7, size: 32, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !650, file: !651, line: 166, baseType: !7, size: 32, offset: 288)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !650, file: !651, line: 167, baseType: !7, size: 32, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !650, file: !651, line: 170, baseType: !7, size: 32, offset: 352)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !650, file: !651, line: 172, baseType: !666, size: 64, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !651, line: 138, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !651, line: 46, size: 3328, elements: !669)
!669 = !{!670, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !718, !720, !724, !726, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !668, file: !651, line: 48, baseType: !671, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !30, line: 140, baseType: !29)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !668, file: !651, line: 50, baseType: !7, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !668, file: !651, line: 51, baseType: !7, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !668, file: !651, line: 52, baseType: !7, size: 32, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !668, file: !651, line: 53, baseType: !7, size: 32, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !668, file: !651, line: 54, baseType: !31, size: 32, offset: 160)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !668, file: !651, line: 55, baseType: !31, size: 32, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !668, file: !651, line: 57, baseType: !7, size: 32, offset: 224)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !668, file: !651, line: 58, baseType: !7, size: 32, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !668, file: !651, line: 59, baseType: !7, size: 32, offset: 288)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !668, file: !651, line: 61, baseType: !261, size: 8, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !668, file: !651, line: 62, baseType: !7, size: 32, offset: 352)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !668, file: !651, line: 63, baseType: !7, size: 32, offset: 384)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !668, file: !651, line: 64, baseType: !7, size: 32, offset: 416)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !668, file: !651, line: 65, baseType: !7, size: 32, offset: 448)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !668, file: !651, line: 67, baseType: !78, size: 16, offset: 480)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !668, file: !651, line: 69, baseType: !7, size: 32, offset: 512)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !668, file: !651, line: 69, baseType: !7, size: 32, offset: 544)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !668, file: !651, line: 69, baseType: !7, size: 32, offset: 576)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !668, file: !651, line: 69, baseType: !7, size: 32, offset: 608)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !668, file: !651, line: 70, baseType: !7, size: 32, offset: 640)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !668, file: !651, line: 70, baseType: !7, size: 32, offset: 672)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !668, file: !651, line: 70, baseType: !7, size: 32, offset: 704)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !668, file: !651, line: 70, baseType: !7, size: 32, offset: 736)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !668, file: !651, line: 71, baseType: !7, size: 32, offset: 768)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !668, file: !651, line: 72, baseType: !7, size: 32, offset: 800)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !668, file: !651, line: 73, baseType: !31, size: 32, offset: 832)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !668, file: !651, line: 74, baseType: !31, size: 32, offset: 864)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !668, file: !651, line: 75, baseType: !7, size: 32, offset: 896)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !668, file: !651, line: 75, baseType: !7, size: 32, offset: 928)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !668, file: !651, line: 76, baseType: !7, size: 32, offset: 960)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !668, file: !651, line: 76, baseType: !7, size: 32, offset: 992)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !668, file: !651, line: 79, baseType: !598, size: 64, offset: 1024)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !668, file: !651, line: 80, baseType: !645, size: 64, offset: 1088)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !668, file: !651, line: 81, baseType: !645, size: 64, offset: 1152)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !668, file: !651, line: 84, baseType: !707, size: 64, offset: 1216)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !651, line: 36, size: 256, elements: !710)
!710 = !{!711, !714, !716}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !709, file: !651, line: 38, baseType: !712, size: 128)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 128, elements: !460)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !709, file: !651, line: 39, baseType: !715, size: 64, offset: 128)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !95, size: 64, elements: !460)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !709, file: !651, line: 40, baseType: !717, size: 16, offset: 192)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 16, elements: !460)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !668, file: !651, line: 85, baseType: !719, size: 192, offset: 1280)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 192, elements: !162)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !668, file: !651, line: 87, baseType: !721, size: 64, offset: 1472)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !651, line: 29, size: 64, elements: !722)
!722 = !{!723}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !721, file: !651, line: 31, baseType: !260, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !668, file: !651, line: 88, baseType: !725, size: 192, offset: 1536)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, size: 192, elements: !162)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !668, file: !651, line: 90, baseType: !727, size: 64, offset: 1728)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !668, file: !651, line: 92, baseType: !713, size: 64, offset: 1792)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !668, file: !651, line: 93, baseType: !713, size: 64, offset: 1856)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !668, file: !651, line: 94, baseType: !713, size: 64, offset: 1920)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !668, file: !651, line: 96, baseType: !7, size: 32, offset: 1984)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !668, file: !651, line: 97, baseType: !7, size: 32, offset: 2016)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !668, file: !651, line: 98, baseType: !7, size: 32, offset: 2048)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !668, file: !651, line: 99, baseType: !7, size: 32, offset: 2080)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !668, file: !651, line: 100, baseType: !7, size: 32, offset: 2112)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !668, file: !651, line: 102, baseType: !7, size: 32, offset: 2144)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !668, file: !651, line: 103, baseType: !7, size: 32, offset: 2176)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !668, file: !651, line: 104, baseType: !7, size: 32, offset: 2208)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !668, file: !651, line: 105, baseType: !7, size: 32, offset: 2240)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !668, file: !651, line: 106, baseType: !7, size: 32, offset: 2272)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !668, file: !651, line: 107, baseType: !7, size: 32, offset: 2304)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !668, file: !651, line: 108, baseType: !7, size: 32, offset: 2336)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !668, file: !651, line: 109, baseType: !7, size: 32, offset: 2368)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !668, file: !651, line: 110, baseType: !459, size: 64, offset: 2400)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !668, file: !651, line: 111, baseType: !7, size: 32, offset: 2464)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !668, file: !651, line: 112, baseType: !748, size: 64, offset: 2496)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !93, line: 194, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !93, line: 186, size: 256, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !750, file: !93, line: 188, baseType: !7, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !750, file: !93, line: 189, baseType: !7, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !750, file: !93, line: 190, baseType: !7, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !750, file: !93, line: 191, baseType: !7, size: 32, offset: 96)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !750, file: !93, line: 192, baseType: !7, size: 32, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !750, file: !93, line: 193, baseType: !758, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !668, file: !651, line: 115, baseType: !7, size: 32, offset: 2560)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !668, file: !651, line: 118, baseType: !7, size: 32, offset: 2592)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !668, file: !651, line: 119, baseType: !7, size: 32, offset: 2624)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !668, file: !651, line: 120, baseType: !7, size: 32, offset: 2656)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !668, file: !651, line: 121, baseType: !599, size: 64, offset: 2688)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !668, file: !651, line: 124, baseType: !7, size: 32, offset: 2752)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !668, file: !651, line: 125, baseType: !7, size: 32, offset: 2784)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !668, file: !651, line: 126, baseType: !7, size: 32, offset: 2816)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !668, file: !651, line: 128, baseType: !7, size: 32, offset: 2848)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !668, file: !651, line: 129, baseType: !7, size: 32, offset: 2880)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !668, file: !651, line: 130, baseType: !7, size: 32, offset: 2912)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !668, file: !651, line: 131, baseType: !7, size: 32, offset: 2944)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !668, file: !651, line: 132, baseType: !598, size: 64, offset: 3008)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !668, file: !651, line: 133, baseType: !7, size: 32, offset: 3072)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !668, file: !651, line: 134, baseType: !7, size: 32, offset: 3104)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !668, file: !651, line: 136, baseType: !717, size: 16, offset: 3136)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !668, file: !651, line: 137, baseType: !776, size: 128, offset: 3200)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 128, elements: !460)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !650, file: !651, line: 173, baseType: !666, size: 64, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !650, file: !651, line: 174, baseType: !666, size: 64, offset: 512)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !650, file: !651, line: 177, baseType: !7, size: 32, offset: 576)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !650, file: !651, line: 178, baseType: !459, size: 64, offset: 608)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !650, file: !651, line: 179, baseType: !459, size: 64, offset: 672)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "pocs_in_dpb", scope: !132, file: !93, line: 769, baseType: !784, size: 3200, offset: 6848448)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3200, elements: !785)
!785 = !{!786}
!786 = !DISubrange(count: 100)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture", scope: !132, file: !93, line: 771, baseType: !713, size: 64, offset: 6851648)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture_JV", scope: !132, file: !93, line: 772, baseType: !789, size: 192, offset: 6851712)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 192, elements: !162)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "no_reference_picture", scope: !132, file: !93, line: 773, baseType: !713, size: 64, offset: 6851904)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "erc_object_list", scope: !132, file: !93, line: 776, baseType: !792, size: 64, offset: 6851968)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "object_buffer", file: !93, line: 776, flags: DIFlagFwdDecl)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "erc_errorVar", scope: !132, file: !93, line: 777, baseType: !795, size: 64, offset: 6852032)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "ercVariables_s", file: !93, line: 777, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "erc_mvperMB", scope: !132, file: !93, line: 779, baseType: !7, size: 32, offset: 6852096)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "erc_img", scope: !132, file: !93, line: 780, baseType: !131, size: 64, offset: 6852160)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ec_flag", scope: !132, file: !93, line: 781, baseType: !800, size: 640, offset: 6852224)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 640, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 20)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "annex_b", scope: !132, file: !93, line: 783, baseType: !804, size: 64, offset: 6852864)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DICompositeType(tag: DW_TAG_structure_type, name: "annex_b_struct", file: !93, line: 783, flags: DIFlagFwdDecl)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bitsfile", scope: !132, file: !93, line: 784, baseType: !807, size: 64, offset: 6852928)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "sBitsFile", file: !93, line: 784, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "out_buffer", scope: !132, file: !93, line: 786, baseType: !649, size: 64, offset: 6852992)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output", scope: !132, file: !93, line: 788, baseType: !713, size: 64, offset: 6853056)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output_state", scope: !132, file: !93, line: 789, baseType: !7, size: 32, offset: 6853120)
