; ModuleID = 'ldecod_src/mc_prediction.c'
source_filename = "ldecod_src/mc_prediction.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.pix_pos = type { i32, i32, i16, i16, i16, i16 }
%struct.pic_motion_params = type { [2 x ptr], [2 x %struct.MotionVector], [2 x i8] }
%struct.MotionVector = type { i16, i16 }
%struct.macroblock = type { ptr, ptr, ptr, i32, %struct.BlockPos, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], [3 x i32], i32, i32, i32, i32, i16, i8, i8, i16, i16, ptr, ptr, ptr, ptr, i16, [2 x [4 x [4 x [2 x i16]]]], i32, [3 x i64], [3 x i64], [3 x i64], i32, [4 x i8], [4 x i8], i8, i8, i8, i16, i16, i16, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, i8 }
%struct.BlockPos = type { i16, i16 }


!93 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!94 = !{!95, !0, !101, !110, !1345, !1350, !1355, !1404, !1480}
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(scope: null, file: !3, line: 899, type: !97, isLocal: true, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 504, elements: !99)
!98 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!99 = !{!100}
!100 = !DISubrange(count: 63)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "subblk_offset_x", scope: !2, file: !103, line: 34, type: !104, isLocal: true, isDefinition: true)
!103 = !DIFile(filename: "ldecod_src/inc/block.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e90b7727b4f0f4492b5dc2d8d9d6a429")
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 768, elements: !106)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !88)
!106 = !{!107, !108, !109}
!107 = !DISubrange(count: 3)
!108 = !DISubrange(count: 8)
!109 = !DISubrange(count: 4)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "mv_mul", scope: !112, file: !3, line: 1343, type: !1344, isLocal: true, isDefinition: true)
!112 = distinct !DISubprogram(name: "perform_mc_single_wp", scope: !3, file: !3, line: 1336, type: !113, scopeLine: 1337, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1287)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !115, !86, !655, !7, !7, !7, !7, !7}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !117, line: 273, baseType: !118)
!117 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !117, line: 197, size: 3840, elements: !119)
!119 = !{!120, !1203, !1204, !1205, !1206, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1235, !1236, !1237, !1238, !1239, !1242, !1243, !1245, !1246, !1247, !1248, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1272, !1273, !1278, !1282, !1286}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !118, file: !117, line: 199, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !117, line: 341, size: 109184, elements: !123)
!123 = !{!124, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !978, !980, !1033, !1062, !1089, !1092, !1093, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1128, !1129, !1130, !1131, !1132, !1133, !1136, !1137, !1140, !1141, !1143, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1156, !1157, !1158, !1159, !1160, !1162, !1163, !1164, !1168, !1172, !1176, !1180, !1184, !1185, !1186, !1187, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !122, file: !117, line: 343, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !117, line: 566, size: 6855040, elements: !127)
!127 = !{!128, !212, !266, !369, !371, !373, !430, !432, !433, !434, !435, !436, !439, !459, !471, !472, !473, !474, !475, !476, !480, !481, !483, !484, !485, !486, !487, !488, !490, !492, !495, !496, !498, !499, !500, !501, !502, !504, !505, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !620, !621, !625, !626, !627, !628, !629, !630, !631, !632, !633, !635, !636, !637, !777, !781, !782, !784, !785, !788, !791, !792, !793, !797, !800, !803, !804, !805, !806, !807, !808, !834, !835, !837, !841, !842, !843, !844, !847, !852, !866, !870, !874, !875, !879, !880, !884, !885, !889, !910, !911, !914, !915, !916, !917, !918, !919, !920, !921}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !126, file: !117, line: 568, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !117, line: 850, size: 32128, elements: !131)
!131 = !{!132, !136, !137, !138, !139, !140, !141, !142, !143, !144, !173, !174, !175, !176, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !130, file: !117, line: 852, baseType: !133, size: 2040)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 2040, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 255)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !130, file: !117, line: 853, baseType: !133, size: 2040, offset: 2040)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !130, file: !117, line: 854, baseType: !133, size: 2040, offset: 4080)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !130, file: !117, line: 856, baseType: !7, size: 32, offset: 6144)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !130, file: !117, line: 857, baseType: !7, size: 32, offset: 6176)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !130, file: !117, line: 858, baseType: !7, size: 32, offset: 6208)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !130, file: !117, line: 859, baseType: !7, size: 32, offset: 6240)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !130, file: !117, line: 860, baseType: !7, size: 32, offset: 6272)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !130, file: !117, line: 861, baseType: !7, size: 32, offset: 6304)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !130, file: !117, line: 864, baseType: !145, size: 1088, offset: 6336)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !6, line: 52, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !6, line: 30, size: 1088, elements: !147)
!147 = !{!148, !150, !152, !154, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !146, file: !6, line: 32, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !6, line: 28, baseType: !5)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !146, file: !6, line: 33, baseType: !151, size: 32, offset: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !6, line: 20, baseType: !14)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !146, file: !6, line: 34, baseType: !153, size: 64, offset: 64)
!153 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !146, file: !6, line: 35, baseType: !155, size: 96, offset: 128)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !156)
!156 = !{!107}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !146, file: !6, line: 36, baseType: !155, size: 96, offset: 224)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !146, file: !6, line: 37, baseType: !7, size: 32, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !146, file: !6, line: 38, baseType: !7, size: 32, offset: 352)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !146, file: !6, line: 39, baseType: !7, size: 32, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !146, file: !6, line: 40, baseType: !7, size: 32, offset: 416)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !146, file: !6, line: 41, baseType: !7, size: 32, offset: 448)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !146, file: !6, line: 42, baseType: !7, size: 32, offset: 480)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !146, file: !6, line: 43, baseType: !7, size: 32, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !146, file: !6, line: 44, baseType: !7, size: 32, offset: 544)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !146, file: !6, line: 45, baseType: !155, size: 96, offset: 576)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !146, file: !6, line: 46, baseType: !7, size: 32, offset: 672)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !146, file: !6, line: 47, baseType: !155, size: 96, offset: 704)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !146, file: !6, line: 48, baseType: !155, size: 96, offset: 800)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !146, file: !6, line: 49, baseType: !155, size: 96, offset: 896)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !146, file: !6, line: 50, baseType: !7, size: 32, offset: 992)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !146, file: !6, line: 51, baseType: !7, size: 32, offset: 1024)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !130, file: !117, line: 865, baseType: !145, size: 1088, offset: 7424)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !130, file: !117, line: 867, baseType: !7, size: 32, offset: 8512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !130, file: !117, line: 868, baseType: !7, size: 32, offset: 8544)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !130, file: !117, line: 869, baseType: !177, size: 7744, offset: 8576)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !21, line: 60, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !21, line: 34, size: 7744, elements: !179)
!179 = !{!180, !181, !182, !183, !184, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !178, file: !21, line: 37, baseType: !133, size: 2040)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !178, file: !21, line: 38, baseType: !133, size: 2040, offset: 2040)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !178, file: !21, line: 39, baseType: !133, size: 2040, offset: 4080)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !178, file: !21, line: 40, baseType: !7, size: 32, offset: 6144)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !178, file: !21, line: 41, baseType: !185, size: 32, offset: 6176)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !21, line: 32, baseType: !20)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !178, file: !21, line: 42, baseType: !145, size: 1088, offset: 6208)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !178, file: !21, line: 43, baseType: !7, size: 32, offset: 7296)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !178, file: !21, line: 44, baseType: !7, size: 32, offset: 7328)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !178, file: !21, line: 45, baseType: !7, size: 32, offset: 7360)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !178, file: !21, line: 46, baseType: !7, size: 32, offset: 7392)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !178, file: !21, line: 47, baseType: !7, size: 32, offset: 7424)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !178, file: !21, line: 48, baseType: !7, size: 32, offset: 7456)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !178, file: !21, line: 49, baseType: !7, size: 32, offset: 7488)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !178, file: !21, line: 50, baseType: !7, size: 32, offset: 7520)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !178, file: !21, line: 51, baseType: !7, size: 32, offset: 7552)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !178, file: !21, line: 52, baseType: !7, size: 32, offset: 7584)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !178, file: !21, line: 53, baseType: !7, size: 32, offset: 7616)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !178, file: !21, line: 56, baseType: !199, size: 64, offset: 7680)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !130, file: !117, line: 870, baseType: !177, size: 7744, offset: 16320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !130, file: !117, line: 871, baseType: !177, size: 7744, offset: 24064)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !130, file: !117, line: 873, baseType: !7, size: 32, offset: 31808)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !130, file: !117, line: 884, baseType: !7, size: 32, offset: 31840)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !130, file: !117, line: 885, baseType: !7, size: 32, offset: 31872)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !130, file: !117, line: 886, baseType: !7, size: 32, offset: 31904)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !130, file: !117, line: 890, baseType: !7, size: 32, offset: 31936)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !130, file: !117, line: 893, baseType: !7, size: 32, offset: 31968)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !130, file: !117, line: 894, baseType: !7, size: 32, offset: 32000)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !130, file: !117, line: 895, baseType: !7, size: 32, offset: 32032)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !130, file: !117, line: 897, baseType: !7, size: 32, offset: 32064)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !130, file: !117, line: 899, baseType: !7, size: 32, offset: 32096)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !126, file: !117, line: 569, baseType: !213, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !215, line: 138, baseType: !216)
!215 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !215, line: 94, size: 17728, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223, !224, !228, !233, !237, !240, !241, !242, !243, !244, !247, !248, !249, !250, !251, !252, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !216, file: !215, line: 96, baseType: !7, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !216, file: !215, line: 97, baseType: !31, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !216, file: !215, line: 98, baseType: !31, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !216, file: !215, line: 99, baseType: !7, size: 32, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !216, file: !215, line: 100, baseType: !7, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !216, file: !215, line: 102, baseType: !7, size: 32, offset: 160)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !216, file: !215, line: 103, baseType: !225, size: 384, offset: 192)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 384, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 12)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !216, file: !215, line: 104, baseType: !229, size: 3072, offset: 576)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3072, elements: !230)
!230 = !{!231, !232}
!231 = !DISubrange(count: 6)
!232 = !DISubrange(count: 16)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !216, file: !215, line: 105, baseType: !234, size: 12288, offset: 3648)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 12288, elements: !235)
!235 = !{!231, !236}
!236 = !DISubrange(count: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !216, file: !215, line: 106, baseType: !238, size: 192, offset: 15936)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !239)
!239 = !{!231}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !216, file: !215, line: 107, baseType: !238, size: 192, offset: 16128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !216, file: !215, line: 110, baseType: !7, size: 32, offset: 16320)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !216, file: !215, line: 111, baseType: !31, size: 32, offset: 16352)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !216, file: !215, line: 112, baseType: !31, size: 32, offset: 16384)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !216, file: !215, line: 114, baseType: !245, size: 256, offset: 16416)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 256, elements: !246)
!246 = !{!108}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !216, file: !215, line: 116, baseType: !245, size: 256, offset: 16672)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !216, file: !215, line: 117, baseType: !245, size: 256, offset: 16928)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !216, file: !215, line: 119, baseType: !7, size: 32, offset: 17184)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !216, file: !215, line: 120, baseType: !31, size: 32, offset: 17216)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !216, file: !215, line: 122, baseType: !31, size: 32, offset: 17248)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !216, file: !215, line: 123, baseType: !253, size: 64, offset: 17280)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !90, line: 21, baseType: !88)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !216, file: !215, line: 125, baseType: !7, size: 32, offset: 17344)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !216, file: !215, line: 126, baseType: !7, size: 32, offset: 17376)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !216, file: !215, line: 127, baseType: !7, size: 32, offset: 17408)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !216, file: !215, line: 128, baseType: !31, size: 32, offset: 17440)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !216, file: !215, line: 129, baseType: !7, size: 32, offset: 17472)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !216, file: !215, line: 130, baseType: !7, size: 32, offset: 17504)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !216, file: !215, line: 131, baseType: !7, size: 32, offset: 17536)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !216, file: !215, line: 133, baseType: !7, size: 32, offset: 17568)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !216, file: !215, line: 135, baseType: !7, size: 32, offset: 17600)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !216, file: !215, line: 136, baseType: !7, size: 32, offset: 17632)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !216, file: !215, line: 137, baseType: !7, size: 32, offset: 17664)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !126, file: !117, line: 570, baseType: !267, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !215, line: 197, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !215, line: 142, size: 33024, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !367, !368}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !269, file: !215, line: 144, baseType: !7, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !269, file: !215, line: 146, baseType: !31, size: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !269, file: !215, line: 147, baseType: !7, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !269, file: !215, line: 148, baseType: !7, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !269, file: !215, line: 149, baseType: !7, size: 32, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !269, file: !215, line: 150, baseType: !7, size: 32, offset: 160)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !269, file: !215, line: 152, baseType: !7, size: 32, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !269, file: !215, line: 154, baseType: !31, size: 32, offset: 224)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !269, file: !215, line: 155, baseType: !31, size: 32, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !269, file: !215, line: 156, baseType: !31, size: 32, offset: 288)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !269, file: !215, line: 158, baseType: !7, size: 32, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !269, file: !215, line: 159, baseType: !225, size: 384, offset: 352)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !269, file: !215, line: 160, baseType: !229, size: 3072, offset: 736)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !269, file: !215, line: 161, baseType: !234, size: 12288, offset: 3808)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !269, file: !215, line: 162, baseType: !238, size: 192, offset: 16096)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !269, file: !215, line: 163, baseType: !238, size: 192, offset: 16288)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !269, file: !215, line: 165, baseType: !31, size: 32, offset: 16480)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !269, file: !215, line: 166, baseType: !31, size: 32, offset: 16512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !269, file: !215, line: 167, baseType: !31, size: 32, offset: 16544)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !269, file: !215, line: 168, baseType: !31, size: 32, offset: 16576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !269, file: !215, line: 170, baseType: !31, size: 32, offset: 16608)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !269, file: !215, line: 172, baseType: !7, size: 32, offset: 16640)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !269, file: !215, line: 173, baseType: !7, size: 32, offset: 16672)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !269, file: !215, line: 174, baseType: !7, size: 32, offset: 16704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !269, file: !215, line: 175, baseType: !31, size: 32, offset: 16736)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !269, file: !215, line: 177, baseType: !297, size: 8192, offset: 16768)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !298)
!298 = !{!299}
!299 = !DISubrange(count: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !269, file: !215, line: 178, baseType: !31, size: 32, offset: 24960)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !269, file: !215, line: 179, baseType: !7, size: 32, offset: 24992)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !269, file: !215, line: 180, baseType: !31, size: 32, offset: 25024)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !269, file: !215, line: 181, baseType: !31, size: 32, offset: 25056)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !269, file: !215, line: 182, baseType: !7, size: 32, offset: 25088)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !269, file: !215, line: 184, baseType: !7, size: 32, offset: 25120)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !269, file: !215, line: 185, baseType: !7, size: 32, offset: 25152)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !269, file: !215, line: 186, baseType: !7, size: 32, offset: 25184)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !269, file: !215, line: 187, baseType: !31, size: 32, offset: 25216)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !269, file: !215, line: 188, baseType: !31, size: 32, offset: 25248)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !269, file: !215, line: 189, baseType: !31, size: 32, offset: 25280)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !269, file: !215, line: 190, baseType: !31, size: 32, offset: 25312)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !269, file: !215, line: 191, baseType: !7, size: 32, offset: 25344)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !269, file: !215, line: 192, baseType: !314, size: 7584, offset: 25376)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !215, line: 90, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !215, line: 53, size: 7584, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !315, file: !215, line: 55, baseType: !7, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !315, file: !215, line: 56, baseType: !31, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !315, file: !215, line: 57, baseType: !92, size: 16, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !315, file: !215, line: 58, baseType: !92, size: 16, offset: 80)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !315, file: !215, line: 59, baseType: !7, size: 32, offset: 96)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !315, file: !215, line: 60, baseType: !7, size: 32, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !315, file: !215, line: 61, baseType: !7, size: 32, offset: 160)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !315, file: !215, line: 62, baseType: !31, size: 32, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !315, file: !215, line: 63, baseType: !7, size: 32, offset: 224)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !315, file: !215, line: 64, baseType: !7, size: 32, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !315, file: !215, line: 65, baseType: !31, size: 32, offset: 288)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !315, file: !215, line: 66, baseType: !31, size: 32, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !315, file: !215, line: 67, baseType: !31, size: 32, offset: 352)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !315, file: !215, line: 68, baseType: !7, size: 32, offset: 384)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !315, file: !215, line: 69, baseType: !31, size: 32, offset: 416)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !315, file: !215, line: 70, baseType: !31, size: 32, offset: 448)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !315, file: !215, line: 71, baseType: !7, size: 32, offset: 480)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !315, file: !215, line: 72, baseType: !31, size: 32, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !315, file: !215, line: 73, baseType: !31, size: 32, offset: 544)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !315, file: !215, line: 74, baseType: !7, size: 32, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !315, file: !215, line: 75, baseType: !7, size: 32, offset: 608)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !315, file: !215, line: 76, baseType: !339, size: 3296, offset: 640)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !215, line: 50, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !215, line: 38, size: 3296, elements: !341)
!341 = !{!342, !343, !344, !345, !349, !350, !351, !352, !353, !354}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !340, file: !215, line: 40, baseType: !31, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !340, file: !215, line: 41, baseType: !31, size: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !340, file: !215, line: 42, baseType: !31, size: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !340, file: !215, line: 43, baseType: !346, size: 1024, offset: 96)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1024, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !340, file: !215, line: 44, baseType: !346, size: 1024, offset: 1120)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !340, file: !215, line: 45, baseType: !346, size: 1024, offset: 2144)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !340, file: !215, line: 46, baseType: !31, size: 32, offset: 3168)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !340, file: !215, line: 47, baseType: !31, size: 32, offset: 3200)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !340, file: !215, line: 48, baseType: !31, size: 32, offset: 3232)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !340, file: !215, line: 49, baseType: !31, size: 32, offset: 3264)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !315, file: !215, line: 77, baseType: !7, size: 32, offset: 3936)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !315, file: !215, line: 78, baseType: !339, size: 3296, offset: 3968)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !315, file: !215, line: 80, baseType: !7, size: 32, offset: 7264)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !315, file: !215, line: 81, baseType: !7, size: 32, offset: 7296)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !315, file: !215, line: 82, baseType: !7, size: 32, offset: 7328)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !315, file: !215, line: 83, baseType: !7, size: 32, offset: 7360)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !315, file: !215, line: 84, baseType: !31, size: 32, offset: 7392)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !315, file: !215, line: 85, baseType: !31, size: 32, offset: 7424)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !315, file: !215, line: 86, baseType: !31, size: 32, offset: 7456)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !315, file: !215, line: 87, baseType: !31, size: 32, offset: 7488)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !315, file: !215, line: 88, baseType: !31, size: 32, offset: 7520)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !315, file: !215, line: 89, baseType: !31, size: 32, offset: 7552)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !269, file: !215, line: 193, baseType: !31, size: 32, offset: 32960)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !269, file: !215, line: 195, baseType: !7, size: 32, offset: 32992)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !126, file: !117, line: 571, baseType: !370, size: 1056768, offset: 192)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 1056768, elements: !347)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !126, file: !117, line: 572, baseType: !372, size: 4538368, offset: 1056960)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 4538368, elements: !298)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !126, file: !117, line: 575, baseType: !374, size: 64, offset: 5595328)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !215, line: 256, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !215, line: 228, size: 37312, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !398, !399, !400, !401}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !376, file: !215, line: 230, baseType: !268, size: 33024)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !376, file: !215, line: 232, baseType: !31, size: 32, offset: 33024)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !376, file: !215, line: 233, baseType: !7, size: 32, offset: 33056)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !376, file: !215, line: 234, baseType: !199, size: 64, offset: 33088)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !376, file: !215, line: 235, baseType: !199, size: 64, offset: 33152)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !376, file: !215, line: 236, baseType: !384, size: 64, offset: 33216)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !376, file: !215, line: 237, baseType: !199, size: 64, offset: 33280)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !376, file: !215, line: 238, baseType: !384, size: 64, offset: 33344)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !376, file: !215, line: 240, baseType: !199, size: 64, offset: 33408)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !376, file: !215, line: 241, baseType: !384, size: 64, offset: 33472)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !376, file: !215, line: 242, baseType: !199, size: 64, offset: 33536)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !376, file: !215, line: 243, baseType: !384, size: 64, offset: 33600)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !376, file: !215, line: 245, baseType: !7, size: 32, offset: 33664)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !376, file: !215, line: 246, baseType: !199, size: 64, offset: 33728)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !376, file: !215, line: 247, baseType: !199, size: 64, offset: 33792)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !376, file: !215, line: 248, baseType: !384, size: 64, offset: 33856)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !376, file: !215, line: 249, baseType: !384, size: 64, offset: 33920)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !376, file: !215, line: 250, baseType: !397, size: 64, offset: 33984)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !376, file: !215, line: 251, baseType: !384, size: 64, offset: 34048)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !376, file: !215, line: 253, baseType: !31, size: 32, offset: 34112)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !376, file: !215, line: 254, baseType: !7, size: 32, offset: 34144)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !376, file: !215, line: 255, baseType: !402, size: 3136, offset: 34176)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !215, line: 226, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !215, line: 200, size: 3136, elements: !404)
!404 = !{!405, !406, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !423, !424, !426, !427, !428, !429}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !403, file: !215, line: 202, baseType: !7, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !403, file: !215, line: 203, baseType: !407, size: 64, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !403, file: !215, line: 204, baseType: !199, size: 64, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !403, file: !215, line: 205, baseType: !384, size: 64, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !403, file: !215, line: 206, baseType: !407, size: 64, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !403, file: !215, line: 207, baseType: !199, size: 64, offset: 320)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !403, file: !215, line: 208, baseType: !199, size: 64, offset: 384)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !403, file: !215, line: 209, baseType: !407, size: 64, offset: 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !403, file: !215, line: 210, baseType: !407, size: 64, offset: 512)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !403, file: !215, line: 211, baseType: !407, size: 64, offset: 576)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !403, file: !215, line: 212, baseType: !407, size: 64, offset: 640)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !403, file: !215, line: 213, baseType: !407, size: 64, offset: 704)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !403, file: !215, line: 216, baseType: !87, size: 8, offset: 768)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !403, file: !215, line: 217, baseType: !87, size: 8, offset: 776)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !403, file: !215, line: 218, baseType: !87, size: 8, offset: 784)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !403, file: !215, line: 219, baseType: !422, size: 1024, offset: 800)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !347)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !403, file: !215, line: 220, baseType: !422, size: 1024, offset: 1824)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !403, file: !215, line: 221, baseType: !425, size: 256, offset: 2848)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 256, elements: !347)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !403, file: !215, line: 222, baseType: !87, size: 8, offset: 3104)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !403, file: !215, line: 223, baseType: !87, size: 8, offset: 3112)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !403, file: !215, line: 224, baseType: !87, size: 8, offset: 3120)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !403, file: !215, line: 225, baseType: !87, size: 8, offset: 3128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !126, file: !117, line: 577, baseType: !431, size: 1193984, offset: 5595392)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !375, size: 1193984, elements: !347)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !126, file: !117, line: 578, baseType: !7, size: 32, offset: 6789376)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !126, file: !117, line: 579, baseType: !7, size: 32, offset: 6789408)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !126, file: !117, line: 580, baseType: !7, size: 32, offset: 6789440)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !126, file: !117, line: 581, baseType: !7, size: 32, offset: 6789472)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !126, file: !117, line: 584, baseType: !437, size: 64, offset: 6789504)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !117, line: 584, flags: DIFlagFwdDecl)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !126, file: !117, line: 586, baseType: !440, size: 64, offset: 6789568)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !117, line: 902, size: 416, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !448, !452, !453, !454, !455, !456, !457, !458}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !441, file: !117, line: 904, baseType: !31, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !441, file: !117, line: 905, baseType: !31, size: 32, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !441, file: !117, line: 906, baseType: !7, size: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !441, file: !117, line: 907, baseType: !31, size: 32, offset: 96)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !441, file: !117, line: 908, baseType: !7, size: 32, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !441, file: !117, line: 909, baseType: !449, size: 64, offset: 160)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !450)
!450 = !{!451}
!451 = !DISubrange(count: 2)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !441, file: !117, line: 910, baseType: !254, size: 8, offset: 224)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !441, file: !117, line: 911, baseType: !254, size: 8, offset: 232)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !441, file: !117, line: 912, baseType: !7, size: 32, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !441, file: !117, line: 913, baseType: !7, size: 32, offset: 288)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !441, file: !117, line: 915, baseType: !7, size: 32, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !441, file: !117, line: 916, baseType: !7, size: 32, offset: 352)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !441, file: !117, line: 917, baseType: !7, size: 32, offset: 384)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !126, file: !117, line: 587, baseType: !460, size: 64, offset: 6789632)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !117, line: 839, size: 512, elements: !462)
!462 = !{!463, !464, !467, !468, !469, !470}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !461, file: !117, line: 841, baseType: !7, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !461, file: !117, line: 842, baseType: !465, size: 96, offset: 32)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 96, elements: !156)
!466 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !461, file: !117, line: 843, baseType: !465, size: 96, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !461, file: !117, line: 844, baseType: !465, size: 96, offset: 224)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !461, file: !117, line: 845, baseType: !465, size: 96, offset: 320)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !461, file: !117, line: 846, baseType: !465, size: 96, offset: 416)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !126, file: !117, line: 588, baseType: !7, size: 32, offset: 6789696)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !126, file: !117, line: 591, baseType: !31, size: 32, offset: 6789728)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !126, file: !117, line: 592, baseType: !7, size: 32, offset: 6789760)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !126, file: !117, line: 593, baseType: !7, size: 32, offset: 6789792)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !126, file: !117, line: 594, baseType: !7, size: 32, offset: 6789824)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !126, file: !117, line: 595, baseType: !477, size: 64, offset: 6789888)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !117, line: 542, baseType: !122)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !126, file: !117, line: 596, baseType: !407, size: 64, offset: 6789952)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block_JV", scope: !126, file: !117, line: 597, baseType: !482, size: 192, offset: 6790016)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 192, elements: !156)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !126, file: !117, line: 601, baseType: !7, size: 32, offset: 6790208)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !126, file: !117, line: 602, baseType: !7, size: 32, offset: 6790240)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !126, file: !117, line: 603, baseType: !7, size: 32, offset: 6790272)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !126, file: !117, line: 604, baseType: !7, size: 32, offset: 6790304)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !126, file: !117, line: 605, baseType: !7, size: 32, offset: 6790336)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !126, file: !117, line: 607, baseType: !489, size: 64, offset: 6790400)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode_JV", scope: !126, file: !117, line: 608, baseType: !491, size: 192, offset: 6790464)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 192, elements: !156)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !126, file: !117, line: 609, baseType: !493, size: 64, offset: 6790656)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "siblock", scope: !126, file: !117, line: 610, baseType: !384, size: 64, offset: 6790720)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "siblock_JV", scope: !126, file: !117, line: 611, baseType: !497, size: 192, offset: 6790784)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 192, elements: !156)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "newframe", scope: !126, file: !117, line: 613, baseType: !7, size: 32, offset: 6790976)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !126, file: !117, line: 614, baseType: !7, size: 32, offset: 6791008)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pNextSlice", scope: !126, file: !117, line: 617, baseType: !478, size: 64, offset: 6791040)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !126, file: !117, line: 618, baseType: !115, size: 64, offset: 6791104)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data_JV", scope: !126, file: !117, line: 619, baseType: !503, size: 192, offset: 6791168)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 192, elements: !156)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaArrayType", scope: !126, file: !117, line: 621, baseType: !7, size: 32, offset: 6791360)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_head", scope: !126, file: !117, line: 626, baseType: !506, size: 64, offset: 6791424)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !117, line: 626, flags: DIFlagFwdDecl)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_end", scope: !126, file: !117, line: 627, baseType: !506, size: 64, offset: 6791488)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !126, file: !117, line: 629, baseType: !31, size: 32, offset: 6791552)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "non_conforming_stream", scope: !126, file: !117, line: 630, baseType: !7, size: 32, offset: 6791584)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntMsb", scope: !126, file: !117, line: 634, baseType: !7, size: 32, offset: 6791616)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntLsb", scope: !126, file: !117, line: 635, baseType: !31, size: 32, offset: 6791648)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedPicOrderCnt", scope: !126, file: !117, line: 638, baseType: !7, size: 32, offset: 6791680)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntCycleCnt", scope: !126, file: !117, line: 638, baseType: !7, size: 32, offset: 6791712)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumInPicOrderCntCycle", scope: !126, file: !117, line: 638, baseType: !7, size: 32, offset: 6791744)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNum", scope: !126, file: !117, line: 639, baseType: !31, size: 32, offset: 6791776)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumOffset", scope: !126, file: !117, line: 639, baseType: !31, size: 32, offset: 6791808)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDeltaPerPicOrderCntCycle", scope: !126, file: !117, line: 640, baseType: !7, size: 32, offset: 6791840)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !126, file: !117, line: 641, baseType: !7, size: 32, offset: 6791872)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNumOffset", scope: !126, file: !117, line: 642, baseType: !7, size: 32, offset: 6791904)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFrameNum", scope: !126, file: !117, line: 645, baseType: !7, size: 32, offset: 6791936)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !126, file: !117, line: 647, baseType: !31, size: 32, offset: 6791968)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !126, file: !117, line: 648, baseType: !31, size: 32, offset: 6792000)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !126, file: !117, line: 649, baseType: !31, size: 32, offset: 6792032)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !126, file: !117, line: 650, baseType: !31, size: 32, offset: 6792064)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !126, file: !117, line: 651, baseType: !31, size: 32, offset: 6792096)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !126, file: !117, line: 652, baseType: !31, size: 32, offset: 6792128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "oldFrameSizeInMbs", scope: !126, file: !117, line: 653, baseType: !31, size: 32, offset: 6792160)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !126, file: !117, line: 655, baseType: !7, size: 32, offset: 6792192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !126, file: !117, line: 657, baseType: !7, size: 32, offset: 6792224)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !126, file: !117, line: 658, baseType: !7, size: 32, offset: 6792256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_bitsize_on_disk", scope: !126, file: !117, line: 661, baseType: !7, size: 32, offset: 6792288)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !126, file: !117, line: 662, baseType: !93, size: 16, offset: 6792320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !126, file: !117, line: 663, baseType: !93, size: 16, offset: 6792336)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_scale", scope: !126, file: !117, line: 664, baseType: !449, size: 64, offset: 6792352)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !126, file: !117, line: 665, baseType: !7, size: 32, offset: 6792416)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !126, file: !117, line: 666, baseType: !7, size: 32, offset: 6792448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value_comp", scope: !126, file: !117, line: 667, baseType: !539, size: 96, offset: 6792480)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 96, elements: !156)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "max_pel_value_comp", scope: !126, file: !117, line: 668, baseType: !155, size: 96, offset: 6792576)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !126, file: !117, line: 670, baseType: !7, size: 32, offset: 6792672)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !126, file: !117, line: 671, baseType: !7, size: 32, offset: 6792704)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !126, file: !117, line: 672, baseType: !7, size: 32, offset: 6792736)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !126, file: !117, line: 673, baseType: !7, size: 32, offset: 6792768)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "num_uv_blocks", scope: !126, file: !117, line: 674, baseType: !7, size: 32, offset: 6792800)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !126, file: !117, line: 675, baseType: !7, size: 32, offset: 6792832)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !126, file: !117, line: 676, baseType: !7, size: 32, offset: 6792864)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !126, file: !117, line: 677, baseType: !7, size: 32, offset: 6792896)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x_blk", scope: !126, file: !117, line: 678, baseType: !7, size: 32, offset: 6792928)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y_blk", scope: !126, file: !117, line: 679, baseType: !7, size: 32, offset: 6792960)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !126, file: !117, line: 680, baseType: !552, size: 192, offset: 6792992)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !553)
!553 = !{!107, !451}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_blk", scope: !126, file: !117, line: 681, baseType: !552, size: 192, offset: 6793184)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_shift", scope: !126, file: !117, line: 682, baseType: !552, size: 192, offset: 6793376)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_x", scope: !126, file: !117, line: 683, baseType: !7, size: 32, offset: 6793568)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_y", scope: !126, file: !117, line: 684, baseType: !7, size: 32, offset: 6793600)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_x", scope: !126, file: !117, line: 685, baseType: !7, size: 32, offset: 6793632)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_y", scope: !126, file: !117, line: 686, baseType: !7, size: 32, offset: 6793664)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "total_scale", scope: !126, file: !117, line: 687, baseType: !7, size: 32, offset: 6793696)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "max_vmv_r", scope: !126, file: !117, line: 689, baseType: !7, size: 32, offset: 6793728)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "idr_psnr_number", scope: !126, file: !117, line: 692, baseType: !7, size: 32, offset: 6793760)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "psnr_number", scope: !126, file: !117, line: 693, baseType: !7, size: 32, offset: 6793792)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "last_ref_pic_poc", scope: !126, file: !117, line: 700, baseType: !7, size: 32, offset: 6793824)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !126, file: !117, line: 701, baseType: !7, size: 32, offset: 6793856)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !126, file: !117, line: 702, baseType: !7, size: 32, offset: 6793888)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !126, file: !117, line: 703, baseType: !7, size: 32, offset: 6793920)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "earlier_missing_poc", scope: !126, file: !117, line: 704, baseType: !7, size: 32, offset: 6793952)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_conceal", scope: !126, file: !117, line: 705, baseType: !31, size: 32, offset: 6793984)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "IDR_concealment_flag", scope: !126, file: !117, line: 706, baseType: !7, size: 32, offset: 6794016)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_slice_type", scope: !126, file: !117, line: 707, baseType: !7, size: 32, offset: 6794048)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point", scope: !126, file: !117, line: 710, baseType: !7, size: 32, offset: 6794080)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point_found", scope: !126, file: !117, line: 711, baseType: !7, size: 32, offset: 6794112)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_cnt", scope: !126, file: !117, line: 712, baseType: !7, size: 32, offset: 6794144)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_num", scope: !126, file: !117, line: 713, baseType: !7, size: 32, offset: 6794176)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_poc", scope: !126, file: !117, line: 714, baseType: !7, size: 32, offset: 6794208)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !126, file: !117, line: 716, baseType: !7, size: 32, offset: 6794240)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !126, file: !117, line: 717, baseType: !7, size: 32, offset: 6794272)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !126, file: !117, line: 719, baseType: !253, size: 64, offset: 6794304)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !126, file: !117, line: 720, baseType: !253, size: 64, offset: 6794368)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "imgData", scope: !126, file: !117, line: 722, baseType: !582, size: 2560, offset: 6794432)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageData", file: !583, line: 38, baseType: !584)
!583 = !DIFile(filename: "ldecod_src/inc/io_image.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "8caef624e6f5391b0c6ab2984e7f77c6")
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "image_data", file: !583, line: 20, size: 2560, elements: !585)
!585 = !{!586, !587, !591, !592, !593, !597, !598, !599, !600, !601}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !584, file: !583, line: 22, baseType: !145, size: 1088)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "frm_data", scope: !584, file: !583, line: 24, baseType: !588, size: 192, offset: 1088)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 192, elements: !156)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "top_data", scope: !584, file: !583, line: 25, baseType: !588, size: 192, offset: 1280)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "bot_data", scope: !584, file: !583, line: 26, baseType: !588, size: 192, offset: 1472)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "frm_uint16", scope: !584, file: !583, line: 31, baseType: !594, size: 192, offset: 1664)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 192, elements: !156)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "top_uint16", scope: !584, file: !583, line: 32, baseType: !594, size: 192, offset: 1856)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bot_uint16", scope: !584, file: !583, line: 33, baseType: !594, size: 192, offset: 2048)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "frm_stride", scope: !584, file: !583, line: 35, baseType: !155, size: 96, offset: 2240)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "top_stride", scope: !584, file: !583, line: 36, baseType: !155, size: 96, offset: 2336)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "bot_stride", scope: !584, file: !583, line: 37, baseType: !155, size: 96, offset: 2432)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "imgData0", scope: !126, file: !117, line: 723, baseType: !582, size: 2560, offset: 6796992)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "imgData1", scope: !126, file: !117, line: 724, baseType: !582, size: 2560, offset: 6799552)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "imgData2", scope: !126, file: !117, line: 725, baseType: !582, size: 2560, offset: 6802112)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "imgData32", scope: !126, file: !117, line: 728, baseType: !582, size: 2560, offset: 6804672)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "imgData4", scope: !126, file: !117, line: 729, baseType: !582, size: 2560, offset: 6807232)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "imgData5", scope: !126, file: !117, line: 730, baseType: !582, size: 2560, offset: 6809792)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "imgData6", scope: !126, file: !117, line: 731, baseType: !582, size: 2560, offset: 6812352)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "previous_frame_num", scope: !126, file: !117, line: 735, baseType: !31, size: 32, offset: 6814912)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "Is_primary_correct", scope: !126, file: !117, line: 737, baseType: !7, size: 32, offset: 6814944)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "Is_redundant_correct", scope: !126, file: !117, line: 738, baseType: !7, size: 32, offset: 6814976)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "tot_time", scope: !126, file: !117, line: 741, baseType: !613, size: 64, offset: 6815040)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !614, line: 103, baseType: !615)
!614 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !616, line: 27, baseType: !617)
!616 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !618, line: 44, baseType: !619)
!618 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!619 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "p_out", scope: !126, file: !117, line: 744, baseType: !7, size: 32, offset: 6815104)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "p_out_mvc", scope: !126, file: !117, line: 746, baseType: !622, size: 32768, offset: 6815136)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32768, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 1024)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "p_ref", scope: !126, file: !117, line: 748, baseType: !7, size: 32, offset: 6847904)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessUnitExists", scope: !126, file: !117, line: 751, baseType: !7, size: 32, offset: 6847936)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "NALUCount", scope: !126, file: !117, line: 752, baseType: !7, size: 32, offset: 6847968)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Bframe_ctr", scope: !126, file: !117, line: 755, baseType: !7, size: 32, offset: 6848000)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "frame_no", scope: !126, file: !117, line: 756, baseType: !7, size: 32, offset: 6848032)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "g_nFrame", scope: !126, file: !117, line: 758, baseType: !7, size: 32, offset: 6848064)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "global_init_done", scope: !126, file: !117, line: 759, baseType: !7, size: 32, offset: 6848096)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ref", scope: !126, file: !117, line: 762, baseType: !589, size: 64, offset: 6848128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV_ref", scope: !126, file: !117, line: 763, baseType: !634, size: 64, offset: 6848192)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "qp_per_matrix", scope: !126, file: !117, line: 765, baseType: !199, size: 64, offset: 6848256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "qp_rem_matrix", scope: !126, file: !117, line: 766, baseType: !199, size: 64, offset: 6848320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "last_out_fs", scope: !126, file: !117, line: 768, baseType: !638, size: 64, offset: 6848384)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !640, line: 152, size: 768, elements: !641)
!640 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !772, !773, !774, !775, !776}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !639, file: !640, line: 154, baseType: !7, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !639, file: !640, line: 155, baseType: !7, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !639, file: !640, line: 156, baseType: !7, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !639, file: !640, line: 157, baseType: !7, size: 32, offset: 96)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !639, file: !640, line: 159, baseType: !7, size: 32, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !639, file: !640, line: 161, baseType: !31, size: 32, offset: 160)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !639, file: !640, line: 162, baseType: !31, size: 32, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !639, file: !640, line: 164, baseType: !7, size: 32, offset: 224)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !639, file: !640, line: 165, baseType: !7, size: 32, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !639, file: !640, line: 166, baseType: !7, size: 32, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !639, file: !640, line: 167, baseType: !7, size: 32, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !639, file: !640, line: 170, baseType: !7, size: 32, offset: 352)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !639, file: !640, line: 172, baseType: !655, size: 64, offset: 384)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !640, line: 138, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !640, line: 46, size: 3328, elements: !658)
!658 = !{!659, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !712, !714, !718, !720, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !657, file: !640, line: 48, baseType: !660, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !30, line: 140, baseType: !39)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !657, file: !640, line: 50, baseType: !7, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !657, file: !640, line: 51, baseType: !7, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !657, file: !640, line: 52, baseType: !7, size: 32, offset: 96)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !657, file: !640, line: 53, baseType: !7, size: 32, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !657, file: !640, line: 54, baseType: !31, size: 32, offset: 160)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !657, file: !640, line: 55, baseType: !31, size: 32, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !657, file: !640, line: 57, baseType: !7, size: 32, offset: 224)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !657, file: !640, line: 58, baseType: !7, size: 32, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !657, file: !640, line: 59, baseType: !7, size: 32, offset: 288)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !657, file: !640, line: 61, baseType: !254, size: 8, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !657, file: !640, line: 62, baseType: !7, size: 32, offset: 352)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !657, file: !640, line: 63, baseType: !7, size: 32, offset: 384)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !657, file: !640, line: 64, baseType: !7, size: 32, offset: 416)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !657, file: !640, line: 65, baseType: !7, size: 32, offset: 448)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !657, file: !640, line: 67, baseType: !93, size: 16, offset: 480)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !657, file: !640, line: 69, baseType: !7, size: 32, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !657, file: !640, line: 69, baseType: !7, size: 32, offset: 544)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !657, file: !640, line: 69, baseType: !7, size: 32, offset: 576)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !657, file: !640, line: 69, baseType: !7, size: 32, offset: 608)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !657, file: !640, line: 70, baseType: !7, size: 32, offset: 640)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !657, file: !640, line: 70, baseType: !7, size: 32, offset: 672)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !657, file: !640, line: 70, baseType: !7, size: 32, offset: 704)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !657, file: !640, line: 70, baseType: !7, size: 32, offset: 736)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !657, file: !640, line: 71, baseType: !7, size: 32, offset: 768)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !657, file: !640, line: 72, baseType: !7, size: 32, offset: 800)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !657, file: !640, line: 73, baseType: !31, size: 32, offset: 832)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !657, file: !640, line: 74, baseType: !31, size: 32, offset: 864)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !657, file: !640, line: 75, baseType: !7, size: 32, offset: 896)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !657, file: !640, line: 75, baseType: !7, size: 32, offset: 928)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !657, file: !640, line: 76, baseType: !7, size: 32, offset: 960)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !657, file: !640, line: 76, baseType: !7, size: 32, offset: 992)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !657, file: !640, line: 79, baseType: !589, size: 64, offset: 1024)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !657, file: !640, line: 80, baseType: !634, size: 64, offset: 1088)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !657, file: !640, line: 81, baseType: !634, size: 64, offset: 1152)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !657, file: !640, line: 84, baseType: !696, size: 64, offset: 1216)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !640, line: 36, size: 256, elements: !699)
!699 = !{!700, !703, !710}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !698, file: !640, line: 38, baseType: !701, size: 128)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 128, elements: !450)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !698, file: !640, line: 39, baseType: !704, size: 64, offset: 128)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 64, elements: !450)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !117, line: 104, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !117, line: 100, size: 32, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !706, file: !117, line: 102, baseType: !93, size: 16)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !706, file: !117, line: 103, baseType: !93, size: 16, offset: 16)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !698, file: !640, line: 40, baseType: !711, size: 16, offset: 192)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 16, elements: !450)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !657, file: !640, line: 85, baseType: !713, size: 192, offset: 1280)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 192, elements: !156)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !657, file: !640, line: 87, baseType: !715, size: 64, offset: 1472)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !640, line: 29, size: 64, elements: !716)
!716 = !{!717}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !715, file: !640, line: 31, baseType: !253, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !657, file: !640, line: 88, baseType: !719, size: 192, offset: 1536)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, size: 192, elements: !156)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !657, file: !640, line: 90, baseType: !721, size: 64, offset: 1728)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !657, file: !640, line: 92, baseType: !702, size: 64, offset: 1792)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !657, file: !640, line: 93, baseType: !702, size: 64, offset: 1856)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !657, file: !640, line: 94, baseType: !702, size: 64, offset: 1920)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !657, file: !640, line: 96, baseType: !7, size: 32, offset: 1984)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !657, file: !640, line: 97, baseType: !7, size: 32, offset: 2016)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !657, file: !640, line: 98, baseType: !7, size: 32, offset: 2048)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !657, file: !640, line: 99, baseType: !7, size: 32, offset: 2080)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !657, file: !640, line: 100, baseType: !7, size: 32, offset: 2112)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !657, file: !640, line: 102, baseType: !7, size: 32, offset: 2144)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !657, file: !640, line: 103, baseType: !7, size: 32, offset: 2176)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !657, file: !640, line: 104, baseType: !7, size: 32, offset: 2208)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !657, file: !640, line: 105, baseType: !7, size: 32, offset: 2240)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !657, file: !640, line: 106, baseType: !7, size: 32, offset: 2272)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !657, file: !640, line: 107, baseType: !7, size: 32, offset: 2304)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !657, file: !640, line: 108, baseType: !7, size: 32, offset: 2336)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !657, file: !640, line: 109, baseType: !7, size: 32, offset: 2368)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !657, file: !640, line: 110, baseType: !449, size: 64, offset: 2400)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !657, file: !640, line: 111, baseType: !7, size: 32, offset: 2464)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !657, file: !640, line: 112, baseType: !742, size: 64, offset: 2496)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !117, line: 194, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !117, line: 186, size: 256, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !744, file: !117, line: 188, baseType: !7, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !744, file: !117, line: 189, baseType: !7, size: 32, offset: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !744, file: !117, line: 190, baseType: !7, size: 32, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !744, file: !117, line: 191, baseType: !7, size: 32, offset: 96)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !744, file: !117, line: 192, baseType: !7, size: 32, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !744, file: !117, line: 193, baseType: !752, size: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !657, file: !640, line: 115, baseType: !7, size: 32, offset: 2560)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !657, file: !640, line: 118, baseType: !7, size: 32, offset: 2592)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !657, file: !640, line: 119, baseType: !7, size: 32, offset: 2624)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !657, file: !640, line: 120, baseType: !7, size: 32, offset: 2656)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !657, file: !640, line: 121, baseType: !590, size: 64, offset: 2688)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !657, file: !640, line: 124, baseType: !7, size: 32, offset: 2752)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !657, file: !640, line: 125, baseType: !7, size: 32, offset: 2784)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !657, file: !640, line: 126, baseType: !7, size: 32, offset: 2816)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !657, file: !640, line: 128, baseType: !7, size: 32, offset: 2848)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !657, file: !640, line: 129, baseType: !7, size: 32, offset: 2880)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !657, file: !640, line: 130, baseType: !7, size: 32, offset: 2912)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !657, file: !640, line: 131, baseType: !7, size: 32, offset: 2944)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !657, file: !640, line: 132, baseType: !589, size: 64, offset: 3008)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !657, file: !640, line: 133, baseType: !7, size: 32, offset: 3072)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !657, file: !640, line: 134, baseType: !7, size: 32, offset: 3104)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !657, file: !640, line: 136, baseType: !711, size: 16, offset: 3136)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !657, file: !640, line: 137, baseType: !770, size: 128, offset: 3200)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 128, elements: !450)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !639, file: !640, line: 173, baseType: !655, size: 64, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !639, file: !640, line: 174, baseType: !655, size: 64, offset: 512)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !639, file: !640, line: 177, baseType: !7, size: 32, offset: 576)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !639, file: !640, line: 178, baseType: !449, size: 64, offset: 608)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !639, file: !640, line: 179, baseType: !449, size: 64, offset: 672)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pocs_in_dpb", scope: !126, file: !117, line: 769, baseType: !778, size: 3200, offset: 6848448)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3200, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 100)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture", scope: !126, file: !117, line: 771, baseType: !702, size: 64, offset: 6851648)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture_JV", scope: !126, file: !117, line: 772, baseType: !783, size: 192, offset: 6851712)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 192, elements: !156)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "no_reference_picture", scope: !126, file: !117, line: 773, baseType: !702, size: 64, offset: 6851904)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "erc_object_list", scope: !126, file: !117, line: 776, baseType: !786, size: 64, offset: 6851968)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DICompositeType(tag: DW_TAG_structure_type, name: "object_buffer", file: !117, line: 776, flags: DIFlagFwdDecl)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "erc_errorVar", scope: !126, file: !117, line: 777, baseType: !789, size: 64, offset: 6852032)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "ercVariables_s", file: !117, line: 777, flags: DIFlagFwdDecl)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "erc_mvperMB", scope: !126, file: !117, line: 779, baseType: !7, size: 32, offset: 6852096)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "erc_img", scope: !126, file: !117, line: 780, baseType: !125, size: 64, offset: 6852160)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "ec_flag", scope: !126, file: !117, line: 781, baseType: !794, size: 640, offset: 6852224)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 640, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 20)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "annex_b", scope: !126, file: !117, line: 783, baseType: !798, size: 64, offset: 6852864)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "annex_b_struct", file: !117, line: 783, flags: DIFlagFwdDecl)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "bitsfile", scope: !126, file: !117, line: 784, baseType: !801, size: 64, offset: 6852928)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "sBitsFile", file: !117, line: 784, flags: DIFlagFwdDecl)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "out_buffer", scope: !126, file: !117, line: 786, baseType: !638, size: 64, offset: 6852992)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output", scope: !126, file: !117, line: 788, baseType: !702, size: 64, offset: 6853056)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output_state", scope: !126, file: !117, line: 789, baseType: !7, size: 32, offset: 6853120)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_flag", scope: !126, file: !117, line: 790, baseType: !7, size: 32, offset: 6853152)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "BitStreamFile", scope: !126, file: !117, line: 792, baseType: !7, size: 32, offset: 6853184)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !126, file: !117, line: 794, baseType: !809, size: 64, offset: 6853248)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !640, line: 186, size: 33408, elements: !811)
!811 = !{!812, !815, !818, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !810, file: !640, line: 188, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !117, line: 836, baseType: !126)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !810, file: !640, line: 189, baseType: !816, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !117, line: 900, baseType: !130)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !810, file: !640, line: 190, baseType: !819, size: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !640, line: 182, baseType: !639)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ref", scope: !810, file: !640, line: 191, baseType: !819, size: 64, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ltref", scope: !810, file: !640, line: 192, baseType: !819, size: 64, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !810, file: !640, line: 193, baseType: !31, size: 32, offset: 320)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !810, file: !640, line: 194, baseType: !31, size: 32, offset: 352)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frames_in_buffer", scope: !810, file: !640, line: 195, baseType: !31, size: 32, offset: 384)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ltref_frames_in_buffer", scope: !810, file: !640, line: 196, baseType: !31, size: 32, offset: 416)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_poc", scope: !810, file: !640, line: 197, baseType: !7, size: 32, offset: 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_view_id", scope: !810, file: !640, line: 199, baseType: !7, size: 32, offset: 480)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_pic_idx", scope: !810, file: !640, line: 200, baseType: !622, size: 32768, offset: 512)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "init_done", scope: !810, file: !640, line: 205, baseType: !7, size: 32, offset: 33280)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !810, file: !640, line: 206, baseType: !7, size: 32, offset: 33312)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "last_picture", scope: !810, file: !640, line: 208, baseType: !820, size: 64, offset: 33344)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb_legacy", scope: !126, file: !117, line: 795, baseType: !809, size: 64, offset: 6853312)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb_layer", scope: !126, file: !117, line: 796, baseType: !836, size: 128, offset: 6853376)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !809, size: 128, elements: !450)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "cslice_type", scope: !126, file: !117, line: 800, baseType: !838, size: 72, offset: 6853504)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 72, elements: !839)
!839 = !{!840}
!840 = !DISubrange(count: 9)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "MbToSliceGroupMap", scope: !126, file: !117, line: 802, baseType: !199, size: 64, offset: 6853632)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "MapUnitToSliceGroupMap", scope: !126, file: !117, line: 803, baseType: !199, size: 64, offset: 6853696)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSliceGroups", scope: !126, file: !117, line: 804, baseType: !7, size: 32, offset: 6853760)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "seiToneMapping", scope: !126, file: !117, line: 807, baseType: !845, size: 64, offset: 6853824)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "tone_mapping_struct_s", file: !117, line: 807, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "buf2img", scope: !126, file: !117, line: 810, baseType: !848, size: 64, offset: 6853888)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !589, !851, !7, !7, !7, !7, !7, !7}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "getNeighbour", scope: !126, file: !117, line: 811, baseType: !853, size: 64, offset: 6853952)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{null, !115, !7, !7, !199, !856}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !117, line: 85, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !117, line: 77, size: 128, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !858, file: !117, line: 79, baseType: !7, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !858, file: !117, line: 80, baseType: !7, size: 32, offset: 32)
