; ModuleID = 'ldecod_src/memalloc.c'
source_filename = "ldecod_src/memalloc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.distortion_data = type { [4 x [4 x i32]], [4 x [4 x i64]], [2 x [2 x i64]], [2 x [2 x i32]], i32, i32, double }
%struct.lambda_params = type { double, [3 x double], [3 x i32] }
%struct.pic_motion_params = type { [2 x ptr], [2 x %struct.MotionVector], [2 x i8] }
%struct.MotionVector = type { i16, i16 }
%struct.level_quant_params = type { i32, i32, i32 }

@.str = private unnamed_addr constant [33 x i8] c"init_top_bot_planes: imgTopField\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [33 x i8] c"init_top_bot_planes: imgBotField\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [23 x i8] c"get_mem2Ddist: array2D\00", align 1, !dbg !9
@.str.3 = private unnamed_addr constant [21 x i8] c"get_mem2Dlm: array2D\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [45 x i8] c"free_mem2Ddist: trying to free unused memory\00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [43 x i8] c"free_mem2Dlm: trying to free unused memory\00", align 1, !dbg !24
@.str.6 = private unnamed_addr constant [21 x i8] c"get_mem2Dmv: array2D\00", align 1, !dbg !29
@.str.7 = private unnamed_addr constant [21 x i8] c"get_mem2Dmp: array2D\00", align 1, !dbg !31

!265 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2306, type: !162, isLocal: true, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2328, type: !162, isLocal: true, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2354, type: !162, isLocal: true, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2388, type: !272, isLocal: true, isDefinition: true)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 31)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2419, type: !11, isLocal: true, isDefinition: true)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2482, type: !222, isLocal: true, isDefinition: true)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2508, type: !243, isLocal: true, isDefinition: true)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2535, type: !204, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2553, type: !204, isLocal: true, isDefinition: true)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2582, type: !204, isLocal: true, isDefinition: true)
!287 = !DIGlobalVariableExpression(var: !288, expr: !DIExpression())
!288 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2617, type: !21, isLocal: true, isDefinition: true)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2649, type: !21, isLocal: true, isDefinition: true)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2675, type: !293, isLocal: true, isDefinition: true)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 424, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 53)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2722, type: !69, isLocal: true, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2750, type: !122, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(scope: null, file: !2, line: 2768, type: !204, isLocal: true, isDefinition: true)
!302 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !311, globals: !547, splitDebugInlining: false, nameTableKind: None)
!303 = !{!304}
!304 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !305, line: 135, baseType: !306, size: 32, elements: !307)
!305 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!306 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!307 = !{!308, !309, !310}
!308 = !DIEnumerator(name: "FRAME", value: 0)
!309 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!310 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!311 = !{!312, !318, !319, !320, !350, !351, !363, !364, !491, !492, !493, !501, !502, !503, !504, !505, !509, !510, !511, !512, !513, !514, !515, !516, !313, !412, !517, !518, !519, !423, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !427, !428, !539, !540, !541, !542, !543, !544, !545, !546}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !315, line: 41, baseType: !316)
!315 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !315, line: 23, baseType: !317)
!317 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "DistortionData", file: !322, line: 28, baseType: !323)
!322 = !DIFile(filename: "ldecod_src/inc/distortion.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "4a0bacf595bd1a578672eab86a0cc72b")
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "distortion_data", file: !322, line: 19, size: 2048, elements: !324)
!324 = !{!325, !330, !340, !344, !346, !347, !348}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4rd", scope: !323, file: !322, line: 21, baseType: !326, size: 512)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 512, elements: !328)
!327 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!328 = !{!329, !329}
!329 = !DISubrange(count: 4)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4", scope: !323, file: !322, line: 22, baseType: !331, size: 1024, offset: 512)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 1024, elements: !328)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "distblk", file: !315, line: 43, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !334, line: 103, baseType: !335)
!334 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !336, line: 27, baseType: !337)
!336 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !338, line: 44, baseType: !339)
!338 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!339 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8", scope: !323, file: !322, line: 23, baseType: !341, size: 256, offset: 1536)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 256, elements: !342)
!342 = !{!343, !343}
!343 = !DISubrange(count: 2)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8rd", scope: !323, file: !322, line: 24, baseType: !345, size: 128, offset: 1792)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 128, elements: !342)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "i16x16", scope: !323, file: !322, line: 25, baseType: !327, size: 32, offset: 1920)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "i16x16rd", scope: !323, file: !322, line: 26, baseType: !327, size: 32, offset: 1952)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "rd_cost", scope: !323, file: !322, line: 27, baseType: !349, size: 64, offset: 1984)
!349 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "LambdaParams", file: !353, line: 22, baseType: !354)
!353 = !DIFile(filename: "ldecod_src/inc/lagrangian.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "8b7bf04cfb074afff52461c462d803e1")
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lambda_params", file: !353, line: 17, size: 384, elements: !355)
!355 = !{!356, !357, !361}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "md", scope: !354, file: !353, line: 19, baseType: !349, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "me", scope: !354, file: !353, line: 20, baseType: !358, size: 192, offset: 64)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 192, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 3)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mf", scope: !354, file: !353, line: 21, baseType: !362, size: 96, offset: 256)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 96, elements: !359)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "PicMotionParams", file: !366, line: 43, baseType: !367)
!366 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !366, line: 36, size: 256, elements: !368)
!368 = !{!369, !483, !490}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !367, file: !366, line: 38, baseType: !370, size: 128)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 128, elements: !447)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !366, line: 46, size: 3328, elements: !373)
!373 = !{!374, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !388, !389, !390, !391, !392, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !413, !414, !417, !419, !424, !426, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !448, !449, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !480}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !372, file: !366, line: 48, baseType: !375, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !305, line: 140, baseType: !304)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !372, file: !366, line: 50, baseType: !327, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !372, file: !366, line: 51, baseType: !327, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !372, file: !366, line: 52, baseType: !327, size: 32, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !372, file: !366, line: 53, baseType: !327, size: 32, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !372, file: !366, line: 54, baseType: !306, size: 32, offset: 160)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !372, file: !366, line: 55, baseType: !306, size: 32, offset: 192)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !372, file: !366, line: 57, baseType: !327, size: 32, offset: 224)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !372, file: !366, line: 58, baseType: !327, size: 32, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !372, file: !366, line: 59, baseType: !327, size: 32, offset: 288)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !372, file: !366, line: 61, baseType: !386, size: 8, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !315, line: 21, baseType: !387)
!387 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !372, file: !366, line: 62, baseType: !327, size: 32, offset: 352)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !372, file: !366, line: 63, baseType: !327, size: 32, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !372, file: !366, line: 64, baseType: !327, size: 32, offset: 416)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !372, file: !366, line: 65, baseType: !327, size: 32, offset: 448)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !372, file: !366, line: 67, baseType: !393, size: 16, offset: 480)
!393 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !372, file: !366, line: 69, baseType: !327, size: 32, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !372, file: !366, line: 69, baseType: !327, size: 32, offset: 544)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !372, file: !366, line: 69, baseType: !327, size: 32, offset: 576)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !372, file: !366, line: 69, baseType: !327, size: 32, offset: 608)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !372, file: !366, line: 70, baseType: !327, size: 32, offset: 640)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !372, file: !366, line: 70, baseType: !327, size: 32, offset: 672)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !372, file: !366, line: 70, baseType: !327, size: 32, offset: 704)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !372, file: !366, line: 70, baseType: !327, size: 32, offset: 736)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !372, file: !366, line: 71, baseType: !327, size: 32, offset: 768)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !372, file: !366, line: 72, baseType: !327, size: 32, offset: 800)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !372, file: !366, line: 73, baseType: !306, size: 32, offset: 832)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !372, file: !366, line: 74, baseType: !306, size: 32, offset: 864)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !372, file: !366, line: 75, baseType: !327, size: 32, offset: 896)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !372, file: !366, line: 75, baseType: !327, size: 32, offset: 928)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !372, file: !366, line: 76, baseType: !327, size: 32, offset: 960)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !372, file: !366, line: 76, baseType: !327, size: 32, offset: 992)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !372, file: !366, line: 79, baseType: !312, size: 64, offset: 1024)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !372, file: !366, line: 80, baseType: !412, size: 64, offset: 1088)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !372, file: !366, line: 81, baseType: !412, size: 64, offset: 1152)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !372, file: !366, line: 84, baseType: !415, size: 64, offset: 1216)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !372, file: !366, line: 85, baseType: !418, size: 192, offset: 1280)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 192, elements: !359)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !372, file: !366, line: 87, baseType: !420, size: 64, offset: 1472)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !366, line: 29, size: 64, elements: !421)
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !420, file: !366, line: 31, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !372, file: !366, line: 88, baseType: !425, size: 192, offset: 1536)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !420, size: 192, elements: !359)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !372, file: !366, line: 90, baseType: !427, size: 64, offset: 1728)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !372, file: !366, line: 92, baseType: !371, size: 64, offset: 1792)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !372, file: !366, line: 93, baseType: !371, size: 64, offset: 1856)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !372, file: !366, line: 94, baseType: !371, size: 64, offset: 1920)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !372, file: !366, line: 96, baseType: !327, size: 32, offset: 1984)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !372, file: !366, line: 97, baseType: !327, size: 32, offset: 2016)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !372, file: !366, line: 98, baseType: !327, size: 32, offset: 2048)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !372, file: !366, line: 99, baseType: !327, size: 32, offset: 2080)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !372, file: !366, line: 100, baseType: !327, size: 32, offset: 2112)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !372, file: !366, line: 102, baseType: !327, size: 32, offset: 2144)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !372, file: !366, line: 103, baseType: !327, size: 32, offset: 2176)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !372, file: !366, line: 104, baseType: !327, size: 32, offset: 2208)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !372, file: !366, line: 105, baseType: !327, size: 32, offset: 2240)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !372, file: !366, line: 106, baseType: !327, size: 32, offset: 2272)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !372, file: !366, line: 107, baseType: !327, size: 32, offset: 2304)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !372, file: !366, line: 108, baseType: !327, size: 32, offset: 2336)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !372, file: !366, line: 109, baseType: !327, size: 32, offset: 2368)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !372, file: !366, line: 110, baseType: !446, size: 64, offset: 2400)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 64, elements: !447)
!447 = !{!343}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !372, file: !366, line: 111, baseType: !327, size: 32, offset: 2464)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !372, file: !366, line: 112, baseType: !450, size: 64, offset: 2496)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !452, line: 194, baseType: !453)
!452 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !452, line: 186, size: 256, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !453, file: !452, line: 188, baseType: !327, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !453, file: !452, line: 189, baseType: !327, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !453, file: !452, line: 190, baseType: !327, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !453, file: !452, line: 191, baseType: !327, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !453, file: !452, line: 192, baseType: !327, size: 32, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !453, file: !452, line: 193, baseType: !461, size: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !372, file: !366, line: 115, baseType: !327, size: 32, offset: 2560)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !372, file: !366, line: 118, baseType: !327, size: 32, offset: 2592)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !372, file: !366, line: 119, baseType: !327, size: 32, offset: 2624)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !372, file: !366, line: 120, baseType: !327, size: 32, offset: 2656)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !372, file: !366, line: 121, baseType: !313, size: 64, offset: 2688)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !372, file: !366, line: 124, baseType: !327, size: 32, offset: 2752)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !372, file: !366, line: 125, baseType: !327, size: 32, offset: 2784)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !372, file: !366, line: 126, baseType: !327, size: 32, offset: 2816)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !372, file: !366, line: 128, baseType: !327, size: 32, offset: 2848)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !372, file: !366, line: 129, baseType: !327, size: 32, offset: 2880)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !372, file: !366, line: 130, baseType: !327, size: 32, offset: 2912)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !372, file: !366, line: 131, baseType: !327, size: 32, offset: 2944)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !372, file: !366, line: 132, baseType: !312, size: 64, offset: 3008)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !372, file: !366, line: 133, baseType: !327, size: 32, offset: 3072)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !372, file: !366, line: 134, baseType: !327, size: 32, offset: 3104)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !372, file: !366, line: 136, baseType: !478, size: 16, offset: 3136)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 16, elements: !447)
!479 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !372, file: !366, line: 137, baseType: !481, size: 128, offset: 3200)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 128, elements: !447)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !367, file: !366, line: 39, baseType: !484, size: 64, offset: 128)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 64, elements: !447)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !452, line: 104, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !452, line: 100, size: 32, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !486, file: !452, line: 102, baseType: !393, size: 16)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !486, file: !452, line: 103, baseType: !393, size: 16, offset: 16)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !367, file: !366, line: 40, baseType: !478, size: 16, offset: 192)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "LevelQuantParams", file: !495, line: 21, baseType: !496)
!495 = !DIFile(filename: "ldecod_src/inc/quant_params.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e63d1c6a2fb27627d8643dee4eda38e3")
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "level_quant_params", file: !495, line: 17, size: 96, elements: !497)
!497 = !{!498, !499, !500}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "OffsetComp", scope: !496, file: !495, line: 18, baseType: !327, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ScaleComp", scope: !496, file: !495, line: 19, baseType: !327, size: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "InvScaleComp", scope: !496, file: !495, line: 20, baseType: !327, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicturePtr", file: !366, line: 140, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !366, line: 138, baseType: !372)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
