; ModuleID = 'ldecod_src/mv_prediction.c'
source_filename = "ldecod_src/mv_prediction.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MotionVector = type { i16, i16 }
%struct.macroblock = type { ptr, ptr, ptr, i32, %struct.BlockPos, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x i32], [3 x i32], i32, i32, i32, i32, i16, i8, i8, i16, i16, ptr, ptr, ptr, ptr, i16, [2 x [4 x [4 x [2 x i16]]]], i32, [3 x i64], [3 x i64], [3 x i64], i32, [4 x i8], [4 x i8], i8, i8, i8, i16, i16, i16, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr, ptr, ptr, ptr, i8 }
%struct.BlockPos = type { i16, i16 }
%struct.pic_motion_params = type { [2 x ptr], [2 x %struct.MotionVector], [2 x i8] }

@zero_mv = internal unnamed_addr constant %struct.MotionVector zeroinitializer, align 2, !dbg !0

; Function Attrs: mustprogress nofree norecurse nosync nounwind willreturn memory(argmem: write) uwtable
define dso_local void @init_motion_vector_prediction(ptr nocapture noundef writeonly %currMB, i32 noundef %mb_aff_frame_flag) local_unnamed_addr #0 !dbg !70 {
entry:
    #dbg_value(ptr %currMB, !1250, !DIExpression(), !1252)
    #dbg_value(i32 %mb_aff_frame_flag, !1251, !DIExpression(), !1252)
  %tobool.not = icmp eq i32 %mb_aff_frame_flag, 0, !dbg !1253
  %spec.select = select i1 %tobool.not, ptr @GetMotionVectorPredictorNormal, ptr @GetMotionVectorPredictorMBAFF, !dbg !1255

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "zero_mv", scope: !2, file: !55, line: 106, type: !61, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !51, globals: !60, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "ldecod_src/mv_prediction.c", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "14776f2ec3937b5cafc4138a85bb23c5")
!4 = !{!5, !14, !20, !29, !36, !44}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 22, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "ldecod_src/inc/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "fd6ca9e1c707932f749220576db72b57")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "CF_UNKNOWN", value: -1)
!10 = !DIEnumerator(name: "YUV400", value: 0)
!11 = !DIEnumerator(name: "YUV420", value: 1)
!12 = !DIEnumerator(name: "YUV422", value: 2)
!13 = !DIEnumerator(name: "YUV444", value: 3)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 15, baseType: !7, size: 32, elements: !15)
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "CM_UNKNOWN", value: -1)
!17 = !DIEnumerator(name: "CM_YUV", value: 0)
!18 = !DIEnumerator(name: "CM_RGB", value: 1)
!19 = !DIEnumerator(name: "CM_XYZ", value: 2)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 25, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "ldecod_src/inc/io_video.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1141c07f1801ad27d87214c419749431")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "VIDEO_UNKNOWN", value: -1)
!24 = !DIEnumerator(name: "VIDEO_YUV", value: 0)
!25 = !DIEnumerator(name: "VIDEO_RGB", value: 1)
!26 = !DIEnumerator(name: "VIDEO_XYZ", value: 2)
!27 = !DIEnumerator(name: "VIDEO_TIFF", value: 3)
!28 = !DIEnumerator(name: "VIDEO_AVI", value: 4)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 135, baseType: !31, size: 32, elements: !32)
!30 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!31 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!32 = !{!33, !34, !35}
!33 = !DIEnumerator(name: "FRAME", value: 0)
!34 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!35 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 22, baseType: !31, size: 32, elements: !37)
!37 = !{!38, !39, !40, !41, !42, !43}
!38 = !DIEnumerator(name: "PLANE_Y", value: 0)
!39 = !DIEnumerator(name: "PLANE_U", value: 1)
!40 = !DIEnumerator(name: "PLANE_V", value: 2)
!41 = !DIEnumerator(name: "PLANE_G", value: 0)
!42 = !DIEnumerator(name: "PLANE_B", value: 1)
!43 = !DIEnumerator(name: "PLANE_R", value: 2)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 239, baseType: !31, size: 32, elements: !46)
!45 = !DIFile(filename: "ldecod_src/inc/defines.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "f06de374c735b286d10ba4ea0c8c0a5d")
!46 = !{!47, !48, !49, !50}
!47 = !DIEnumerator(name: "MVPRED_MEDIAN", value: 0)
!48 = !DIEnumerator(name: "MVPRED_L", value: 1)
!49 = !DIEnumerator(name: "MVPRED_U", value: 2)
!50 = !DIEnumerator(name: "MVPRED_UR", value: 3)
!51 = !{!52, !53}
!52 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !55, line: 104, baseType: !56)
!55 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 100, size: 32, elements: !57)
!57 = !{!58, !59}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !56, file: !55, line: 102, baseType: !52, size: 16)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !56, file: !55, line: 103, baseType: !52, size: 16, offset: 16)
!60 = !{!0}
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!62 = !{i32 7, !"Dwarf Version", i32 5}
!63 = !{i32 2, !"Debug Info Version", i32 3}
!64 = !{i32 1, !"wchar_size", i32 4}
!65 = !{i32 8, !"PIC Level", i32 2}
!66 = !{i32 7, !"PIE Level", i32 2}
!67 = !{i32 7, !"uwtable", i32 2}
!68 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!69 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!70 = distinct !DISubprogram(name: "init_motion_vector_prediction", scope: !3, file: !3, line: 306, type: !71, scopeLine: 307, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1249)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !73, !7}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !55, line: 273, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !55, line: 197, size: 3840, elements: !76)
!76 = !{!77, !1166, !1167, !1168, !1169, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1198, !1199, !1200, !1201, !1202, !1205, !1206, !1208, !1209, !1210, !1211, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1235, !1236, !1240, !1244, !1248}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !75, file: !55, line: 199, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !55, line: 341, size: 109184, elements: !80)
!80 = !{!81, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !940, !942, !995, !1025, !1052, !1055, !1056, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1091, !1092, !1093, !1094, !1095, !1096, !1099, !1100, !1103, !1104, !1106, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1119, !1120, !1121, !1122, !1123, !1125, !1126, !1127, !1131, !1135, !1139, !1143, !1147, !1148, !1149, !1150, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !79, file: !55, line: 343, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !55, line: 566, size: 6855040, elements: !84)
!84 = !{!85, !171, !228, !332, !334, !336, !394, !396, !397, !398, !399, !400, !403, !423, !435, !436, !437, !438, !439, !440, !444, !445, !447, !448, !449, !450, !451, !452, !454, !456, !459, !460, !462, !463, !464, !465, !466, !468, !469, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !586, !587, !591, !592, !593, !594, !595, !596, !597, !598, !599, !601, !602, !603, !738, !742, !743, !745, !746, !749, !752, !753, !754, !758, !761, !764, !765, !766, !767, !768, !769, !795, !796, !798, !802, !803, !804, !805, !808, !813, !827, !831, !835, !836, !841, !842, !846, !847, !851, !872, !873, !876, !877, !878, !879, !880, !881, !882, !883}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !83, file: !55, line: 568, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !55, line: 850, size: 32128, elements: !88)
!88 = !{!89, !94, !95, !96, !97, !98, !99, !100, !101, !102, !132, !133, !134, !135, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !87, file: !55, line: 852, baseType: !90, size: 2040)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 2040, elements: !92)
!91 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!92 = !{!93}
!93 = !DISubrange(count: 255)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !87, file: !55, line: 853, baseType: !90, size: 2040, offset: 2040)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !87, file: !55, line: 854, baseType: !90, size: 2040, offset: 4080)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !87, file: !55, line: 856, baseType: !7, size: 32, offset: 6144)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !87, file: !55, line: 857, baseType: !7, size: 32, offset: 6176)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !87, file: !55, line: 858, baseType: !7, size: 32, offset: 6208)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !87, file: !55, line: 859, baseType: !7, size: 32, offset: 6240)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !87, file: !55, line: 860, baseType: !7, size: 32, offset: 6272)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !87, file: !55, line: 861, baseType: !7, size: 32, offset: 6304)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !87, file: !55, line: 864, baseType: !103, size: 1088, offset: 6336)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !6, line: 52, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !6, line: 30, size: 1088, elements: !105)
!105 = !{!106, !108, !110, !112, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !104, file: !6, line: 32, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !6, line: 28, baseType: !5)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !104, file: !6, line: 33, baseType: !109, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !6, line: 20, baseType: !14)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !104, file: !6, line: 34, baseType: !111, size: 64, offset: 64)
!111 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !104, file: !6, line: 35, baseType: !113, size: 96, offset: 128)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 3)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !104, file: !6, line: 36, baseType: !113, size: 96, offset: 224)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !104, file: !6, line: 37, baseType: !7, size: 32, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !104, file: !6, line: 38, baseType: !7, size: 32, offset: 352)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !104, file: !6, line: 39, baseType: !7, size: 32, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !104, file: !6, line: 40, baseType: !7, size: 32, offset: 416)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !104, file: !6, line: 41, baseType: !7, size: 32, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !104, file: !6, line: 42, baseType: !7, size: 32, offset: 480)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !104, file: !6, line: 43, baseType: !7, size: 32, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !104, file: !6, line: 44, baseType: !7, size: 32, offset: 544)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !104, file: !6, line: 45, baseType: !113, size: 96, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !104, file: !6, line: 46, baseType: !7, size: 32, offset: 672)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !104, file: !6, line: 47, baseType: !113, size: 96, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !104, file: !6, line: 48, baseType: !113, size: 96, offset: 800)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !104, file: !6, line: 49, baseType: !113, size: 96, offset: 896)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !104, file: !6, line: 50, baseType: !7, size: 32, offset: 992)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !104, file: !6, line: 51, baseType: !7, size: 32, offset: 1024)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !87, file: !55, line: 865, baseType: !103, size: 1088, offset: 7424)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !87, file: !55, line: 867, baseType: !7, size: 32, offset: 8512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !87, file: !55, line: 868, baseType: !7, size: 32, offset: 8544)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !87, file: !55, line: 869, baseType: !136, size: 7744, offset: 8576)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !21, line: 60, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !21, line: 34, size: 7744, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !137, file: !21, line: 37, baseType: !90, size: 2040)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !137, file: !21, line: 38, baseType: !90, size: 2040, offset: 2040)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !137, file: !21, line: 39, baseType: !90, size: 2040, offset: 4080)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !137, file: !21, line: 40, baseType: !7, size: 32, offset: 6144)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !137, file: !21, line: 41, baseType: !144, size: 32, offset: 6176)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !21, line: 32, baseType: !20)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !137, file: !21, line: 42, baseType: !103, size: 1088, offset: 6208)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !137, file: !21, line: 43, baseType: !7, size: 32, offset: 7296)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !137, file: !21, line: 44, baseType: !7, size: 32, offset: 7328)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !137, file: !21, line: 45, baseType: !7, size: 32, offset: 7360)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !137, file: !21, line: 46, baseType: !7, size: 32, offset: 7392)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !137, file: !21, line: 47, baseType: !7, size: 32, offset: 7424)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !137, file: !21, line: 48, baseType: !7, size: 32, offset: 7456)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !137, file: !21, line: 49, baseType: !7, size: 32, offset: 7488)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !137, file: !21, line: 50, baseType: !7, size: 32, offset: 7520)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !137, file: !21, line: 51, baseType: !7, size: 32, offset: 7552)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !137, file: !21, line: 52, baseType: !7, size: 32, offset: 7584)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !137, file: !21, line: 53, baseType: !7, size: 32, offset: 7616)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !137, file: !21, line: 56, baseType: !158, size: 64, offset: 7680)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !87, file: !55, line: 870, baseType: !136, size: 7744, offset: 16320)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !87, file: !55, line: 871, baseType: !136, size: 7744, offset: 24064)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !87, file: !55, line: 873, baseType: !7, size: 32, offset: 31808)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !87, file: !55, line: 884, baseType: !7, size: 32, offset: 31840)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !87, file: !55, line: 885, baseType: !7, size: 32, offset: 31872)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !87, file: !55, line: 886, baseType: !7, size: 32, offset: 31904)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !87, file: !55, line: 890, baseType: !7, size: 32, offset: 31936)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !87, file: !55, line: 893, baseType: !7, size: 32, offset: 31968)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !87, file: !55, line: 894, baseType: !7, size: 32, offset: 32000)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !87, file: !55, line: 895, baseType: !7, size: 32, offset: 32032)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !87, file: !55, line: 897, baseType: !7, size: 32, offset: 32064)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !87, file: !55, line: 899, baseType: !7, size: 32, offset: 32096)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !83, file: !55, line: 569, baseType: !172, size: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !174, line: 138, baseType: !175)
!174 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !174, line: 94, size: 17728, elements: !176)
!176 = !{!177, !178, !179, !180, !181, !182, !183, !187, !192, !196, !199, !200, !201, !202, !203, !207, !208, !209, !210, !211, !212, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !175, file: !174, line: 96, baseType: !7, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !175, file: !174, line: 97, baseType: !31, size: 32, offset: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !175, file: !174, line: 98, baseType: !31, size: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !175, file: !174, line: 99, baseType: !7, size: 32, offset: 96)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !175, file: !174, line: 100, baseType: !7, size: 32, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !175, file: !174, line: 102, baseType: !7, size: 32, offset: 160)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !175, file: !174, line: 103, baseType: !184, size: 384, offset: 192)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 384, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 12)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !175, file: !174, line: 104, baseType: !188, size: 3072, offset: 576)
!188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3072, elements: !189)
!189 = !{!190, !191}
!190 = !DISubrange(count: 6)
!191 = !DISubrange(count: 16)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !175, file: !174, line: 105, baseType: !193, size: 12288, offset: 3648)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 12288, elements: !194)
!194 = !{!190, !195}
!195 = !DISubrange(count: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !175, file: !174, line: 106, baseType: !197, size: 192, offset: 15936)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !198)
!198 = !{!190}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !175, file: !174, line: 107, baseType: !197, size: 192, offset: 16128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !175, file: !174, line: 110, baseType: !7, size: 32, offset: 16320)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !175, file: !174, line: 111, baseType: !31, size: 32, offset: 16352)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !175, file: !174, line: 112, baseType: !31, size: 32, offset: 16384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !175, file: !174, line: 114, baseType: !204, size: 256, offset: 16416)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 256, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 8)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !175, file: !174, line: 116, baseType: !204, size: 256, offset: 16672)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !175, file: !174, line: 117, baseType: !204, size: 256, offset: 16928)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !175, file: !174, line: 119, baseType: !7, size: 32, offset: 17184)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !175, file: !174, line: 120, baseType: !31, size: 32, offset: 17216)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !175, file: !174, line: 122, baseType: !31, size: 32, offset: 17248)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !175, file: !174, line: 123, baseType: !213, size: 64, offset: 17280)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !215, line: 21, baseType: !216)
!215 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!216 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !175, file: !174, line: 125, baseType: !7, size: 32, offset: 17344)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !175, file: !174, line: 126, baseType: !7, size: 32, offset: 17376)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !175, file: !174, line: 127, baseType: !7, size: 32, offset: 17408)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !175, file: !174, line: 128, baseType: !31, size: 32, offset: 17440)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !175, file: !174, line: 129, baseType: !7, size: 32, offset: 17472)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !175, file: !174, line: 130, baseType: !7, size: 32, offset: 17504)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !175, file: !174, line: 131, baseType: !7, size: 32, offset: 17536)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !175, file: !174, line: 133, baseType: !7, size: 32, offset: 17568)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !175, file: !174, line: 135, baseType: !7, size: 32, offset: 17600)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !175, file: !174, line: 136, baseType: !7, size: 32, offset: 17632)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !175, file: !174, line: 137, baseType: !7, size: 32, offset: 17664)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !83, file: !55, line: 570, baseType: !229, size: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !174, line: 197, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !174, line: 142, size: 33024, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !330, !331}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !231, file: !174, line: 144, baseType: !7, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !231, file: !174, line: 146, baseType: !31, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !231, file: !174, line: 147, baseType: !7, size: 32, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !231, file: !174, line: 148, baseType: !7, size: 32, offset: 96)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !231, file: !174, line: 149, baseType: !7, size: 32, offset: 128)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !231, file: !174, line: 150, baseType: !7, size: 32, offset: 160)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !231, file: !174, line: 152, baseType: !7, size: 32, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !231, file: !174, line: 154, baseType: !31, size: 32, offset: 224)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !231, file: !174, line: 155, baseType: !31, size: 32, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !231, file: !174, line: 156, baseType: !31, size: 32, offset: 288)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !231, file: !174, line: 158, baseType: !7, size: 32, offset: 320)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !231, file: !174, line: 159, baseType: !184, size: 384, offset: 352)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !231, file: !174, line: 160, baseType: !188, size: 3072, offset: 736)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !231, file: !174, line: 161, baseType: !193, size: 12288, offset: 3808)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !231, file: !174, line: 162, baseType: !197, size: 192, offset: 16096)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !231, file: !174, line: 163, baseType: !197, size: 192, offset: 16288)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !231, file: !174, line: 165, baseType: !31, size: 32, offset: 16480)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !231, file: !174, line: 166, baseType: !31, size: 32, offset: 16512)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !231, file: !174, line: 167, baseType: !31, size: 32, offset: 16544)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !231, file: !174, line: 168, baseType: !31, size: 32, offset: 16576)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !231, file: !174, line: 170, baseType: !31, size: 32, offset: 16608)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !231, file: !174, line: 172, baseType: !7, size: 32, offset: 16640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !231, file: !174, line: 173, baseType: !7, size: 32, offset: 16672)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !231, file: !174, line: 174, baseType: !7, size: 32, offset: 16704)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !231, file: !174, line: 175, baseType: !31, size: 32, offset: 16736)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !231, file: !174, line: 177, baseType: !259, size: 8192, offset: 16768)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 256)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !231, file: !174, line: 178, baseType: !31, size: 32, offset: 24960)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !231, file: !174, line: 179, baseType: !7, size: 32, offset: 24992)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !231, file: !174, line: 180, baseType: !31, size: 32, offset: 25024)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !231, file: !174, line: 181, baseType: !31, size: 32, offset: 25056)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !231, file: !174, line: 182, baseType: !7, size: 32, offset: 25088)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !231, file: !174, line: 184, baseType: !7, size: 32, offset: 25120)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !231, file: !174, line: 185, baseType: !7, size: 32, offset: 25152)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !231, file: !174, line: 186, baseType: !7, size: 32, offset: 25184)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !231, file: !174, line: 187, baseType: !31, size: 32, offset: 25216)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !231, file: !174, line: 188, baseType: !31, size: 32, offset: 25248)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !231, file: !174, line: 189, baseType: !31, size: 32, offset: 25280)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !231, file: !174, line: 190, baseType: !31, size: 32, offset: 25312)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !231, file: !174, line: 191, baseType: !7, size: 32, offset: 25344)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !231, file: !174, line: 192, baseType: !276, size: 7584, offset: 25376)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !174, line: 90, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !174, line: 53, size: 7584, elements: !278)
!278 = !{!279, !280, !281, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !277, file: !174, line: 55, baseType: !7, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !277, file: !174, line: 56, baseType: !31, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !277, file: !174, line: 57, baseType: !282, size: 16, offset: 64)
!282 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !277, file: !174, line: 58, baseType: !282, size: 16, offset: 80)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !277, file: !174, line: 59, baseType: !7, size: 32, offset: 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !277, file: !174, line: 60, baseType: !7, size: 32, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !277, file: !174, line: 61, baseType: !7, size: 32, offset: 160)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !277, file: !174, line: 62, baseType: !31, size: 32, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !277, file: !174, line: 63, baseType: !7, size: 32, offset: 224)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !277, file: !174, line: 64, baseType: !7, size: 32, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !277, file: !174, line: 65, baseType: !31, size: 32, offset: 288)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !277, file: !174, line: 66, baseType: !31, size: 32, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !277, file: !174, line: 67, baseType: !31, size: 32, offset: 352)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !277, file: !174, line: 68, baseType: !7, size: 32, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !277, file: !174, line: 69, baseType: !31, size: 32, offset: 416)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !277, file: !174, line: 70, baseType: !31, size: 32, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !277, file: !174, line: 71, baseType: !7, size: 32, offset: 480)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !277, file: !174, line: 72, baseType: !31, size: 32, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !277, file: !174, line: 73, baseType: !31, size: 32, offset: 544)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !277, file: !174, line: 74, baseType: !7, size: 32, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !277, file: !174, line: 75, baseType: !7, size: 32, offset: 608)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !277, file: !174, line: 76, baseType: !302, size: 3296, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !174, line: 50, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !174, line: 38, size: 3296, elements: !304)
!304 = !{!305, !306, !307, !308, !312, !313, !314, !315, !316, !317}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !303, file: !174, line: 40, baseType: !31, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !303, file: !174, line: 41, baseType: !31, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !303, file: !174, line: 42, baseType: !31, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !303, file: !174, line: 43, baseType: !309, size: 1024, offset: 96)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1024, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !303, file: !174, line: 44, baseType: !309, size: 1024, offset: 1120)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !303, file: !174, line: 45, baseType: !309, size: 1024, offset: 2144)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !303, file: !174, line: 46, baseType: !31, size: 32, offset: 3168)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !303, file: !174, line: 47, baseType: !31, size: 32, offset: 3200)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !303, file: !174, line: 48, baseType: !31, size: 32, offset: 3232)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !303, file: !174, line: 49, baseType: !31, size: 32, offset: 3264)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !277, file: !174, line: 77, baseType: !7, size: 32, offset: 3936)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !277, file: !174, line: 78, baseType: !302, size: 3296, offset: 3968)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !277, file: !174, line: 80, baseType: !7, size: 32, offset: 7264)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !277, file: !174, line: 81, baseType: !7, size: 32, offset: 7296)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !277, file: !174, line: 82, baseType: !7, size: 32, offset: 7328)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !277, file: !174, line: 83, baseType: !7, size: 32, offset: 7360)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !277, file: !174, line: 84, baseType: !31, size: 32, offset: 7392)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !277, file: !174, line: 85, baseType: !31, size: 32, offset: 7424)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !277, file: !174, line: 86, baseType: !31, size: 32, offset: 7456)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !277, file: !174, line: 87, baseType: !31, size: 32, offset: 7488)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !277, file: !174, line: 88, baseType: !31, size: 32, offset: 7520)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !277, file: !174, line: 89, baseType: !31, size: 32, offset: 7552)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !231, file: !174, line: 193, baseType: !31, size: 32, offset: 32960)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !231, file: !174, line: 195, baseType: !7, size: 32, offset: 32992)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !83, file: !55, line: 571, baseType: !333, size: 1056768, offset: 192)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 1056768, elements: !310)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !83, file: !55, line: 572, baseType: !335, size: 4538368, offset: 1056960)
!335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 4538368, elements: !260)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !83, file: !55, line: 575, baseType: !337, size: 64, offset: 5595328)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !174, line: 256, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !174, line: 228, size: 37312, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !361, !362, !363, !364}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !339, file: !174, line: 230, baseType: !230, size: 33024)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !339, file: !174, line: 232, baseType: !31, size: 32, offset: 33024)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !339, file: !174, line: 233, baseType: !7, size: 32, offset: 33056)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !339, file: !174, line: 234, baseType: !158, size: 64, offset: 33088)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !339, file: !174, line: 235, baseType: !158, size: 64, offset: 33152)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !339, file: !174, line: 236, baseType: !347, size: 64, offset: 33216)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !339, file: !174, line: 237, baseType: !158, size: 64, offset: 33280)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !339, file: !174, line: 238, baseType: !347, size: 64, offset: 33344)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !339, file: !174, line: 240, baseType: !158, size: 64, offset: 33408)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !339, file: !174, line: 241, baseType: !347, size: 64, offset: 33472)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !339, file: !174, line: 242, baseType: !158, size: 64, offset: 33536)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !339, file: !174, line: 243, baseType: !347, size: 64, offset: 33600)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !339, file: !174, line: 245, baseType: !7, size: 32, offset: 33664)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !339, file: !174, line: 246, baseType: !158, size: 64, offset: 33728)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !339, file: !174, line: 247, baseType: !158, size: 64, offset: 33792)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !339, file: !174, line: 248, baseType: !347, size: 64, offset: 33856)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !339, file: !174, line: 249, baseType: !347, size: 64, offset: 33920)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !339, file: !174, line: 250, baseType: !360, size: 64, offset: 33984)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !339, file: !174, line: 251, baseType: !347, size: 64, offset: 34048)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !339, file: !174, line: 253, baseType: !31, size: 32, offset: 34112)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !339, file: !174, line: 254, baseType: !7, size: 32, offset: 34144)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !339, file: !174, line: 255, baseType: !365, size: 3136, offset: 34176)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !174, line: 226, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !174, line: 200, size: 3136, elements: !367)
!367 = !{!368, !369, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !387, !388, !390, !391, !392, !393}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !366, file: !174, line: 202, baseType: !7, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !366, file: !174, line: 203, baseType: !370, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64)
!371 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !366, file: !174, line: 204, baseType: !158, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !366, file: !174, line: 205, baseType: !347, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !366, file: !174, line: 206, baseType: !370, size: 64, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !366, file: !174, line: 207, baseType: !158, size: 64, offset: 320)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !366, file: !174, line: 208, baseType: !158, size: 64, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !366, file: !174, line: 209, baseType: !370, size: 64, offset: 448)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !366, file: !174, line: 210, baseType: !370, size: 64, offset: 512)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !366, file: !174, line: 211, baseType: !370, size: 64, offset: 576)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !366, file: !174, line: 212, baseType: !370, size: 64, offset: 640)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !366, file: !174, line: 213, baseType: !370, size: 64, offset: 704)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !366, file: !174, line: 216, baseType: !371, size: 8, offset: 768)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !366, file: !174, line: 217, baseType: !371, size: 8, offset: 776)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !366, file: !174, line: 218, baseType: !371, size: 8, offset: 784)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !366, file: !174, line: 219, baseType: !386, size: 1024, offset: 800)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !310)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !366, file: !174, line: 220, baseType: !386, size: 1024, offset: 1824)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !366, file: !174, line: 221, baseType: !389, size: 256, offset: 2848)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 256, elements: !310)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !366, file: !174, line: 222, baseType: !371, size: 8, offset: 3104)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !366, file: !174, line: 223, baseType: !371, size: 8, offset: 3112)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !366, file: !174, line: 224, baseType: !371, size: 8, offset: 3120)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !366, file: !174, line: 225, baseType: !371, size: 8, offset: 3128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !83, file: !55, line: 577, baseType: !395, size: 1193984, offset: 5595392)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 1193984, elements: !310)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !83, file: !55, line: 578, baseType: !7, size: 32, offset: 6789376)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !83, file: !55, line: 579, baseType: !7, size: 32, offset: 6789408)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !83, file: !55, line: 580, baseType: !7, size: 32, offset: 6789440)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !83, file: !55, line: 581, baseType: !7, size: 32, offset: 6789472)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !83, file: !55, line: 584, baseType: !401, size: 64, offset: 6789504)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !55, line: 584, flags: DIFlagFwdDecl)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !83, file: !55, line: 586, baseType: !404, size: 64, offset: 6789568)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !55, line: 902, size: 416, elements: !406)
!406 = !{!407, !408, !409, !410, !411, !412, !416, !417, !418, !419, !420, !421, !422}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !405, file: !55, line: 904, baseType: !31, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !405, file: !55, line: 905, baseType: !31, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !405, file: !55, line: 906, baseType: !7, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !405, file: !55, line: 907, baseType: !31, size: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !405, file: !55, line: 908, baseType: !7, size: 32, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !405, file: !55, line: 909, baseType: !413, size: 64, offset: 160)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 2)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !405, file: !55, line: 910, baseType: !214, size: 8, offset: 224)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !405, file: !55, line: 911, baseType: !214, size: 8, offset: 232)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !405, file: !55, line: 912, baseType: !7, size: 32, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !405, file: !55, line: 913, baseType: !7, size: 32, offset: 288)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !405, file: !55, line: 915, baseType: !7, size: 32, offset: 320)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !405, file: !55, line: 916, baseType: !7, size: 32, offset: 352)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !405, file: !55, line: 917, baseType: !7, size: 32, offset: 384)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !83, file: !55, line: 587, baseType: !424, size: 64, offset: 6789632)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !55, line: 839, size: 512, elements: !426)
!426 = !{!427, !428, !431, !432, !433, !434}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !425, file: !55, line: 841, baseType: !7, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !425, file: !55, line: 842, baseType: !429, size: 96, offset: 32)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 96, elements: !114)
!430 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !425, file: !55, line: 843, baseType: !429, size: 96, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !425, file: !55, line: 844, baseType: !429, size: 96, offset: 224)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !425, file: !55, line: 845, baseType: !429, size: 96, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !425, file: !55, line: 846, baseType: !429, size: 96, offset: 416)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !83, file: !55, line: 588, baseType: !7, size: 32, offset: 6789696)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !83, file: !55, line: 591, baseType: !31, size: 32, offset: 6789728)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !83, file: !55, line: 592, baseType: !7, size: 32, offset: 6789760)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !83, file: !55, line: 593, baseType: !7, size: 32, offset: 6789792)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !83, file: !55, line: 594, baseType: !7, size: 32, offset: 6789824)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !83, file: !55, line: 595, baseType: !441, size: 64, offset: 6789888)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !55, line: 542, baseType: !79)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !83, file: !55, line: 596, baseType: !370, size: 64, offset: 6789952)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block_JV", scope: !83, file: !55, line: 597, baseType: !446, size: 192, offset: 6790016)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 192, elements: !114)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !83, file: !55, line: 601, baseType: !7, size: 32, offset: 6790208)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !83, file: !55, line: 602, baseType: !7, size: 32, offset: 6790240)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !83, file: !55, line: 603, baseType: !7, size: 32, offset: 6790272)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !83, file: !55, line: 604, baseType: !7, size: 32, offset: 6790304)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !83, file: !55, line: 605, baseType: !7, size: 32, offset: 6790336)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !83, file: !55, line: 607, baseType: !453, size: 64, offset: 6790400)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode_JV", scope: !83, file: !55, line: 608, baseType: !455, size: 192, offset: 6790464)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 192, elements: !114)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !83, file: !55, line: 609, baseType: !457, size: 64, offset: 6790656)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "siblock", scope: !83, file: !55, line: 610, baseType: !347, size: 64, offset: 6790720)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "siblock_JV", scope: !83, file: !55, line: 611, baseType: !461, size: 192, offset: 6790784)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 192, elements: !114)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "newframe", scope: !83, file: !55, line: 613, baseType: !7, size: 32, offset: 6790976)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !83, file: !55, line: 614, baseType: !7, size: 32, offset: 6791008)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pNextSlice", scope: !83, file: !55, line: 617, baseType: !442, size: 64, offset: 6791040)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !83, file: !55, line: 618, baseType: !73, size: 64, offset: 6791104)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data_JV", scope: !83, file: !55, line: 619, baseType: !467, size: 192, offset: 6791168)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 192, elements: !114)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaArrayType", scope: !83, file: !55, line: 621, baseType: !7, size: 32, offset: 6791360)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_head", scope: !83, file: !55, line: 626, baseType: !470, size: 64, offset: 6791424)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !55, line: 626, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_end", scope: !83, file: !55, line: 627, baseType: !470, size: 64, offset: 6791488)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !83, file: !55, line: 629, baseType: !31, size: 32, offset: 6791552)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "non_conforming_stream", scope: !83, file: !55, line: 630, baseType: !7, size: 32, offset: 6791584)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntMsb", scope: !83, file: !55, line: 634, baseType: !7, size: 32, offset: 6791616)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntLsb", scope: !83, file: !55, line: 635, baseType: !31, size: 32, offset: 6791648)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedPicOrderCnt", scope: !83, file: !55, line: 638, baseType: !7, size: 32, offset: 6791680)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntCycleCnt", scope: !83, file: !55, line: 638, baseType: !7, size: 32, offset: 6791712)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumInPicOrderCntCycle", scope: !83, file: !55, line: 638, baseType: !7, size: 32, offset: 6791744)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNum", scope: !83, file: !55, line: 639, baseType: !31, size: 32, offset: 6791776)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumOffset", scope: !83, file: !55, line: 639, baseType: !31, size: 32, offset: 6791808)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDeltaPerPicOrderCntCycle", scope: !83, file: !55, line: 640, baseType: !7, size: 32, offset: 6791840)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !83, file: !55, line: 641, baseType: !7, size: 32, offset: 6791872)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNumOffset", scope: !83, file: !55, line: 642, baseType: !7, size: 32, offset: 6791904)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFrameNum", scope: !83, file: !55, line: 645, baseType: !7, size: 32, offset: 6791936)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !83, file: !55, line: 647, baseType: !31, size: 32, offset: 6791968)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !83, file: !55, line: 648, baseType: !31, size: 32, offset: 6792000)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !83, file: !55, line: 649, baseType: !31, size: 32, offset: 6792032)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !83, file: !55, line: 650, baseType: !31, size: 32, offset: 6792064)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !83, file: !55, line: 651, baseType: !31, size: 32, offset: 6792096)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !83, file: !55, line: 652, baseType: !31, size: 32, offset: 6792128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "oldFrameSizeInMbs", scope: !83, file: !55, line: 653, baseType: !31, size: 32, offset: 6792160)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !83, file: !55, line: 655, baseType: !7, size: 32, offset: 6792192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !83, file: !55, line: 657, baseType: !7, size: 32, offset: 6792224)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !83, file: !55, line: 658, baseType: !7, size: 32, offset: 6792256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_bitsize_on_disk", scope: !83, file: !55, line: 661, baseType: !7, size: 32, offset: 6792288)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !83, file: !55, line: 662, baseType: !52, size: 16, offset: 6792320)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !83, file: !55, line: 663, baseType: !52, size: 16, offset: 6792336)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_scale", scope: !83, file: !55, line: 664, baseType: !413, size: 64, offset: 6792352)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !83, file: !55, line: 665, baseType: !7, size: 32, offset: 6792416)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !83, file: !55, line: 666, baseType: !7, size: 32, offset: 6792448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value_comp", scope: !83, file: !55, line: 667, baseType: !503, size: 96, offset: 6792480)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 96, elements: !114)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "max_pel_value_comp", scope: !83, file: !55, line: 668, baseType: !113, size: 96, offset: 6792576)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !83, file: !55, line: 670, baseType: !7, size: 32, offset: 6792672)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !83, file: !55, line: 671, baseType: !7, size: 32, offset: 6792704)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !83, file: !55, line: 672, baseType: !7, size: 32, offset: 6792736)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !83, file: !55, line: 673, baseType: !7, size: 32, offset: 6792768)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "num_uv_blocks", scope: !83, file: !55, line: 674, baseType: !7, size: 32, offset: 6792800)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !83, file: !55, line: 675, baseType: !7, size: 32, offset: 6792832)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !83, file: !55, line: 676, baseType: !7, size: 32, offset: 6792864)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !83, file: !55, line: 677, baseType: !7, size: 32, offset: 6792896)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x_blk", scope: !83, file: !55, line: 678, baseType: !7, size: 32, offset: 6792928)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y_blk", scope: !83, file: !55, line: 679, baseType: !7, size: 32, offset: 6792960)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !83, file: !55, line: 680, baseType: !516, size: 192, offset: 6792992)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !517)
!517 = !{!115, !415}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_blk", scope: !83, file: !55, line: 681, baseType: !516, size: 192, offset: 6793184)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_shift", scope: !83, file: !55, line: 682, baseType: !516, size: 192, offset: 6793376)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_x", scope: !83, file: !55, line: 683, baseType: !7, size: 32, offset: 6793568)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_y", scope: !83, file: !55, line: 684, baseType: !7, size: 32, offset: 6793600)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_x", scope: !83, file: !55, line: 685, baseType: !7, size: 32, offset: 6793632)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_y", scope: !83, file: !55, line: 686, baseType: !7, size: 32, offset: 6793664)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "total_scale", scope: !83, file: !55, line: 687, baseType: !7, size: 32, offset: 6793696)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "max_vmv_r", scope: !83, file: !55, line: 689, baseType: !7, size: 32, offset: 6793728)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "idr_psnr_number", scope: !83, file: !55, line: 692, baseType: !7, size: 32, offset: 6793760)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "psnr_number", scope: !83, file: !55, line: 693, baseType: !7, size: 32, offset: 6793792)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "last_ref_pic_poc", scope: !83, file: !55, line: 700, baseType: !7, size: 32, offset: 6793824)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !83, file: !55, line: 701, baseType: !7, size: 32, offset: 6793856)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !83, file: !55, line: 702, baseType: !7, size: 32, offset: 6793888)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !83, file: !55, line: 703, baseType: !7, size: 32, offset: 6793920)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "earlier_missing_poc", scope: !83, file: !55, line: 704, baseType: !7, size: 32, offset: 6793952)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_conceal", scope: !83, file: !55, line: 705, baseType: !31, size: 32, offset: 6793984)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "IDR_concealment_flag", scope: !83, file: !55, line: 706, baseType: !7, size: 32, offset: 6794016)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_slice_type", scope: !83, file: !55, line: 707, baseType: !7, size: 32, offset: 6794048)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point", scope: !83, file: !55, line: 710, baseType: !7, size: 32, offset: 6794080)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point_found", scope: !83, file: !55, line: 711, baseType: !7, size: 32, offset: 6794112)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_cnt", scope: !83, file: !55, line: 712, baseType: !7, size: 32, offset: 6794144)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_num", scope: !83, file: !55, line: 713, baseType: !7, size: 32, offset: 6794176)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_poc", scope: !83, file: !55, line: 714, baseType: !7, size: 32, offset: 6794208)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !83, file: !55, line: 716, baseType: !7, size: 32, offset: 6794240)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !83, file: !55, line: 717, baseType: !7, size: 32, offset: 6794272)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !83, file: !55, line: 719, baseType: !213, size: 64, offset: 6794304)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !83, file: !55, line: 720, baseType: !213, size: 64, offset: 6794368)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "imgData", scope: !83, file: !55, line: 722, baseType: !546, size: 2560, offset: 6794432)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageData", file: !547, line: 38, baseType: !548)
!547 = !DIFile(filename: "ldecod_src/inc/io_image.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "8caef624e6f5391b0c6ab2984e7f77c6")
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "image_data", file: !547, line: 20, size: 2560, elements: !549)
!549 = !{!550, !551, !557, !558, !559, !563, !564, !565, !566, !567}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !548, file: !547, line: 22, baseType: !103, size: 1088)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "frm_data", scope: !548, file: !547, line: 24, baseType: !552, size: 192, offset: 1088)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 192, elements: !114)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !215, line: 41, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !215, line: 23, baseType: !282)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "top_data", scope: !548, file: !547, line: 25, baseType: !552, size: 192, offset: 1280)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "bot_data", scope: !548, file: !547, line: 26, baseType: !552, size: 192, offset: 1472)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "frm_uint16", scope: !548, file: !547, line: 31, baseType: !560, size: 192, offset: 1664)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 192, elements: !114)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "top_uint16", scope: !548, file: !547, line: 32, baseType: !560, size: 192, offset: 1856)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "bot_uint16", scope: !548, file: !547, line: 33, baseType: !560, size: 192, offset: 2048)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "frm_stride", scope: !548, file: !547, line: 35, baseType: !113, size: 96, offset: 2240)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "top_stride", scope: !548, file: !547, line: 36, baseType: !113, size: 96, offset: 2336)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "bot_stride", scope: !548, file: !547, line: 37, baseType: !113, size: 96, offset: 2432)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "imgData0", scope: !83, file: !55, line: 723, baseType: !546, size: 2560, offset: 6796992)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "imgData1", scope: !83, file: !55, line: 724, baseType: !546, size: 2560, offset: 6799552)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "imgData2", scope: !83, file: !55, line: 725, baseType: !546, size: 2560, offset: 6802112)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "imgData32", scope: !83, file: !55, line: 728, baseType: !546, size: 2560, offset: 6804672)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "imgData4", scope: !83, file: !55, line: 729, baseType: !546, size: 2560, offset: 6807232)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "imgData5", scope: !83, file: !55, line: 730, baseType: !546, size: 2560, offset: 6809792)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "imgData6", scope: !83, file: !55, line: 731, baseType: !546, size: 2560, offset: 6812352)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "previous_frame_num", scope: !83, file: !55, line: 735, baseType: !31, size: 32, offset: 6814912)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Is_primary_correct", scope: !83, file: !55, line: 737, baseType: !7, size: 32, offset: 6814944)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Is_redundant_correct", scope: !83, file: !55, line: 738, baseType: !7, size: 32, offset: 6814976)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "tot_time", scope: !83, file: !55, line: 741, baseType: !579, size: 64, offset: 6815040)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !580, line: 103, baseType: !581)
!580 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !582, line: 27, baseType: !583)
!582 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !584, line: 44, baseType: !585)
!584 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!585 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "p_out", scope: !83, file: !55, line: 744, baseType: !7, size: 32, offset: 6815104)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "p_out_mvc", scope: !83, file: !55, line: 746, baseType: !588, size: 32768, offset: 6815136)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32768, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 1024)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "p_ref", scope: !83, file: !55, line: 748, baseType: !7, size: 32, offset: 6847904)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessUnitExists", scope: !83, file: !55, line: 751, baseType: !7, size: 32, offset: 6847936)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "NALUCount", scope: !83, file: !55, line: 752, baseType: !7, size: 32, offset: 6847968)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Bframe_ctr", scope: !83, file: !55, line: 755, baseType: !7, size: 32, offset: 6848000)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "frame_no", scope: !83, file: !55, line: 756, baseType: !7, size: 32, offset: 6848032)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "g_nFrame", scope: !83, file: !55, line: 758, baseType: !7, size: 32, offset: 6848064)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "global_init_done", scope: !83, file: !55, line: 759, baseType: !7, size: 32, offset: 6848096)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ref", scope: !83, file: !55, line: 762, baseType: !553, size: 64, offset: 6848128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV_ref", scope: !83, file: !55, line: 763, baseType: !600, size: 64, offset: 6848192)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "qp_per_matrix", scope: !83, file: !55, line: 765, baseType: !158, size: 64, offset: 6848256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "qp_rem_matrix", scope: !83, file: !55, line: 766, baseType: !158, size: 64, offset: 6848320)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "last_out_fs", scope: !83, file: !55, line: 768, baseType: !604, size: 64, offset: 6848384)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !606, line: 152, size: 768, elements: !607)
!606 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !733, !734, !735, !736, !737}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !605, file: !606, line: 154, baseType: !7, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !605, file: !606, line: 155, baseType: !7, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !605, file: !606, line: 156, baseType: !7, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !605, file: !606, line: 157, baseType: !7, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !605, file: !606, line: 159, baseType: !7, size: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !605, file: !606, line: 161, baseType: !31, size: 32, offset: 160)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !605, file: !606, line: 162, baseType: !31, size: 32, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !605, file: !606, line: 164, baseType: !7, size: 32, offset: 224)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !605, file: !606, line: 165, baseType: !7, size: 32, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !605, file: !606, line: 166, baseType: !7, size: 32, offset: 288)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !605, file: !606, line: 167, baseType: !7, size: 32, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !605, file: !606, line: 170, baseType: !7, size: 32, offset: 352)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !605, file: !606, line: 172, baseType: !621, size: 64, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !606, line: 138, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !606, line: 46, size: 3328, elements: !624)
!624 = !{!625, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !673, !675, !679, !681, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !623, file: !606, line: 48, baseType: !626, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !30, line: 140, baseType: !29)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !623, file: !606, line: 50, baseType: !7, size: 32, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !623, file: !606, line: 51, baseType: !7, size: 32, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !623, file: !606, line: 52, baseType: !7, size: 32, offset: 96)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !623, file: !606, line: 53, baseType: !7, size: 32, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !623, file: !606, line: 54, baseType: !31, size: 32, offset: 160)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !623, file: !606, line: 55, baseType: !31, size: 32, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !623, file: !606, line: 57, baseType: !7, size: 32, offset: 224)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !623, file: !606, line: 58, baseType: !7, size: 32, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !623, file: !606, line: 59, baseType: !7, size: 32, offset: 288)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !623, file: !606, line: 61, baseType: !214, size: 8, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !623, file: !606, line: 62, baseType: !7, size: 32, offset: 352)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !623, file: !606, line: 63, baseType: !7, size: 32, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !623, file: !606, line: 64, baseType: !7, size: 32, offset: 416)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !623, file: !606, line: 65, baseType: !7, size: 32, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !623, file: !606, line: 67, baseType: !52, size: 16, offset: 480)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !623, file: !606, line: 69, baseType: !7, size: 32, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !623, file: !606, line: 69, baseType: !7, size: 32, offset: 544)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !623, file: !606, line: 69, baseType: !7, size: 32, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !623, file: !606, line: 69, baseType: !7, size: 32, offset: 608)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !623, file: !606, line: 70, baseType: !7, size: 32, offset: 640)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !623, file: !606, line: 70, baseType: !7, size: 32, offset: 672)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !623, file: !606, line: 70, baseType: !7, size: 32, offset: 704)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !623, file: !606, line: 70, baseType: !7, size: 32, offset: 736)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !623, file: !606, line: 71, baseType: !7, size: 32, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !623, file: !606, line: 72, baseType: !7, size: 32, offset: 800)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !623, file: !606, line: 73, baseType: !31, size: 32, offset: 832)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !623, file: !606, line: 74, baseType: !31, size: 32, offset: 864)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !623, file: !606, line: 75, baseType: !7, size: 32, offset: 896)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !623, file: !606, line: 75, baseType: !7, size: 32, offset: 928)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !623, file: !606, line: 76, baseType: !7, size: 32, offset: 960)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !623, file: !606, line: 76, baseType: !7, size: 32, offset: 992)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !623, file: !606, line: 79, baseType: !553, size: 64, offset: 1024)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !623, file: !606, line: 80, baseType: !600, size: 64, offset: 1088)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !623, file: !606, line: 81, baseType: !600, size: 64, offset: 1152)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !623, file: !606, line: 84, baseType: !662, size: 64, offset: 1216)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !606, line: 36, size: 256, elements: !665)
!665 = !{!666, !669, !671}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !664, file: !606, line: 38, baseType: !667, size: 128)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 128, elements: !414)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !664, file: !606, line: 39, baseType: !670, size: 64, offset: 128)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 64, elements: !414)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !664, file: !606, line: 40, baseType: !672, size: 16, offset: 192)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 16, elements: !414)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !623, file: !606, line: 85, baseType: !674, size: 192, offset: 1280)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 192, elements: !114)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !623, file: !606, line: 87, baseType: !676, size: 64, offset: 1472)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !606, line: 29, size: 64, elements: !677)
!677 = !{!678}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !676, file: !606, line: 31, baseType: !213, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !623, file: !606, line: 88, baseType: !680, size: 192, offset: 1536)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 192, elements: !114)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !623, file: !606, line: 90, baseType: !682, size: 64, offset: 1728)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !623, file: !606, line: 92, baseType: !668, size: 64, offset: 1792)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !623, file: !606, line: 93, baseType: !668, size: 64, offset: 1856)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !623, file: !606, line: 94, baseType: !668, size: 64, offset: 1920)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !623, file: !606, line: 96, baseType: !7, size: 32, offset: 1984)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !623, file: !606, line: 97, baseType: !7, size: 32, offset: 2016)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !623, file: !606, line: 98, baseType: !7, size: 32, offset: 2048)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !623, file: !606, line: 99, baseType: !7, size: 32, offset: 2080)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !623, file: !606, line: 100, baseType: !7, size: 32, offset: 2112)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !623, file: !606, line: 102, baseType: !7, size: 32, offset: 2144)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !623, file: !606, line: 103, baseType: !7, size: 32, offset: 2176)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !623, file: !606, line: 104, baseType: !7, size: 32, offset: 2208)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !623, file: !606, line: 105, baseType: !7, size: 32, offset: 2240)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !623, file: !606, line: 106, baseType: !7, size: 32, offset: 2272)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !623, file: !606, line: 107, baseType: !7, size: 32, offset: 2304)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !623, file: !606, line: 108, baseType: !7, size: 32, offset: 2336)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !623, file: !606, line: 109, baseType: !7, size: 32, offset: 2368)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !623, file: !606, line: 110, baseType: !413, size: 64, offset: 2400)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !623, file: !606, line: 111, baseType: !7, size: 32, offset: 2464)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !623, file: !606, line: 112, baseType: !703, size: 64, offset: 2496)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !55, line: 194, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !55, line: 186, size: 256, elements: !706)
!706 = !{!707, !708, !709, !710, !711, !712}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !705, file: !55, line: 188, baseType: !7, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !705, file: !55, line: 189, baseType: !7, size: 32, offset: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !705, file: !55, line: 190, baseType: !7, size: 32, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !705, file: !55, line: 191, baseType: !7, size: 32, offset: 96)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !705, file: !55, line: 192, baseType: !7, size: 32, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !705, file: !55, line: 193, baseType: !713, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !623, file: !606, line: 115, baseType: !7, size: 32, offset: 2560)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !623, file: !606, line: 118, baseType: !7, size: 32, offset: 2592)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !623, file: !606, line: 119, baseType: !7, size: 32, offset: 2624)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !623, file: !606, line: 120, baseType: !7, size: 32, offset: 2656)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !623, file: !606, line: 121, baseType: !554, size: 64, offset: 2688)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !623, file: !606, line: 124, baseType: !7, size: 32, offset: 2752)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !623, file: !606, line: 125, baseType: !7, size: 32, offset: 2784)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !623, file: !606, line: 126, baseType: !7, size: 32, offset: 2816)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !623, file: !606, line: 128, baseType: !7, size: 32, offset: 2848)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !623, file: !606, line: 129, baseType: !7, size: 32, offset: 2880)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !623, file: !606, line: 130, baseType: !7, size: 32, offset: 2912)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !623, file: !606, line: 131, baseType: !7, size: 32, offset: 2944)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !623, file: !606, line: 132, baseType: !553, size: 64, offset: 3008)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !623, file: !606, line: 133, baseType: !7, size: 32, offset: 3072)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !623, file: !606, line: 134, baseType: !7, size: 32, offset: 3104)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !623, file: !606, line: 136, baseType: !672, size: 16, offset: 3136)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !623, file: !606, line: 137, baseType: !731, size: 128, offset: 3200)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !732, size: 128, elements: !414)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !605, file: !606, line: 173, baseType: !621, size: 64, offset: 448)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !605, file: !606, line: 174, baseType: !621, size: 64, offset: 512)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !605, file: !606, line: 177, baseType: !7, size: 32, offset: 576)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !605, file: !606, line: 178, baseType: !413, size: 64, offset: 608)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !605, file: !606, line: 179, baseType: !413, size: 64, offset: 672)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pocs_in_dpb", scope: !83, file: !55, line: 769, baseType: !739, size: 3200, offset: 6848448)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3200, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 100)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture", scope: !83, file: !55, line: 771, baseType: !668, size: 64, offset: 6851648)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture_JV", scope: !83, file: !55, line: 772, baseType: !744, size: 192, offset: 6851712)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 192, elements: !114)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "no_reference_picture", scope: !83, file: !55, line: 773, baseType: !668, size: 64, offset: 6851904)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "erc_object_list", scope: !83, file: !55, line: 776, baseType: !747, size: 64, offset: 6851968)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "object_buffer", file: !55, line: 776, flags: DIFlagFwdDecl)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "erc_errorVar", scope: !83, file: !55, line: 777, baseType: !750, size: 64, offset: 6852032)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_structure_type, name: "ercVariables_s", file: !55, line: 777, flags: DIFlagFwdDecl)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "erc_mvperMB", scope: !83, file: !55, line: 779, baseType: !7, size: 32, offset: 6852096)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "erc_img", scope: !83, file: !55, line: 780, baseType: !82, size: 64, offset: 6852160)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ec_flag", scope: !83, file: !55, line: 781, baseType: !755, size: 640, offset: 6852224)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 640, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 20)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "annex_b", scope: !83, file: !55, line: 783, baseType: !759, size: 64, offset: 6852864)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DICompositeType(tag: DW_TAG_structure_type, name: "annex_b_struct", file: !55, line: 783, flags: DIFlagFwdDecl)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "bitsfile", scope: !83, file: !55, line: 784, baseType: !762, size: 64, offset: 6852928)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "sBitsFile", file: !55, line: 784, flags: DIFlagFwdDecl)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "out_buffer", scope: !83, file: !55, line: 786, baseType: !604, size: 64, offset: 6852992)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output", scope: !83, file: !55, line: 788, baseType: !668, size: 64, offset: 6853056)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output_state", scope: !83, file: !55, line: 789, baseType: !7, size: 32, offset: 6853120)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_flag", scope: !83, file: !55, line: 790, baseType: !7, size: 32, offset: 6853152)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "BitStreamFile", scope: !83, file: !55, line: 792, baseType: !7, size: 32, offset: 6853184)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !83, file: !55, line: 794, baseType: !770, size: 64, offset: 6853248)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !606, line: 186, size: 33408, elements: !772)
!772 = !{!773, !776, !779, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !771, file: !606, line: 188, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !55, line: 836, baseType: !83)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !771, file: !606, line: 189, baseType: !777, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !55, line: 900, baseType: !87)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !771, file: !606, line: 190, baseType: !780, size: 64, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !606, line: 182, baseType: !605)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ref", scope: !771, file: !606, line: 191, baseType: !780, size: 64, offset: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ltref", scope: !771, file: !606, line: 192, baseType: !780, size: 64, offset: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !771, file: !606, line: 193, baseType: !31, size: 32, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !771, file: !606, line: 194, baseType: !31, size: 32, offset: 352)
