; ModuleID = 'ldecod_src/nalu.c'
source_filename = "ldecod_src/nalu.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [31 x i8] c"initBitsFile : p_Vid->bitsfile\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [42 x i8] c"initBitsFile: Unknown bitstream file mode\00", align 1, !dbg !7
@errortext = external global [300 x i8], align 16
@.str.2 = private unnamed_addr constant [54 x i8] c"Error while getting the NALU in file format %s, exit\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [8 x i8] c"Annex B\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [4 x i8] c"RTP\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [46 x i8] c"Invalid startcode emulation prevention found.\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [46 x i8] c"Found NALU with forbidden_bit set, bit error?\00", align 1, !dbg !32
@.str.9 = private unnamed_addr constant [13 x i8] c"non_idr_flag\00", align 1, !dbg !34
@.str.10 = private unnamed_addr constant [12 x i8] c"priority_id\00", align 1, !dbg !39
@.str.11 = private unnamed_addr constant [8 x i8] c"view_id\00", align 1, !dbg !44
@.str.12 = private unnamed_addr constant [12 x i8] c"temporal_id\00", align 1, !dbg !46
@.str.13 = private unnamed_addr constant [16 x i8] c"anchor_pic_flag\00", align 1, !dbg !48

!87 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!88 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!89 = !{!90, !91, !92}
!90 = !DIEnumerator(name: "FRAME", value: 0)
!91 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!92 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!93 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 22, baseType: !88, size: 32, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100}
!95 = !DIEnumerator(name: "PLANE_Y", value: 0)
!96 = !DIEnumerator(name: "PLANE_U", value: 1)
!97 = !DIEnumerator(name: "PLANE_V", value: 2)
!98 = !DIEnumerator(name: "PLANE_G", value: 0)
!99 = !DIEnumerator(name: "PLANE_B", value: 1)
!100 = !DIEnumerator(name: "PLANE_R", value: 2)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 24, baseType: !88, size: 32, elements: !103)
!102 = !DIFile(filename: "ldecod_src/inc/nalucommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "f9e55677f5f79524218c8a7a94869788")
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119}
!104 = !DIEnumerator(name: "NALU_TYPE_SLICE", value: 1)
!105 = !DIEnumerator(name: "NALU_TYPE_DPA", value: 2)
!106 = !DIEnumerator(name: "NALU_TYPE_DPB", value: 3)
!107 = !DIEnumerator(name: "NALU_TYPE_DPC", value: 4)
!108 = !DIEnumerator(name: "NALU_TYPE_IDR", value: 5)
!109 = !DIEnumerator(name: "NALU_TYPE_SEI", value: 6)
!110 = !DIEnumerator(name: "NALU_TYPE_SPS", value: 7)
!111 = !DIEnumerator(name: "NALU_TYPE_PPS", value: 8)
!112 = !DIEnumerator(name: "NALU_TYPE_AUD", value: 9)
!113 = !DIEnumerator(name: "NALU_TYPE_EOSEQ", value: 10)
!114 = !DIEnumerator(name: "NALU_TYPE_EOSTREAM", value: 11)
!115 = !DIEnumerator(name: "NALU_TYPE_FILL", value: 12)
!116 = !DIEnumerator(name: "NALU_TYPE_PREFIX", value: 14)
!117 = !DIEnumerator(name: "NALU_TYPE_SUB_SPS", value: 15)
!118 = !DIEnumerator(name: "NALU_TYPE_SLC_EXT", value: 20)
!119 = !DIEnumerator(name: "NALU_TYPE_VDRD", value: 24)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !102, line: 46, baseType: !88, size: 32, elements: !121)
!121 = !{!122, !123, !124, !125}
!122 = !DIEnumerator(name: "NALU_PRIORITY_HIGHEST", value: 3)
!123 = !DIEnumerator(name: "NALU_PRIORITY_HIGH", value: 2)
!124 = !DIEnumerator(name: "NALU_PRIORITY_LOW", value: 1)
!125 = !DIEnumerator(name: "NALU_PRIORITY_DISPOSABLE", value: 0)
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 70, baseType: !88, size: 32, elements: !127)
!127 = !{!128, !129}
!128 = !DIEnumerator(name: "PAR_OF_ANNEXB", value: 0)
!129 = !DIEnumerator(name: "PAR_OF_RTP", value: 1)
!130 = !{!131, !1353}
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "BitsFile", file: !133, line: 27, baseType: !134)
!133 = !DIFile(filename: "ldecod_src/inc/nalu.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "b3549c8c215a89e3e10b3ba1698c39db")
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sBitsFile", file: !133, line: 22, size: 192, elements: !135)
!135 = !{!136, !1343, !1347}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "OpenBitsFile", scope: !134, file: !133, line: 24, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !140, !1342}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !142, line: 836, baseType: !143)
!142 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !142, line: 566, size: 6855040, elements: !144)
!144 = !{!145, !230, !282, !386, !388, !390, !448, !450, !451, !452, !453, !454, !457, !477, !489, !490, !491, !492, !493, !494, !1060, !1061, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1071, !1074, !1075, !1077, !1078, !1079, !1080, !1081, !1083, !1084, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1208, !1209, !1211, !1212, !1215, !1218, !1219, !1220, !1224, !1238, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1249, !1252, !1253, !1254, !1255, !1258, !1263, !1267, !1271, !1275, !1276, !1280, !1281, !1285, !1286, !1290, !1311, !1312, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !143, file: !142, line: 568, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !142, line: 850, size: 32128, elements: !148)
!148 = !{!149, !153, !154, !155, !156, !157, !158, !159, !160, !161, !191, !192, !193, !194, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !147, file: !142, line: 852, baseType: !150, size: 2040)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 255)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !147, file: !142, line: 853, baseType: !150, size: 2040, offset: 2040)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !147, file: !142, line: 854, baseType: !150, size: 2040, offset: 4080)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !147, file: !142, line: 856, baseType: !64, size: 32, offset: 6144)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !147, file: !142, line: 857, baseType: !64, size: 32, offset: 6176)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !147, file: !142, line: 858, baseType: !64, size: 32, offset: 6208)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !147, file: !142, line: 859, baseType: !64, size: 32, offset: 6240)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !147, file: !142, line: 860, baseType: !64, size: 32, offset: 6272)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !147, file: !142, line: 861, baseType: !64, size: 32, offset: 6304)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !147, file: !142, line: 864, baseType: !162, size: 1088, offset: 6336)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !63, line: 52, baseType: !163)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !63, line: 30, size: 1088, elements: !164)
!164 = !{!165, !167, !169, !171, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !163, file: !63, line: 32, baseType: !166, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !63, line: 28, baseType: !62)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !163, file: !63, line: 33, baseType: !168, size: 32, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !63, line: 20, baseType: !71)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !163, file: !63, line: 34, baseType: !170, size: 64, offset: 64)
!170 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !163, file: !63, line: 35, baseType: !172, size: 96, offset: 128)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 96, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 3)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !163, file: !63, line: 36, baseType: !172, size: 96, offset: 224)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !163, file: !63, line: 37, baseType: !64, size: 32, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !163, file: !63, line: 38, baseType: !64, size: 32, offset: 352)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !163, file: !63, line: 39, baseType: !64, size: 32, offset: 384)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !163, file: !63, line: 40, baseType: !64, size: 32, offset: 416)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !163, file: !63, line: 41, baseType: !64, size: 32, offset: 448)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !163, file: !63, line: 42, baseType: !64, size: 32, offset: 480)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !163, file: !63, line: 43, baseType: !64, size: 32, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !163, file: !63, line: 44, baseType: !64, size: 32, offset: 544)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !163, file: !63, line: 45, baseType: !172, size: 96, offset: 576)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !163, file: !63, line: 46, baseType: !64, size: 32, offset: 672)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !163, file: !63, line: 47, baseType: !172, size: 96, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !163, file: !63, line: 48, baseType: !172, size: 96, offset: 800)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !163, file: !63, line: 49, baseType: !172, size: 96, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !163, file: !63, line: 50, baseType: !64, size: 32, offset: 992)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !163, file: !63, line: 51, baseType: !64, size: 32, offset: 1024)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !147, file: !142, line: 865, baseType: !162, size: 1088, offset: 7424)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !147, file: !142, line: 867, baseType: !64, size: 32, offset: 8512)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !147, file: !142, line: 868, baseType: !64, size: 32, offset: 8544)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !147, file: !142, line: 869, baseType: !195, size: 7744, offset: 8576)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !78, line: 60, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !78, line: 34, size: 7744, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !196, file: !78, line: 37, baseType: !150, size: 2040)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !196, file: !78, line: 38, baseType: !150, size: 2040, offset: 2040)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !196, file: !78, line: 39, baseType: !150, size: 2040, offset: 4080)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !196, file: !78, line: 40, baseType: !64, size: 32, offset: 6144)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !196, file: !78, line: 41, baseType: !203, size: 32, offset: 6176)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !78, line: 32, baseType: !77)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !196, file: !78, line: 42, baseType: !162, size: 1088, offset: 6208)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !196, file: !78, line: 43, baseType: !64, size: 32, offset: 7296)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !196, file: !78, line: 44, baseType: !64, size: 32, offset: 7328)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !196, file: !78, line: 45, baseType: !64, size: 32, offset: 7360)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !196, file: !78, line: 46, baseType: !64, size: 32, offset: 7392)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !196, file: !78, line: 47, baseType: !64, size: 32, offset: 7424)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !196, file: !78, line: 48, baseType: !64, size: 32, offset: 7456)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !196, file: !78, line: 49, baseType: !64, size: 32, offset: 7488)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !196, file: !78, line: 50, baseType: !64, size: 32, offset: 7520)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !196, file: !78, line: 51, baseType: !64, size: 32, offset: 7552)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !196, file: !78, line: 52, baseType: !64, size: 32, offset: 7584)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !196, file: !78, line: 53, baseType: !64, size: 32, offset: 7616)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !196, file: !78, line: 56, baseType: !217, size: 64, offset: 7680)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !147, file: !142, line: 870, baseType: !195, size: 7744, offset: 16320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !147, file: !142, line: 871, baseType: !195, size: 7744, offset: 24064)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !147, file: !142, line: 873, baseType: !64, size: 32, offset: 31808)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !147, file: !142, line: 884, baseType: !64, size: 32, offset: 31840)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !147, file: !142, line: 885, baseType: !64, size: 32, offset: 31872)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !147, file: !142, line: 886, baseType: !64, size: 32, offset: 31904)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !147, file: !142, line: 890, baseType: !64, size: 32, offset: 31936)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !147, file: !142, line: 893, baseType: !64, size: 32, offset: 31968)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !147, file: !142, line: 894, baseType: !64, size: 32, offset: 32000)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !147, file: !142, line: 895, baseType: !64, size: 32, offset: 32032)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !147, file: !142, line: 897, baseType: !64, size: 32, offset: 32064)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !147, file: !142, line: 899, baseType: !64, size: 32, offset: 32096)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !143, file: !142, line: 569, baseType: !231, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !233, line: 138, baseType: !234)
!233 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 94, size: 17728, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !242, !244, !248, !252, !255, !256, !257, !258, !259, !261, !262, !263, !264, !265, !266, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !234, file: !233, line: 96, baseType: !64, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !234, file: !233, line: 97, baseType: !88, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !234, file: !233, line: 98, baseType: !88, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !234, file: !233, line: 99, baseType: !64, size: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !234, file: !233, line: 100, baseType: !64, size: 32, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !234, file: !233, line: 102, baseType: !64, size: 32, offset: 160)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !234, file: !233, line: 103, baseType: !243, size: 384, offset: 192)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 384, elements: !42)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !234, file: !233, line: 104, baseType: !245, size: 3072, offset: 576)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 3072, elements: !246)
!246 = !{!247, !52}
!247 = !DISubrange(count: 6)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !234, file: !233, line: 105, baseType: !249, size: 12288, offset: 3648)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 12288, elements: !250)
!250 = !{!247, !251}
!251 = !DISubrange(count: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !234, file: !233, line: 106, baseType: !253, size: 192, offset: 15936)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, elements: !254)
!254 = !{!247}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !234, file: !233, line: 107, baseType: !253, size: 192, offset: 16128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !234, file: !233, line: 110, baseType: !64, size: 32, offset: 16320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !234, file: !233, line: 111, baseType: !88, size: 32, offset: 16352)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !234, file: !233, line: 112, baseType: !88, size: 32, offset: 16384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !234, file: !233, line: 114, baseType: !260, size: 256, offset: 16416)
!260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 256, elements: !20)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !234, file: !233, line: 116, baseType: !260, size: 256, offset: 16672)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !234, file: !233, line: 117, baseType: !260, size: 256, offset: 16928)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !234, file: !233, line: 119, baseType: !64, size: 32, offset: 17184)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !234, file: !233, line: 120, baseType: !88, size: 32, offset: 17216)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !234, file: !233, line: 122, baseType: !88, size: 32, offset: 17248)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !234, file: !233, line: 123, baseType: !267, size: 64, offset: 17280)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !269, line: 21, baseType: !270)
!269 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!270 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !234, file: !233, line: 125, baseType: !64, size: 32, offset: 17344)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !234, file: !233, line: 126, baseType: !64, size: 32, offset: 17376)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !234, file: !233, line: 127, baseType: !64, size: 32, offset: 17408)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !234, file: !233, line: 128, baseType: !88, size: 32, offset: 17440)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !234, file: !233, line: 129, baseType: !64, size: 32, offset: 17472)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !234, file: !233, line: 130, baseType: !64, size: 32, offset: 17504)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !234, file: !233, line: 131, baseType: !64, size: 32, offset: 17536)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !234, file: !233, line: 133, baseType: !64, size: 32, offset: 17568)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !234, file: !233, line: 135, baseType: !64, size: 32, offset: 17600)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !234, file: !233, line: 136, baseType: !64, size: 32, offset: 17632)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !234, file: !233, line: 137, baseType: !64, size: 32, offset: 17664)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !143, file: !142, line: 570, baseType: !283, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !233, line: 197, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 142, size: 33024, elements: !286)
!286 = !{!287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !384, !385}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !285, file: !233, line: 144, baseType: !64, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !285, file: !233, line: 146, baseType: !88, size: 32, offset: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !285, file: !233, line: 147, baseType: !64, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !285, file: !233, line: 148, baseType: !64, size: 32, offset: 96)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !285, file: !233, line: 149, baseType: !64, size: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !285, file: !233, line: 150, baseType: !64, size: 32, offset: 160)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !285, file: !233, line: 152, baseType: !64, size: 32, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !285, file: !233, line: 154, baseType: !88, size: 32, offset: 224)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !285, file: !233, line: 155, baseType: !88, size: 32, offset: 256)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !285, file: !233, line: 156, baseType: !88, size: 32, offset: 288)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !285, file: !233, line: 158, baseType: !64, size: 32, offset: 320)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !285, file: !233, line: 159, baseType: !243, size: 384, offset: 352)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !285, file: !233, line: 160, baseType: !245, size: 3072, offset: 736)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !285, file: !233, line: 161, baseType: !249, size: 12288, offset: 3808)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !285, file: !233, line: 162, baseType: !253, size: 192, offset: 16096)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !285, file: !233, line: 163, baseType: !253, size: 192, offset: 16288)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !285, file: !233, line: 165, baseType: !88, size: 32, offset: 16480)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !285, file: !233, line: 166, baseType: !88, size: 32, offset: 16512)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !285, file: !233, line: 167, baseType: !88, size: 32, offset: 16544)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !285, file: !233, line: 168, baseType: !88, size: 32, offset: 16576)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !285, file: !233, line: 170, baseType: !88, size: 32, offset: 16608)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !285, file: !233, line: 172, baseType: !64, size: 32, offset: 16640)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !285, file: !233, line: 173, baseType: !64, size: 32, offset: 16672)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !285, file: !233, line: 174, baseType: !64, size: 32, offset: 16704)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !285, file: !233, line: 175, baseType: !88, size: 32, offset: 16736)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !285, file: !233, line: 177, baseType: !313, size: 8192, offset: 16768)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 8192, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !285, file: !233, line: 178, baseType: !88, size: 32, offset: 24960)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !285, file: !233, line: 179, baseType: !64, size: 32, offset: 24992)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !285, file: !233, line: 180, baseType: !88, size: 32, offset: 25024)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !285, file: !233, line: 181, baseType: !88, size: 32, offset: 25056)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !285, file: !233, line: 182, baseType: !64, size: 32, offset: 25088)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !285, file: !233, line: 184, baseType: !64, size: 32, offset: 25120)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !285, file: !233, line: 185, baseType: !64, size: 32, offset: 25152)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !285, file: !233, line: 186, baseType: !64, size: 32, offset: 25184)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !285, file: !233, line: 187, baseType: !88, size: 32, offset: 25216)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !285, file: !233, line: 188, baseType: !88, size: 32, offset: 25248)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !285, file: !233, line: 189, baseType: !88, size: 32, offset: 25280)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !285, file: !233, line: 190, baseType: !88, size: 32, offset: 25312)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !285, file: !233, line: 191, baseType: !64, size: 32, offset: 25344)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !285, file: !233, line: 192, baseType: !330, size: 7584, offset: 25376)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !233, line: 90, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 53, size: 7584, elements: !332)
!332 = !{!333, !334, !335, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !331, file: !233, line: 55, baseType: !64, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !331, file: !233, line: 56, baseType: !88, size: 32, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !331, file: !233, line: 57, baseType: !336, size: 16, offset: 64)
!336 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !331, file: !233, line: 58, baseType: !336, size: 16, offset: 80)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !331, file: !233, line: 59, baseType: !64, size: 32, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !331, file: !233, line: 60, baseType: !64, size: 32, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !331, file: !233, line: 61, baseType: !64, size: 32, offset: 160)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !331, file: !233, line: 62, baseType: !88, size: 32, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !331, file: !233, line: 63, baseType: !64, size: 32, offset: 224)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !331, file: !233, line: 64, baseType: !64, size: 32, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !331, file: !233, line: 65, baseType: !88, size: 32, offset: 288)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !331, file: !233, line: 66, baseType: !88, size: 32, offset: 320)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !331, file: !233, line: 67, baseType: !88, size: 32, offset: 352)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !331, file: !233, line: 68, baseType: !64, size: 32, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !331, file: !233, line: 69, baseType: !88, size: 32, offset: 416)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !331, file: !233, line: 70, baseType: !88, size: 32, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !331, file: !233, line: 71, baseType: !64, size: 32, offset: 480)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !331, file: !233, line: 72, baseType: !88, size: 32, offset: 512)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !331, file: !233, line: 73, baseType: !88, size: 32, offset: 544)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !331, file: !233, line: 74, baseType: !64, size: 32, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !331, file: !233, line: 75, baseType: !64, size: 32, offset: 608)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !331, file: !233, line: 76, baseType: !356, size: 3296, offset: 640)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !233, line: 50, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 38, size: 3296, elements: !358)
!358 = !{!359, !360, !361, !362, !366, !367, !368, !369, !370, !371}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !357, file: !233, line: 40, baseType: !88, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !357, file: !233, line: 41, baseType: !88, size: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !357, file: !233, line: 42, baseType: !88, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !357, file: !233, line: 43, baseType: !363, size: 1024, offset: 96)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 1024, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !357, file: !233, line: 44, baseType: !363, size: 1024, offset: 1120)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !357, file: !233, line: 45, baseType: !363, size: 1024, offset: 2144)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !357, file: !233, line: 46, baseType: !88, size: 32, offset: 3168)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !357, file: !233, line: 47, baseType: !88, size: 32, offset: 3200)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !357, file: !233, line: 48, baseType: !88, size: 32, offset: 3232)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !357, file: !233, line: 49, baseType: !88, size: 32, offset: 3264)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !331, file: !233, line: 77, baseType: !64, size: 32, offset: 3936)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !331, file: !233, line: 78, baseType: !356, size: 3296, offset: 3968)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !331, file: !233, line: 80, baseType: !64, size: 32, offset: 7264)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !331, file: !233, line: 81, baseType: !64, size: 32, offset: 7296)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !331, file: !233, line: 82, baseType: !64, size: 32, offset: 7328)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !331, file: !233, line: 83, baseType: !64, size: 32, offset: 7360)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !331, file: !233, line: 84, baseType: !88, size: 32, offset: 7392)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !331, file: !233, line: 85, baseType: !88, size: 32, offset: 7424)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !331, file: !233, line: 86, baseType: !88, size: 32, offset: 7456)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !331, file: !233, line: 87, baseType: !88, size: 32, offset: 7488)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !331, file: !233, line: 88, baseType: !88, size: 32, offset: 7520)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !331, file: !233, line: 89, baseType: !88, size: 32, offset: 7552)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !285, file: !233, line: 193, baseType: !88, size: 32, offset: 32960)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !285, file: !233, line: 195, baseType: !64, size: 32, offset: 32992)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !143, file: !142, line: 571, baseType: !387, size: 1056768, offset: 192)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 1056768, elements: !364)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !143, file: !142, line: 572, baseType: !389, size: 4538368, offset: 1056960)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 4538368, elements: !314)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !143, file: !142, line: 575, baseType: !391, size: 64, offset: 5595328)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !233, line: 256, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !233, line: 228, size: 37312, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !415, !416, !417, !418}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !393, file: !233, line: 230, baseType: !284, size: 33024)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !393, file: !233, line: 232, baseType: !88, size: 32, offset: 33024)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !393, file: !233, line: 233, baseType: !64, size: 32, offset: 33056)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !393, file: !233, line: 234, baseType: !217, size: 64, offset: 33088)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !393, file: !233, line: 235, baseType: !217, size: 64, offset: 33152)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !393, file: !233, line: 236, baseType: !401, size: 64, offset: 33216)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !393, file: !233, line: 237, baseType: !217, size: 64, offset: 33280)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !393, file: !233, line: 238, baseType: !401, size: 64, offset: 33344)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !393, file: !233, line: 240, baseType: !217, size: 64, offset: 33408)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !393, file: !233, line: 241, baseType: !401, size: 64, offset: 33472)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !393, file: !233, line: 242, baseType: !217, size: 64, offset: 33536)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !393, file: !233, line: 243, baseType: !401, size: 64, offset: 33600)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !393, file: !233, line: 245, baseType: !64, size: 32, offset: 33664)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !393, file: !233, line: 246, baseType: !217, size: 64, offset: 33728)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !393, file: !233, line: 247, baseType: !217, size: 64, offset: 33792)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !393, file: !233, line: 248, baseType: !401, size: 64, offset: 33856)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !393, file: !233, line: 249, baseType: !401, size: 64, offset: 33920)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !393, file: !233, line: 250, baseType: !414, size: 64, offset: 33984)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !393, file: !233, line: 251, baseType: !401, size: 64, offset: 34048)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !393, file: !233, line: 253, baseType: !88, size: 32, offset: 34112)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !393, file: !233, line: 254, baseType: !64, size: 32, offset: 34144)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !393, file: !233, line: 255, baseType: !419, size: 3136, offset: 34176)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !233, line: 226, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !233, line: 200, size: 3136, elements: !421)
!421 = !{!422, !423, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !441, !442, !444, !445, !446, !447}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !420, file: !233, line: 202, baseType: !64, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !420, file: !233, line: 203, baseType: !424, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!425 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !420, file: !233, line: 204, baseType: !217, size: 64, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !420, file: !233, line: 205, baseType: !401, size: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !420, file: !233, line: 206, baseType: !424, size: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !420, file: !233, line: 207, baseType: !217, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !420, file: !233, line: 208, baseType: !217, size: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !420, file: !233, line: 209, baseType: !424, size: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !420, file: !233, line: 210, baseType: !424, size: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !420, file: !233, line: 211, baseType: !424, size: 64, offset: 576)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !420, file: !233, line: 212, baseType: !424, size: 64, offset: 640)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !420, file: !233, line: 213, baseType: !424, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !420, file: !233, line: 216, baseType: !425, size: 8, offset: 768)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !420, file: !233, line: 217, baseType: !425, size: 8, offset: 776)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !420, file: !233, line: 218, baseType: !425, size: 8, offset: 784)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !420, file: !233, line: 219, baseType: !440, size: 1024, offset: 800)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 1024, elements: !364)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !420, file: !233, line: 220, baseType: !440, size: 1024, offset: 1824)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !420, file: !233, line: 221, baseType: !443, size: 256, offset: 2848)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 256, elements: !364)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !420, file: !233, line: 222, baseType: !425, size: 8, offset: 3104)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !420, file: !233, line: 223, baseType: !425, size: 8, offset: 3112)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !420, file: !233, line: 224, baseType: !425, size: 8, offset: 3120)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !420, file: !233, line: 225, baseType: !425, size: 8, offset: 3128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !143, file: !142, line: 577, baseType: !449, size: 1193984, offset: 5595392)
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !392, size: 1193984, elements: !364)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !143, file: !142, line: 578, baseType: !64, size: 32, offset: 6789376)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !143, file: !142, line: 579, baseType: !64, size: 32, offset: 6789408)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !143, file: !142, line: 580, baseType: !64, size: 32, offset: 6789440)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !143, file: !142, line: 581, baseType: !64, size: 32, offset: 6789472)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !143, file: !142, line: 584, baseType: !455, size: 64, offset: 6789504)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !142, line: 584, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !143, file: !142, line: 586, baseType: !458, size: 64, offset: 6789568)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !142, line: 902, size: 416, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !470, !471, !472, !473, !474, !475, !476}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !459, file: !142, line: 904, baseType: !88, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !459, file: !142, line: 905, baseType: !88, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !459, file: !142, line: 906, baseType: !64, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !459, file: !142, line: 907, baseType: !88, size: 32, offset: 96)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !459, file: !142, line: 908, baseType: !64, size: 32, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !459, file: !142, line: 909, baseType: !467, size: 64, offset: 160)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 64, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 2)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !459, file: !142, line: 910, baseType: !268, size: 8, offset: 224)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !459, file: !142, line: 911, baseType: !268, size: 8, offset: 232)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !459, file: !142, line: 912, baseType: !64, size: 32, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !459, file: !142, line: 913, baseType: !64, size: 32, offset: 288)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !459, file: !142, line: 915, baseType: !64, size: 32, offset: 320)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !459, file: !142, line: 916, baseType: !64, size: 32, offset: 352)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !459, file: !142, line: 917, baseType: !64, size: 32, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !143, file: !142, line: 587, baseType: !478, size: 64, offset: 6789632)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !142, line: 839, size: 512, elements: !480)
!480 = !{!481, !482, !485, !486, !487, !488}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !479, file: !142, line: 841, baseType: !64, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !479, file: !142, line: 842, baseType: !483, size: 96, offset: 32)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 96, elements: !173)
!484 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !479, file: !142, line: 843, baseType: !483, size: 96, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !479, file: !142, line: 844, baseType: !483, size: 96, offset: 224)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !479, file: !142, line: 845, baseType: !483, size: 96, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !479, file: !142, line: 846, baseType: !483, size: 96, offset: 416)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !143, file: !142, line: 588, baseType: !64, size: 32, offset: 6789696)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !143, file: !142, line: 591, baseType: !88, size: 32, offset: 6789728)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !143, file: !142, line: 592, baseType: !64, size: 32, offset: 6789760)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !143, file: !142, line: 593, baseType: !64, size: 32, offset: 6789792)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !143, file: !142, line: 594, baseType: !64, size: 32, offset: 6789824)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !143, file: !142, line: 595, baseType: !495, size: 64, offset: 6789888)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !142, line: 542, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !142, line: 341, size: 109184, elements: !499)
!499 = !{!500, !502, !503, !504, !505, !506, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !728, !730, !891, !920, !947, !950, !951, !953, !954, !955, !956, !957, !958, !959, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !985, !986, !987, !988, !989, !990, !993, !994, !997, !998, !1000, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1013, !1014, !1015, !1016, !1017, !1020, !1021, !1022, !1024, !1028, !1032, !1036, !1040, !1041, !1042, !1043, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1057, !1058}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !498, file: !142, line: 343, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !498, file: !142, line: 344, baseType: !146, size: 64, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !498, file: !142, line: 345, baseType: !231, size: 64, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !498, file: !142, line: 346, baseType: !283, size: 64, offset: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "svc_extension_flag", scope: !498, file: !142, line: 347, baseType: !64, size: 32, offset: 256)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !498, file: !142, line: 350, baseType: !507, size: 64, offset: 320)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !509, line: 186, size: 33408, elements: !510)
!509 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!510 = !{!511, !512, !515, !662, !663, !664, !665, !666, !667, !668, !669, !670, !674, !675, !676}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !508, file: !509, line: 188, baseType: !140, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !508, file: !509, line: 189, baseType: !513, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !142, line: 900, baseType: !147)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !508, file: !509, line: 190, baseType: !516, size: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !509, line: 182, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !509, line: 152, size: 768, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !657, !658, !659, !660, !661}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !519, file: !509, line: 154, baseType: !64, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !519, file: !509, line: 155, baseType: !64, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !519, file: !509, line: 156, baseType: !64, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !519, file: !509, line: 157, baseType: !64, size: 32, offset: 96)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !519, file: !509, line: 159, baseType: !64, size: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !519, file: !509, line: 161, baseType: !88, size: 32, offset: 160)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !519, file: !509, line: 162, baseType: !88, size: 32, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !519, file: !509, line: 164, baseType: !64, size: 32, offset: 224)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !519, file: !509, line: 165, baseType: !64, size: 32, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !519, file: !509, line: 166, baseType: !64, size: 32, offset: 288)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !519, file: !509, line: 167, baseType: !64, size: 32, offset: 320)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !519, file: !509, line: 170, baseType: !64, size: 32, offset: 352)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !519, file: !509, line: 172, baseType: !534, size: 64, offset: 384)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !509, line: 138, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !509, line: 46, size: 3328, elements: !537)
!537 = !{!538, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !577, !579, !580, !597, !599, !603, !605, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !536, file: !509, line: 48, baseType: !539, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !87, line: 140, baseType: !86)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !536, file: !509, line: 50, baseType: !64, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !536, file: !509, line: 51, baseType: !64, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !536, file: !509, line: 52, baseType: !64, size: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !536, file: !509, line: 53, baseType: !64, size: 32, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !536, file: !509, line: 54, baseType: !88, size: 32, offset: 160)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !536, file: !509, line: 55, baseType: !88, size: 32, offset: 192)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !536, file: !509, line: 57, baseType: !64, size: 32, offset: 224)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !536, file: !509, line: 58, baseType: !64, size: 32, offset: 256)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !536, file: !509, line: 59, baseType: !64, size: 32, offset: 288)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !536, file: !509, line: 61, baseType: !268, size: 8, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !536, file: !509, line: 62, baseType: !64, size: 32, offset: 352)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !536, file: !509, line: 63, baseType: !64, size: 32, offset: 384)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !536, file: !509, line: 64, baseType: !64, size: 32, offset: 416)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !536, file: !509, line: 65, baseType: !64, size: 32, offset: 448)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !536, file: !509, line: 67, baseType: !555, size: 16, offset: 480)
!555 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !536, file: !509, line: 69, baseType: !64, size: 32, offset: 512)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !536, file: !509, line: 69, baseType: !64, size: 32, offset: 544)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !536, file: !509, line: 69, baseType: !64, size: 32, offset: 576)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !536, file: !509, line: 69, baseType: !64, size: 32, offset: 608)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !536, file: !509, line: 70, baseType: !64, size: 32, offset: 640)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !536, file: !509, line: 70, baseType: !64, size: 32, offset: 672)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !536, file: !509, line: 70, baseType: !64, size: 32, offset: 704)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !536, file: !509, line: 70, baseType: !64, size: 32, offset: 736)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !536, file: !509, line: 71, baseType: !64, size: 32, offset: 768)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !536, file: !509, line: 72, baseType: !64, size: 32, offset: 800)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !536, file: !509, line: 73, baseType: !88, size: 32, offset: 832)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !536, file: !509, line: 74, baseType: !88, size: 32, offset: 864)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !536, file: !509, line: 75, baseType: !64, size: 32, offset: 896)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !536, file: !509, line: 75, baseType: !64, size: 32, offset: 928)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !536, file: !509, line: 76, baseType: !64, size: 32, offset: 960)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !536, file: !509, line: 76, baseType: !64, size: 32, offset: 992)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !536, file: !509, line: 79, baseType: !573, size: 64, offset: 1024)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !269, line: 41, baseType: !576)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !269, line: 23, baseType: !336)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !536, file: !509, line: 80, baseType: !578, size: 64, offset: 1088)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !536, file: !509, line: 81, baseType: !578, size: 64, offset: 1152)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !536, file: !509, line: 84, baseType: !581, size: 64, offset: 1216)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !509, line: 36, size: 256, elements: !584)
!584 = !{!585, !588, !595}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !583, file: !509, line: 38, baseType: !586, size: 128)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 128, elements: !468)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !583, file: !509, line: 39, baseType: !589, size: 64, offset: 128)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 64, elements: !468)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !142, line: 104, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 100, size: 32, elements: !592)
!592 = !{!593, !594}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !591, file: !142, line: 102, baseType: !555, size: 16)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !591, file: !142, line: 103, baseType: !555, size: 16, offset: 16)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !583, file: !509, line: 40, baseType: !596, size: 16, offset: 192)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 16, elements: !468)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !536, file: !509, line: 85, baseType: !598, size: 192, offset: 1280)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 192, elements: !173)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !536, file: !509, line: 87, baseType: !600, size: 64, offset: 1472)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !509, line: 29, size: 64, elements: !601)
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !600, file: !509, line: 31, baseType: !267, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !536, file: !509, line: 88, baseType: !604, size: 192, offset: 1536)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 192, elements: !173)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !536, file: !509, line: 90, baseType: !606, size: 64, offset: 1728)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !536, file: !509, line: 92, baseType: !587, size: 64, offset: 1792)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !536, file: !509, line: 93, baseType: !587, size: 64, offset: 1856)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !536, file: !509, line: 94, baseType: !587, size: 64, offset: 1920)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !536, file: !509, line: 96, baseType: !64, size: 32, offset: 1984)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !536, file: !509, line: 97, baseType: !64, size: 32, offset: 2016)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !536, file: !509, line: 98, baseType: !64, size: 32, offset: 2048)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !536, file: !509, line: 99, baseType: !64, size: 32, offset: 2080)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !536, file: !509, line: 100, baseType: !64, size: 32, offset: 2112)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !536, file: !509, line: 102, baseType: !64, size: 32, offset: 2144)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !536, file: !509, line: 103, baseType: !64, size: 32, offset: 2176)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !536, file: !509, line: 104, baseType: !64, size: 32, offset: 2208)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !536, file: !509, line: 105, baseType: !64, size: 32, offset: 2240)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !536, file: !509, line: 106, baseType: !64, size: 32, offset: 2272)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !536, file: !509, line: 107, baseType: !64, size: 32, offset: 2304)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !536, file: !509, line: 108, baseType: !64, size: 32, offset: 2336)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !536, file: !509, line: 109, baseType: !64, size: 32, offset: 2368)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !536, file: !509, line: 110, baseType: !467, size: 64, offset: 2400)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !536, file: !509, line: 111, baseType: !64, size: 32, offset: 2464)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !536, file: !509, line: 112, baseType: !627, size: 64, offset: 2496)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !142, line: 194, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !142, line: 186, size: 256, elements: !630)
!630 = !{!631, !632, !633, !634, !635, !636}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !629, file: !142, line: 188, baseType: !64, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !629, file: !142, line: 189, baseType: !64, size: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !629, file: !142, line: 190, baseType: !64, size: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !629, file: !142, line: 191, baseType: !64, size: 32, offset: 96)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !629, file: !142, line: 192, baseType: !64, size: 32, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !629, file: !142, line: 193, baseType: !637, size: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !536, file: !509, line: 115, baseType: !64, size: 32, offset: 2560)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !536, file: !509, line: 118, baseType: !64, size: 32, offset: 2592)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !536, file: !509, line: 119, baseType: !64, size: 32, offset: 2624)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !536, file: !509, line: 120, baseType: !64, size: 32, offset: 2656)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !536, file: !509, line: 121, baseType: !574, size: 64, offset: 2688)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !536, file: !509, line: 124, baseType: !64, size: 32, offset: 2752)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !536, file: !509, line: 125, baseType: !64, size: 32, offset: 2784)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !536, file: !509, line: 126, baseType: !64, size: 32, offset: 2816)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !536, file: !509, line: 128, baseType: !64, size: 32, offset: 2848)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !536, file: !509, line: 129, baseType: !64, size: 32, offset: 2880)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !536, file: !509, line: 130, baseType: !64, size: 32, offset: 2912)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !536, file: !509, line: 131, baseType: !64, size: 32, offset: 2944)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !536, file: !509, line: 132, baseType: !573, size: 64, offset: 3008)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !536, file: !509, line: 133, baseType: !64, size: 32, offset: 3072)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !536, file: !509, line: 134, baseType: !64, size: 32, offset: 3104)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !536, file: !509, line: 136, baseType: !596, size: 16, offset: 3136)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !536, file: !509, line: 137, baseType: !655, size: 128, offset: 3200)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !656, size: 128, elements: !468)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !519, file: !509, line: 173, baseType: !534, size: 64, offset: 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !519, file: !509, line: 174, baseType: !534, size: 64, offset: 512)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !519, file: !509, line: 177, baseType: !64, size: 32, offset: 576)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !519, file: !509, line: 178, baseType: !467, size: 64, offset: 608)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !519, file: !509, line: 179, baseType: !467, size: 64, offset: 672)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ref", scope: !508, file: !509, line: 191, baseType: !516, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ltref", scope: !508, file: !509, line: 192, baseType: !516, size: 64, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !508, file: !509, line: 193, baseType: !88, size: 32, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !508, file: !509, line: 194, baseType: !88, size: 32, offset: 352)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frames_in_buffer", scope: !508, file: !509, line: 195, baseType: !88, size: 32, offset: 384)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ltref_frames_in_buffer", scope: !508, file: !509, line: 196, baseType: !88, size: 32, offset: 416)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_poc", scope: !508, file: !509, line: 197, baseType: !64, size: 32, offset: 448)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_view_id", scope: !508, file: !509, line: 199, baseType: !64, size: 32, offset: 480)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_pic_idx", scope: !508, file: !509, line: 200, baseType: !671, size: 32768, offset: 512)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 32768, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 1024)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "init_done", scope: !508, file: !509, line: 205, baseType: !64, size: 32, offset: 33280)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !508, file: !509, line: 206, baseType: !64, size: 32, offset: 33312)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "last_picture", scope: !508, file: !509, line: 208, baseType: !517, size: 64, offset: 33344)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !498, file: !142, line: 353, baseType: !64, size: 32, offset: 384)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !498, file: !142, line: 354, baseType: !64, size: 32, offset: 416)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !498, file: !142, line: 355, baseType: !64, size: 32, offset: 448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "Transform8x8Mode", scope: !498, file: !142, line: 356, baseType: !64, size: 32, offset: 480)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "is_not_independent", scope: !498, file: !142, line: 357, baseType: !64, size: 32, offset: 512)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "toppoc", scope: !498, file: !142, line: 359, baseType: !64, size: 32, offset: 544)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "bottompoc", scope: !498, file: !142, line: 360, baseType: !64, size: 32, offset: 576)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "framepoc", scope: !498, file: !142, line: 361, baseType: !64, size: 32, offset: 608)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !498, file: !142, line: 365, baseType: !88, size: 32, offset: 640)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !498, file: !142, line: 366, baseType: !64, size: 32, offset: 672)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !498, file: !142, line: 368, baseType: !467, size: 64, offset: 704)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntMsb", scope: !498, file: !142, line: 372, baseType: !64, size: 32, offset: 768)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "AbsFrameNum", scope: !498, file: !142, line: 378, baseType: !88, size: 32, offset: 800)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !498, file: !142, line: 379, baseType: !64, size: 32, offset: 832)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "current_mb_nr", scope: !498, file: !142, line: 387, baseType: !88, size: 32, offset: 864)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !498, file: !142, line: 388, baseType: !88, size: 32, offset: 896)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "current_slice_nr", scope: !498, file: !142, line: 389, baseType: !555, size: 16, offset: 928)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "cod_counter", scope: !498, file: !142, line: 396, baseType: !64, size: 32, offset: 960)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "allrefzero", scope: !498, file: !142, line: 397, baseType: !64, size: 32, offset: 992)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !498, file: !142, line: 400, baseType: !64, size: 32, offset: 1024)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !498, file: !142, line: 401, baseType: !64, size: 32, offset: 1056)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_active", scope: !498, file: !142, line: 402, baseType: !467, size: 64, offset: 1088)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !498, file: !142, line: 406, baseType: !64, size: 32, offset: 1152)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !498, file: !142, line: 407, baseType: !64, size: 32, offset: 1184)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !498, file: !142, line: 408, baseType: !64, size: 32, offset: 1216)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "qs", scope: !498, file: !142, line: 409, baseType: !64, size: 32, offset: 1248)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qs_delta", scope: !498, file: !142, line: 410, baseType: !64, size: 32, offset: 1280)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !498, file: !142, line: 411, baseType: !64, size: 32, offset: 1312)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "model_number", scope: !498, file: !142, line: 412, baseType: !64, size: 32, offset: 1344)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !498, file: !142, line: 413, baseType: !88, size: 32, offset: 1376)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !498, file: !142, line: 414, baseType: !88, size: 32, offset: 1408)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !498, file: !142, line: 415, baseType: !268, size: 8, offset: 1440)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !498, file: !142, line: 416, baseType: !539, size: 32, offset: 1472)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !498, file: !142, line: 417, baseType: !64, size: 32, offset: 1504)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "end_mb_nr_plus1", scope: !498, file: !142, line: 418, baseType: !64, size: 32, offset: 1536)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !498, file: !142, line: 419, baseType: !64, size: 32, offset: 1568)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dp_mode", scope: !498, file: !142, line: 420, baseType: !64, size: 32, offset: 1600)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "current_header", scope: !498, file: !142, line: 421, baseType: !64, size: 32, offset: 1632)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "next_header", scope: !498, file: !142, line: 422, baseType: !64, size: 32, offset: 1664)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "last_dquant", scope: !498, file: !142, line: 423, baseType: !64, size: 32, offset: 1696)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "colour_plane_id", scope: !498, file: !142, line: 426, baseType: !64, size: 32, offset: 1728)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !498, file: !142, line: 427, baseType: !64, size: 32, offset: 1760)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "sp_switch", scope: !498, file: !142, line: 428, baseType: !64, size: 32, offset: 1792)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !498, file: !142, line: 429, baseType: !64, size: 32, offset: 1824)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_slice_ref_idx", scope: !498, file: !142, line: 430, baseType: !64, size: 32, offset: 1856)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !498, file: !142, line: 431, baseType: !64, size: 32, offset: 1888)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !498, file: !142, line: 432, baseType: !64, size: 32, offset: 1920)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !498, file: !142, line: 433, baseType: !64, size: 32, offset: 1952)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !498, file: !142, line: 434, baseType: !627, size: 64, offset: 1984)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !498, file: !142, line: 436, baseType: !727, size: 48, offset: 2048)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 48, elements: !254)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !498, file: !142, line: 437, baseType: !729, size: 384, offset: 2112)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !656, size: 384, elements: !254)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !498, file: !142, line: 440, baseType: !731, size: 64, offset: 2496)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !142, line: 324, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !142, line: 314, size: 384, elements: !734)
!734 = !{!735, !746, !755}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !733, file: !142, line: 317, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !142, line: 47, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream", file: !142, line: 300, size: 256, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "read_len", scope: !738, file: !142, line: 303, baseType: !64, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !738, file: !142, line: 304, baseType: !64, size: 32, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bitoffset", scope: !738, file: !142, line: 306, baseType: !64, size: 32, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_length", scope: !738, file: !142, line: 307, baseType: !64, size: 32, offset: 96)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !738, file: !142, line: 309, baseType: !267, size: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !738, file: !142, line: 310, baseType: !64, size: 32, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "de_cabac", scope: !733, file: !142, line: 318, baseType: !747, size: 256, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !142, line: 95, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 88, size: 256, elements: !749)
!749 = !{!750, !751, !752, !753, !754}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !748, file: !142, line: 90, baseType: !88, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !748, file: !142, line: 91, baseType: !88, size: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !748, file: !142, line: 92, baseType: !64, size: 32, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !748, file: !142, line: 93, baseType: !267, size: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !748, file: !142, line: 94, baseType: !217, size: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "readSyntaxElement", scope: !733, file: !142, line: 320, baseType: !756, size: 64, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{!64, !759, !889, !887}
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !142, line: 273, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !142, line: 197, size: 3840, elements: !762)
!762 = !{!763, !765, !766, !767, !768, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !797, !798, !799, !800, !801, !804, !805, !814, !815, !816, !817, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !842, !843, !858, !864, !888}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !761, file: !142, line: 199, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !761, file: !142, line: 200, baseType: !501, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !761, file: !142, line: 201, baseType: !146, size: 64, offset: 128)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrX", scope: !761, file: !142, line: 202, baseType: !64, size: 32, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !761, file: !142, line: 203, baseType: !769, size: 32, offset: 224)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockPos", file: !142, line: 112, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 108, size: 32, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !770, file: !142, line: 110, baseType: !555, size: 16)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !770, file: !142, line: 111, baseType: !555, size: 16, offset: 16)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !761, file: !142, line: 204, baseType: !64, size: 32, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !761, file: !142, line: 205, baseType: !64, size: 32, offset: 288)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "block_y_aff", scope: !761, file: !142, line: 206, baseType: !64, size: 32, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !761, file: !142, line: 207, baseType: !64, size: 32, offset: 352)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !761, file: !142, line: 208, baseType: !64, size: 32, offset: 384)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !761, file: !142, line: 209, baseType: !64, size: 32, offset: 416)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !761, file: !142, line: 210, baseType: !64, size: 32, offset: 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !761, file: !142, line: 212, baseType: !64, size: 32, offset: 480)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !761, file: !142, line: 213, baseType: !64, size: 32, offset: 512)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !761, file: !142, line: 215, baseType: !64, size: 32, offset: 544)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "qpc", scope: !761, file: !142, line: 216, baseType: !467, size: 64, offset: 576)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "qp_scaled", scope: !761, file: !142, line: 217, baseType: !172, size: 96, offset: 640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "is_lossless", scope: !761, file: !142, line: 218, baseType: !64, size: 32, offset: 736)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !761, file: !142, line: 219, baseType: !64, size: 32, offset: 768)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !761, file: !142, line: 220, baseType: !64, size: 32, offset: 800)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !761, file: !142, line: 221, baseType: !64, size: 32, offset: 832)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !761, file: !142, line: 223, baseType: !555, size: 16, offset: 864)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !761, file: !142, line: 224, baseType: !425, size: 8, offset: 880)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "dpl_flag", scope: !761, file: !142, line: 225, baseType: !425, size: 8, offset: 888)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "delta_quant", scope: !761, file: !142, line: 226, baseType: !555, size: 16, offset: 896)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "list_offset", scope: !761, file: !142, line: 227, baseType: !555, size: 16, offset: 912)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "mb_up", scope: !761, file: !142, line: 229, baseType: !796, size: 64, offset: 960)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "mb_left", scope: !761, file: !142, line: 230, baseType: !796, size: 64, offset: 1024)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "mbup", scope: !761, file: !142, line: 232, baseType: !796, size: 64, offset: 1088)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "mbleft", scope: !761, file: !142, line: 233, baseType: !796, size: 64, offset: 1152)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !761, file: !142, line: 236, baseType: !555, size: 16, offset: 1216)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !761, file: !142, line: 237, baseType: !802, size: 1024, offset: 1232)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 1024, elements: !803)
!803 = !{!469, !26, !26, !469}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !761, file: !142, line: 239, baseType: !64, size: 32, offset: 2272)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !761, file: !142, line: 240, baseType: !806, size: 192, offset: 2304)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 192, elements: !173)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !808, line: 103, baseType: !809)
!808 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !810, line: 27, baseType: !811)
!810 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !812, line: 44, baseType: !813)
!812 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!813 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !761, file: !142, line: 241, baseType: !806, size: 192, offset: 2496)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits_8x8", scope: !761, file: !142, line: 242, baseType: !806, size: 192, offset: 2688)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "i16mode", scope: !761, file: !142, line: 244, baseType: !64, size: 32, offset: 2880)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !761, file: !142, line: 245, baseType: !818, size: 32, offset: 2912)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 32, elements: !25)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !761, file: !142, line: 246, baseType: !818, size: 32, offset: 2944)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ipmode_DPCM", scope: !761, file: !142, line: 247, baseType: !425, size: 8, offset: 2976)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !761, file: !142, line: 248, baseType: !425, size: 8, offset: 2984)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !761, file: !142, line: 249, baseType: !425, size: 8, offset: 2992)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "DFDisableIdc", scope: !761, file: !142, line: 250, baseType: !555, size: 16, offset: 3008)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "DFAlphaC0Offset", scope: !761, file: !142, line: 251, baseType: !555, size: 16, offset: 3024)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "DFBetaOffset", scope: !761, file: !142, line: 252, baseType: !555, size: 16, offset: 3040)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !761, file: !142, line: 254, baseType: !64, size: 32, offset: 3072)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !761, file: !142, line: 256, baseType: !64, size: 32, offset: 3104)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !761, file: !142, line: 256, baseType: !64, size: 32, offset: 3136)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !761, file: !142, line: 256, baseType: !64, size: 32, offset: 3168)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !761, file: !142, line: 256, baseType: !64, size: 32, offset: 3200)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !761, file: !142, line: 257, baseType: !64, size: 32, offset: 3232)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !761, file: !142, line: 257, baseType: !64, size: 32, offset: 3264)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !761, file: !142, line: 257, baseType: !64, size: 32, offset: 3296)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !761, file: !142, line: 257, baseType: !64, size: 32, offset: 3328)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !761, file: !142, line: 259, baseType: !64, size: 32, offset: 3360)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !761, file: !142, line: 260, baseType: !64, size: 32, offset: 3392)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_4x4", scope: !761, file: !142, line: 262, baseType: !838, size: 64, offset: 3456)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = !DISubroutineType(types: !840)
!840 = !{null, !796, !841, !64, !64}
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorPlane", file: !87, line: 32, baseType: !93)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_8x8", scope: !761, file: !142, line: 263, baseType: !838, size: 64, offset: 3520)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "GetMVPredictor", scope: !761, file: !142, line: 265, baseType: !844, size: 64, offset: 3584)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !796, !847, !857, !555, !581, !64, !64, !64, !64, !64}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !142, line: 85, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !142, line: 77, size: 128, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !849, file: !142, line: 79, baseType: !64, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !849, file: !142, line: 80, baseType: !64, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !849, file: !142, line: 81, baseType: !555, size: 16, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !849, file: !142, line: 82, baseType: !555, size: 16, offset: 80)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !849, file: !142, line: 83, baseType: !555, size: 16, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !849, file: !142, line: 84, baseType: !555, size: 16, offset: 112)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "read_and_store_CBP_block_bit", scope: !761, file: !142, line: 268, baseType: !859, size: 64, offset: 3648)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!64, !796, !862, !64}
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironmentPtr", file: !142, line: 97, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "readRefPictureIdx", scope: !761, file: !142, line: 269, baseType: !865, size: 64, offset: 3712)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!425, !796, !868, !887, !425, !64}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !142, line: 276, size: 384, elements: !870)
!870 = !{!871, !872, !873, !874, !875, !876, !877, !878, !879, !883}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !869, file: !142, line: 278, baseType: !64, size: 32)
