; ModuleID = 'ldecod_src/parsetcommon.c'
source_filename = "ldecod_src/parsetcommon.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [14 x i8] c"AllocPPS: PPS\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [14 x i8] c"AllocSPS: SPS\00", align 1, !dbg !7

; Function Attrs: nounwind uwtable
define dso_local noalias noundef ptr @AllocPPS() local_unnamed_addr #0 !dbg !22 {
entry:
  %call = tail call noalias dereferenceable_or_null(2216) ptr @calloc(i64 noundef 1, i64 noundef 2216) #8, !dbg !84
    #dbg_value(ptr %call, !83, !DIExpression(), !86)
  %cmp = icmp eq ptr %call, null, !dbg !87
  br i1 %cmp, label %if.then, label %if.end, !dbg !88

if.then:                                          ; preds = %entry
  tail call void @no_mem_exit(ptr noundef nonnull @.str) #9, !dbg !89
  br label %if.end, !dbg !89

if.end:                                           ; preds = %if.then, %entry
  ret ptr %call, !dbg !90
}

; Function Attrs: mustprogress nofree nounwind willreturn allockind("alloc,zeroed") allocsize(0,1) memory(inaccessiblemem: readwrite)
declare !dbg !91 noalias noundef ptr @calloc(i64 noundef, i64 noundef) local_unnamed_addr #1

declare !dbg !98 void @no_mem_exit(ptr noundef) local_unnamed_addr #2

; Function Attrs: nounwind uwtable
define dso_local noalias noundef ptr @AllocSPS() local_unnamed_addr #0 !dbg !103 {
entry:

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 34, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "ldecod_src/parsetcommon.c", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "29e50fd146ea68377794b0403b2e61e9")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 112, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 14)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 55, type: !3, isLocal: true, isDefinition: true)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !10, globals: !13, splitDebugInlining: false, nameTableKind: None)
!10 = !{!11, !12}
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!12 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!13 = !{!0, !7}
!14 = !{i32 7, !"Dwarf Version", i32 5}
!15 = !{i32 2, !"Debug Info Version", i32 3}
!16 = !{i32 1, !"wchar_size", i32 4}
!17 = !{i32 8, !"PIC Level", i32 2}
!18 = !{i32 7, !"PIE Level", i32 2}
!19 = !{i32 7, !"uwtable", i32 2}
!20 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!21 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!22 = distinct !DISubprogram(name: "AllocPPS", scope: !2, file: !2, line: 29, type: !23, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !82)
!23 = !DISubroutineType(types: !24)
!24 = !{!25}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !27, line: 138, baseType: !28)
!27 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 94, size: 17728, elements: !29)
!29 = !{!30, !32, !33, !34, !35, !36, !37, !41, !46, !50, !53, !54, !55, !56, !57, !61, !62, !63, !64, !65, !66, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !28, file: !27, line: 96, baseType: !31, size: 32)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !28, file: !27, line: 97, baseType: !12, size: 32, offset: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !28, file: !27, line: 98, baseType: !12, size: 32, offset: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !28, file: !27, line: 99, baseType: !31, size: 32, offset: 96)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !28, file: !27, line: 100, baseType: !31, size: 32, offset: 128)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !28, file: !27, line: 102, baseType: !31, size: 32, offset: 160)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !28, file: !27, line: 103, baseType: !38, size: 384, offset: 192)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 384, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 12)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !28, file: !27, line: 104, baseType: !42, size: 3072, offset: 576)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 3072, elements: !43)
!43 = !{!44, !45}
!44 = !DISubrange(count: 6)
!45 = !DISubrange(count: 16)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !28, file: !27, line: 105, baseType: !47, size: 12288, offset: 3648)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 12288, elements: !48)
!48 = !{!44, !49}
!49 = !DISubrange(count: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !28, file: !27, line: 106, baseType: !51, size: 192, offset: 15936)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 192, elements: !52)
!52 = !{!44}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !28, file: !27, line: 107, baseType: !51, size: 192, offset: 16128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !28, file: !27, line: 110, baseType: !31, size: 32, offset: 16320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !28, file: !27, line: 111, baseType: !12, size: 32, offset: 16352)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !28, file: !27, line: 112, baseType: !12, size: 32, offset: 16384)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !28, file: !27, line: 114, baseType: !58, size: 256, offset: 16416)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 256, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 8)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !28, file: !27, line: 116, baseType: !58, size: 256, offset: 16672)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !28, file: !27, line: 117, baseType: !58, size: 256, offset: 16928)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !28, file: !27, line: 119, baseType: !31, size: 32, offset: 17184)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !28, file: !27, line: 120, baseType: !12, size: 32, offset: 17216)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !28, file: !27, line: 122, baseType: !12, size: 32, offset: 17248)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !28, file: !27, line: 123, baseType: !67, size: 64, offset: 17280)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !69, line: 21, baseType: !70)
!69 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!70 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !28, file: !27, line: 125, baseType: !31, size: 32, offset: 17344)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !28, file: !27, line: 126, baseType: !31, size: 32, offset: 17376)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !28, file: !27, line: 127, baseType: !31, size: 32, offset: 17408)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !28, file: !27, line: 128, baseType: !12, size: 32, offset: 17440)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !28, file: !27, line: 129, baseType: !31, size: 32, offset: 17472)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !28, file: !27, line: 130, baseType: !31, size: 32, offset: 17504)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !28, file: !27, line: 131, baseType: !31, size: 32, offset: 17536)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !28, file: !27, line: 133, baseType: !31, size: 32, offset: 17568)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !28, file: !27, line: 135, baseType: !31, size: 32, offset: 17600)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !28, file: !27, line: 136, baseType: !31, size: 32, offset: 17632)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !28, file: !27, line: 137, baseType: !31, size: 32, offset: 17664)
!82 = !{!83}
!83 = !DILocalVariable(name: "p", scope: !22, file: !2, line: 31, type: !25)
!84 = !DILocation(line: 33, column: 11, scope: !85)
!85 = distinct !DILexicalBlock(scope: !22, file: !2, line: 33, column: 8)
!86 = !DILocation(line: 0, scope: !22)
!87 = !DILocation(line: 33, column: 58, scope: !85)
!88 = !DILocation(line: 33, column: 8, scope: !22)
!89 = !DILocation(line: 34, column: 6, scope: !85)
!90 = !DILocation(line: 36, column: 4, scope: !22)
!91 = !DISubprogram(name: "calloc", scope: !92, file: !92, line: 543, type: !93, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!92 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!93 = !DISubroutineType(types: !94)
!94 = !{!11, !95, !95}
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !96, line: 18, baseType: !97)
!96 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!97 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!98 = !DISubprogram(name: "no_mem_exit", scope: !99, file: !99, line: 180, type: !100, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!99 = !DIFile(filename: "ldecod_src/inc/memalloc.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "88776e97a131c37d03036121c7c9e0ac")
!100 = !DISubroutineType(types: !101)
!101 = !{null, !102}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!103 = distinct !DISubprogram(name: "AllocSPS", scope: !2, file: !2, line: 50, type: !104, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !209)
!104 = !DISubroutineType(types: !105)
!105 = !{!106}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !27, line: 197, baseType: !108)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 142, size: 33024, elements: !109)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !207, !208}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !108, file: !27, line: 144, baseType: !31, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !108, file: !27, line: 146, baseType: !12, size: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !108, file: !27, line: 147, baseType: !31, size: 32, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !108, file: !27, line: 148, baseType: !31, size: 32, offset: 96)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !108, file: !27, line: 149, baseType: !31, size: 32, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !108, file: !27, line: 150, baseType: !31, size: 32, offset: 160)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !108, file: !27, line: 152, baseType: !31, size: 32, offset: 192)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !108, file: !27, line: 154, baseType: !12, size: 32, offset: 224)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !108, file: !27, line: 155, baseType: !12, size: 32, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !108, file: !27, line: 156, baseType: !12, size: 32, offset: 288)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !108, file: !27, line: 158, baseType: !31, size: 32, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !108, file: !27, line: 159, baseType: !38, size: 384, offset: 352)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !108, file: !27, line: 160, baseType: !42, size: 3072, offset: 736)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !108, file: !27, line: 161, baseType: !47, size: 12288, offset: 3808)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !108, file: !27, line: 162, baseType: !51, size: 192, offset: 16096)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !108, file: !27, line: 163, baseType: !51, size: 192, offset: 16288)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !108, file: !27, line: 165, baseType: !12, size: 32, offset: 16480)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !108, file: !27, line: 166, baseType: !12, size: 32, offset: 16512)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !108, file: !27, line: 167, baseType: !12, size: 32, offset: 16544)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !108, file: !27, line: 168, baseType: !12, size: 32, offset: 16576)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !108, file: !27, line: 170, baseType: !12, size: 32, offset: 16608)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !108, file: !27, line: 172, baseType: !31, size: 32, offset: 16640)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !108, file: !27, line: 173, baseType: !31, size: 32, offset: 16672)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !108, file: !27, line: 174, baseType: !31, size: 32, offset: 16704)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !108, file: !27, line: 175, baseType: !12, size: 32, offset: 16736)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !108, file: !27, line: 177, baseType: !136, size: 8192, offset: 16768)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 8192, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !108, file: !27, line: 178, baseType: !12, size: 32, offset: 24960)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !108, file: !27, line: 179, baseType: !31, size: 32, offset: 24992)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !108, file: !27, line: 180, baseType: !12, size: 32, offset: 25024)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !108, file: !27, line: 181, baseType: !12, size: 32, offset: 25056)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !108, file: !27, line: 182, baseType: !31, size: 32, offset: 25088)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !108, file: !27, line: 184, baseType: !31, size: 32, offset: 25120)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !108, file: !27, line: 185, baseType: !31, size: 32, offset: 25152)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !108, file: !27, line: 186, baseType: !31, size: 32, offset: 25184)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !108, file: !27, line: 187, baseType: !12, size: 32, offset: 25216)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !108, file: !27, line: 188, baseType: !12, size: 32, offset: 25248)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !108, file: !27, line: 189, baseType: !12, size: 32, offset: 25280)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !108, file: !27, line: 190, baseType: !12, size: 32, offset: 25312)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !108, file: !27, line: 191, baseType: !31, size: 32, offset: 25344)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !108, file: !27, line: 192, baseType: !153, size: 7584, offset: 25376)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !27, line: 90, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 53, size: 7584, elements: !155)
!155 = !{!156, !157, !158, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !154, file: !27, line: 55, baseType: !31, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !154, file: !27, line: 56, baseType: !12, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !154, file: !27, line: 57, baseType: !159, size: 16, offset: 64)
!159 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !154, file: !27, line: 58, baseType: !159, size: 16, offset: 80)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !154, file: !27, line: 59, baseType: !31, size: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !154, file: !27, line: 60, baseType: !31, size: 32, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !154, file: !27, line: 61, baseType: !31, size: 32, offset: 160)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !154, file: !27, line: 62, baseType: !12, size: 32, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !154, file: !27, line: 63, baseType: !31, size: 32, offset: 224)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !154, file: !27, line: 64, baseType: !31, size: 32, offset: 256)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !154, file: !27, line: 65, baseType: !12, size: 32, offset: 288)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !154, file: !27, line: 66, baseType: !12, size: 32, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !154, file: !27, line: 67, baseType: !12, size: 32, offset: 352)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !154, file: !27, line: 68, baseType: !31, size: 32, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !154, file: !27, line: 69, baseType: !12, size: 32, offset: 416)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !154, file: !27, line: 70, baseType: !12, size: 32, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !154, file: !27, line: 71, baseType: !31, size: 32, offset: 480)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !154, file: !27, line: 72, baseType: !12, size: 32, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !154, file: !27, line: 73, baseType: !12, size: 32, offset: 544)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !154, file: !27, line: 74, baseType: !31, size: 32, offset: 576)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !154, file: !27, line: 75, baseType: !31, size: 32, offset: 608)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !154, file: !27, line: 76, baseType: !179, size: 3296, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !27, line: 50, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !27, line: 38, size: 3296, elements: !181)
!181 = !{!182, !183, !184, !185, !189, !190, !191, !192, !193, !194}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !180, file: !27, line: 40, baseType: !12, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !180, file: !27, line: 41, baseType: !12, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !180, file: !27, line: 42, baseType: !12, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !180, file: !27, line: 43, baseType: !186, size: 1024, offset: 96)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 1024, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !180, file: !27, line: 44, baseType: !186, size: 1024, offset: 1120)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !180, file: !27, line: 45, baseType: !186, size: 1024, offset: 2144)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !180, file: !27, line: 46, baseType: !12, size: 32, offset: 3168)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !180, file: !27, line: 47, baseType: !12, size: 32, offset: 3200)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !180, file: !27, line: 48, baseType: !12, size: 32, offset: 3232)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !180, file: !27, line: 49, baseType: !12, size: 32, offset: 3264)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !154, file: !27, line: 77, baseType: !31, size: 32, offset: 3936)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !154, file: !27, line: 78, baseType: !179, size: 3296, offset: 3968)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !154, file: !27, line: 80, baseType: !31, size: 32, offset: 7264)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !154, file: !27, line: 81, baseType: !31, size: 32, offset: 7296)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !154, file: !27, line: 82, baseType: !31, size: 32, offset: 7328)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !154, file: !27, line: 83, baseType: !31, size: 32, offset: 7360)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !154, file: !27, line: 84, baseType: !12, size: 32, offset: 7392)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !154, file: !27, line: 85, baseType: !12, size: 32, offset: 7424)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !154, file: !27, line: 86, baseType: !12, size: 32, offset: 7456)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !154, file: !27, line: 87, baseType: !12, size: 32, offset: 7488)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !154, file: !27, line: 88, baseType: !12, size: 32, offset: 7520)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !154, file: !27, line: 89, baseType: !12, size: 32, offset: 7552)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !108, file: !27, line: 193, baseType: !12, size: 32, offset: 32960)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !108, file: !27, line: 195, baseType: !31, size: 32, offset: 32992)
!209 = !{!210}
!210 = !DILocalVariable(name: "p", scope: !103, file: !2, line: 52, type: !106)
!211 = !DILocation(line: 54, column: 11, scope: !212)
!212 = distinct !DILexicalBlock(scope: !103, file: !2, line: 54, column: 8)
!213 = !DILocation(line: 0, scope: !103)
!214 = !DILocation(line: 54, column: 58, scope: !212)
!215 = !DILocation(line: 54, column: 8, scope: !103)
!216 = !DILocation(line: 55, column: 6, scope: !212)
!217 = !DILocation(line: 56, column: 4, scope: !103)
!218 = distinct !DISubprogram(name: "FreePPS", scope: !2, file: !2, line: 70, type: !219, scopeLine: 71, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !221)
!219 = !DISubroutineType(types: !220)
!220 = !{null, !25}
!221 = !{!222}
!222 = !DILocalVariable(name: "pps", arg: 1, scope: !218, file: !2, line: 70, type: !25)
!223 = !DILocation(line: 0, scope: !218)
!224 = !DILocation(line: 73, column: 13, scope: !225)
!225 = distinct !DILexicalBlock(scope: !218, file: !2, line: 73, column: 8)
!226 = !DILocation(line: 73, column: 28, scope: !225)
!227 = !DILocation(line: 73, column: 8, scope: !218)
!228 = !DILocation(line: 74, column: 6, scope: !225)
!229 = !DILocation(line: 75, column: 4, scope: !218)
!230 = !DILocation(line: 76, column: 2, scope: !218)
!231 = !DISubprogram(name: "free", scope: !92, file: !92, line: 555, type: !232, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !11}
!234 = distinct !DISubprogram(name: "FreeSPS", scope: !2, file: !2, line: 89, type: !235, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !237)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !106}
!237 = !{!238}
!238 = !DILocalVariable(name: "sps", arg: 1, scope: !234, file: !2, line: 89, type: !106)
!239 = !DILocation(line: 0, scope: !234)
!240 = !DILocation(line: 92, column: 4, scope: !234)
!241 = !DILocation(line: 93, column: 2, scope: !234)
!242 = distinct !DISubprogram(name: "sps_is_equal", scope: !2, file: !2, line: 96, type: !243, scopeLine: 97, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !245)
!243 = !DISubroutineType(types: !244)
!244 = !{!31, !106, !106}
!245 = !{!246, !247, !248, !249}
!246 = !DILocalVariable(name: "sps1", arg: 1, scope: !242, file: !2, line: 96, type: !106)
!247 = !DILocalVariable(name: "sps2", arg: 2, scope: !242, file: !2, line: 96, type: !106)
!248 = !DILocalVariable(name: "i", scope: !242, file: !2, line: 98, type: !12)
!249 = !DILocalVariable(name: "equal", scope: !242, file: !2, line: 99, type: !31)
!250 = !DILocation(line: 0, scope: !242)
!251 = !DILocation(line: 101, column: 15, scope: !252)
!252 = distinct !DILexicalBlock(scope: !242, file: !2, line: 101, column: 7)
!253 = !DILocation(line: 101, column: 9, scope: !252)
!254 = !DILocation(line: 101, column: 22, scope: !252)
!255 = !DILocation(line: 101, column: 33, scope: !252)
!256 = !DILocation(line: 101, column: 27, scope: !252)
!257 = !DILocation(line: 101, column: 7, scope: !242)
!258 = !DILocation(line: 104, column: 19, scope: !242)
!259 = !DILocation(line: 104, column: 40, scope: !242)
!260 = !DILocation(line: 108, column: 19, scope: !242)
!261 = !DILocation(line: 108, column: 38, scope: !242)
!262 = !DILocation(line: 110, column: 19, scope: !242)
!263 = !DILocation(line: 110, column: 54, scope: !242)
!264 = !DILocation(line: 104, column: 31, scope: !242)
!265 = !DILocation(line: 111, column: 9, scope: !242)
!266 = !DILocation(line: 113, column: 7, scope: !242)
!267 = !DILocation(line: 115, column: 7, scope: !242)
!268 = !DILocation(line: 117, column: 21, scope: !269)
!269 = distinct !DILexicalBlock(scope: !270, file: !2, line: 116, column: 3)
