; ModuleID = 'ldecod_src/parset.c'
source_filename = "ldecod_src/parset.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.seq_parameter_set_rbsp_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [12 x i32], [6 x [16 x i32]], [6 x [64 x i32]], [6 x i32], [6 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.vui_seq_parameters_t, i32, i32 }
%struct.vui_seq_parameters_t = type { i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.hrd_parameters_t, i32, %struct.hrd_parameters_t, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.hrd_parameters_t = type { i32, i32, i32, [32 x i32], [32 x i32], [32 x i32], i32, i32, i32, i32 }
%struct.pic_parameter_set_rbsp_t = type { i32, i32, i32, i32, i32, i32, [12 x i32], [6 x [16 x i32]], [6 x [64 x i32]], [6 x i32], [6 x i32], i32, i32, i32, [8 x i32], [8 x i32], [8 x i32], i32, i32, i32, ptr, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.subset_seq_parameter_set_rbsp_t = type { %struct.seq_parameter_set_rbsp_t, i32, i32, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, i32, ptr, ptr, ptr, ptr, ptr, ptr, i32, i32, %struct.mvcvui_tag }

!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(scope: null, file: !3, line: 431, type: !190, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(scope: null, file: !3, line: 432, type: !205, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(scope: null, file: !3, line: 442, type: !165, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(scope: null, file: !3, line: 444, type: !155, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(scope: null, file: !3, line: 446, type: !272, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(scope: null, file: !3, line: 452, type: !165, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(scope: null, file: !3, line: 453, type: !165, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(scope: null, file: !3, line: 454, type: !185, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(scope: null, file: !3, line: 455, type: !128, isLocal: true, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(scope: null, file: !3, line: 456, type: !128, isLocal: true, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(scope: null, file: !3, line: 457, type: !128, isLocal: true, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(scope: null, file: !3, line: 459, type: !200, isLocal: true, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(scope: null, file: !3, line: 461, type: !402, isLocal: true, isDefinition: true)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 352, elements: !403)
!403 = !{!404}
!404 = !DISubrange(count: 44)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(scope: null, file: !3, line: 462, type: !247, isLocal: true, isDefinition: true)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(scope: null, file: !3, line: 463, type: !205, isLocal: true, isDefinition: true)
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(scope: null, file: !3, line: 468, type: !155, isLocal: true, isDefinition: true)
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(scope: null, file: !3, line: 469, type: !170, isLocal: true, isDefinition: true)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(scope: null, file: !3, line: 477, type: !175, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(scope: null, file: !3, line: 488, type: !175, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(scope: null, file: !3, line: 502, type: !419, isLocal: true, isDefinition: true)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 464, elements: !420)
!420 = !{!421}
!421 = !DISubrange(count: 58)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(scope: null, file: !3, line: 508, type: !424, isLocal: true, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 472, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 59)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(scope: null, file: !3, line: 514, type: !429, isLocal: true, isDefinition: true)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 528, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 66)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "SubWidthC", scope: !434, file: !3, line: 701, type: !1677, isLocal: true, isDefinition: true)
!434 = distinct !DISubprogram(name: "reset_format_info", scope: !3, file: !3, line: 698, type: !435, scopeLine: 699, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1667)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !437, !549, !1666, !1666}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !439, line: 197, baseType: !440)
!439 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 142, size: 33024, elements: !441)
!441 = !{!442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !457, !461, !465, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !547, !548}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !440, file: !439, line: 144, baseType: !7, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !440, file: !439, line: 146, baseType: !31, size: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !440, file: !439, line: 147, baseType: !7, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !440, file: !439, line: 148, baseType: !7, size: 32, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !440, file: !439, line: 149, baseType: !7, size: 32, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !440, file: !439, line: 150, baseType: !7, size: 32, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !440, file: !439, line: 152, baseType: !7, size: 32, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !440, file: !439, line: 154, baseType: !31, size: 32, offset: 224)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !440, file: !439, line: 155, baseType: !31, size: 32, offset: 256)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !440, file: !439, line: 156, baseType: !31, size: 32, offset: 288)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !440, file: !439, line: 158, baseType: !7, size: 32, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !440, file: !439, line: 159, baseType: !454, size: 384, offset: 352)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 384, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 12)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !440, file: !439, line: 160, baseType: !458, size: 3072, offset: 736)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3072, elements: !459)
!459 = !{!460, !263}
!460 = !DISubrange(count: 6)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !440, file: !439, line: 161, baseType: !462, size: 12288, offset: 3808)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 12288, elements: !463)
!463 = !{!460, !464}
!464 = !DISubrange(count: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !440, file: !439, line: 162, baseType: !466, size: 192, offset: 16096)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !467)
!467 = !{!460}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !440, file: !439, line: 163, baseType: !466, size: 192, offset: 16288)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !440, file: !439, line: 165, baseType: !31, size: 32, offset: 16480)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !440, file: !439, line: 166, baseType: !31, size: 32, offset: 16512)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !440, file: !439, line: 167, baseType: !31, size: 32, offset: 16544)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !440, file: !439, line: 168, baseType: !31, size: 32, offset: 16576)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !440, file: !439, line: 170, baseType: !31, size: 32, offset: 16608)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !440, file: !439, line: 172, baseType: !7, size: 32, offset: 16640)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !440, file: !439, line: 173, baseType: !7, size: 32, offset: 16672)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !440, file: !439, line: 174, baseType: !7, size: 32, offset: 16704)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !440, file: !439, line: 175, baseType: !31, size: 32, offset: 16736)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !440, file: !439, line: 177, baseType: !479, size: 8192, offset: 16768)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 256)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !440, file: !439, line: 178, baseType: !31, size: 32, offset: 24960)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !440, file: !439, line: 179, baseType: !7, size: 32, offset: 24992)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !440, file: !439, line: 180, baseType: !31, size: 32, offset: 25024)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !440, file: !439, line: 181, baseType: !31, size: 32, offset: 25056)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !440, file: !439, line: 182, baseType: !7, size: 32, offset: 25088)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !440, file: !439, line: 184, baseType: !7, size: 32, offset: 25120)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !440, file: !439, line: 185, baseType: !7, size: 32, offset: 25152)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !440, file: !439, line: 186, baseType: !7, size: 32, offset: 25184)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !440, file: !439, line: 187, baseType: !31, size: 32, offset: 25216)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !440, file: !439, line: 188, baseType: !31, size: 32, offset: 25248)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !440, file: !439, line: 189, baseType: !31, size: 32, offset: 25280)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !440, file: !439, line: 190, baseType: !31, size: 32, offset: 25312)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !440, file: !439, line: 191, baseType: !7, size: 32, offset: 25344)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !440, file: !439, line: 192, baseType: !496, size: 7584, offset: 25376)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !439, line: 90, baseType: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 53, size: 7584, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !497, file: !439, line: 55, baseType: !7, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !497, file: !439, line: 56, baseType: !31, size: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !497, file: !439, line: 57, baseType: !87, size: 16, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !497, file: !439, line: 58, baseType: !87, size: 16, offset: 80)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !497, file: !439, line: 59, baseType: !7, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !497, file: !439, line: 60, baseType: !7, size: 32, offset: 128)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !497, file: !439, line: 61, baseType: !7, size: 32, offset: 160)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !497, file: !439, line: 62, baseType: !31, size: 32, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !497, file: !439, line: 63, baseType: !7, size: 32, offset: 224)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !497, file: !439, line: 64, baseType: !7, size: 32, offset: 256)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !497, file: !439, line: 65, baseType: !31, size: 32, offset: 288)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !497, file: !439, line: 66, baseType: !31, size: 32, offset: 320)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !497, file: !439, line: 67, baseType: !31, size: 32, offset: 352)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !497, file: !439, line: 68, baseType: !7, size: 32, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !497, file: !439, line: 69, baseType: !31, size: 32, offset: 416)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !497, file: !439, line: 70, baseType: !31, size: 32, offset: 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !497, file: !439, line: 71, baseType: !7, size: 32, offset: 480)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !497, file: !439, line: 72, baseType: !31, size: 32, offset: 512)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !497, file: !439, line: 73, baseType: !31, size: 32, offset: 544)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !497, file: !439, line: 74, baseType: !7, size: 32, offset: 576)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !497, file: !439, line: 75, baseType: !7, size: 32, offset: 608)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !497, file: !439, line: 76, baseType: !521, size: 3296, offset: 640)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !439, line: 50, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 38, size: 3296, elements: !523)
!523 = !{!524, !525, !526, !527, !529, !530, !531, !532, !533, !534}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !522, file: !439, line: 40, baseType: !31, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !522, file: !439, line: 41, baseType: !31, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !522, file: !439, line: 42, baseType: !31, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !522, file: !439, line: 43, baseType: !528, size: 1024, offset: 96)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1024, elements: !149)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !522, file: !439, line: 44, baseType: !528, size: 1024, offset: 1120)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !522, file: !439, line: 45, baseType: !528, size: 1024, offset: 2144)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !522, file: !439, line: 46, baseType: !31, size: 32, offset: 3168)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !522, file: !439, line: 47, baseType: !31, size: 32, offset: 3200)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !522, file: !439, line: 48, baseType: !31, size: 32, offset: 3232)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !522, file: !439, line: 49, baseType: !31, size: 32, offset: 3264)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !497, file: !439, line: 77, baseType: !7, size: 32, offset: 3936)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !497, file: !439, line: 78, baseType: !521, size: 3296, offset: 3968)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !497, file: !439, line: 80, baseType: !7, size: 32, offset: 7264)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !497, file: !439, line: 81, baseType: !7, size: 32, offset: 7296)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !497, file: !439, line: 82, baseType: !7, size: 32, offset: 7328)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !497, file: !439, line: 83, baseType: !7, size: 32, offset: 7360)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !497, file: !439, line: 84, baseType: !31, size: 32, offset: 7392)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !497, file: !439, line: 85, baseType: !31, size: 32, offset: 7424)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !497, file: !439, line: 86, baseType: !31, size: 32, offset: 7456)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !497, file: !439, line: 87, baseType: !31, size: 32, offset: 7488)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !497, file: !439, line: 88, baseType: !31, size: 32, offset: 7520)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !497, file: !439, line: 89, baseType: !31, size: 32, offset: 7552)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !440, file: !439, line: 193, baseType: !31, size: 32, offset: 32960)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !440, file: !439, line: 195, baseType: !7, size: 32, offset: 32992)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !551, line: 836, baseType: !552)
!551 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !551, line: 566, size: 6855040, elements: !553)
!553 = !{!554, !637, !678, !679, !681, !683, !738, !740, !741, !742, !743, !744, !747, !767, !779, !780, !781, !782, !783, !784, !1349, !1350, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1360, !1363, !1364, !1366, !1367, !1368, !1369, !1370, !1372, !1373, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1502, !1503, !1505, !1506, !1515, !1537, !1538, !1539, !1541, !1544, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1593, !1596, !1597, !1598, !1599, !1602, !1607, !1611, !1615, !1619, !1620, !1624, !1625, !1629, !1630, !1634, !1655, !1656, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !552, file: !551, line: 568, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !551, line: 850, size: 32128, elements: !557)
!557 = !{!558, !562, !563, !564, !565, !566, !567, !568, !569, !570, !599, !600, !601, !602, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !556, file: !551, line: 852, baseType: !559, size: 2040)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 2040, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 255)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !556, file: !551, line: 853, baseType: !559, size: 2040, offset: 2040)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !556, file: !551, line: 854, baseType: !559, size: 2040, offset: 4080)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !556, file: !551, line: 856, baseType: !7, size: 32, offset: 6144)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !556, file: !551, line: 857, baseType: !7, size: 32, offset: 6176)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !556, file: !551, line: 858, baseType: !7, size: 32, offset: 6208)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !556, file: !551, line: 859, baseType: !7, size: 32, offset: 6240)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !556, file: !551, line: 860, baseType: !7, size: 32, offset: 6272)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !556, file: !551, line: 861, baseType: !7, size: 32, offset: 6304)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !556, file: !551, line: 864, baseType: !571, size: 1088, offset: 6336)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !6, line: 52, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !6, line: 30, size: 1088, elements: !573)
!573 = !{!574, !575, !577, !579, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !572, file: !6, line: 32, baseType: !92, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !572, file: !6, line: 33, baseType: !576, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !6, line: 20, baseType: !14)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !572, file: !6, line: 34, baseType: !578, size: 64, offset: 64)
!578 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !572, file: !6, line: 35, baseType: !580, size: 96, offset: 128)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 3)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !572, file: !6, line: 36, baseType: !580, size: 96, offset: 224)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !572, file: !6, line: 37, baseType: !7, size: 32, offset: 320)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !572, file: !6, line: 38, baseType: !7, size: 32, offset: 352)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !572, file: !6, line: 39, baseType: !7, size: 32, offset: 384)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !572, file: !6, line: 40, baseType: !7, size: 32, offset: 416)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !572, file: !6, line: 41, baseType: !7, size: 32, offset: 448)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !572, file: !6, line: 42, baseType: !7, size: 32, offset: 480)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !572, file: !6, line: 43, baseType: !7, size: 32, offset: 512)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !572, file: !6, line: 44, baseType: !7, size: 32, offset: 544)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !572, file: !6, line: 45, baseType: !580, size: 96, offset: 576)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !572, file: !6, line: 46, baseType: !7, size: 32, offset: 672)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !572, file: !6, line: 47, baseType: !580, size: 96, offset: 704)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !572, file: !6, line: 48, baseType: !580, size: 96, offset: 800)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !572, file: !6, line: 49, baseType: !580, size: 96, offset: 896)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !572, file: !6, line: 50, baseType: !7, size: 32, offset: 992)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !572, file: !6, line: 51, baseType: !7, size: 32, offset: 1024)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !556, file: !551, line: 865, baseType: !571, size: 1088, offset: 7424)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !556, file: !551, line: 867, baseType: !7, size: 32, offset: 8512)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !556, file: !551, line: 868, baseType: !7, size: 32, offset: 8544)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !556, file: !551, line: 869, baseType: !603, size: 7744, offset: 8576)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !21, line: 60, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !21, line: 34, size: 7744, elements: !605)
!605 = !{!606, !607, !608, !609, !610, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !604, file: !21, line: 37, baseType: !559, size: 2040)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !604, file: !21, line: 38, baseType: !559, size: 2040, offset: 2040)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !604, file: !21, line: 39, baseType: !559, size: 2040, offset: 4080)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !604, file: !21, line: 40, baseType: !7, size: 32, offset: 6144)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !604, file: !21, line: 41, baseType: !611, size: 32, offset: 6176)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !21, line: 32, baseType: !20)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !604, file: !21, line: 42, baseType: !571, size: 1088, offset: 6208)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !604, file: !21, line: 43, baseType: !7, size: 32, offset: 7296)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !604, file: !21, line: 44, baseType: !7, size: 32, offset: 7328)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !604, file: !21, line: 45, baseType: !7, size: 32, offset: 7360)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !604, file: !21, line: 46, baseType: !7, size: 32, offset: 7392)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !604, file: !21, line: 47, baseType: !7, size: 32, offset: 7424)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !604, file: !21, line: 48, baseType: !7, size: 32, offset: 7456)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !604, file: !21, line: 49, baseType: !7, size: 32, offset: 7488)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !604, file: !21, line: 50, baseType: !7, size: 32, offset: 7520)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !604, file: !21, line: 51, baseType: !7, size: 32, offset: 7552)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !604, file: !21, line: 52, baseType: !7, size: 32, offset: 7584)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !604, file: !21, line: 53, baseType: !7, size: 32, offset: 7616)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !604, file: !21, line: 56, baseType: !94, size: 64, offset: 7680)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !556, file: !551, line: 870, baseType: !603, size: 7744, offset: 16320)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !556, file: !551, line: 871, baseType: !603, size: 7744, offset: 24064)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !556, file: !551, line: 873, baseType: !7, size: 32, offset: 31808)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !556, file: !551, line: 884, baseType: !7, size: 32, offset: 31840)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !556, file: !551, line: 885, baseType: !7, size: 32, offset: 31872)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !556, file: !551, line: 886, baseType: !7, size: 32, offset: 31904)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !556, file: !551, line: 890, baseType: !7, size: 32, offset: 31936)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !556, file: !551, line: 893, baseType: !7, size: 32, offset: 31968)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !556, file: !551, line: 894, baseType: !7, size: 32, offset: 32000)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !556, file: !551, line: 895, baseType: !7, size: 32, offset: 32032)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !556, file: !551, line: 897, baseType: !7, size: 32, offset: 32064)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !556, file: !551, line: 899, baseType: !7, size: 32, offset: 32096)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !552, file: !551, line: 569, baseType: !638, size: 64, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !439, line: 138, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 94, size: 17728, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !660, !661, !662, !663, !664, !665, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !640, file: !439, line: 96, baseType: !7, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !640, file: !439, line: 97, baseType: !31, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !640, file: !439, line: 98, baseType: !31, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !640, file: !439, line: 99, baseType: !7, size: 32, offset: 96)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !640, file: !439, line: 100, baseType: !7, size: 32, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !640, file: !439, line: 102, baseType: !7, size: 32, offset: 160)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !640, file: !439, line: 103, baseType: !454, size: 384, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !640, file: !439, line: 104, baseType: !458, size: 3072, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !640, file: !439, line: 105, baseType: !462, size: 12288, offset: 3648)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !640, file: !439, line: 106, baseType: !466, size: 192, offset: 15936)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !640, file: !439, line: 107, baseType: !466, size: 192, offset: 16128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !640, file: !439, line: 110, baseType: !7, size: 32, offset: 16320)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !640, file: !439, line: 111, baseType: !31, size: 32, offset: 16352)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !640, file: !439, line: 112, baseType: !31, size: 32, offset: 16384)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !640, file: !439, line: 114, baseType: !657, size: 256, offset: 16416)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 256, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 8)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !640, file: !439, line: 116, baseType: !657, size: 256, offset: 16672)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !640, file: !439, line: 117, baseType: !657, size: 256, offset: 16928)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !640, file: !439, line: 119, baseType: !7, size: 32, offset: 17184)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !640, file: !439, line: 120, baseType: !31, size: 32, offset: 17216)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !640, file: !439, line: 122, baseType: !31, size: 32, offset: 17248)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !640, file: !439, line: 123, baseType: !666, size: 64, offset: 17280)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !640, file: !439, line: 125, baseType: !7, size: 32, offset: 17344)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !640, file: !439, line: 126, baseType: !7, size: 32, offset: 17376)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !640, file: !439, line: 127, baseType: !7, size: 32, offset: 17408)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !640, file: !439, line: 128, baseType: !31, size: 32, offset: 17440)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !640, file: !439, line: 129, baseType: !7, size: 32, offset: 17472)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !640, file: !439, line: 130, baseType: !7, size: 32, offset: 17504)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !640, file: !439, line: 131, baseType: !7, size: 32, offset: 17536)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !640, file: !439, line: 133, baseType: !7, size: 32, offset: 17568)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !640, file: !439, line: 135, baseType: !7, size: 32, offset: 17600)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !640, file: !439, line: 136, baseType: !7, size: 32, offset: 17632)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !640, file: !439, line: 137, baseType: !7, size: 32, offset: 17664)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !552, file: !551, line: 570, baseType: !437, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !552, file: !551, line: 571, baseType: !680, size: 1056768, offset: 192)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 1056768, elements: !149)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !552, file: !551, line: 572, baseType: !682, size: 4538368, offset: 1056960)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 4538368, elements: !480)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !552, file: !551, line: 575, baseType: !684, size: 64, offset: 5595328)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !439, line: 256, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 228, size: 37312, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !686, file: !439, line: 230, baseType: !438, size: 33024)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !686, file: !439, line: 232, baseType: !31, size: 32, offset: 33024)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !686, file: !439, line: 233, baseType: !7, size: 32, offset: 33056)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !686, file: !439, line: 234, baseType: !94, size: 64, offset: 33088)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !686, file: !439, line: 235, baseType: !94, size: 64, offset: 33152)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !686, file: !439, line: 236, baseType: !95, size: 64, offset: 33216)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !686, file: !439, line: 237, baseType: !94, size: 64, offset: 33280)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !686, file: !439, line: 238, baseType: !95, size: 64, offset: 33344)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !686, file: !439, line: 240, baseType: !94, size: 64, offset: 33408)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !686, file: !439, line: 241, baseType: !95, size: 64, offset: 33472)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !686, file: !439, line: 242, baseType: !94, size: 64, offset: 33536)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !686, file: !439, line: 243, baseType: !95, size: 64, offset: 33600)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !686, file: !439, line: 245, baseType: !7, size: 32, offset: 33664)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !686, file: !439, line: 246, baseType: !94, size: 64, offset: 33728)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !686, file: !439, line: 247, baseType: !94, size: 64, offset: 33792)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !686, file: !439, line: 248, baseType: !95, size: 64, offset: 33856)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !686, file: !439, line: 249, baseType: !95, size: 64, offset: 33920)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !686, file: !439, line: 250, baseType: !96, size: 64, offset: 33984)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !686, file: !439, line: 251, baseType: !95, size: 64, offset: 34048)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !686, file: !439, line: 253, baseType: !31, size: 32, offset: 34112)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !686, file: !439, line: 254, baseType: !7, size: 32, offset: 34144)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !686, file: !439, line: 255, baseType: !710, size: 3136, offset: 34176)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !439, line: 226, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !439, line: 200, size: 3136, elements: !712)
!712 = !{!713, !714, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !731, !732, !734, !735, !736, !737}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !711, file: !439, line: 202, baseType: !7, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !711, file: !439, line: 203, baseType: !715, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !711, file: !439, line: 204, baseType: !94, size: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !711, file: !439, line: 205, baseType: !95, size: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !711, file: !439, line: 206, baseType: !715, size: 64, offset: 256)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !711, file: !439, line: 207, baseType: !94, size: 64, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !711, file: !439, line: 208, baseType: !94, size: 64, offset: 384)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !711, file: !439, line: 209, baseType: !715, size: 64, offset: 448)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !711, file: !439, line: 210, baseType: !715, size: 64, offset: 512)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !711, file: !439, line: 211, baseType: !715, size: 64, offset: 576)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !711, file: !439, line: 212, baseType: !715, size: 64, offset: 640)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !711, file: !439, line: 213, baseType: !715, size: 64, offset: 704)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !711, file: !439, line: 216, baseType: !97, size: 8, offset: 768)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !711, file: !439, line: 217, baseType: !97, size: 8, offset: 776)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !711, file: !439, line: 218, baseType: !97, size: 8, offset: 784)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !711, file: !439, line: 219, baseType: !730, size: 1024, offset: 800)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !149)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !711, file: !439, line: 220, baseType: !730, size: 1024, offset: 1824)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !711, file: !439, line: 221, baseType: !733, size: 256, offset: 2848)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 256, elements: !149)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !711, file: !439, line: 222, baseType: !97, size: 8, offset: 3104)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !711, file: !439, line: 223, baseType: !97, size: 8, offset: 3112)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !711, file: !439, line: 224, baseType: !97, size: 8, offset: 3120)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !711, file: !439, line: 225, baseType: !97, size: 8, offset: 3128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !552, file: !551, line: 577, baseType: !739, size: 1193984, offset: 5595392)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 1193984, elements: !149)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !552, file: !551, line: 578, baseType: !7, size: 32, offset: 6789376)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !552, file: !551, line: 579, baseType: !7, size: 32, offset: 6789408)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !552, file: !551, line: 580, baseType: !7, size: 32, offset: 6789440)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !552, file: !551, line: 581, baseType: !7, size: 32, offset: 6789472)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !552, file: !551, line: 584, baseType: !745, size: 64, offset: 6789504)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !551, line: 584, flags: DIFlagFwdDecl)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !552, file: !551, line: 586, baseType: !748, size: 64, offset: 6789568)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !551, line: 902, size: 416, elements: !750)
!750 = !{!751, !752, !753, !754, !755, !756, !760, !761, !762, !763, !764, !765, !766}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !749, file: !551, line: 904, baseType: !31, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !749, file: !551, line: 905, baseType: !31, size: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !749, file: !551, line: 906, baseType: !7, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !749, file: !551, line: 907, baseType: !31, size: 32, offset: 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !749, file: !551, line: 908, baseType: !7, size: 32, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !749, file: !551, line: 909, baseType: !757, size: 64, offset: 160)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 2)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !749, file: !551, line: 910, baseType: !89, size: 8, offset: 224)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !749, file: !551, line: 911, baseType: !89, size: 8, offset: 232)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !749, file: !551, line: 912, baseType: !7, size: 32, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !749, file: !551, line: 913, baseType: !7, size: 32, offset: 288)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !749, file: !551, line: 915, baseType: !7, size: 32, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !749, file: !551, line: 916, baseType: !7, size: 32, offset: 352)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !749, file: !551, line: 917, baseType: !7, size: 32, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !552, file: !551, line: 587, baseType: !768, size: 64, offset: 6789632)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !551, line: 839, size: 512, elements: !770)
!770 = !{!771, !772, !775, !776, !777, !778}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !769, file: !551, line: 841, baseType: !7, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !769, file: !551, line: 842, baseType: !773, size: 96, offset: 32)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 96, elements: !581)
!774 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !769, file: !551, line: 843, baseType: !773, size: 96, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !769, file: !551, line: 844, baseType: !773, size: 96, offset: 224)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !769, file: !551, line: 845, baseType: !773, size: 96, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !769, file: !551, line: 846, baseType: !773, size: 96, offset: 416)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !552, file: !551, line: 588, baseType: !7, size: 32, offset: 6789696)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !552, file: !551, line: 591, baseType: !31, size: 32, offset: 6789728)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !552, file: !551, line: 592, baseType: !7, size: 32, offset: 6789760)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !552, file: !551, line: 593, baseType: !7, size: 32, offset: 6789792)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !552, file: !551, line: 594, baseType: !7, size: 32, offset: 6789824)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !552, file: !551, line: 595, baseType: !785, size: 64, offset: 6789888)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !551, line: 542, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !551, line: 341, size: 109184, elements: !789)
!789 = !{!790, !792, !793, !794, !795, !796, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1017, !1019, !1182, !1211, !1236, !1239, !1240, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1274, !1275, !1276, !1277, !1278, !1279, !1282, !1283, !1286, !1287, !1289, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1302, !1303, !1304, !1305, !1306, !1309, !1310, !1311, !1313, !1317, !1321, !1325, !1329, !1330, !1331, !1332, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1346, !1347}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !788, file: !551, line: 343, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !788, file: !551, line: 344, baseType: !555, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !788, file: !551, line: 345, baseType: !638, size: 64, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !788, file: !551, line: 346, baseType: !437, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "svc_extension_flag", scope: !788, file: !551, line: 347, baseType: !7, size: 32, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !788, file: !551, line: 350, baseType: !797, size: 64, offset: 320)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !799, line: 186, size: 33408, elements: !800)
!799 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!800 = !{!801, !802, !805, !951, !952, !953, !954, !955, !956, !957, !958, !959, !963, !964, !965}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !798, file: !799, line: 188, baseType: !549, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !798, file: !799, line: 189, baseType: !803, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !551, line: 900, baseType: !556)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !798, file: !799, line: 190, baseType: !806, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !799, line: 182, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !799, line: 152, size: 768, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !946, !947, !948, !949, !950}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !809, file: !799, line: 154, baseType: !7, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !809, file: !799, line: 155, baseType: !7, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !809, file: !799, line: 156, baseType: !7, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !809, file: !799, line: 157, baseType: !7, size: 32, offset: 96)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !809, file: !799, line: 159, baseType: !7, size: 32, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !809, file: !799, line: 161, baseType: !31, size: 32, offset: 160)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !809, file: !799, line: 162, baseType: !31, size: 32, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !809, file: !799, line: 164, baseType: !7, size: 32, offset: 224)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !809, file: !799, line: 165, baseType: !7, size: 32, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !809, file: !799, line: 166, baseType: !7, size: 32, offset: 288)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !809, file: !799, line: 167, baseType: !7, size: 32, offset: 320)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !809, file: !799, line: 170, baseType: !7, size: 32, offset: 352)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !809, file: !799, line: 172, baseType: !824, size: 64, offset: 384)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !799, line: 138, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !799, line: 46, size: 3328, elements: !827)
!827 = !{!828, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !866, !868, !869, !886, !888, !892, !894, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !826, file: !799, line: 48, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !30, line: 140, baseType: !29)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !826, file: !799, line: 50, baseType: !7, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !826, file: !799, line: 51, baseType: !7, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !826, file: !799, line: 52, baseType: !7, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !826, file: !799, line: 53, baseType: !7, size: 32, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !826, file: !799, line: 54, baseType: !31, size: 32, offset: 160)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !826, file: !799, line: 55, baseType: !31, size: 32, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !826, file: !799, line: 57, baseType: !7, size: 32, offset: 224)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !826, file: !799, line: 58, baseType: !7, size: 32, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !826, file: !799, line: 59, baseType: !7, size: 32, offset: 288)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !826, file: !799, line: 61, baseType: !89, size: 8, offset: 320)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !826, file: !799, line: 62, baseType: !7, size: 32, offset: 352)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !826, file: !799, line: 63, baseType: !7, size: 32, offset: 384)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !826, file: !799, line: 64, baseType: !7, size: 32, offset: 416)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !826, file: !799, line: 65, baseType: !7, size: 32, offset: 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !826, file: !799, line: 67, baseType: !93, size: 16, offset: 480)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !826, file: !799, line: 69, baseType: !7, size: 32, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !826, file: !799, line: 69, baseType: !7, size: 32, offset: 544)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !826, file: !799, line: 69, baseType: !7, size: 32, offset: 576)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !826, file: !799, line: 69, baseType: !7, size: 32, offset: 608)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !826, file: !799, line: 70, baseType: !7, size: 32, offset: 640)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !826, file: !799, line: 70, baseType: !7, size: 32, offset: 672)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !826, file: !799, line: 70, baseType: !7, size: 32, offset: 704)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !826, file: !799, line: 70, baseType: !7, size: 32, offset: 736)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !826, file: !799, line: 71, baseType: !7, size: 32, offset: 768)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !826, file: !799, line: 72, baseType: !7, size: 32, offset: 800)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !826, file: !799, line: 73, baseType: !31, size: 32, offset: 832)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !826, file: !799, line: 74, baseType: !31, size: 32, offset: 864)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !826, file: !799, line: 75, baseType: !7, size: 32, offset: 896)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !826, file: !799, line: 75, baseType: !7, size: 32, offset: 928)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !826, file: !799, line: 76, baseType: !7, size: 32, offset: 960)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !826, file: !799, line: 76, baseType: !7, size: 32, offset: 992)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !826, file: !799, line: 79, baseType: !862, size: 64, offset: 1024)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !90, line: 41, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !90, line: 23, baseType: !87)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !826, file: !799, line: 80, baseType: !867, size: 64, offset: 1088)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !826, file: !799, line: 81, baseType: !867, size: 64, offset: 1152)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !826, file: !799, line: 84, baseType: !870, size: 64, offset: 1216)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !799, line: 36, size: 256, elements: !873)
!873 = !{!874, !877, !884}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !872, file: !799, line: 38, baseType: !875, size: 128)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !876, size: 128, elements: !758)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !872, file: !799, line: 39, baseType: !878, size: 64, offset: 128)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !879, size: 64, elements: !758)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !551, line: 104, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !551, line: 100, size: 32, elements: !881)
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !880, file: !551, line: 102, baseType: !93, size: 16)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !880, file: !551, line: 103, baseType: !93, size: 16, offset: 16)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !872, file: !799, line: 40, baseType: !885, size: 16, offset: 192)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 16, elements: !758)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !826, file: !799, line: 85, baseType: !887, size: 192, offset: 1280)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 192, elements: !581)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !826, file: !799, line: 87, baseType: !889, size: 64, offset: 1472)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !799, line: 29, size: 64, elements: !890)
!890 = !{!891}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !889, file: !799, line: 31, baseType: !666, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !826, file: !799, line: 88, baseType: !893, size: 192, offset: 1536)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 192, elements: !581)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !826, file: !799, line: 90, baseType: !895, size: 64, offset: 1728)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !826, file: !799, line: 92, baseType: !876, size: 64, offset: 1792)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !826, file: !799, line: 93, baseType: !876, size: 64, offset: 1856)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !826, file: !799, line: 94, baseType: !876, size: 64, offset: 1920)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !826, file: !799, line: 96, baseType: !7, size: 32, offset: 1984)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !826, file: !799, line: 97, baseType: !7, size: 32, offset: 2016)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !826, file: !799, line: 98, baseType: !7, size: 32, offset: 2048)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !826, file: !799, line: 99, baseType: !7, size: 32, offset: 2080)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !826, file: !799, line: 100, baseType: !7, size: 32, offset: 2112)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !826, file: !799, line: 102, baseType: !7, size: 32, offset: 2144)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !826, file: !799, line: 103, baseType: !7, size: 32, offset: 2176)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !826, file: !799, line: 104, baseType: !7, size: 32, offset: 2208)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !826, file: !799, line: 105, baseType: !7, size: 32, offset: 2240)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !826, file: !799, line: 106, baseType: !7, size: 32, offset: 2272)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !826, file: !799, line: 107, baseType: !7, size: 32, offset: 2304)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !826, file: !799, line: 108, baseType: !7, size: 32, offset: 2336)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !826, file: !799, line: 109, baseType: !7, size: 32, offset: 2368)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !826, file: !799, line: 110, baseType: !757, size: 64, offset: 2400)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !826, file: !799, line: 111, baseType: !7, size: 32, offset: 2464)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !826, file: !799, line: 112, baseType: !916, size: 64, offset: 2496)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !551, line: 194, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !551, line: 186, size: 256, elements: !919)
!919 = !{!920, !921, !922, !923, !924, !925}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !918, file: !551, line: 188, baseType: !7, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !918, file: !551, line: 189, baseType: !7, size: 32, offset: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !918, file: !551, line: 190, baseType: !7, size: 32, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !918, file: !551, line: 191, baseType: !7, size: 32, offset: 96)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !918, file: !551, line: 192, baseType: !7, size: 32, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !918, file: !551, line: 193, baseType: !926, size: 64, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !826, file: !799, line: 115, baseType: !7, size: 32, offset: 2560)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !826, file: !799, line: 118, baseType: !7, size: 32, offset: 2592)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !826, file: !799, line: 119, baseType: !7, size: 32, offset: 2624)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !826, file: !799, line: 120, baseType: !7, size: 32, offset: 2656)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !826, file: !799, line: 121, baseType: !863, size: 64, offset: 2688)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !826, file: !799, line: 124, baseType: !7, size: 32, offset: 2752)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !826, file: !799, line: 125, baseType: !7, size: 32, offset: 2784)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !826, file: !799, line: 126, baseType: !7, size: 32, offset: 2816)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !826, file: !799, line: 128, baseType: !7, size: 32, offset: 2848)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !826, file: !799, line: 129, baseType: !7, size: 32, offset: 2880)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !826, file: !799, line: 130, baseType: !7, size: 32, offset: 2912)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !826, file: !799, line: 131, baseType: !7, size: 32, offset: 2944)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !826, file: !799, line: 132, baseType: !862, size: 64, offset: 3008)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !826, file: !799, line: 133, baseType: !7, size: 32, offset: 3072)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !826, file: !799, line: 134, baseType: !7, size: 32, offset: 3104)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !826, file: !799, line: 136, baseType: !885, size: 16, offset: 3136)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !826, file: !799, line: 137, baseType: !944, size: 128, offset: 3200)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 128, elements: !758)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !809, file: !799, line: 173, baseType: !824, size: 64, offset: 448)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !809, file: !799, line: 174, baseType: !824, size: 64, offset: 512)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !809, file: !799, line: 177, baseType: !7, size: 32, offset: 576)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !809, file: !799, line: 178, baseType: !757, size: 64, offset: 608)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !809, file: !799, line: 179, baseType: !757, size: 64, offset: 672)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ref", scope: !798, file: !799, line: 191, baseType: !806, size: 64, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ltref", scope: !798, file: !799, line: 192, baseType: !806, size: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !798, file: !799, line: 193, baseType: !31, size: 32, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !798, file: !799, line: 194, baseType: !31, size: 32, offset: 352)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frames_in_buffer", scope: !798, file: !799, line: 195, baseType: !31, size: 32, offset: 384)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ltref_frames_in_buffer", scope: !798, file: !799, line: 196, baseType: !31, size: 32, offset: 416)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_poc", scope: !798, file: !799, line: 197, baseType: !7, size: 32, offset: 448)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_view_id", scope: !798, file: !799, line: 199, baseType: !7, size: 32, offset: 480)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_pic_idx", scope: !798, file: !799, line: 200, baseType: !960, size: 32768, offset: 512)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32768, elements: !961)
!961 = !{!962}
!962 = !DISubrange(count: 1024)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "init_done", scope: !798, file: !799, line: 205, baseType: !7, size: 32, offset: 33280)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !798, file: !799, line: 206, baseType: !7, size: 32, offset: 33312)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "last_picture", scope: !798, file: !799, line: 208, baseType: !807, size: 64, offset: 33344)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !788, file: !551, line: 353, baseType: !7, size: 32, offset: 384)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !788, file: !551, line: 354, baseType: !7, size: 32, offset: 416)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !788, file: !551, line: 355, baseType: !7, size: 32, offset: 448)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "Transform8x8Mode", scope: !788, file: !551, line: 356, baseType: !7, size: 32, offset: 480)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "is_not_independent", scope: !788, file: !551, line: 357, baseType: !7, size: 32, offset: 512)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "toppoc", scope: !788, file: !551, line: 359, baseType: !7, size: 32, offset: 544)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "bottompoc", scope: !788, file: !551, line: 360, baseType: !7, size: 32, offset: 576)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "framepoc", scope: !788, file: !551, line: 361, baseType: !7, size: 32, offset: 608)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !788, file: !551, line: 365, baseType: !31, size: 32, offset: 640)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !788, file: !551, line: 366, baseType: !7, size: 32, offset: 672)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !788, file: !551, line: 368, baseType: !757, size: 64, offset: 704)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntMsb", scope: !788, file: !551, line: 372, baseType: !7, size: 32, offset: 768)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "AbsFrameNum", scope: !788, file: !551, line: 378, baseType: !31, size: 32, offset: 800)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !788, file: !551, line: 379, baseType: !7, size: 32, offset: 832)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "current_mb_nr", scope: !788, file: !551, line: 387, baseType: !31, size: 32, offset: 864)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !788, file: !551, line: 388, baseType: !31, size: 32, offset: 896)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "current_slice_nr", scope: !788, file: !551, line: 389, baseType: !93, size: 16, offset: 928)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "cod_counter", scope: !788, file: !551, line: 396, baseType: !7, size: 32, offset: 960)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "allrefzero", scope: !788, file: !551, line: 397, baseType: !7, size: 32, offset: 992)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !788, file: !551, line: 400, baseType: !7, size: 32, offset: 1024)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !788, file: !551, line: 401, baseType: !7, size: 32, offset: 1056)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_active", scope: !788, file: !551, line: 402, baseType: !757, size: 64, offset: 1088)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !788, file: !551, line: 406, baseType: !7, size: 32, offset: 1152)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !788, file: !551, line: 407, baseType: !7, size: 32, offset: 1184)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !788, file: !551, line: 408, baseType: !7, size: 32, offset: 1216)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "qs", scope: !788, file: !551, line: 409, baseType: !7, size: 32, offset: 1248)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qs_delta", scope: !788, file: !551, line: 410, baseType: !7, size: 32, offset: 1280)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !788, file: !551, line: 411, baseType: !7, size: 32, offset: 1312)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "model_number", scope: !788, file: !551, line: 412, baseType: !7, size: 32, offset: 1344)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !788, file: !551, line: 413, baseType: !31, size: 32, offset: 1376)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !788, file: !551, line: 414, baseType: !31, size: 32, offset: 1408)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !788, file: !551, line: 415, baseType: !89, size: 8, offset: 1440)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !788, file: !551, line: 416, baseType: !829, size: 32, offset: 1472)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !788, file: !551, line: 417, baseType: !7, size: 32, offset: 1504)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "end_mb_nr_plus1", scope: !788, file: !551, line: 418, baseType: !7, size: 32, offset: 1536)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !788, file: !551, line: 419, baseType: !7, size: 32, offset: 1568)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "dp_mode", scope: !788, file: !551, line: 420, baseType: !7, size: 32, offset: 1600)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "current_header", scope: !788, file: !551, line: 421, baseType: !7, size: 32, offset: 1632)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "next_header", scope: !788, file: !551, line: 422, baseType: !7, size: 32, offset: 1664)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "last_dquant", scope: !788, file: !551, line: 423, baseType: !7, size: 32, offset: 1696)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "colour_plane_id", scope: !788, file: !551, line: 426, baseType: !7, size: 32, offset: 1728)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !788, file: !551, line: 427, baseType: !7, size: 32, offset: 1760)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "sp_switch", scope: !788, file: !551, line: 428, baseType: !7, size: 32, offset: 1792)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !788, file: !551, line: 429, baseType: !7, size: 32, offset: 1824)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_slice_ref_idx", scope: !788, file: !551, line: 430, baseType: !7, size: 32, offset: 1856)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !788, file: !551, line: 431, baseType: !7, size: 32, offset: 1888)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !788, file: !551, line: 432, baseType: !7, size: 32, offset: 1920)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !788, file: !551, line: 433, baseType: !7, size: 32, offset: 1952)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !788, file: !551, line: 434, baseType: !916, size: 64, offset: 1984)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !788, file: !551, line: 436, baseType: !1016, size: 48, offset: 2048)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 48, elements: !467)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !788, file: !551, line: 437, baseType: !1018, size: 384, offset: 2112)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 384, elements: !467)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !788, file: !551, line: 440, baseType: !1020, size: 64, offset: 2496)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !551, line: 324, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !551, line: 314, size: 384, elements: !1023)
!1023 = !{!1024, !1035, !1044}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !1022, file: !551, line: 317, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !551, line: 47, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream", file: !551, line: 300, size: 256, elements: !1028)
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "read_len", scope: !1027, file: !551, line: 303, baseType: !7, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !1027, file: !551, line: 304, baseType: !7, size: 32, offset: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bitoffset", scope: !1027, file: !551, line: 306, baseType: !7, size: 32, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_length", scope: !1027, file: !551, line: 307, baseType: !7, size: 32, offset: 96)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !1027, file: !551, line: 309, baseType: !666, size: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !1027, file: !551, line: 310, baseType: !7, size: 32, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "de_cabac", scope: !1022, file: !551, line: 318, baseType: !1036, size: 256, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !551, line: 95, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !551, line: 88, size: 256, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1043}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !1037, file: !551, line: 90, baseType: !31, size: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !1037, file: !551, line: 91, baseType: !31, size: 32, offset: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !1037, file: !551, line: 92, baseType: !7, size: 32, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !1037, file: !551, line: 93, baseType: !666, size: 64, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !1037, file: !551, line: 94, baseType: !94, size: 64, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "readSyntaxElement", scope: !1022, file: !551, line: 320, baseType: !1045, size: 64, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!7, !1048, !1180, !1178}
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !551, line: 273, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !551, line: 197, size: 3840, elements: !1051)
!1051 = !{!1052, !1054, !1055, !1056, !1057, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1086, !1087, !1088, !1089, !1090, !1094, !1095, !1104, !1105, !1106, !1107, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1133, !1134, !1149, !1155, !1179}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !1050, file: !551, line: 199, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !1050, file: !551, line: 200, baseType: !791, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !1050, file: !551, line: 201, baseType: !555, size: 64, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrX", scope: !1050, file: !551, line: 202, baseType: !7, size: 32, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !1050, file: !551, line: 203, baseType: !1058, size: 32, offset: 224)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockPos", file: !551, line: 112, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !551, line: 108, size: 32, elements: !1060)
!1060 = !{!1061, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1059, file: !551, line: 110, baseType: !93, size: 16)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1059, file: !551, line: 111, baseType: !93, size: 16, offset: 16)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !1050, file: !551, line: 204, baseType: !7, size: 32, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !1050, file: !551, line: 205, baseType: !7, size: 32, offset: 288)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "block_y_aff", scope: !1050, file: !551, line: 206, baseType: !7, size: 32, offset: 320)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !1050, file: !551, line: 207, baseType: !7, size: 32, offset: 352)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !1050, file: !551, line: 208, baseType: !7, size: 32, offset: 384)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !1050, file: !551, line: 209, baseType: !7, size: 32, offset: 416)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !1050, file: !551, line: 210, baseType: !7, size: 32, offset: 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !1050, file: !551, line: 212, baseType: !7, size: 32, offset: 480)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !1050, file: !551, line: 213, baseType: !7, size: 32, offset: 512)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !1050, file: !551, line: 215, baseType: !7, size: 32, offset: 544)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "qpc", scope: !1050, file: !551, line: 216, baseType: !757, size: 64, offset: 576)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "qp_scaled", scope: !1050, file: !551, line: 217, baseType: !580, size: 96, offset: 640)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "is_lossless", scope: !1050, file: !551, line: 218, baseType: !7, size: 32, offset: 736)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !1050, file: !551, line: 219, baseType: !7, size: 32, offset: 768)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !1050, file: !551, line: 220, baseType: !7, size: 32, offset: 800)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !1050, file: !551, line: 221, baseType: !7, size: 32, offset: 832)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !1050, file: !551, line: 223, baseType: !93, size: 16, offset: 864)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !1050, file: !551, line: 224, baseType: !97, size: 8, offset: 880)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "dpl_flag", scope: !1050, file: !551, line: 225, baseType: !97, size: 8, offset: 888)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "delta_quant", scope: !1050, file: !551, line: 226, baseType: !93, size: 16, offset: 896)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "list_offset", scope: !1050, file: !551, line: 227, baseType: !93, size: 16, offset: 912)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "mb_up", scope: !1050, file: !551, line: 229, baseType: !1085, size: 64, offset: 960)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "mb_left", scope: !1050, file: !551, line: 230, baseType: !1085, size: 64, offset: 1024)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "mbup", scope: !1050, file: !551, line: 232, baseType: !1085, size: 64, offset: 1088)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "mbleft", scope: !1050, file: !551, line: 233, baseType: !1085, size: 64, offset: 1152)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !1050, file: !551, line: 236, baseType: !93, size: 16, offset: 1216)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !1050, file: !551, line: 237, baseType: !1091, size: 1024, offset: 1232)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 1024, elements: !1092)
!1092 = !{!759, !1093, !1093, !759}
!1093 = !DISubrange(count: 4)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !1050, file: !551, line: 239, baseType: !7, size: 32, offset: 2272)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !1050, file: !551, line: 240, baseType: !1096, size: 192, offset: 2304)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1097, size: 192, elements: !581)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !1098, line: 103, baseType: !1099)
!1098 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1100, line: 27, baseType: !1101)
!1100 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !1102, line: 44, baseType: !1103)
!1102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!1103 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !1050, file: !551, line: 241, baseType: !1096, size: 192, offset: 2496)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits_8x8", scope: !1050, file: !551, line: 242, baseType: !1096, size: 192, offset: 2688)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "i16mode", scope: !1050, file: !551, line: 244, baseType: !7, size: 32, offset: 2880)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !1050, file: !551, line: 245, baseType: !1108, size: 32, offset: 2912)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 32, elements: !1109)
!1109 = !{!1093}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !1050, file: !551, line: 246, baseType: !1108, size: 32, offset: 2944)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "ipmode_DPCM", scope: !1050, file: !551, line: 247, baseType: !97, size: 8, offset: 2976)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !1050, file: !551, line: 248, baseType: !97, size: 8, offset: 2984)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !1050, file: !551, line: 249, baseType: !97, size: 8, offset: 2992)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "DFDisableIdc", scope: !1050, file: !551, line: 250, baseType: !93, size: 16, offset: 3008)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "DFAlphaC0Offset", scope: !1050, file: !551, line: 251, baseType: !93, size: 16, offset: 3024)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "DFBetaOffset", scope: !1050, file: !551, line: 252, baseType: !93, size: 16, offset: 3040)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !1050, file: !551, line: 254, baseType: !7, size: 32, offset: 3072)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !1050, file: !551, line: 256, baseType: !7, size: 32, offset: 3104)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !1050, file: !551, line: 256, baseType: !7, size: 32, offset: 3136)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !1050, file: !551, line: 256, baseType: !7, size: 32, offset: 3168)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !1050, file: !551, line: 256, baseType: !7, size: 32, offset: 3200)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !1050, file: !551, line: 257, baseType: !7, size: 32, offset: 3232)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !1050, file: !551, line: 257, baseType: !7, size: 32, offset: 3264)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !1050, file: !551, line: 257, baseType: !7, size: 32, offset: 3296)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !1050, file: !551, line: 257, baseType: !7, size: 32, offset: 3328)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !1050, file: !551, line: 259, baseType: !7, size: 32, offset: 3360)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !1050, file: !551, line: 260, baseType: !7, size: 32, offset: 3392)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_4x4", scope: !1050, file: !551, line: 262, baseType: !1129, size: 64, offset: 3456)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{null, !1085, !1132, !7, !7}
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorPlane", file: !30, line: 32, baseType: !36)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_8x8", scope: !1050, file: !551, line: 263, baseType: !1129, size: 64, offset: 3520)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "GetMVPredictor", scope: !1050, file: !551, line: 265, baseType: !1135, size: 64, offset: 3584)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{null, !1085, !1138, !1148, !93, !870, !7, !7, !7, !7, !7}
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !551, line: 85, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !551, line: 77, size: 128, elements: !1141)
!1141 = !{!1142, !1143, !1144, !1145, !1146, !1147}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !1140, file: !551, line: 79, baseType: !7, size: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !1140, file: !551, line: 80, baseType: !7, size: 32, offset: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1140, file: !551, line: 81, baseType: !93, size: 16, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1140, file: !551, line: 82, baseType: !93, size: 16, offset: 80)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !1140, file: !551, line: 83, baseType: !93, size: 16, offset: 96)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !1140, file: !551, line: 84, baseType: !93, size: 16, offset: 112)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "read_and_store_CBP_block_bit", scope: !1050, file: !551, line: 268, baseType: !1150, size: 64, offset: 3648)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!7, !1085, !1153, !7}
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironmentPtr", file: !551, line: 97, baseType: !1154)
