; ModuleID = 'ldecod_src/quant.c'
source_filename = "ldecod_src/quant.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@quant_intra_default = dso_local global [16 x i32] [i32 6, i32 13, i32 20, i32 28, i32 13, i32 20, i32 28, i32 32, i32 20, i32 28, i32 32, i32 37, i32 28, i32 32, i32 37, i32 42], align 16, !dbg !0
@quant_inter_default = dso_local global [16 x i32] [i32 10, i32 14, i32 20, i32 24, i32 14, i32 20, i32 24, i32 27, i32 20, i32 24, i32 27, i32 30, i32 24, i32 27, i32 30, i32 34], align 16, !dbg !48
@quant8_intra_default = dso_local global [64 x i32] [i32 6, i32 10, i32 13, i32 16, i32 18, i32 23, i32 25, i32 27, i32 10, i32 11, i32 16, i32 18, i32 23, i32 25, i32 27, i32 29, i32 13, i32 16, i32 18, i32 23, i32 25, i32 27, i32 29, i32 31, i32 16, i32 18, i32 23, i32 25, i32 27, i32 29, i32 31, i32 33, i32 18, i32 23, i32 25, i32 27, i32 29, i32 31, i32 33, i32 36, i32 23, i32 25, i32 27, i32 29, i32 31, i32 33, i32 36, i32 38, i32 25, i32 27, i32 29, i32 31, i32 33, i32 36, i32 38, i32 40, i32 27, i32 29, i32 31, i32 33, i32 36, i32 38, i32 40, i32 42], align 16, !dbg !53

!47 = !{!0, !48, !53, !58, !60, !62, !64, !70, !72, !80}
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "quant_inter_default", scope: !2, file: !3, line: 33, type: !50, isLocal: false, isDefinition: true)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 16)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "quant8_intra_default", scope: !2, file: !3, line: 40, type: !55, isLocal: false, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 2048, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 64)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(name: "quant8_inter_default", scope: !2, file: !3, line: 51, type: !55, isLocal: false, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "quant_org", scope: !2, file: !3, line: 62, type: !50, isLocal: false, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "quant8_org", scope: !2, file: !3, line: 69, type: !55, isLocal: false, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(scope: null, file: !3, line: 95, type: !66, isLocal: true, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 304, elements: !68)
!67 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!68 = !{!69}
!69 = !DISubrange(count: 38)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(scope: null, file: !3, line: 99, type: !66, isLocal: true, isDefinition: true)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "dequant_coef", scope: !2, file: !74, line: 84, type: !75, isLocal: true, isDefinition: true)
!74 = !DIFile(filename: "ldecod_src/inc/quant.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1cab853af0b7d1def614506434d35908")
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 3072, elements: !77)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!77 = !{!78, !79, !79}
!78 = !DISubrange(count: 6)
!79 = !DISubrange(count: 4)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "dequant_coef8", scope: !2, file: !74, line: 18, type: !82, isLocal: true, isDefinition: true)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 12288, elements: !83)
!83 = !{!78, !84, !84}
!84 = !DISubrange(count: 8)
!85 = !{i32 7, !"Dwarf Version", i32 5}
!86 = !{i32 2, !"Debug Info Version", i32 3}
!87 = !{i32 1, !"wchar_size", i32 4}
!88 = !{i32 8, !"PIC Level", i32 2}
!89 = !{i32 7, !"PIE Level", i32 2}
!90 = !{i32 7, !"uwtable", i32 2}
!91 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!92 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!93 = distinct !DISubprogram(name: "init_qp_process", scope: !3, file: !3, line: 86, type: !94, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1269)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !98, line: 836, baseType: !99)
!98 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !98, line: 566, size: 6855040, elements: !100)
!100 = !{!101, !185, !238, !342, !344, !346, !404, !406, !407, !408, !409, !410, !413, !433, !445, !446, !447, !448, !449, !450, !1016, !1017, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1027, !1030, !1031, !1033, !1034, !1035, !1036, !1037, !1039, !1040, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1164, !1165, !1167, !1168, !1171, !1174, !1175, !1176, !1180, !1183, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1195, !1198, !1199, !1200, !1201, !1204, !1209, !1213, !1217, !1221, !1222, !1226, !1227, !1231, !1232, !1236, !1257, !1258, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !99, file: !98, line: 568, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !98, line: 850, size: 32128, elements: !104)
!104 = !{!105, !109, !110, !111, !112, !113, !114, !115, !116, !117, !147, !148, !149, !150, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !103, file: !98, line: 852, baseType: !106, size: 2040)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 2040, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 255)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !103, file: !98, line: 853, baseType: !106, size: 2040, offset: 2040)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !103, file: !98, line: 854, baseType: !106, size: 2040, offset: 4080)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !103, file: !98, line: 856, baseType: !7, size: 32, offset: 6144)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !103, file: !98, line: 857, baseType: !7, size: 32, offset: 6176)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !103, file: !98, line: 858, baseType: !7, size: 32, offset: 6208)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !103, file: !98, line: 859, baseType: !7, size: 32, offset: 6240)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !103, file: !98, line: 860, baseType: !7, size: 32, offset: 6272)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !103, file: !98, line: 861, baseType: !7, size: 32, offset: 6304)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !103, file: !98, line: 864, baseType: !118, size: 1088, offset: 6336)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !6, line: 52, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !6, line: 30, size: 1088, elements: !120)
!120 = !{!121, !123, !125, !127, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !119, file: !6, line: 32, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !6, line: 28, baseType: !5)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !119, file: !6, line: 33, baseType: !124, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !6, line: 20, baseType: !14)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !119, file: !6, line: 34, baseType: !126, size: 64, offset: 64)
!126 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !119, file: !6, line: 35, baseType: !128, size: 96, offset: 128)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 3)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !119, file: !6, line: 36, baseType: !128, size: 96, offset: 224)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !119, file: !6, line: 37, baseType: !7, size: 32, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !119, file: !6, line: 38, baseType: !7, size: 32, offset: 352)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !119, file: !6, line: 39, baseType: !7, size: 32, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !119, file: !6, line: 40, baseType: !7, size: 32, offset: 416)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !119, file: !6, line: 41, baseType: !7, size: 32, offset: 448)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !119, file: !6, line: 42, baseType: !7, size: 32, offset: 480)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !119, file: !6, line: 43, baseType: !7, size: 32, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !119, file: !6, line: 44, baseType: !7, size: 32, offset: 544)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !119, file: !6, line: 45, baseType: !128, size: 96, offset: 576)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !119, file: !6, line: 46, baseType: !7, size: 32, offset: 672)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !119, file: !6, line: 47, baseType: !128, size: 96, offset: 704)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !119, file: !6, line: 48, baseType: !128, size: 96, offset: 800)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !119, file: !6, line: 49, baseType: !128, size: 96, offset: 896)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !119, file: !6, line: 50, baseType: !7, size: 32, offset: 992)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !119, file: !6, line: 51, baseType: !7, size: 32, offset: 1024)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !103, file: !98, line: 865, baseType: !118, size: 1088, offset: 7424)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !103, file: !98, line: 867, baseType: !7, size: 32, offset: 8512)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !103, file: !98, line: 868, baseType: !7, size: 32, offset: 8544)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !103, file: !98, line: 869, baseType: !151, size: 7744, offset: 8576)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !21, line: 60, baseType: !152)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !21, line: 34, size: 7744, elements: !153)
!153 = !{!154, !155, !156, !157, !158, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !152, file: !21, line: 37, baseType: !106, size: 2040)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !152, file: !21, line: 38, baseType: !106, size: 2040, offset: 2040)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !152, file: !21, line: 39, baseType: !106, size: 2040, offset: 4080)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !152, file: !21, line: 40, baseType: !7, size: 32, offset: 6144)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !152, file: !21, line: 41, baseType: !159, size: 32, offset: 6176)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !21, line: 32, baseType: !20)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !152, file: !21, line: 42, baseType: !118, size: 1088, offset: 6208)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !152, file: !21, line: 43, baseType: !7, size: 32, offset: 7296)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !152, file: !21, line: 44, baseType: !7, size: 32, offset: 7328)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !152, file: !21, line: 45, baseType: !7, size: 32, offset: 7360)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !152, file: !21, line: 46, baseType: !7, size: 32, offset: 7392)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !152, file: !21, line: 47, baseType: !7, size: 32, offset: 7424)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !152, file: !21, line: 48, baseType: !7, size: 32, offset: 7456)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !152, file: !21, line: 49, baseType: !7, size: 32, offset: 7488)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !152, file: !21, line: 50, baseType: !7, size: 32, offset: 7520)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !152, file: !21, line: 51, baseType: !7, size: 32, offset: 7552)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !152, file: !21, line: 52, baseType: !7, size: 32, offset: 7584)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !152, file: !21, line: 53, baseType: !7, size: 32, offset: 7616)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !152, file: !21, line: 56, baseType: !46, size: 64, offset: 7680)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !103, file: !98, line: 870, baseType: !151, size: 7744, offset: 16320)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !103, file: !98, line: 871, baseType: !151, size: 7744, offset: 24064)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !103, file: !98, line: 873, baseType: !7, size: 32, offset: 31808)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !103, file: !98, line: 884, baseType: !7, size: 32, offset: 31840)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !103, file: !98, line: 885, baseType: !7, size: 32, offset: 31872)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !103, file: !98, line: 886, baseType: !7, size: 32, offset: 31904)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !103, file: !98, line: 890, baseType: !7, size: 32, offset: 31936)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !103, file: !98, line: 893, baseType: !7, size: 32, offset: 31968)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !103, file: !98, line: 894, baseType: !7, size: 32, offset: 32000)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !103, file: !98, line: 895, baseType: !7, size: 32, offset: 32032)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !103, file: !98, line: 897, baseType: !7, size: 32, offset: 32064)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !103, file: !98, line: 899, baseType: !7, size: 32, offset: 32096)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !99, file: !98, line: 569, baseType: !186, size: 64, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !188, line: 138, baseType: !189)
!188 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 94, size: 17728, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196, !197, !201, !204, !207, !210, !211, !212, !213, !214, !217, !218, !219, !220, !221, !222, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !189, file: !188, line: 96, baseType: !7, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !189, file: !188, line: 97, baseType: !31, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !189, file: !188, line: 98, baseType: !31, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !189, file: !188, line: 99, baseType: !7, size: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !189, file: !188, line: 100, baseType: !7, size: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !189, file: !188, line: 102, baseType: !7, size: 32, offset: 160)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !189, file: !188, line: 103, baseType: !198, size: 384, offset: 192)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 384, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 12)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !189, file: !188, line: 104, baseType: !202, size: 3072, offset: 576)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3072, elements: !203)
!203 = !{!78, !52}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !189, file: !188, line: 105, baseType: !205, size: 12288, offset: 3648)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 12288, elements: !206)
!206 = !{!78, !57}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !189, file: !188, line: 106, baseType: !208, size: 192, offset: 15936)
!208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !209)
!209 = !{!78}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !189, file: !188, line: 107, baseType: !208, size: 192, offset: 16128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !189, file: !188, line: 110, baseType: !7, size: 32, offset: 16320)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !189, file: !188, line: 111, baseType: !31, size: 32, offset: 16352)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !189, file: !188, line: 112, baseType: !31, size: 32, offset: 16384)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !189, file: !188, line: 114, baseType: !215, size: 256, offset: 16416)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 256, elements: !216)
!216 = !{!84}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !189, file: !188, line: 116, baseType: !215, size: 256, offset: 16672)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !189, file: !188, line: 117, baseType: !215, size: 256, offset: 16928)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !189, file: !188, line: 119, baseType: !7, size: 32, offset: 17184)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !189, file: !188, line: 120, baseType: !31, size: 32, offset: 17216)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !189, file: !188, line: 122, baseType: !31, size: 32, offset: 17248)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !189, file: !188, line: 123, baseType: !223, size: 64, offset: 17280)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !225, line: 21, baseType: !226)
!225 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!226 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !189, file: !188, line: 125, baseType: !7, size: 32, offset: 17344)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !189, file: !188, line: 126, baseType: !7, size: 32, offset: 17376)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !189, file: !188, line: 127, baseType: !7, size: 32, offset: 17408)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !189, file: !188, line: 128, baseType: !31, size: 32, offset: 17440)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !189, file: !188, line: 129, baseType: !7, size: 32, offset: 17472)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !189, file: !188, line: 130, baseType: !7, size: 32, offset: 17504)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !189, file: !188, line: 131, baseType: !7, size: 32, offset: 17536)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !189, file: !188, line: 133, baseType: !7, size: 32, offset: 17568)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !189, file: !188, line: 135, baseType: !7, size: 32, offset: 17600)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !189, file: !188, line: 136, baseType: !7, size: 32, offset: 17632)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !189, file: !188, line: 137, baseType: !7, size: 32, offset: 17664)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !99, file: !98, line: 570, baseType: !239, size: 64, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !188, line: 197, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 142, size: 33024, elements: !242)
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !340, !341}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !241, file: !188, line: 144, baseType: !7, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !241, file: !188, line: 146, baseType: !31, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !241, file: !188, line: 147, baseType: !7, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !241, file: !188, line: 148, baseType: !7, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !241, file: !188, line: 149, baseType: !7, size: 32, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !241, file: !188, line: 150, baseType: !7, size: 32, offset: 160)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !241, file: !188, line: 152, baseType: !7, size: 32, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !241, file: !188, line: 154, baseType: !31, size: 32, offset: 224)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !241, file: !188, line: 155, baseType: !31, size: 32, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !241, file: !188, line: 156, baseType: !31, size: 32, offset: 288)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !241, file: !188, line: 158, baseType: !7, size: 32, offset: 320)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !241, file: !188, line: 159, baseType: !198, size: 384, offset: 352)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !241, file: !188, line: 160, baseType: !202, size: 3072, offset: 736)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !241, file: !188, line: 161, baseType: !205, size: 12288, offset: 3808)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !241, file: !188, line: 162, baseType: !208, size: 192, offset: 16096)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !241, file: !188, line: 163, baseType: !208, size: 192, offset: 16288)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !241, file: !188, line: 165, baseType: !31, size: 32, offset: 16480)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !241, file: !188, line: 166, baseType: !31, size: 32, offset: 16512)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !241, file: !188, line: 167, baseType: !31, size: 32, offset: 16544)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !241, file: !188, line: 168, baseType: !31, size: 32, offset: 16576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !241, file: !188, line: 170, baseType: !31, size: 32, offset: 16608)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !241, file: !188, line: 172, baseType: !7, size: 32, offset: 16640)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !241, file: !188, line: 173, baseType: !7, size: 32, offset: 16672)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !241, file: !188, line: 174, baseType: !7, size: 32, offset: 16704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !241, file: !188, line: 175, baseType: !31, size: 32, offset: 16736)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !241, file: !188, line: 177, baseType: !269, size: 8192, offset: 16768)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !241, file: !188, line: 178, baseType: !31, size: 32, offset: 24960)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !241, file: !188, line: 179, baseType: !7, size: 32, offset: 24992)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !241, file: !188, line: 180, baseType: !31, size: 32, offset: 25024)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !241, file: !188, line: 181, baseType: !31, size: 32, offset: 25056)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !241, file: !188, line: 182, baseType: !7, size: 32, offset: 25088)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !241, file: !188, line: 184, baseType: !7, size: 32, offset: 25120)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !241, file: !188, line: 185, baseType: !7, size: 32, offset: 25152)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !241, file: !188, line: 186, baseType: !7, size: 32, offset: 25184)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !241, file: !188, line: 187, baseType: !31, size: 32, offset: 25216)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !241, file: !188, line: 188, baseType: !31, size: 32, offset: 25248)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !241, file: !188, line: 189, baseType: !31, size: 32, offset: 25280)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !241, file: !188, line: 190, baseType: !31, size: 32, offset: 25312)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !241, file: !188, line: 191, baseType: !7, size: 32, offset: 25344)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !241, file: !188, line: 192, baseType: !286, size: 7584, offset: 25376)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !188, line: 90, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 53, size: 7584, elements: !288)
!288 = !{!289, !290, !291, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !287, file: !188, line: 55, baseType: !7, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !287, file: !188, line: 56, baseType: !31, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !287, file: !188, line: 57, baseType: !292, size: 16, offset: 64)
!292 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !287, file: !188, line: 58, baseType: !292, size: 16, offset: 80)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !287, file: !188, line: 59, baseType: !7, size: 32, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !287, file: !188, line: 60, baseType: !7, size: 32, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !287, file: !188, line: 61, baseType: !7, size: 32, offset: 160)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !287, file: !188, line: 62, baseType: !31, size: 32, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !287, file: !188, line: 63, baseType: !7, size: 32, offset: 224)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !287, file: !188, line: 64, baseType: !7, size: 32, offset: 256)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !287, file: !188, line: 65, baseType: !31, size: 32, offset: 288)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !287, file: !188, line: 66, baseType: !31, size: 32, offset: 320)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !287, file: !188, line: 67, baseType: !31, size: 32, offset: 352)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !287, file: !188, line: 68, baseType: !7, size: 32, offset: 384)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !287, file: !188, line: 69, baseType: !31, size: 32, offset: 416)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !287, file: !188, line: 70, baseType: !31, size: 32, offset: 448)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !287, file: !188, line: 71, baseType: !7, size: 32, offset: 480)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !287, file: !188, line: 72, baseType: !31, size: 32, offset: 512)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !287, file: !188, line: 73, baseType: !31, size: 32, offset: 544)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !287, file: !188, line: 74, baseType: !7, size: 32, offset: 576)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !287, file: !188, line: 75, baseType: !7, size: 32, offset: 608)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !287, file: !188, line: 76, baseType: !312, size: 3296, offset: 640)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !188, line: 50, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 38, size: 3296, elements: !314)
!314 = !{!315, !316, !317, !318, !322, !323, !324, !325, !326, !327}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !313, file: !188, line: 40, baseType: !31, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !313, file: !188, line: 41, baseType: !31, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !313, file: !188, line: 42, baseType: !31, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !313, file: !188, line: 43, baseType: !319, size: 1024, offset: 96)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1024, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !313, file: !188, line: 44, baseType: !319, size: 1024, offset: 1120)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !313, file: !188, line: 45, baseType: !319, size: 1024, offset: 2144)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !313, file: !188, line: 46, baseType: !31, size: 32, offset: 3168)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !313, file: !188, line: 47, baseType: !31, size: 32, offset: 3200)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !313, file: !188, line: 48, baseType: !31, size: 32, offset: 3232)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !313, file: !188, line: 49, baseType: !31, size: 32, offset: 3264)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !287, file: !188, line: 77, baseType: !7, size: 32, offset: 3936)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !287, file: !188, line: 78, baseType: !312, size: 3296, offset: 3968)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !287, file: !188, line: 80, baseType: !7, size: 32, offset: 7264)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !287, file: !188, line: 81, baseType: !7, size: 32, offset: 7296)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !287, file: !188, line: 82, baseType: !7, size: 32, offset: 7328)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !287, file: !188, line: 83, baseType: !7, size: 32, offset: 7360)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !287, file: !188, line: 84, baseType: !31, size: 32, offset: 7392)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !287, file: !188, line: 85, baseType: !31, size: 32, offset: 7424)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !287, file: !188, line: 86, baseType: !31, size: 32, offset: 7456)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !287, file: !188, line: 87, baseType: !31, size: 32, offset: 7488)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !287, file: !188, line: 88, baseType: !31, size: 32, offset: 7520)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !287, file: !188, line: 89, baseType: !31, size: 32, offset: 7552)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !241, file: !188, line: 193, baseType: !31, size: 32, offset: 32960)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !241, file: !188, line: 195, baseType: !7, size: 32, offset: 32992)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !99, file: !98, line: 571, baseType: !343, size: 1056768, offset: 192)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 1056768, elements: !320)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !99, file: !98, line: 572, baseType: !345, size: 4538368, offset: 1056960)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 4538368, elements: !270)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !99, file: !98, line: 575, baseType: !347, size: 64, offset: 5595328)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !188, line: 256, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 228, size: 37312, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !371, !372, !373, !374}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !349, file: !188, line: 230, baseType: !240, size: 33024)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !349, file: !188, line: 232, baseType: !31, size: 32, offset: 33024)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !349, file: !188, line: 233, baseType: !7, size: 32, offset: 33056)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !349, file: !188, line: 234, baseType: !46, size: 64, offset: 33088)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !349, file: !188, line: 235, baseType: !46, size: 64, offset: 33152)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !349, file: !188, line: 236, baseType: !357, size: 64, offset: 33216)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !349, file: !188, line: 237, baseType: !46, size: 64, offset: 33280)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !349, file: !188, line: 238, baseType: !357, size: 64, offset: 33344)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !349, file: !188, line: 240, baseType: !46, size: 64, offset: 33408)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !349, file: !188, line: 241, baseType: !357, size: 64, offset: 33472)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !349, file: !188, line: 242, baseType: !46, size: 64, offset: 33536)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !349, file: !188, line: 243, baseType: !357, size: 64, offset: 33600)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !349, file: !188, line: 245, baseType: !7, size: 32, offset: 33664)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !349, file: !188, line: 246, baseType: !46, size: 64, offset: 33728)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !349, file: !188, line: 247, baseType: !46, size: 64, offset: 33792)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !349, file: !188, line: 248, baseType: !357, size: 64, offset: 33856)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !349, file: !188, line: 249, baseType: !357, size: 64, offset: 33920)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !349, file: !188, line: 250, baseType: !370, size: 64, offset: 33984)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !349, file: !188, line: 251, baseType: !357, size: 64, offset: 34048)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !349, file: !188, line: 253, baseType: !31, size: 32, offset: 34112)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !349, file: !188, line: 254, baseType: !7, size: 32, offset: 34144)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !349, file: !188, line: 255, baseType: !375, size: 3136, offset: 34176)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !188, line: 226, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !188, line: 200, size: 3136, elements: !377)
!377 = !{!378, !379, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !397, !398, !400, !401, !402, !403}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !376, file: !188, line: 202, baseType: !7, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !376, file: !188, line: 203, baseType: !380, size: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !376, file: !188, line: 204, baseType: !46, size: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !376, file: !188, line: 205, baseType: !357, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !376, file: !188, line: 206, baseType: !380, size: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !376, file: !188, line: 207, baseType: !46, size: 64, offset: 320)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !376, file: !188, line: 208, baseType: !46, size: 64, offset: 384)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !376, file: !188, line: 209, baseType: !380, size: 64, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !376, file: !188, line: 210, baseType: !380, size: 64, offset: 512)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !376, file: !188, line: 211, baseType: !380, size: 64, offset: 576)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !376, file: !188, line: 212, baseType: !380, size: 64, offset: 640)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !376, file: !188, line: 213, baseType: !380, size: 64, offset: 704)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !376, file: !188, line: 216, baseType: !381, size: 8, offset: 768)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !376, file: !188, line: 217, baseType: !381, size: 8, offset: 776)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !376, file: !188, line: 218, baseType: !381, size: 8, offset: 784)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !376, file: !188, line: 219, baseType: !396, size: 1024, offset: 800)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !376, file: !188, line: 220, baseType: !396, size: 1024, offset: 1824)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !376, file: !188, line: 221, baseType: !399, size: 256, offset: 2848)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 256, elements: !320)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !376, file: !188, line: 222, baseType: !381, size: 8, offset: 3104)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !376, file: !188, line: 223, baseType: !381, size: 8, offset: 3112)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !376, file: !188, line: 224, baseType: !381, size: 8, offset: 3120)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !376, file: !188, line: 225, baseType: !381, size: 8, offset: 3128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !99, file: !98, line: 577, baseType: !405, size: 1193984, offset: 5595392)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 1193984, elements: !320)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !99, file: !98, line: 578, baseType: !7, size: 32, offset: 6789376)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !99, file: !98, line: 579, baseType: !7, size: 32, offset: 6789408)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !99, file: !98, line: 580, baseType: !7, size: 32, offset: 6789440)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !99, file: !98, line: 581, baseType: !7, size: 32, offset: 6789472)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !99, file: !98, line: 584, baseType: !411, size: 64, offset: 6789504)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !98, line: 584, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !99, file: !98, line: 586, baseType: !414, size: 64, offset: 6789568)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !98, line: 902, size: 416, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !426, !427, !428, !429, !430, !431, !432}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !415, file: !98, line: 904, baseType: !31, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !415, file: !98, line: 905, baseType: !31, size: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !415, file: !98, line: 906, baseType: !7, size: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !415, file: !98, line: 907, baseType: !31, size: 32, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !415, file: !98, line: 908, baseType: !7, size: 32, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !415, file: !98, line: 909, baseType: !423, size: 64, offset: 160)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 2)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !415, file: !98, line: 910, baseType: !224, size: 8, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !415, file: !98, line: 911, baseType: !224, size: 8, offset: 232)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !415, file: !98, line: 912, baseType: !7, size: 32, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !415, file: !98, line: 913, baseType: !7, size: 32, offset: 288)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !415, file: !98, line: 915, baseType: !7, size: 32, offset: 320)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !415, file: !98, line: 916, baseType: !7, size: 32, offset: 352)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !415, file: !98, line: 917, baseType: !7, size: 32, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !99, file: !98, line: 587, baseType: !434, size: 64, offset: 6789632)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !98, line: 839, size: 512, elements: !436)
!436 = !{!437, !438, !441, !442, !443, !444}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !435, file: !98, line: 841, baseType: !7, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !435, file: !98, line: 842, baseType: !439, size: 96, offset: 32)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 96, elements: !129)
!440 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !435, file: !98, line: 843, baseType: !439, size: 96, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !435, file: !98, line: 844, baseType: !439, size: 96, offset: 224)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !435, file: !98, line: 845, baseType: !439, size: 96, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !435, file: !98, line: 846, baseType: !439, size: 96, offset: 416)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !99, file: !98, line: 588, baseType: !7, size: 32, offset: 6789696)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !99, file: !98, line: 591, baseType: !31, size: 32, offset: 6789728)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !99, file: !98, line: 592, baseType: !7, size: 32, offset: 6789760)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !99, file: !98, line: 593, baseType: !7, size: 32, offset: 6789792)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !99, file: !98, line: 594, baseType: !7, size: 32, offset: 6789824)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !99, file: !98, line: 595, baseType: !451, size: 64, offset: 6789888)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !98, line: 542, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !98, line: 341, size: 109184, elements: !455)
!455 = !{!456, !458, !459, !460, !461, !462, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !684, !686, !848, !877, !904, !907, !908, !910, !911, !912, !913, !914, !915, !916, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !949, !950, !953, !954, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !967, !968, !969, !970, !971, !974, !975, !976, !980, !984, !988, !992, !996, !997, !998, !999, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1013, !1014}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !454, file: !98, line: 343, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !454, file: !98, line: 344, baseType: !102, size: 64, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !454, file: !98, line: 345, baseType: !186, size: 64, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !454, file: !98, line: 346, baseType: !239, size: 64, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "svc_extension_flag", scope: !454, file: !98, line: 347, baseType: !7, size: 32, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !454, file: !98, line: 350, baseType: !463, size: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !465, line: 186, size: 33408, elements: !466)
!465 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!466 = !{!467, !468, !471, !618, !619, !620, !621, !622, !623, !624, !625, !626, !630, !631, !632}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !464, file: !465, line: 188, baseType: !96, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !464, file: !465, line: 189, baseType: !469, size: 64, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !98, line: 900, baseType: !103)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !464, file: !465, line: 190, baseType: !472, size: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !465, line: 182, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !465, line: 152, size: 768, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !613, !614, !615, !616, !617}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !475, file: !465, line: 154, baseType: !7, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !475, file: !465, line: 155, baseType: !7, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !475, file: !465, line: 156, baseType: !7, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !475, file: !465, line: 157, baseType: !7, size: 32, offset: 96)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !475, file: !465, line: 159, baseType: !7, size: 32, offset: 128)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !475, file: !465, line: 161, baseType: !31, size: 32, offset: 160)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !475, file: !465, line: 162, baseType: !31, size: 32, offset: 192)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !475, file: !465, line: 164, baseType: !7, size: 32, offset: 224)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !475, file: !465, line: 165, baseType: !7, size: 32, offset: 256)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !475, file: !465, line: 166, baseType: !7, size: 32, offset: 288)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !475, file: !465, line: 167, baseType: !7, size: 32, offset: 320)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !475, file: !465, line: 170, baseType: !7, size: 32, offset: 352)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !475, file: !465, line: 172, baseType: !490, size: 64, offset: 384)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !465, line: 138, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !465, line: 46, size: 3328, elements: !493)
!493 = !{!494, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !533, !535, !536, !553, !555, !559, !561, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !492, file: !465, line: 48, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !30, line: 140, baseType: !29)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !492, file: !465, line: 50, baseType: !7, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !492, file: !465, line: 51, baseType: !7, size: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !492, file: !465, line: 52, baseType: !7, size: 32, offset: 96)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !492, file: !465, line: 53, baseType: !7, size: 32, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !492, file: !465, line: 54, baseType: !31, size: 32, offset: 160)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !492, file: !465, line: 55, baseType: !31, size: 32, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !492, file: !465, line: 57, baseType: !7, size: 32, offset: 224)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !492, file: !465, line: 58, baseType: !7, size: 32, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !492, file: !465, line: 59, baseType: !7, size: 32, offset: 288)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !492, file: !465, line: 61, baseType: !224, size: 8, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !492, file: !465, line: 62, baseType: !7, size: 32, offset: 352)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !492, file: !465, line: 63, baseType: !7, size: 32, offset: 384)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !492, file: !465, line: 64, baseType: !7, size: 32, offset: 416)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !492, file: !465, line: 65, baseType: !7, size: 32, offset: 448)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !492, file: !465, line: 67, baseType: !511, size: 16, offset: 480)
!511 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !492, file: !465, line: 69, baseType: !7, size: 32, offset: 512)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !492, file: !465, line: 69, baseType: !7, size: 32, offset: 544)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !492, file: !465, line: 69, baseType: !7, size: 32, offset: 576)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !492, file: !465, line: 69, baseType: !7, size: 32, offset: 608)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !492, file: !465, line: 70, baseType: !7, size: 32, offset: 640)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !492, file: !465, line: 70, baseType: !7, size: 32, offset: 672)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !492, file: !465, line: 70, baseType: !7, size: 32, offset: 704)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !492, file: !465, line: 70, baseType: !7, size: 32, offset: 736)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !492, file: !465, line: 71, baseType: !7, size: 32, offset: 768)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !492, file: !465, line: 72, baseType: !7, size: 32, offset: 800)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !492, file: !465, line: 73, baseType: !31, size: 32, offset: 832)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !492, file: !465, line: 74, baseType: !31, size: 32, offset: 864)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !492, file: !465, line: 75, baseType: !7, size: 32, offset: 896)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !492, file: !465, line: 75, baseType: !7, size: 32, offset: 928)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !492, file: !465, line: 76, baseType: !7, size: 32, offset: 960)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !492, file: !465, line: 76, baseType: !7, size: 32, offset: 992)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !492, file: !465, line: 79, baseType: !529, size: 64, offset: 1024)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !225, line: 41, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !225, line: 23, baseType: !292)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !492, file: !465, line: 80, baseType: !534, size: 64, offset: 1088)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !492, file: !465, line: 81, baseType: !534, size: 64, offset: 1152)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !492, file: !465, line: 84, baseType: !537, size: 64, offset: 1216)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !465, line: 36, size: 256, elements: !540)
!540 = !{!541, !544, !551}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !539, file: !465, line: 38, baseType: !542, size: 128)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 128, elements: !424)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !539, file: !465, line: 39, baseType: !545, size: 64, offset: 128)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 64, elements: !424)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !98, line: 104, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 100, size: 32, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !547, file: !98, line: 102, baseType: !511, size: 16)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !547, file: !98, line: 103, baseType: !511, size: 16, offset: 16)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !539, file: !465, line: 40, baseType: !552, size: 16, offset: 192)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 16, elements: !424)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !492, file: !465, line: 85, baseType: !554, size: 192, offset: 1280)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, size: 192, elements: !129)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !492, file: !465, line: 87, baseType: !556, size: 64, offset: 1472)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !465, line: 29, size: 64, elements: !557)
!557 = !{!558}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !556, file: !465, line: 31, baseType: !223, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !492, file: !465, line: 88, baseType: !560, size: 192, offset: 1536)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 192, elements: !129)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !492, file: !465, line: 90, baseType: !562, size: 64, offset: 1728)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !492, file: !465, line: 92, baseType: !543, size: 64, offset: 1792)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !492, file: !465, line: 93, baseType: !543, size: 64, offset: 1856)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !492, file: !465, line: 94, baseType: !543, size: 64, offset: 1920)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !492, file: !465, line: 96, baseType: !7, size: 32, offset: 1984)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !492, file: !465, line: 97, baseType: !7, size: 32, offset: 2016)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !492, file: !465, line: 98, baseType: !7, size: 32, offset: 2048)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !492, file: !465, line: 99, baseType: !7, size: 32, offset: 2080)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !492, file: !465, line: 100, baseType: !7, size: 32, offset: 2112)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !492, file: !465, line: 102, baseType: !7, size: 32, offset: 2144)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !492, file: !465, line: 103, baseType: !7, size: 32, offset: 2176)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !492, file: !465, line: 104, baseType: !7, size: 32, offset: 2208)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !492, file: !465, line: 105, baseType: !7, size: 32, offset: 2240)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !492, file: !465, line: 106, baseType: !7, size: 32, offset: 2272)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !492, file: !465, line: 107, baseType: !7, size: 32, offset: 2304)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !492, file: !465, line: 108, baseType: !7, size: 32, offset: 2336)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !492, file: !465, line: 109, baseType: !7, size: 32, offset: 2368)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !492, file: !465, line: 110, baseType: !423, size: 64, offset: 2400)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !492, file: !465, line: 111, baseType: !7, size: 32, offset: 2464)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !492, file: !465, line: 112, baseType: !583, size: 64, offset: 2496)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !98, line: 194, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !98, line: 186, size: 256, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !585, file: !98, line: 188, baseType: !7, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !585, file: !98, line: 189, baseType: !7, size: 32, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !585, file: !98, line: 190, baseType: !7, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !585, file: !98, line: 191, baseType: !7, size: 32, offset: 96)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !585, file: !98, line: 192, baseType: !7, size: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !585, file: !98, line: 193, baseType: !593, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !492, file: !465, line: 115, baseType: !7, size: 32, offset: 2560)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !492, file: !465, line: 118, baseType: !7, size: 32, offset: 2592)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !492, file: !465, line: 119, baseType: !7, size: 32, offset: 2624)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !492, file: !465, line: 120, baseType: !7, size: 32, offset: 2656)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !492, file: !465, line: 121, baseType: !530, size: 64, offset: 2688)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !492, file: !465, line: 124, baseType: !7, size: 32, offset: 2752)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !492, file: !465, line: 125, baseType: !7, size: 32, offset: 2784)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !492, file: !465, line: 126, baseType: !7, size: 32, offset: 2816)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !492, file: !465, line: 128, baseType: !7, size: 32, offset: 2848)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !492, file: !465, line: 129, baseType: !7, size: 32, offset: 2880)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !492, file: !465, line: 130, baseType: !7, size: 32, offset: 2912)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !492, file: !465, line: 131, baseType: !7, size: 32, offset: 2944)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !492, file: !465, line: 132, baseType: !529, size: 64, offset: 3008)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !492, file: !465, line: 133, baseType: !7, size: 32, offset: 3072)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !492, file: !465, line: 134, baseType: !7, size: 32, offset: 3104)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !492, file: !465, line: 136, baseType: !552, size: 16, offset: 3136)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !492, file: !465, line: 137, baseType: !611, size: 128, offset: 3200)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 128, elements: !424)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !475, file: !465, line: 173, baseType: !490, size: 64, offset: 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !475, file: !465, line: 174, baseType: !490, size: 64, offset: 512)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !475, file: !465, line: 177, baseType: !7, size: 32, offset: 576)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !475, file: !465, line: 178, baseType: !423, size: 64, offset: 608)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !475, file: !465, line: 179, baseType: !423, size: 64, offset: 672)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ref", scope: !464, file: !465, line: 191, baseType: !472, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ltref", scope: !464, file: !465, line: 192, baseType: !472, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !464, file: !465, line: 193, baseType: !31, size: 32, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !464, file: !465, line: 194, baseType: !31, size: 32, offset: 352)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frames_in_buffer", scope: !464, file: !465, line: 195, baseType: !31, size: 32, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ltref_frames_in_buffer", scope: !464, file: !465, line: 196, baseType: !31, size: 32, offset: 416)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_poc", scope: !464, file: !465, line: 197, baseType: !7, size: 32, offset: 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_view_id", scope: !464, file: !465, line: 199, baseType: !7, size: 32, offset: 480)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_pic_idx", scope: !464, file: !465, line: 200, baseType: !627, size: 32768, offset: 512)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32768, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 1024)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "init_done", scope: !464, file: !465, line: 205, baseType: !7, size: 32, offset: 33280)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !464, file: !465, line: 206, baseType: !7, size: 32, offset: 33312)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "last_picture", scope: !464, file: !465, line: 208, baseType: !473, size: 64, offset: 33344)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !454, file: !98, line: 353, baseType: !7, size: 32, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !454, file: !98, line: 354, baseType: !7, size: 32, offset: 416)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !454, file: !98, line: 355, baseType: !7, size: 32, offset: 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Transform8x8Mode", scope: !454, file: !98, line: 356, baseType: !7, size: 32, offset: 480)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "is_not_independent", scope: !454, file: !98, line: 357, baseType: !7, size: 32, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "toppoc", scope: !454, file: !98, line: 359, baseType: !7, size: 32, offset: 544)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "bottompoc", scope: !454, file: !98, line: 360, baseType: !7, size: 32, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "framepoc", scope: !454, file: !98, line: 361, baseType: !7, size: 32, offset: 608)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !454, file: !98, line: 365, baseType: !31, size: 32, offset: 640)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !454, file: !98, line: 366, baseType: !7, size: 32, offset: 672)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !454, file: !98, line: 368, baseType: !423, size: 64, offset: 704)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntMsb", scope: !454, file: !98, line: 372, baseType: !7, size: 32, offset: 768)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "AbsFrameNum", scope: !454, file: !98, line: 378, baseType: !31, size: 32, offset: 800)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !454, file: !98, line: 379, baseType: !7, size: 32, offset: 832)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "current_mb_nr", scope: !454, file: !98, line: 387, baseType: !31, size: 32, offset: 864)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !454, file: !98, line: 388, baseType: !31, size: 32, offset: 896)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "current_slice_nr", scope: !454, file: !98, line: 389, baseType: !511, size: 16, offset: 928)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "cod_counter", scope: !454, file: !98, line: 396, baseType: !7, size: 32, offset: 960)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "allrefzero", scope: !454, file: !98, line: 397, baseType: !7, size: 32, offset: 992)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !454, file: !98, line: 400, baseType: !7, size: 32, offset: 1024)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !454, file: !98, line: 401, baseType: !7, size: 32, offset: 1056)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_active", scope: !454, file: !98, line: 402, baseType: !423, size: 64, offset: 1088)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !454, file: !98, line: 406, baseType: !7, size: 32, offset: 1152)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !454, file: !98, line: 407, baseType: !7, size: 32, offset: 1184)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !454, file: !98, line: 408, baseType: !7, size: 32, offset: 1216)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "qs", scope: !454, file: !98, line: 409, baseType: !7, size: 32, offset: 1248)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qs_delta", scope: !454, file: !98, line: 410, baseType: !7, size: 32, offset: 1280)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !454, file: !98, line: 411, baseType: !7, size: 32, offset: 1312)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "model_number", scope: !454, file: !98, line: 412, baseType: !7, size: 32, offset: 1344)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !454, file: !98, line: 413, baseType: !31, size: 32, offset: 1376)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !454, file: !98, line: 414, baseType: !31, size: 32, offset: 1408)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !454, file: !98, line: 415, baseType: !224, size: 8, offset: 1440)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !454, file: !98, line: 416, baseType: !495, size: 32, offset: 1472)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !454, file: !98, line: 417, baseType: !7, size: 32, offset: 1504)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "end_mb_nr_plus1", scope: !454, file: !98, line: 418, baseType: !7, size: 32, offset: 1536)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !454, file: !98, line: 419, baseType: !7, size: 32, offset: 1568)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dp_mode", scope: !454, file: !98, line: 420, baseType: !7, size: 32, offset: 1600)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "current_header", scope: !454, file: !98, line: 421, baseType: !7, size: 32, offset: 1632)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "next_header", scope: !454, file: !98, line: 422, baseType: !7, size: 32, offset: 1664)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "last_dquant", scope: !454, file: !98, line: 423, baseType: !7, size: 32, offset: 1696)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "colour_plane_id", scope: !454, file: !98, line: 426, baseType: !7, size: 32, offset: 1728)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !454, file: !98, line: 427, baseType: !7, size: 32, offset: 1760)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "sp_switch", scope: !454, file: !98, line: 428, baseType: !7, size: 32, offset: 1792)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !454, file: !98, line: 429, baseType: !7, size: 32, offset: 1824)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_slice_ref_idx", scope: !454, file: !98, line: 430, baseType: !7, size: 32, offset: 1856)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !454, file: !98, line: 431, baseType: !7, size: 32, offset: 1888)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !454, file: !98, line: 432, baseType: !7, size: 32, offset: 1920)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !454, file: !98, line: 433, baseType: !7, size: 32, offset: 1952)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !454, file: !98, line: 434, baseType: !583, size: 64, offset: 1984)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !454, file: !98, line: 436, baseType: !683, size: 48, offset: 2048)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 48, elements: !209)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !454, file: !98, line: 437, baseType: !685, size: 384, offset: 2112)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 384, elements: !209)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !454, file: !98, line: 440, baseType: !687, size: 64, offset: 2496)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !98, line: 324, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !98, line: 314, size: 384, elements: !690)
!690 = !{!691, !702, !711}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !689, file: !98, line: 317, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !98, line: 47, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream", file: !98, line: 300, size: 256, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "read_len", scope: !694, file: !98, line: 303, baseType: !7, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !694, file: !98, line: 304, baseType: !7, size: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bitoffset", scope: !694, file: !98, line: 306, baseType: !7, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_length", scope: !694, file: !98, line: 307, baseType: !7, size: 32, offset: 96)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !694, file: !98, line: 309, baseType: !223, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !694, file: !98, line: 310, baseType: !7, size: 32, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "de_cabac", scope: !689, file: !98, line: 318, baseType: !703, size: 256, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !98, line: 95, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 88, size: 256, elements: !705)
!705 = !{!706, !707, !708, !709, !710}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !704, file: !98, line: 90, baseType: !31, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !704, file: !98, line: 91, baseType: !31, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !704, file: !98, line: 92, baseType: !7, size: 32, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !704, file: !98, line: 93, baseType: !223, size: 64, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !704, file: !98, line: 94, baseType: !46, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "readSyntaxElement", scope: !689, file: !98, line: 320, baseType: !712, size: 64, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = !DISubroutineType(types: !714)
!714 = !{!7, !715, !846, !844}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !98, line: 273, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !98, line: 197, size: 3840, elements: !718)
!718 = !{!719, !721, !722, !723, !724, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !753, !754, !755, !756, !757, !760, !761, !770, !771, !772, !773, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !799, !800, !815, !821, !845}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !717, file: !98, line: 199, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !717, file: !98, line: 200, baseType: !457, size: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !717, file: !98, line: 201, baseType: !102, size: 64, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrX", scope: !717, file: !98, line: 202, baseType: !7, size: 32, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !717, file: !98, line: 203, baseType: !725, size: 32, offset: 224)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockPos", file: !98, line: 112, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !98, line: 108, size: 32, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !726, file: !98, line: 110, baseType: !511, size: 16)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !726, file: !98, line: 111, baseType: !511, size: 16, offset: 16)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !717, file: !98, line: 204, baseType: !7, size: 32, offset: 256)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !717, file: !98, line: 205, baseType: !7, size: 32, offset: 288)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "block_y_aff", scope: !717, file: !98, line: 206, baseType: !7, size: 32, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !717, file: !98, line: 207, baseType: !7, size: 32, offset: 352)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !717, file: !98, line: 208, baseType: !7, size: 32, offset: 384)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !717, file: !98, line: 209, baseType: !7, size: 32, offset: 416)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !717, file: !98, line: 210, baseType: !7, size: 32, offset: 448)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !717, file: !98, line: 212, baseType: !7, size: 32, offset: 480)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !717, file: !98, line: 213, baseType: !7, size: 32, offset: 512)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !717, file: !98, line: 215, baseType: !7, size: 32, offset: 544)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "qpc", scope: !717, file: !98, line: 216, baseType: !423, size: 64, offset: 576)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "qp_scaled", scope: !717, file: !98, line: 217, baseType: !128, size: 96, offset: 640)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "is_lossless", scope: !717, file: !98, line: 218, baseType: !7, size: 32, offset: 736)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !717, file: !98, line: 219, baseType: !7, size: 32, offset: 768)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !717, file: !98, line: 220, baseType: !7, size: 32, offset: 800)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !717, file: !98, line: 221, baseType: !7, size: 32, offset: 832)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !717, file: !98, line: 223, baseType: !511, size: 16, offset: 864)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !717, file: !98, line: 224, baseType: !381, size: 8, offset: 880)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "dpl_flag", scope: !717, file: !98, line: 225, baseType: !381, size: 8, offset: 888)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "delta_quant", scope: !717, file: !98, line: 226, baseType: !511, size: 16, offset: 896)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "list_offset", scope: !717, file: !98, line: 227, baseType: !511, size: 16, offset: 912)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "mb_up", scope: !717, file: !98, line: 229, baseType: !752, size: 64, offset: 960)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mb_left", scope: !717, file: !98, line: 230, baseType: !752, size: 64, offset: 1024)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mbup", scope: !717, file: !98, line: 232, baseType: !752, size: 64, offset: 1088)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "mbleft", scope: !717, file: !98, line: 233, baseType: !752, size: 64, offset: 1152)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !717, file: !98, line: 236, baseType: !511, size: 16, offset: 1216)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !717, file: !98, line: 237, baseType: !758, size: 1024, offset: 1232)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 1024, elements: !759)
!759 = !{!425, !79, !79, !425}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !717, file: !98, line: 239, baseType: !7, size: 32, offset: 2272)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !717, file: !98, line: 240, baseType: !762, size: 192, offset: 2304)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 192, elements: !129)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !764, line: 103, baseType: !765)
!764 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !766, line: 27, baseType: !767)
!766 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !768, line: 44, baseType: !769)
!768 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!769 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !717, file: !98, line: 241, baseType: !762, size: 192, offset: 2496)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits_8x8", scope: !717, file: !98, line: 242, baseType: !762, size: 192, offset: 2688)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i16mode", scope: !717, file: !98, line: 244, baseType: !7, size: 32, offset: 2880)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !717, file: !98, line: 245, baseType: !774, size: 32, offset: 2912)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 32, elements: !775)
!775 = !{!79}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !717, file: !98, line: 246, baseType: !774, size: 32, offset: 2944)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ipmode_DPCM", scope: !717, file: !98, line: 247, baseType: !381, size: 8, offset: 2976)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !717, file: !98, line: 248, baseType: !381, size: 8, offset: 2984)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !717, file: !98, line: 249, baseType: !381, size: 8, offset: 2992)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "DFDisableIdc", scope: !717, file: !98, line: 250, baseType: !511, size: 16, offset: 3008)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "DFAlphaC0Offset", scope: !717, file: !98, line: 251, baseType: !511, size: 16, offset: 3024)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "DFBetaOffset", scope: !717, file: !98, line: 252, baseType: !511, size: 16, offset: 3040)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !717, file: !98, line: 254, baseType: !7, size: 32, offset: 3072)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !717, file: !98, line: 256, baseType: !7, size: 32, offset: 3104)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !717, file: !98, line: 256, baseType: !7, size: 32, offset: 3136)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !717, file: !98, line: 256, baseType: !7, size: 32, offset: 3168)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !717, file: !98, line: 256, baseType: !7, size: 32, offset: 3200)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !717, file: !98, line: 257, baseType: !7, size: 32, offset: 3232)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !717, file: !98, line: 257, baseType: !7, size: 32, offset: 3264)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !717, file: !98, line: 257, baseType: !7, size: 32, offset: 3296)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !717, file: !98, line: 257, baseType: !7, size: 32, offset: 3328)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !717, file: !98, line: 259, baseType: !7, size: 32, offset: 3360)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !717, file: !98, line: 260, baseType: !7, size: 32, offset: 3392)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_4x4", scope: !717, file: !98, line: 262, baseType: !795, size: 64, offset: 3456)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !752, !798, !7, !7}
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorPlane", file: !30, line: 32, baseType: !36)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_8x8", scope: !717, file: !98, line: 263, baseType: !795, size: 64, offset: 3520)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "GetMVPredictor", scope: !717, file: !98, line: 265, baseType: !801, size: 64, offset: 3584)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !752, !804, !814, !511, !537, !7, !7, !7, !7, !7}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !98, line: 85, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !98, line: 77, size: 128, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !806, file: !98, line: 79, baseType: !7, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !806, file: !98, line: 80, baseType: !7, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !806, file: !98, line: 81, baseType: !511, size: 16, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !806, file: !98, line: 82, baseType: !511, size: 16, offset: 80)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !806, file: !98, line: 83, baseType: !511, size: 16, offset: 96)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !806, file: !98, line: 84, baseType: !511, size: 16, offset: 112)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "read_and_store_CBP_block_bit", scope: !717, file: !98, line: 268, baseType: !816, size: 64, offset: 3648)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{!7, !752, !819, !7}
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironmentPtr", file: !98, line: 97, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "readRefPictureIdx", scope: !717, file: !98, line: 269, baseType: !822, size: 64, offset: 3712)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!381, !752, !825, !844, !381, !7}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !98, line: 276, size: 384, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835, !836, !840}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !826, file: !98, line: 278, baseType: !7, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !826, file: !98, line: 279, baseType: !7, size: 32, offset: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !826, file: !98, line: 280, baseType: !7, size: 32, offset: 64)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !826, file: !98, line: 281, baseType: !7, size: 32, offset: 96)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !826, file: !98, line: 282, baseType: !7, size: 32, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !826, file: !98, line: 283, baseType: !31, size: 32, offset: 160)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !826, file: !98, line: 284, baseType: !7, size: 32, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !826, file: !98, line: 285, baseType: !7, size: 32, offset: 224)
