; ModuleID = 'ldecod_src/rtp.c'
source_filename = "ldecod_src/rtp.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@errortext = external global [300 x i8], align 16
@.str = private unnamed_addr constant [26 x i8] c"Cannot open RTP file '%s'\00", align 1, !dbg !0
@GetRTPNALU.first_call = internal unnamed_addr global i1 false, align 2, !dbg !7
@GetRTPNALU.old_seq = internal unnamed_addr global i16 0, align 2, !dbg !1300
@.str.1 = private unnamed_addr constant [13 x i8] c"GetRTPNALU-1\00", align 1, !dbg !1302
@.str.2 = private unnamed_addr constant [13 x i8] c"GetRTPNALU-2\00", align 1, !dbg !1307
@.str.3 = private unnamed_addr constant [13 x i8] c"GetRTPNALU-3\00", align 1, !dbg !1309
@.str.6 = private unnamed_addr constant [6 x i8] c"%02x \00", align 1, !dbg !1321
@.str.7 = private unnamed_addr constant [17 x i8] c"Version (V): %d\0A\00", align 1, !dbg !1324
@.str.8 = private unnamed_addr constant [17 x i8] c"Padding (P): %d\0A\00", align 1, !dbg !1327
@.str.9 = private unnamed_addr constant [19 x i8] c"Extension (X): %d\0A\00", align 1, !dbg !1329
@.str.10 = private unnamed_addr constant [21 x i8] c"CSRC count (CC): %d\0A\00", align 1, !dbg !1334
@.str.11 = private unnamed_addr constant [20 x i8] c"Marker bit (M): %d\0A\00", align 1, !dbg !1339
@.str.12 = private unnamed_addr constant [23 x i8] c"Payload Type (PT): %d\0A\00", align 1, !dbg !1342

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 117, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "ldecod_src/rtp.c", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b5ef12dee0826fc6f1c9725402bc90d")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 26)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!8 = distinct !DIGlobalVariable(name: "first_call", scope: !9, file: !2, line: 156, type: !484, isLocal: true, isDefinition: true)
!9 = distinct !DISubprogram(name: "GetRTPNALU", scope: !2, file: !2, line: 154, type: !10, scopeLine: 155, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1294, retainedNodes: !1370)
!10 = !DISubroutineType(types: !11)
!11 = !{!12, !13, !1292}
!12 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !15, line: 836, baseType: !16)
!15 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !15, line: 566, size: 6855040, elements: !17)
!17 = !{!18, !126, !184, !288, !290, !292, !350, !352, !353, !354, !355, !356, !359, !379, !391, !392, !393, !394, !395, !396, !981, !982, !984, !985, !986, !987, !988, !989, !990, !992, !995, !996, !998, !999, !1000, !1001, !1002, !1004, !1005, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1129, !1130, !1132, !1133, !1136, !1139, !1140, !1141, !1145, !1148, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1160, !1163, !1164, !1165, !1166, !1183, !1188, !1192, !1196, !1200, !1201, !1205, !1206, !1210, !1211, !1215, !1236, !1237, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !16, file: !15, line: 568, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !15, line: 850, size: 32128, elements: !21)
!21 = !{!22, !26, !27, !28, !29, !30, !31, !32, !33, !34, !78, !79, !80, !81, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !20, file: !15, line: 852, baseType: !23, size: 2040)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !24)
!24 = !{!25}
!25 = !DISubrange(count: 255)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !20, file: !15, line: 853, baseType: !23, size: 2040, offset: 2040)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !20, file: !15, line: 854, baseType: !23, size: 2040, offset: 4080)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !20, file: !15, line: 856, baseType: !12, size: 32, offset: 6144)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !20, file: !15, line: 857, baseType: !12, size: 32, offset: 6176)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !20, file: !15, line: 858, baseType: !12, size: 32, offset: 6208)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !20, file: !15, line: 859, baseType: !12, size: 32, offset: 6240)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !20, file: !15, line: 860, baseType: !12, size: 32, offset: 6272)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !20, file: !15, line: 861, baseType: !12, size: 32, offset: 6304)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !20, file: !15, line: 864, baseType: !35, size: 1088, offset: 6336)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !36, line: 52, baseType: !37)
!36 = !DIFile(filename: "ldecod_src/inc/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "fd6ca9e1c707932f749220576db72b57")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !36, line: 30, size: 1088, elements: !38)
!38 = !{!39, !48, !56, !58, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !37, file: !36, line: 32, baseType: !40, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !36, line: 28, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 22, baseType: !12, size: 32, elements: !42)
!42 = !{!43, !44, !45, !46, !47}
!43 = !DIEnumerator(name: "CF_UNKNOWN", value: -1)
!44 = !DIEnumerator(name: "YUV400", value: 0)
!45 = !DIEnumerator(name: "YUV420", value: 1)
!46 = !DIEnumerator(name: "YUV422", value: 2)
!47 = !DIEnumerator(name: "YUV444", value: 3)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !37, file: !36, line: 33, baseType: !49, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !36, line: 20, baseType: !50)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !36, line: 15, baseType: !12, size: 32, elements: !51)
!51 = !{!52, !53, !54, !55}
!52 = !DIEnumerator(name: "CM_UNKNOWN", value: -1)
!53 = !DIEnumerator(name: "CM_YUV", value: 0)
!54 = !DIEnumerator(name: "CM_RGB", value: 1)
!55 = !DIEnumerator(name: "CM_XYZ", value: 2)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !37, file: !36, line: 34, baseType: !57, size: 64, offset: 64)
!57 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !37, file: !36, line: 35, baseType: !59, size: 96, offset: 128)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 96, elements: !60)
!60 = !{!61}
!61 = !DISubrange(count: 3)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !37, file: !36, line: 36, baseType: !59, size: 96, offset: 224)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !37, file: !36, line: 37, baseType: !12, size: 32, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !37, file: !36, line: 38, baseType: !12, size: 32, offset: 352)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !37, file: !36, line: 39, baseType: !12, size: 32, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !37, file: !36, line: 40, baseType: !12, size: 32, offset: 416)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !37, file: !36, line: 41, baseType: !12, size: 32, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !37, file: !36, line: 42, baseType: !12, size: 32, offset: 480)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !37, file: !36, line: 43, baseType: !12, size: 32, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !37, file: !36, line: 44, baseType: !12, size: 32, offset: 544)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !37, file: !36, line: 45, baseType: !59, size: 96, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !37, file: !36, line: 46, baseType: !12, size: 32, offset: 672)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !37, file: !36, line: 47, baseType: !59, size: 96, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !37, file: !36, line: 48, baseType: !59, size: 96, offset: 800)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !37, file: !36, line: 49, baseType: !59, size: 96, offset: 896)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !37, file: !36, line: 50, baseType: !12, size: 32, offset: 992)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !37, file: !36, line: 51, baseType: !12, size: 32, offset: 1024)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !20, file: !15, line: 865, baseType: !35, size: 1088, offset: 7424)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !20, file: !15, line: 867, baseType: !12, size: 32, offset: 8512)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !20, file: !15, line: 868, baseType: !12, size: 32, offset: 8544)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !20, file: !15, line: 869, baseType: !82, size: 7744, offset: 8576)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !83, line: 60, baseType: !84)
!83 = !DIFile(filename: "ldecod_src/inc/io_video.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1141c07f1801ad27d87214c419749431")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !83, line: 34, size: 7744, elements: !85)
!85 = !{!86, !87, !88, !89, !90, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !84, file: !83, line: 37, baseType: !23, size: 2040)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !84, file: !83, line: 38, baseType: !23, size: 2040, offset: 2040)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !84, file: !83, line: 39, baseType: !23, size: 2040, offset: 4080)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !84, file: !83, line: 40, baseType: !12, size: 32, offset: 6144)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !84, file: !83, line: 41, baseType: !91, size: 32, offset: 6176)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !83, line: 32, baseType: !92)
!92 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !83, line: 25, baseType: !12, size: 32, elements: !93)
!93 = !{!94, !95, !96, !97, !98, !99}
!94 = !DIEnumerator(name: "VIDEO_UNKNOWN", value: -1)
!95 = !DIEnumerator(name: "VIDEO_YUV", value: 0)
!96 = !DIEnumerator(name: "VIDEO_RGB", value: 1)
!97 = !DIEnumerator(name: "VIDEO_XYZ", value: 2)
!98 = !DIEnumerator(name: "VIDEO_TIFF", value: 3)
!99 = !DIEnumerator(name: "VIDEO_AVI", value: 4)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !84, file: !83, line: 42, baseType: !35, size: 1088, offset: 6208)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !84, file: !83, line: 43, baseType: !12, size: 32, offset: 7296)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !84, file: !83, line: 44, baseType: !12, size: 32, offset: 7328)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !84, file: !83, line: 45, baseType: !12, size: 32, offset: 7360)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !84, file: !83, line: 46, baseType: !12, size: 32, offset: 7392)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !84, file: !83, line: 47, baseType: !12, size: 32, offset: 7424)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !84, file: !83, line: 48, baseType: !12, size: 32, offset: 7456)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !84, file: !83, line: 49, baseType: !12, size: 32, offset: 7488)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !84, file: !83, line: 50, baseType: !12, size: 32, offset: 7520)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !84, file: !83, line: 51, baseType: !12, size: 32, offset: 7552)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !84, file: !83, line: 52, baseType: !12, size: 32, offset: 7584)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !84, file: !83, line: 53, baseType: !12, size: 32, offset: 7616)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !84, file: !83, line: 56, baseType: !113, size: 64, offset: 7680)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !20, file: !15, line: 870, baseType: !82, size: 7744, offset: 16320)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !20, file: !15, line: 871, baseType: !82, size: 7744, offset: 24064)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !20, file: !15, line: 873, baseType: !12, size: 32, offset: 31808)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !20, file: !15, line: 884, baseType: !12, size: 32, offset: 31840)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !20, file: !15, line: 885, baseType: !12, size: 32, offset: 31872)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !20, file: !15, line: 886, baseType: !12, size: 32, offset: 31904)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !20, file: !15, line: 890, baseType: !12, size: 32, offset: 31936)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !20, file: !15, line: 893, baseType: !12, size: 32, offset: 31968)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !20, file: !15, line: 894, baseType: !12, size: 32, offset: 32000)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !20, file: !15, line: 895, baseType: !12, size: 32, offset: 32032)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !20, file: !15, line: 897, baseType: !12, size: 32, offset: 32064)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !20, file: !15, line: 899, baseType: !12, size: 32, offset: 32096)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !16, file: !15, line: 569, baseType: !127, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !129, line: 138, baseType: !130)
!129 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 94, size: 17728, elements: !131)
!131 = !{!132, !133, !135, !136, !137, !138, !139, !143, !148, !152, !155, !156, !157, !158, !159, !163, !164, !165, !166, !167, !168, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !130, file: !129, line: 96, baseType: !12, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !130, file: !129, line: 97, baseType: !134, size: 32, offset: 32)
!134 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !130, file: !129, line: 98, baseType: !134, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !130, file: !129, line: 99, baseType: !12, size: 32, offset: 96)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !130, file: !129, line: 100, baseType: !12, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !130, file: !129, line: 102, baseType: !12, size: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !130, file: !129, line: 103, baseType: !140, size: 384, offset: 192)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 384, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 12)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !130, file: !129, line: 104, baseType: !144, size: 3072, offset: 576)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 3072, elements: !145)
!145 = !{!146, !147}
!146 = !DISubrange(count: 6)
!147 = !DISubrange(count: 16)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !130, file: !129, line: 105, baseType: !149, size: 12288, offset: 3648)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 12288, elements: !150)
!150 = !{!146, !151}
!151 = !DISubrange(count: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !130, file: !129, line: 106, baseType: !153, size: 192, offset: 15936)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 192, elements: !154)
!154 = !{!146}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !130, file: !129, line: 107, baseType: !153, size: 192, offset: 16128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !130, file: !129, line: 110, baseType: !12, size: 32, offset: 16320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !130, file: !129, line: 111, baseType: !134, size: 32, offset: 16352)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !130, file: !129, line: 112, baseType: !134, size: 32, offset: 16384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !130, file: !129, line: 114, baseType: !160, size: 256, offset: 16416)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 256, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 8)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !130, file: !129, line: 116, baseType: !160, size: 256, offset: 16672)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !130, file: !129, line: 117, baseType: !160, size: 256, offset: 16928)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !130, file: !129, line: 119, baseType: !12, size: 32, offset: 17184)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !130, file: !129, line: 120, baseType: !134, size: 32, offset: 17216)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !130, file: !129, line: 122, baseType: !134, size: 32, offset: 17248)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !130, file: !129, line: 123, baseType: !169, size: 64, offset: 17280)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !171, line: 21, baseType: !172)
!171 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!172 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !130, file: !129, line: 125, baseType: !12, size: 32, offset: 17344)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !130, file: !129, line: 126, baseType: !12, size: 32, offset: 17376)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !130, file: !129, line: 127, baseType: !12, size: 32, offset: 17408)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !130, file: !129, line: 128, baseType: !134, size: 32, offset: 17440)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !130, file: !129, line: 129, baseType: !12, size: 32, offset: 17472)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !130, file: !129, line: 130, baseType: !12, size: 32, offset: 17504)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !130, file: !129, line: 131, baseType: !12, size: 32, offset: 17536)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !130, file: !129, line: 133, baseType: !12, size: 32, offset: 17568)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !130, file: !129, line: 135, baseType: !12, size: 32, offset: 17600)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !130, file: !129, line: 136, baseType: !12, size: 32, offset: 17632)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !130, file: !129, line: 137, baseType: !12, size: 32, offset: 17664)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !16, file: !15, line: 570, baseType: !185, size: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !129, line: 197, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 142, size: 33024, elements: !188)
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !286, !287}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !187, file: !129, line: 144, baseType: !12, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !187, file: !129, line: 146, baseType: !134, size: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !187, file: !129, line: 147, baseType: !12, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !187, file: !129, line: 148, baseType: !12, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !187, file: !129, line: 149, baseType: !12, size: 32, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !187, file: !129, line: 150, baseType: !12, size: 32, offset: 160)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !187, file: !129, line: 152, baseType: !12, size: 32, offset: 192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !187, file: !129, line: 154, baseType: !134, size: 32, offset: 224)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !187, file: !129, line: 155, baseType: !134, size: 32, offset: 256)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !187, file: !129, line: 156, baseType: !134, size: 32, offset: 288)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !187, file: !129, line: 158, baseType: !12, size: 32, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !187, file: !129, line: 159, baseType: !140, size: 384, offset: 352)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !187, file: !129, line: 160, baseType: !144, size: 3072, offset: 736)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !187, file: !129, line: 161, baseType: !149, size: 12288, offset: 3808)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !187, file: !129, line: 162, baseType: !153, size: 192, offset: 16096)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !187, file: !129, line: 163, baseType: !153, size: 192, offset: 16288)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !187, file: !129, line: 165, baseType: !134, size: 32, offset: 16480)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !187, file: !129, line: 166, baseType: !134, size: 32, offset: 16512)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !187, file: !129, line: 167, baseType: !134, size: 32, offset: 16544)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !187, file: !129, line: 168, baseType: !134, size: 32, offset: 16576)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !187, file: !129, line: 170, baseType: !134, size: 32, offset: 16608)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !187, file: !129, line: 172, baseType: !12, size: 32, offset: 16640)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !187, file: !129, line: 173, baseType: !12, size: 32, offset: 16672)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !187, file: !129, line: 174, baseType: !12, size: 32, offset: 16704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !187, file: !129, line: 175, baseType: !134, size: 32, offset: 16736)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !187, file: !129, line: 177, baseType: !215, size: 8192, offset: 16768)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8192, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 256)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !187, file: !129, line: 178, baseType: !134, size: 32, offset: 24960)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !187, file: !129, line: 179, baseType: !12, size: 32, offset: 24992)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !187, file: !129, line: 180, baseType: !134, size: 32, offset: 25024)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !187, file: !129, line: 181, baseType: !134, size: 32, offset: 25056)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !187, file: !129, line: 182, baseType: !12, size: 32, offset: 25088)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !187, file: !129, line: 184, baseType: !12, size: 32, offset: 25120)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !187, file: !129, line: 185, baseType: !12, size: 32, offset: 25152)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !187, file: !129, line: 186, baseType: !12, size: 32, offset: 25184)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !187, file: !129, line: 187, baseType: !134, size: 32, offset: 25216)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !187, file: !129, line: 188, baseType: !134, size: 32, offset: 25248)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !187, file: !129, line: 189, baseType: !134, size: 32, offset: 25280)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !187, file: !129, line: 190, baseType: !134, size: 32, offset: 25312)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !187, file: !129, line: 191, baseType: !12, size: 32, offset: 25344)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !187, file: !129, line: 192, baseType: !232, size: 7584, offset: 25376)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !129, line: 90, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 53, size: 7584, elements: !234)
!234 = !{!235, !236, !237, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !233, file: !129, line: 55, baseType: !12, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !233, file: !129, line: 56, baseType: !134, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !233, file: !129, line: 57, baseType: !238, size: 16, offset: 64)
!238 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !233, file: !129, line: 58, baseType: !238, size: 16, offset: 80)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !233, file: !129, line: 59, baseType: !12, size: 32, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !233, file: !129, line: 60, baseType: !12, size: 32, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !233, file: !129, line: 61, baseType: !12, size: 32, offset: 160)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !233, file: !129, line: 62, baseType: !134, size: 32, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !233, file: !129, line: 63, baseType: !12, size: 32, offset: 224)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !233, file: !129, line: 64, baseType: !12, size: 32, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !233, file: !129, line: 65, baseType: !134, size: 32, offset: 288)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !233, file: !129, line: 66, baseType: !134, size: 32, offset: 320)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !233, file: !129, line: 67, baseType: !134, size: 32, offset: 352)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !233, file: !129, line: 68, baseType: !12, size: 32, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !233, file: !129, line: 69, baseType: !134, size: 32, offset: 416)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !233, file: !129, line: 70, baseType: !134, size: 32, offset: 448)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !233, file: !129, line: 71, baseType: !12, size: 32, offset: 480)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !233, file: !129, line: 72, baseType: !134, size: 32, offset: 512)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !233, file: !129, line: 73, baseType: !134, size: 32, offset: 544)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !233, file: !129, line: 74, baseType: !12, size: 32, offset: 576)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !233, file: !129, line: 75, baseType: !12, size: 32, offset: 608)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !233, file: !129, line: 76, baseType: !258, size: 3296, offset: 640)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !129, line: 50, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 38, size: 3296, elements: !260)
!260 = !{!261, !262, !263, !264, !268, !269, !270, !271, !272, !273}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !259, file: !129, line: 40, baseType: !134, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !259, file: !129, line: 41, baseType: !134, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !259, file: !129, line: 42, baseType: !134, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !259, file: !129, line: 43, baseType: !265, size: 1024, offset: 96)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 1024, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !259, file: !129, line: 44, baseType: !265, size: 1024, offset: 1120)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !259, file: !129, line: 45, baseType: !265, size: 1024, offset: 2144)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !259, file: !129, line: 46, baseType: !134, size: 32, offset: 3168)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !259, file: !129, line: 47, baseType: !134, size: 32, offset: 3200)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !259, file: !129, line: 48, baseType: !134, size: 32, offset: 3232)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !259, file: !129, line: 49, baseType: !134, size: 32, offset: 3264)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !233, file: !129, line: 77, baseType: !12, size: 32, offset: 3936)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !233, file: !129, line: 78, baseType: !258, size: 3296, offset: 3968)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !233, file: !129, line: 80, baseType: !12, size: 32, offset: 7264)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !233, file: !129, line: 81, baseType: !12, size: 32, offset: 7296)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !233, file: !129, line: 82, baseType: !12, size: 32, offset: 7328)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !233, file: !129, line: 83, baseType: !12, size: 32, offset: 7360)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !233, file: !129, line: 84, baseType: !134, size: 32, offset: 7392)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !233, file: !129, line: 85, baseType: !134, size: 32, offset: 7424)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !233, file: !129, line: 86, baseType: !134, size: 32, offset: 7456)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !233, file: !129, line: 87, baseType: !134, size: 32, offset: 7488)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !233, file: !129, line: 88, baseType: !134, size: 32, offset: 7520)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !233, file: !129, line: 89, baseType: !134, size: 32, offset: 7552)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !187, file: !129, line: 193, baseType: !134, size: 32, offset: 32960)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !187, file: !129, line: 195, baseType: !12, size: 32, offset: 32992)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !16, file: !15, line: 571, baseType: !289, size: 1056768, offset: 192)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 1056768, elements: !266)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !16, file: !15, line: 572, baseType: !291, size: 4538368, offset: 1056960)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 4538368, elements: !216)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !16, file: !15, line: 575, baseType: !293, size: 64, offset: 5595328)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !129, line: 256, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !129, line: 228, size: 37312, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !317, !318, !319, !320}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !295, file: !129, line: 230, baseType: !186, size: 33024)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !295, file: !129, line: 232, baseType: !134, size: 32, offset: 33024)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !295, file: !129, line: 233, baseType: !12, size: 32, offset: 33056)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !295, file: !129, line: 234, baseType: !113, size: 64, offset: 33088)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !295, file: !129, line: 235, baseType: !113, size: 64, offset: 33152)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !295, file: !129, line: 236, baseType: !303, size: 64, offset: 33216)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !295, file: !129, line: 237, baseType: !113, size: 64, offset: 33280)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !295, file: !129, line: 238, baseType: !303, size: 64, offset: 33344)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !295, file: !129, line: 240, baseType: !113, size: 64, offset: 33408)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !295, file: !129, line: 241, baseType: !303, size: 64, offset: 33472)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !295, file: !129, line: 242, baseType: !113, size: 64, offset: 33536)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !295, file: !129, line: 243, baseType: !303, size: 64, offset: 33600)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !295, file: !129, line: 245, baseType: !12, size: 32, offset: 33664)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !295, file: !129, line: 246, baseType: !113, size: 64, offset: 33728)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !295, file: !129, line: 247, baseType: !113, size: 64, offset: 33792)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !295, file: !129, line: 248, baseType: !303, size: 64, offset: 33856)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !295, file: !129, line: 249, baseType: !303, size: 64, offset: 33920)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !295, file: !129, line: 250, baseType: !316, size: 64, offset: 33984)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !295, file: !129, line: 251, baseType: !303, size: 64, offset: 34048)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !295, file: !129, line: 253, baseType: !134, size: 32, offset: 34112)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !295, file: !129, line: 254, baseType: !12, size: 32, offset: 34144)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !295, file: !129, line: 255, baseType: !321, size: 3136, offset: 34176)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !129, line: 226, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !129, line: 200, size: 3136, elements: !323)
!323 = !{!324, !325, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !343, !344, !346, !347, !348, !349}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !322, file: !129, line: 202, baseType: !12, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !322, file: !129, line: 203, baseType: !326, size: 64, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !322, file: !129, line: 204, baseType: !113, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !322, file: !129, line: 205, baseType: !303, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !322, file: !129, line: 206, baseType: !326, size: 64, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !322, file: !129, line: 207, baseType: !113, size: 64, offset: 320)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !322, file: !129, line: 208, baseType: !113, size: 64, offset: 384)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !322, file: !129, line: 209, baseType: !326, size: 64, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !322, file: !129, line: 210, baseType: !326, size: 64, offset: 512)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !322, file: !129, line: 211, baseType: !326, size: 64, offset: 576)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !322, file: !129, line: 212, baseType: !326, size: 64, offset: 640)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !322, file: !129, line: 213, baseType: !326, size: 64, offset: 704)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !322, file: !129, line: 216, baseType: !327, size: 8, offset: 768)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !322, file: !129, line: 217, baseType: !327, size: 8, offset: 776)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !322, file: !129, line: 218, baseType: !327, size: 8, offset: 784)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !322, file: !129, line: 219, baseType: !342, size: 1024, offset: 800)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 1024, elements: !266)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !322, file: !129, line: 220, baseType: !342, size: 1024, offset: 1824)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !322, file: !129, line: 221, baseType: !345, size: 256, offset: 2848)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 256, elements: !266)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !322, file: !129, line: 222, baseType: !327, size: 8, offset: 3104)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !322, file: !129, line: 223, baseType: !327, size: 8, offset: 3112)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !322, file: !129, line: 224, baseType: !327, size: 8, offset: 3120)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !322, file: !129, line: 225, baseType: !327, size: 8, offset: 3128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !16, file: !15, line: 577, baseType: !351, size: 1193984, offset: 5595392)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 1193984, elements: !266)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !16, file: !15, line: 578, baseType: !12, size: 32, offset: 6789376)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !16, file: !15, line: 579, baseType: !12, size: 32, offset: 6789408)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !16, file: !15, line: 580, baseType: !12, size: 32, offset: 6789440)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !16, file: !15, line: 581, baseType: !12, size: 32, offset: 6789472)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !16, file: !15, line: 584, baseType: !357, size: 64, offset: 6789504)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 64)
!358 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !15, line: 584, flags: DIFlagFwdDecl)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !16, file: !15, line: 586, baseType: !360, size: 64, offset: 6789568)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !15, line: 902, size: 416, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !372, !373, !374, !375, !376, !377, !378}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !361, file: !15, line: 904, baseType: !134, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !361, file: !15, line: 905, baseType: !134, size: 32, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !361, file: !15, line: 906, baseType: !12, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !361, file: !15, line: 907, baseType: !134, size: 32, offset: 96)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !361, file: !15, line: 908, baseType: !12, size: 32, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !361, file: !15, line: 909, baseType: !369, size: 64, offset: 160)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 2)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !361, file: !15, line: 910, baseType: !170, size: 8, offset: 224)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !361, file: !15, line: 911, baseType: !170, size: 8, offset: 232)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !361, file: !15, line: 912, baseType: !12, size: 32, offset: 256)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !361, file: !15, line: 913, baseType: !12, size: 32, offset: 288)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !361, file: !15, line: 915, baseType: !12, size: 32, offset: 320)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !361, file: !15, line: 916, baseType: !12, size: 32, offset: 352)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !361, file: !15, line: 917, baseType: !12, size: 32, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !16, file: !15, line: 587, baseType: !380, size: 64, offset: 6789632)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !15, line: 839, size: 512, elements: !382)
!382 = !{!383, !384, !387, !388, !389, !390}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !381, file: !15, line: 841, baseType: !12, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !381, file: !15, line: 842, baseType: !385, size: 96, offset: 32)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 96, elements: !60)
!386 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !381, file: !15, line: 843, baseType: !385, size: 96, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !381, file: !15, line: 844, baseType: !385, size: 96, offset: 224)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !381, file: !15, line: 845, baseType: !385, size: 96, offset: 320)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !381, file: !15, line: 846, baseType: !385, size: 96, offset: 416)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !16, file: !15, line: 588, baseType: !12, size: 32, offset: 6789696)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !16, file: !15, line: 591, baseType: !134, size: 32, offset: 6789728)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !16, file: !15, line: 592, baseType: !12, size: 32, offset: 6789760)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !16, file: !15, line: 593, baseType: !12, size: 32, offset: 6789792)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !16, file: !15, line: 594, baseType: !12, size: 32, offset: 6789824)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !16, file: !15, line: 595, baseType: !397, size: 64, offset: 6789888)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !15, line: 542, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !15, line: 341, size: 109184, elements: !401)
!401 = !{!402, !404, !405, !406, !407, !408, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !636, !638, !809, !838, !865, !868, !869, !871, !872, !873, !874, !875, !876, !877, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !904, !905, !906, !907, !908, !909, !912, !913, !916, !917, !919, !922, !923, !924, !925, !926, !927, !928, !929, !930, !932, !933, !934, !935, !936, !939, !940, !941, !945, !949, !953, !957, !961, !962, !963, !964, !968, !969, !970, !971, !972, !973, !974, !975, !976, !978, !979}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !400, file: !15, line: 343, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !400, file: !15, line: 344, baseType: !19, size: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !400, file: !15, line: 345, baseType: !127, size: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !400, file: !15, line: 346, baseType: !185, size: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "svc_extension_flag", scope: !400, file: !15, line: 347, baseType: !12, size: 32, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !400, file: !15, line: 350, baseType: !409, size: 64, offset: 320)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !411, line: 186, size: 33408, elements: !412)
!411 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!412 = !{!413, !414, !417, !570, !571, !572, !573, !574, !575, !576, !577, !578, !582, !583, !584}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !410, file: !411, line: 188, baseType: !13, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !410, file: !411, line: 189, baseType: !415, size: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !15, line: 900, baseType: !20)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !410, file: !411, line: 190, baseType: !418, size: 64, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !411, line: 182, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !411, line: 152, size: 768, elements: !422)
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !565, !566, !567, !568, !569}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !421, file: !411, line: 154, baseType: !12, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !421, file: !411, line: 155, baseType: !12, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !421, file: !411, line: 156, baseType: !12, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !421, file: !411, line: 157, baseType: !12, size: 32, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !421, file: !411, line: 159, baseType: !12, size: 32, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !421, file: !411, line: 161, baseType: !134, size: 32, offset: 160)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !421, file: !411, line: 162, baseType: !134, size: 32, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !421, file: !411, line: 164, baseType: !12, size: 32, offset: 224)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !421, file: !411, line: 165, baseType: !12, size: 32, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !421, file: !411, line: 166, baseType: !12, size: 32, offset: 288)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !421, file: !411, line: 167, baseType: !12, size: 32, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !421, file: !411, line: 170, baseType: !12, size: 32, offset: 352)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !421, file: !411, line: 172, baseType: !436, size: 64, offset: 384)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !411, line: 138, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !411, line: 46, size: 3328, elements: !439)
!439 = !{!440, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !485, !487, !488, !505, !507, !511, !513, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !438, file: !411, line: 48, baseType: !441, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !442, line: 140, baseType: !443)
!442 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!443 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !442, line: 135, baseType: !134, size: 32, elements: !444)
!444 = !{!445, !446, !447}
!445 = !DIEnumerator(name: "FRAME", value: 0)
!446 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!447 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !438, file: !411, line: 50, baseType: !12, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !438, file: !411, line: 51, baseType: !12, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !438, file: !411, line: 52, baseType: !12, size: 32, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !438, file: !411, line: 53, baseType: !12, size: 32, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !438, file: !411, line: 54, baseType: !134, size: 32, offset: 160)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !438, file: !411, line: 55, baseType: !134, size: 32, offset: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !438, file: !411, line: 57, baseType: !12, size: 32, offset: 224)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !438, file: !411, line: 58, baseType: !12, size: 32, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !438, file: !411, line: 59, baseType: !12, size: 32, offset: 288)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !438, file: !411, line: 61, baseType: !170, size: 8, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !438, file: !411, line: 62, baseType: !12, size: 32, offset: 352)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !438, file: !411, line: 63, baseType: !12, size: 32, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !438, file: !411, line: 64, baseType: !12, size: 32, offset: 416)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !438, file: !411, line: 65, baseType: !12, size: 32, offset: 448)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !438, file: !411, line: 67, baseType: !463, size: 16, offset: 480)
!463 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !438, file: !411, line: 69, baseType: !12, size: 32, offset: 512)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !438, file: !411, line: 69, baseType: !12, size: 32, offset: 544)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !438, file: !411, line: 69, baseType: !12, size: 32, offset: 576)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !438, file: !411, line: 69, baseType: !12, size: 32, offset: 608)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !438, file: !411, line: 70, baseType: !12, size: 32, offset: 640)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !438, file: !411, line: 70, baseType: !12, size: 32, offset: 672)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !438, file: !411, line: 70, baseType: !12, size: 32, offset: 704)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !438, file: !411, line: 70, baseType: !12, size: 32, offset: 736)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !438, file: !411, line: 71, baseType: !12, size: 32, offset: 768)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !438, file: !411, line: 72, baseType: !12, size: 32, offset: 800)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !438, file: !411, line: 73, baseType: !134, size: 32, offset: 832)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !438, file: !411, line: 74, baseType: !134, size: 32, offset: 864)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !438, file: !411, line: 75, baseType: !12, size: 32, offset: 896)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !438, file: !411, line: 75, baseType: !12, size: 32, offset: 928)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !438, file: !411, line: 76, baseType: !12, size: 32, offset: 960)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !438, file: !411, line: 76, baseType: !12, size: 32, offset: 992)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !438, file: !411, line: 79, baseType: !481, size: 64, offset: 1024)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !171, line: 41, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !171, line: 23, baseType: !238)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !438, file: !411, line: 80, baseType: !486, size: 64, offset: 1088)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !438, file: !411, line: 81, baseType: !486, size: 64, offset: 1152)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !438, file: !411, line: 84, baseType: !489, size: 64, offset: 1216)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !411, line: 36, size: 256, elements: !492)
!492 = !{!493, !496, !503}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !491, file: !411, line: 38, baseType: !494, size: 128)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 128, elements: !370)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !491, file: !411, line: 39, baseType: !497, size: 64, offset: 128)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 64, elements: !370)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !15, line: 104, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 100, size: 32, elements: !500)
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !499, file: !15, line: 102, baseType: !463, size: 16)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !499, file: !15, line: 103, baseType: !463, size: 16, offset: 16)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !491, file: !411, line: 40, baseType: !504, size: 16, offset: 192)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 16, elements: !370)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !438, file: !411, line: 85, baseType: !506, size: 192, offset: 1280)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 192, elements: !60)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !438, file: !411, line: 87, baseType: !508, size: 64, offset: 1472)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !411, line: 29, size: 64, elements: !509)
!509 = !{!510}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !508, file: !411, line: 31, baseType: !169, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !438, file: !411, line: 88, baseType: !512, size: 192, offset: 1536)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 192, elements: !60)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !438, file: !411, line: 90, baseType: !514, size: 64, offset: 1728)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !438, file: !411, line: 92, baseType: !495, size: 64, offset: 1792)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !438, file: !411, line: 93, baseType: !495, size: 64, offset: 1856)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !438, file: !411, line: 94, baseType: !495, size: 64, offset: 1920)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !438, file: !411, line: 96, baseType: !12, size: 32, offset: 1984)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !438, file: !411, line: 97, baseType: !12, size: 32, offset: 2016)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !438, file: !411, line: 98, baseType: !12, size: 32, offset: 2048)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !438, file: !411, line: 99, baseType: !12, size: 32, offset: 2080)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !438, file: !411, line: 100, baseType: !12, size: 32, offset: 2112)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !438, file: !411, line: 102, baseType: !12, size: 32, offset: 2144)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !438, file: !411, line: 103, baseType: !12, size: 32, offset: 2176)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !438, file: !411, line: 104, baseType: !12, size: 32, offset: 2208)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !438, file: !411, line: 105, baseType: !12, size: 32, offset: 2240)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !438, file: !411, line: 106, baseType: !12, size: 32, offset: 2272)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !438, file: !411, line: 107, baseType: !12, size: 32, offset: 2304)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !438, file: !411, line: 108, baseType: !12, size: 32, offset: 2336)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !438, file: !411, line: 109, baseType: !12, size: 32, offset: 2368)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !438, file: !411, line: 110, baseType: !369, size: 64, offset: 2400)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !438, file: !411, line: 111, baseType: !12, size: 32, offset: 2464)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !438, file: !411, line: 112, baseType: !535, size: 64, offset: 2496)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !15, line: 194, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !15, line: 186, size: 256, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !537, file: !15, line: 188, baseType: !12, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !537, file: !15, line: 189, baseType: !12, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !537, file: !15, line: 190, baseType: !12, size: 32, offset: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !537, file: !15, line: 191, baseType: !12, size: 32, offset: 96)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !537, file: !15, line: 192, baseType: !12, size: 32, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !537, file: !15, line: 193, baseType: !545, size: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !438, file: !411, line: 115, baseType: !12, size: 32, offset: 2560)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !438, file: !411, line: 118, baseType: !12, size: 32, offset: 2592)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !438, file: !411, line: 119, baseType: !12, size: 32, offset: 2624)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !438, file: !411, line: 120, baseType: !12, size: 32, offset: 2656)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !438, file: !411, line: 121, baseType: !482, size: 64, offset: 2688)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !438, file: !411, line: 124, baseType: !12, size: 32, offset: 2752)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !438, file: !411, line: 125, baseType: !12, size: 32, offset: 2784)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !438, file: !411, line: 126, baseType: !12, size: 32, offset: 2816)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !438, file: !411, line: 128, baseType: !12, size: 32, offset: 2848)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !438, file: !411, line: 129, baseType: !12, size: 32, offset: 2880)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !438, file: !411, line: 130, baseType: !12, size: 32, offset: 2912)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !438, file: !411, line: 131, baseType: !12, size: 32, offset: 2944)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !438, file: !411, line: 132, baseType: !481, size: 64, offset: 3008)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !438, file: !411, line: 133, baseType: !12, size: 32, offset: 3072)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !438, file: !411, line: 134, baseType: !12, size: 32, offset: 3104)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !438, file: !411, line: 136, baseType: !504, size: 16, offset: 3136)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !438, file: !411, line: 137, baseType: !563, size: 128, offset: 3200)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 128, elements: !370)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !421, file: !411, line: 173, baseType: !436, size: 64, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !421, file: !411, line: 174, baseType: !436, size: 64, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !421, file: !411, line: 177, baseType: !12, size: 32, offset: 576)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !421, file: !411, line: 178, baseType: !369, size: 64, offset: 608)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !421, file: !411, line: 179, baseType: !369, size: 64, offset: 672)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ref", scope: !410, file: !411, line: 191, baseType: !418, size: 64, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ltref", scope: !410, file: !411, line: 192, baseType: !418, size: 64, offset: 256)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !410, file: !411, line: 193, baseType: !134, size: 32, offset: 320)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !410, file: !411, line: 194, baseType: !134, size: 32, offset: 352)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frames_in_buffer", scope: !410, file: !411, line: 195, baseType: !134, size: 32, offset: 384)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ltref_frames_in_buffer", scope: !410, file: !411, line: 196, baseType: !134, size: 32, offset: 416)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_poc", scope: !410, file: !411, line: 197, baseType: !12, size: 32, offset: 448)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_view_id", scope: !410, file: !411, line: 199, baseType: !12, size: 32, offset: 480)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_pic_idx", scope: !410, file: !411, line: 200, baseType: !579, size: 32768, offset: 512)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 32768, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 1024)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "init_done", scope: !410, file: !411, line: 205, baseType: !12, size: 32, offset: 33280)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !410, file: !411, line: 206, baseType: !12, size: 32, offset: 33312)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "last_picture", scope: !410, file: !411, line: 208, baseType: !419, size: 64, offset: 33344)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !400, file: !15, line: 353, baseType: !12, size: 32, offset: 384)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !400, file: !15, line: 354, baseType: !12, size: 32, offset: 416)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !400, file: !15, line: 355, baseType: !12, size: 32, offset: 448)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "Transform8x8Mode", scope: !400, file: !15, line: 356, baseType: !12, size: 32, offset: 480)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "is_not_independent", scope: !400, file: !15, line: 357, baseType: !12, size: 32, offset: 512)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "toppoc", scope: !400, file: !15, line: 359, baseType: !12, size: 32, offset: 544)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "bottompoc", scope: !400, file: !15, line: 360, baseType: !12, size: 32, offset: 576)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "framepoc", scope: !400, file: !15, line: 361, baseType: !12, size: 32, offset: 608)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !400, file: !15, line: 365, baseType: !134, size: 32, offset: 640)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !400, file: !15, line: 366, baseType: !12, size: 32, offset: 672)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !400, file: !15, line: 368, baseType: !369, size: 64, offset: 704)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntMsb", scope: !400, file: !15, line: 372, baseType: !12, size: 32, offset: 768)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "AbsFrameNum", scope: !400, file: !15, line: 378, baseType: !134, size: 32, offset: 800)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !400, file: !15, line: 379, baseType: !12, size: 32, offset: 832)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "current_mb_nr", scope: !400, file: !15, line: 387, baseType: !134, size: 32, offset: 864)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !400, file: !15, line: 388, baseType: !134, size: 32, offset: 896)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "current_slice_nr", scope: !400, file: !15, line: 389, baseType: !463, size: 16, offset: 928)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "cod_counter", scope: !400, file: !15, line: 396, baseType: !12, size: 32, offset: 960)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "allrefzero", scope: !400, file: !15, line: 397, baseType: !12, size: 32, offset: 992)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !400, file: !15, line: 400, baseType: !12, size: 32, offset: 1024)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !400, file: !15, line: 401, baseType: !12, size: 32, offset: 1056)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_active", scope: !400, file: !15, line: 402, baseType: !369, size: 64, offset: 1088)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !400, file: !15, line: 406, baseType: !12, size: 32, offset: 1152)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !400, file: !15, line: 407, baseType: !12, size: 32, offset: 1184)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !400, file: !15, line: 408, baseType: !12, size: 32, offset: 1216)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "qs", scope: !400, file: !15, line: 409, baseType: !12, size: 32, offset: 1248)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qs_delta", scope: !400, file: !15, line: 410, baseType: !12, size: 32, offset: 1280)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !400, file: !15, line: 411, baseType: !12, size: 32, offset: 1312)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "model_number", scope: !400, file: !15, line: 412, baseType: !12, size: 32, offset: 1344)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !400, file: !15, line: 413, baseType: !134, size: 32, offset: 1376)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !400, file: !15, line: 414, baseType: !134, size: 32, offset: 1408)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !400, file: !15, line: 415, baseType: !170, size: 8, offset: 1440)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !400, file: !15, line: 416, baseType: !441, size: 32, offset: 1472)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !400, file: !15, line: 417, baseType: !12, size: 32, offset: 1504)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "end_mb_nr_plus1", scope: !400, file: !15, line: 418, baseType: !12, size: 32, offset: 1536)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !400, file: !15, line: 419, baseType: !12, size: 32, offset: 1568)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dp_mode", scope: !400, file: !15, line: 420, baseType: !12, size: 32, offset: 1600)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "current_header", scope: !400, file: !15, line: 421, baseType: !12, size: 32, offset: 1632)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "next_header", scope: !400, file: !15, line: 422, baseType: !12, size: 32, offset: 1664)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "last_dquant", scope: !400, file: !15, line: 423, baseType: !12, size: 32, offset: 1696)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "colour_plane_id", scope: !400, file: !15, line: 426, baseType: !12, size: 32, offset: 1728)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !400, file: !15, line: 427, baseType: !12, size: 32, offset: 1760)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "sp_switch", scope: !400, file: !15, line: 428, baseType: !12, size: 32, offset: 1792)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !400, file: !15, line: 429, baseType: !12, size: 32, offset: 1824)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_slice_ref_idx", scope: !400, file: !15, line: 430, baseType: !12, size: 32, offset: 1856)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !400, file: !15, line: 431, baseType: !12, size: 32, offset: 1888)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !400, file: !15, line: 432, baseType: !12, size: 32, offset: 1920)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !400, file: !15, line: 433, baseType: !12, size: 32, offset: 1952)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !400, file: !15, line: 434, baseType: !535, size: 64, offset: 1984)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !400, file: !15, line: 436, baseType: !635, size: 48, offset: 2048)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 48, elements: !154)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !400, file: !15, line: 437, baseType: !637, size: 384, offset: 2112)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 384, elements: !154)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !400, file: !15, line: 440, baseType: !639, size: 64, offset: 2496)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !15, line: 324, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !15, line: 314, size: 384, elements: !642)
!642 = !{!643, !654, !663}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !641, file: !15, line: 317, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !15, line: 47, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream", file: !15, line: 300, size: 256, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "read_len", scope: !646, file: !15, line: 303, baseType: !12, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !646, file: !15, line: 304, baseType: !12, size: 32, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bitoffset", scope: !646, file: !15, line: 306, baseType: !12, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_length", scope: !646, file: !15, line: 307, baseType: !12, size: 32, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !646, file: !15, line: 309, baseType: !169, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !646, file: !15, line: 310, baseType: !12, size: 32, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "de_cabac", scope: !641, file: !15, line: 318, baseType: !655, size: 256, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !15, line: 95, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 88, size: 256, elements: !657)
!657 = !{!658, !659, !660, !661, !662}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !656, file: !15, line: 90, baseType: !134, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !656, file: !15, line: 91, baseType: !134, size: 32, offset: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !656, file: !15, line: 92, baseType: !12, size: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !656, file: !15, line: 93, baseType: !169, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !656, file: !15, line: 94, baseType: !113, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "readSyntaxElement", scope: !641, file: !15, line: 320, baseType: !664, size: 64, offset: 320)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!12, !667, !807, !805}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !15, line: 273, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !15, line: 197, size: 3840, elements: !670)
!670 = !{!671, !673, !674, !675, !676, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !705, !706, !707, !708, !709, !713, !714, !723, !724, !725, !726, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !760, !761, !776, !782, !806}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !669, file: !15, line: 199, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !669, file: !15, line: 200, baseType: !403, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !669, file: !15, line: 201, baseType: !19, size: 64, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrX", scope: !669, file: !15, line: 202, baseType: !12, size: 32, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !669, file: !15, line: 203, baseType: !677, size: 32, offset: 224)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockPos", file: !15, line: 112, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 108, size: 32, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !678, file: !15, line: 110, baseType: !463, size: 16)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !678, file: !15, line: 111, baseType: !463, size: 16, offset: 16)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !669, file: !15, line: 204, baseType: !12, size: 32, offset: 256)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !669, file: !15, line: 205, baseType: !12, size: 32, offset: 288)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "block_y_aff", scope: !669, file: !15, line: 206, baseType: !12, size: 32, offset: 320)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !669, file: !15, line: 207, baseType: !12, size: 32, offset: 352)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !669, file: !15, line: 208, baseType: !12, size: 32, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !669, file: !15, line: 209, baseType: !12, size: 32, offset: 416)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !669, file: !15, line: 210, baseType: !12, size: 32, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !669, file: !15, line: 212, baseType: !12, size: 32, offset: 480)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !669, file: !15, line: 213, baseType: !12, size: 32, offset: 512)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !669, file: !15, line: 215, baseType: !12, size: 32, offset: 544)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "qpc", scope: !669, file: !15, line: 216, baseType: !369, size: 64, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "qp_scaled", scope: !669, file: !15, line: 217, baseType: !59, size: 96, offset: 640)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "is_lossless", scope: !669, file: !15, line: 218, baseType: !12, size: 32, offset: 736)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !669, file: !15, line: 219, baseType: !12, size: 32, offset: 768)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !669, file: !15, line: 220, baseType: !12, size: 32, offset: 800)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !669, file: !15, line: 221, baseType: !12, size: 32, offset: 832)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !669, file: !15, line: 223, baseType: !463, size: 16, offset: 864)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !669, file: !15, line: 224, baseType: !327, size: 8, offset: 880)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "dpl_flag", scope: !669, file: !15, line: 225, baseType: !327, size: 8, offset: 888)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "delta_quant", scope: !669, file: !15, line: 226, baseType: !463, size: 16, offset: 896)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "list_offset", scope: !669, file: !15, line: 227, baseType: !463, size: 16, offset: 912)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mb_up", scope: !669, file: !15, line: 229, baseType: !704, size: 64, offset: 960)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "mb_left", scope: !669, file: !15, line: 230, baseType: !704, size: 64, offset: 1024)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "mbup", scope: !669, file: !15, line: 232, baseType: !704, size: 64, offset: 1088)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mbleft", scope: !669, file: !15, line: 233, baseType: !704, size: 64, offset: 1152)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !669, file: !15, line: 236, baseType: !463, size: 16, offset: 1216)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !669, file: !15, line: 237, baseType: !710, size: 1024, offset: 1232)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 1024, elements: !711)
!711 = !{!371, !712, !712, !371}
!712 = !DISubrange(count: 4)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !669, file: !15, line: 239, baseType: !12, size: 32, offset: 2272)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !669, file: !15, line: 240, baseType: !715, size: 192, offset: 2304)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 192, elements: !60)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !717, line: 103, baseType: !718)
!717 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !719, line: 27, baseType: !720)
!719 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !721, line: 44, baseType: !722)
!721 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!722 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !669, file: !15, line: 241, baseType: !715, size: 192, offset: 2496)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits_8x8", scope: !669, file: !15, line: 242, baseType: !715, size: 192, offset: 2688)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i16mode", scope: !669, file: !15, line: 244, baseType: !12, size: 32, offset: 2880)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !669, file: !15, line: 245, baseType: !727, size: 32, offset: 2912)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 32, elements: !728)
!728 = !{!712}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !669, file: !15, line: 246, baseType: !727, size: 32, offset: 2944)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "ipmode_DPCM", scope: !669, file: !15, line: 247, baseType: !327, size: 8, offset: 2976)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !669, file: !15, line: 248, baseType: !327, size: 8, offset: 2984)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !669, file: !15, line: 249, baseType: !327, size: 8, offset: 2992)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "DFDisableIdc", scope: !669, file: !15, line: 250, baseType: !463, size: 16, offset: 3008)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "DFAlphaC0Offset", scope: !669, file: !15, line: 251, baseType: !463, size: 16, offset: 3024)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "DFBetaOffset", scope: !669, file: !15, line: 252, baseType: !463, size: 16, offset: 3040)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !669, file: !15, line: 254, baseType: !12, size: 32, offset: 3072)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !669, file: !15, line: 256, baseType: !12, size: 32, offset: 3104)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !669, file: !15, line: 256, baseType: !12, size: 32, offset: 3136)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !669, file: !15, line: 256, baseType: !12, size: 32, offset: 3168)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !669, file: !15, line: 256, baseType: !12, size: 32, offset: 3200)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !669, file: !15, line: 257, baseType: !12, size: 32, offset: 3232)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !669, file: !15, line: 257, baseType: !12, size: 32, offset: 3264)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !669, file: !15, line: 257, baseType: !12, size: 32, offset: 3296)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !669, file: !15, line: 257, baseType: !12, size: 32, offset: 3328)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !669, file: !15, line: 259, baseType: !12, size: 32, offset: 3360)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !669, file: !15, line: 260, baseType: !12, size: 32, offset: 3392)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_4x4", scope: !669, file: !15, line: 262, baseType: !748, size: 64, offset: 3456)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !704, !751, !12, !12}
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorPlane", file: !442, line: 32, baseType: !752)
!752 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !442, line: 22, baseType: !134, size: 32, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759}
!754 = !DIEnumerator(name: "PLANE_Y", value: 0)
!755 = !DIEnumerator(name: "PLANE_U", value: 1)
!756 = !DIEnumerator(name: "PLANE_V", value: 2)
!757 = !DIEnumerator(name: "PLANE_G", value: 0)
!758 = !DIEnumerator(name: "PLANE_B", value: 1)
!759 = !DIEnumerator(name: "PLANE_R", value: 2)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_8x8", scope: !669, file: !15, line: 263, baseType: !748, size: 64, offset: 3520)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "GetMVPredictor", scope: !669, file: !15, line: 265, baseType: !762, size: 64, offset: 3584)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !704, !765, !775, !463, !489, !12, !12, !12, !12, !12}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !15, line: 85, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !15, line: 77, size: 128, elements: !768)
!768 = !{!769, !770, !771, !772, !773, !774}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !767, file: !15, line: 79, baseType: !12, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !767, file: !15, line: 80, baseType: !12, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !767, file: !15, line: 81, baseType: !463, size: 16, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !767, file: !15, line: 82, baseType: !463, size: 16, offset: 80)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !767, file: !15, line: 83, baseType: !463, size: 16, offset: 96)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !767, file: !15, line: 84, baseType: !463, size: 16, offset: 112)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "read_and_store_CBP_block_bit", scope: !669, file: !15, line: 268, baseType: !777, size: 64, offset: 3648)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DISubroutineType(types: !779)
!779 = !{!12, !704, !780, !12}
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironmentPtr", file: !15, line: 97, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "readRefPictureIdx", scope: !669, file: !15, line: 269, baseType: !783, size: 64, offset: 3712)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = !DISubroutineType(types: !785)
!785 = !{!327, !704, !786, !805, !327, !12}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !15, line: 276, size: 384, elements: !788)
!788 = !{!789, !790, !791, !792, !793, !794, !795, !796, !797, !801}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !787, file: !15, line: 278, baseType: !12, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !787, file: !15, line: 279, baseType: !12, size: 32, offset: 32)
