; ModuleID = 'ldecod_src/sei.c'
source_filename = "ldecod_src/sei.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.seq_parameter_set_rbsp_t = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [12 x i32], [6 x [16 x i32]], [6 x [64 x i32]], [6 x i32], [6 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, [256 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.vui_seq_parameters_t, i32, i32 }
%struct.vui_seq_parameters_t = type { i32, i32, i16, i16, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.hrd_parameters_t, i32, %struct.hrd_parameters_t, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.hrd_parameters_t = type { i32, i32, i32, [32 x i32], [32 x i32], [32 x i32], i32, i32, i32, i32 }
%struct.tone_mapping_struct_tmp = type { i32, i8, i32, i8, i8, i32, i32, i32, i32, i32, [4096 x i32], i32, [4096 x i32], [4096 x i32] }

@p_Dec = external local_unnamed_addr global ptr, align 8
@.str = private unnamed_addr constant [22 x i8] c"SEI: target_frame_num\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [27 x i8] c"SEI: num_spare_pics_minus1\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [27 x i8] c"SEI: delta_spare_frame_num\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [24 x i8] c"SEI: ref_area_indicator\00", align 1, !dbg !14

!486 = !DIEnumerator(name: "SEI_BASE_LAYER_TEMPORAL_HRD", value: 31)
!487 = !DIEnumerator(name: "SEI_QUALITY_LAYER_INTEGRITY_CHECK", value: 32)
!488 = !DIEnumerator(name: "SEI_REDUNDANT_PIC_PROPERTY", value: 33)
!489 = !DIEnumerator(name: "SEI_TL0_DEP_REP_INDEX", value: 34)
!490 = !DIEnumerator(name: "SEI_TL_SWITCHING_POINT", value: 35)
!491 = !DIEnumerator(name: "SEI_PARALLEL_DECODING_INFO", value: 36)
!492 = !DIEnumerator(name: "SEI_MVC_SCALABLE_NESTING", value: 37)
!493 = !DIEnumerator(name: "SEI_VIEW_SCALABILITY_INFO", value: 38)
!494 = !DIEnumerator(name: "SEI_MULTIVIEW_SCENE_INFO", value: 39)
!495 = !DIEnumerator(name: "SEI_MULTIVIEW_ACQUISITION_INFO", value: 40)
!496 = !DIEnumerator(name: "SEI_NON_REQUIRED_VIEW_COMPONENT", value: 41)
!497 = !DIEnumerator(name: "SEI_VIEW_DEPENDENCY_CHANGE", value: 42)
!498 = !DIEnumerator(name: "SEI_OPERATION_POINTS_NOT_PRESENT", value: 43)
!499 = !DIEnumerator(name: "SEI_BASE_VIEW_TEMPORAL_HRD", value: 44)
!500 = !DIEnumerator(name: "SEI_FRAME_PACKING_ARRANGEMENT", value: 45)
!501 = !DIEnumerator(name: "SEI_MAX_ELEMENTS", value: 46)
!502 = !{!503, !506, !390, !414, !505, !507, !510}
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !504, line: 21, baseType: !505)
!504 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!505 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !504, line: 41, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !504, line: 23, baseType: !509)
!509 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!510 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!511 = !{!0, !7, !12, !14, !19, !21, !26, !31, !36, !41, !43, !45, !50, !55, !57, !59, !61, !63, !65, !67, !69, !71, !73, !78, !80, !85, !87, !89, !94, !99, !101, !106, !108, !113, !118, !120, !122, !124, !126, !128, !130, !135, !137, !142, !147, !149, !151, !153, !155, !157, !162, !164, !169, !174, !179, !181, !183, !185, !190, !192, !194, !196, !198, !200, !202, !204, !206, !211, !216, !221, !223, !228, !230, !232, !234, !236, !241, !243, !248, !250, !252, !254, !256, !258, !260, !265, !267, !272, !274, !276, !278, !280, !282, !284, !286, !288, !290, !295, !297, !299, !301, !306, !311, !313, !315, !317, !319, !321, !323, !325, !327, !329, !331, !333, !335, !337, !342, !347, !349, !351, !353, !355, !357, !359, !364, !366, !368, !370, !372, !374, !376, !378, !380, !382, !384}
!512 = !{i32 7, !"Dwarf Version", i32 5}
!513 = !{i32 2, !"Debug Info Version", i32 3}
!514 = !{i32 1, !"wchar_size", i32 4}
!515 = !{i32 8, !"PIC Level", i32 2}
!516 = !{i32 7, !"PIE Level", i32 2}
!517 = !{i32 7, !"uwtable", i32 2}
!518 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!519 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!520 = distinct !DISubprogram(name: "InterpretSEIMessage", scope: !2, file: !2, line: 66, type: !521, scopeLine: 67, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !386, retainedNodes: !1721)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !523, !390, !524, !876}
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoParameters", file: !526, line: 836, baseType: !527)
!526 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !526, line: 566, size: 6855040, elements: !528)
!528 = !{!529, !613, !665, !766, !768, !770, !828, !830, !831, !832, !833, !834, !837, !857, !869, !870, !871, !872, !873, !874, !1438, !1439, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1449, !1452, !1453, !1455, !1456, !1457, !1458, !1459, !1461, !1462, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1586, !1587, !1589, !1590, !1593, !1596, !1597, !1598, !1600, !1603, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1615, !1618, !1619, !1620, !1621, !1637, !1642, !1646, !1650, !1654, !1655, !1659, !1660, !1664, !1665, !1669, !1690, !1691, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !527, file: !526, line: 568, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !526, line: 850, size: 32128, elements: !532)
!532 = !{!533, !537, !538, !539, !540, !541, !542, !543, !544, !545, !574, !575, !576, !577, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !531, file: !526, line: 852, baseType: !534, size: 2040)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 2040, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 255)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !531, file: !526, line: 853, baseType: !534, size: 2040, offset: 2040)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !531, file: !526, line: 854, baseType: !534, size: 2040, offset: 4080)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !531, file: !526, line: 856, baseType: !390, size: 32, offset: 6144)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !531, file: !526, line: 857, baseType: !390, size: 32, offset: 6176)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !531, file: !526, line: 858, baseType: !390, size: 32, offset: 6208)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !531, file: !526, line: 859, baseType: !390, size: 32, offset: 6240)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !531, file: !526, line: 860, baseType: !390, size: 32, offset: 6272)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !531, file: !526, line: 861, baseType: !390, size: 32, offset: 6304)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !531, file: !526, line: 864, baseType: !546, size: 1088, offset: 6336)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !389, line: 52, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !389, line: 30, size: 1088, elements: !548)
!548 = !{!549, !551, !553, !554, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !547, file: !389, line: 32, baseType: !550, size: 32)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !389, line: 28, baseType: !388)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !547, file: !389, line: 33, baseType: !552, size: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !389, line: 20, baseType: !397)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !547, file: !389, line: 34, baseType: !510, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !547, file: !389, line: 35, baseType: !555, size: 96, offset: 128)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 96, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 3)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !547, file: !389, line: 36, baseType: !555, size: 96, offset: 224)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !547, file: !389, line: 37, baseType: !390, size: 32, offset: 320)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !547, file: !389, line: 38, baseType: !390, size: 32, offset: 352)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !547, file: !389, line: 39, baseType: !390, size: 32, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !547, file: !389, line: 40, baseType: !390, size: 32, offset: 416)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !547, file: !389, line: 41, baseType: !390, size: 32, offset: 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !547, file: !389, line: 42, baseType: !390, size: 32, offset: 480)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !547, file: !389, line: 43, baseType: !390, size: 32, offset: 512)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !547, file: !389, line: 44, baseType: !390, size: 32, offset: 544)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !547, file: !389, line: 45, baseType: !555, size: 96, offset: 576)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !547, file: !389, line: 46, baseType: !390, size: 32, offset: 672)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !547, file: !389, line: 47, baseType: !555, size: 96, offset: 704)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !547, file: !389, line: 48, baseType: !555, size: 96, offset: 800)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !547, file: !389, line: 49, baseType: !555, size: 96, offset: 896)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !547, file: !389, line: 50, baseType: !390, size: 32, offset: 992)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !547, file: !389, line: 51, baseType: !390, size: 32, offset: 1024)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !531, file: !526, line: 865, baseType: !546, size: 1088, offset: 7424)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !531, file: !526, line: 867, baseType: !390, size: 32, offset: 8512)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !531, file: !526, line: 868, baseType: !390, size: 32, offset: 8544)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !531, file: !526, line: 869, baseType: !578, size: 7744, offset: 8576)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !404, line: 60, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !404, line: 34, size: 7744, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !579, file: !404, line: 37, baseType: !534, size: 2040)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !579, file: !404, line: 38, baseType: !534, size: 2040, offset: 2040)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !579, file: !404, line: 39, baseType: !534, size: 2040, offset: 4080)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !579, file: !404, line: 40, baseType: !390, size: 32, offset: 6144)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !579, file: !404, line: 41, baseType: !586, size: 32, offset: 6176)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !404, line: 32, baseType: !403)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !579, file: !404, line: 42, baseType: !546, size: 1088, offset: 6208)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !579, file: !404, line: 43, baseType: !390, size: 32, offset: 7296)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !579, file: !404, line: 44, baseType: !390, size: 32, offset: 7328)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !579, file: !404, line: 45, baseType: !390, size: 32, offset: 7360)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !579, file: !404, line: 46, baseType: !390, size: 32, offset: 7392)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !579, file: !404, line: 47, baseType: !390, size: 32, offset: 7424)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !579, file: !404, line: 48, baseType: !390, size: 32, offset: 7456)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !579, file: !404, line: 49, baseType: !390, size: 32, offset: 7488)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !579, file: !404, line: 50, baseType: !390, size: 32, offset: 7520)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !579, file: !404, line: 51, baseType: !390, size: 32, offset: 7552)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !579, file: !404, line: 52, baseType: !390, size: 32, offset: 7584)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !579, file: !404, line: 53, baseType: !390, size: 32, offset: 7616)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !579, file: !404, line: 56, baseType: !600, size: 64, offset: 7680)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !531, file: !526, line: 870, baseType: !578, size: 7744, offset: 16320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !531, file: !526, line: 871, baseType: !578, size: 7744, offset: 24064)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !531, file: !526, line: 873, baseType: !390, size: 32, offset: 31808)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !531, file: !526, line: 884, baseType: !390, size: 32, offset: 31840)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !531, file: !526, line: 885, baseType: !390, size: 32, offset: 31872)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !531, file: !526, line: 886, baseType: !390, size: 32, offset: 31904)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !531, file: !526, line: 890, baseType: !390, size: 32, offset: 31936)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !531, file: !526, line: 893, baseType: !390, size: 32, offset: 31968)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !531, file: !526, line: 894, baseType: !390, size: 32, offset: 32000)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !531, file: !526, line: 895, baseType: !390, size: 32, offset: 32032)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !531, file: !526, line: 897, baseType: !390, size: 32, offset: 32064)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !531, file: !526, line: 899, baseType: !390, size: 32, offset: 32096)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !527, file: !526, line: 569, baseType: !614, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !616, line: 138, baseType: !617)
!616 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 94, size: 17728, elements: !618)
!618 = !{!619, !620, !621, !622, !623, !624, !625, !629, !633, !637, !640, !641, !642, !643, !644, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !617, file: !616, line: 96, baseType: !390, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !617, file: !616, line: 97, baseType: !414, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !617, file: !616, line: 98, baseType: !414, size: 32, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !617, file: !616, line: 99, baseType: !390, size: 32, offset: 96)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !617, file: !616, line: 100, baseType: !390, size: 32, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !617, file: !616, line: 102, baseType: !390, size: 32, offset: 160)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !617, file: !616, line: 103, baseType: !626, size: 384, offset: 192)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 384, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 12)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !617, file: !616, line: 104, baseType: !630, size: 3072, offset: 576)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 3072, elements: !631)
!631 = !{!632, !40}
!632 = !DISubrange(count: 6)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !617, file: !616, line: 105, baseType: !634, size: 12288, offset: 3648)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 12288, elements: !635)
!635 = !{!632, !636}
!636 = !DISubrange(count: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !617, file: !616, line: 106, baseType: !638, size: 192, offset: 15936)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 192, elements: !639)
!639 = !{!632}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !617, file: !616, line: 107, baseType: !638, size: 192, offset: 16128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !617, file: !616, line: 110, baseType: !390, size: 32, offset: 16320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !617, file: !616, line: 111, baseType: !414, size: 32, offset: 16352)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !617, file: !616, line: 112, baseType: !414, size: 32, offset: 16384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !617, file: !616, line: 114, baseType: !645, size: 256, offset: 16416)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 256, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 8)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !617, file: !616, line: 116, baseType: !645, size: 256, offset: 16672)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !617, file: !616, line: 117, baseType: !645, size: 256, offset: 16928)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !617, file: !616, line: 119, baseType: !390, size: 32, offset: 17184)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !617, file: !616, line: 120, baseType: !414, size: 32, offset: 17216)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !617, file: !616, line: 122, baseType: !414, size: 32, offset: 17248)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !617, file: !616, line: 123, baseType: !523, size: 64, offset: 17280)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !617, file: !616, line: 125, baseType: !390, size: 32, offset: 17344)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !617, file: !616, line: 126, baseType: !390, size: 32, offset: 17376)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !617, file: !616, line: 127, baseType: !390, size: 32, offset: 17408)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !617, file: !616, line: 128, baseType: !414, size: 32, offset: 17440)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !617, file: !616, line: 129, baseType: !390, size: 32, offset: 17472)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !617, file: !616, line: 130, baseType: !390, size: 32, offset: 17504)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !617, file: !616, line: 131, baseType: !390, size: 32, offset: 17536)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !617, file: !616, line: 133, baseType: !390, size: 32, offset: 17568)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !617, file: !616, line: 135, baseType: !390, size: 32, offset: 17600)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !617, file: !616, line: 136, baseType: !390, size: 32, offset: 17632)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !617, file: !616, line: 137, baseType: !390, size: 32, offset: 17664)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !527, file: !526, line: 570, baseType: !666, size: 64, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !616, line: 197, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 142, size: 33024, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !764, !765}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !668, file: !616, line: 144, baseType: !390, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !668, file: !616, line: 146, baseType: !414, size: 32, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !668, file: !616, line: 147, baseType: !390, size: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !668, file: !616, line: 148, baseType: !390, size: 32, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !668, file: !616, line: 149, baseType: !390, size: 32, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !668, file: !616, line: 150, baseType: !390, size: 32, offset: 160)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !668, file: !616, line: 152, baseType: !390, size: 32, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !668, file: !616, line: 154, baseType: !414, size: 32, offset: 224)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !668, file: !616, line: 155, baseType: !414, size: 32, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !668, file: !616, line: 156, baseType: !414, size: 32, offset: 288)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !668, file: !616, line: 158, baseType: !390, size: 32, offset: 320)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !668, file: !616, line: 159, baseType: !626, size: 384, offset: 352)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !668, file: !616, line: 160, baseType: !630, size: 3072, offset: 736)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !668, file: !616, line: 161, baseType: !634, size: 12288, offset: 3808)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !668, file: !616, line: 162, baseType: !638, size: 192, offset: 16096)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !668, file: !616, line: 163, baseType: !638, size: 192, offset: 16288)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !668, file: !616, line: 165, baseType: !414, size: 32, offset: 16480)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !668, file: !616, line: 166, baseType: !414, size: 32, offset: 16512)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !668, file: !616, line: 167, baseType: !414, size: 32, offset: 16544)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !668, file: !616, line: 168, baseType: !414, size: 32, offset: 16576)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !668, file: !616, line: 170, baseType: !414, size: 32, offset: 16608)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !668, file: !616, line: 172, baseType: !390, size: 32, offset: 16640)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !668, file: !616, line: 173, baseType: !390, size: 32, offset: 16672)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !668, file: !616, line: 174, baseType: !390, size: 32, offset: 16704)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !668, file: !616, line: 175, baseType: !414, size: 32, offset: 16736)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !668, file: !616, line: 177, baseType: !696, size: 8192, offset: 16768)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 8192, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 256)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !668, file: !616, line: 178, baseType: !414, size: 32, offset: 24960)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !668, file: !616, line: 179, baseType: !390, size: 32, offset: 24992)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !668, file: !616, line: 180, baseType: !414, size: 32, offset: 25024)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !668, file: !616, line: 181, baseType: !414, size: 32, offset: 25056)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !668, file: !616, line: 182, baseType: !390, size: 32, offset: 25088)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !668, file: !616, line: 184, baseType: !390, size: 32, offset: 25120)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !668, file: !616, line: 185, baseType: !390, size: 32, offset: 25152)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !668, file: !616, line: 186, baseType: !390, size: 32, offset: 25184)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !668, file: !616, line: 187, baseType: !414, size: 32, offset: 25216)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !668, file: !616, line: 188, baseType: !414, size: 32, offset: 25248)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !668, file: !616, line: 189, baseType: !414, size: 32, offset: 25280)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !668, file: !616, line: 190, baseType: !414, size: 32, offset: 25312)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !668, file: !616, line: 191, baseType: !390, size: 32, offset: 25344)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !668, file: !616, line: 192, baseType: !713, size: 7584, offset: 25376)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !616, line: 90, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 53, size: 7584, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !714, file: !616, line: 55, baseType: !390, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !714, file: !616, line: 56, baseType: !414, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !714, file: !616, line: 57, baseType: !509, size: 16, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !714, file: !616, line: 58, baseType: !509, size: 16, offset: 80)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !714, file: !616, line: 59, baseType: !390, size: 32, offset: 96)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !714, file: !616, line: 60, baseType: !390, size: 32, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !714, file: !616, line: 61, baseType: !390, size: 32, offset: 160)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !714, file: !616, line: 62, baseType: !414, size: 32, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !714, file: !616, line: 63, baseType: !390, size: 32, offset: 224)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !714, file: !616, line: 64, baseType: !390, size: 32, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !714, file: !616, line: 65, baseType: !414, size: 32, offset: 288)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !714, file: !616, line: 66, baseType: !414, size: 32, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !714, file: !616, line: 67, baseType: !414, size: 32, offset: 352)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !714, file: !616, line: 68, baseType: !390, size: 32, offset: 384)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !714, file: !616, line: 69, baseType: !414, size: 32, offset: 416)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !714, file: !616, line: 70, baseType: !414, size: 32, offset: 448)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !714, file: !616, line: 71, baseType: !390, size: 32, offset: 480)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !714, file: !616, line: 72, baseType: !414, size: 32, offset: 512)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !714, file: !616, line: 73, baseType: !414, size: 32, offset: 544)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !714, file: !616, line: 74, baseType: !390, size: 32, offset: 576)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !714, file: !616, line: 75, baseType: !390, size: 32, offset: 608)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !714, file: !616, line: 76, baseType: !738, size: 3296, offset: 640)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !616, line: 50, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 38, size: 3296, elements: !740)
!740 = !{!741, !742, !743, !744, !746, !747, !748, !749, !750, !751}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !739, file: !616, line: 40, baseType: !414, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !739, file: !616, line: 41, baseType: !414, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !739, file: !616, line: 42, baseType: !414, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !739, file: !616, line: 43, baseType: !745, size: 1024, offset: 96)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 1024, elements: !104)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !739, file: !616, line: 44, baseType: !745, size: 1024, offset: 1120)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !739, file: !616, line: 45, baseType: !745, size: 1024, offset: 2144)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !739, file: !616, line: 46, baseType: !414, size: 32, offset: 3168)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !739, file: !616, line: 47, baseType: !414, size: 32, offset: 3200)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !739, file: !616, line: 48, baseType: !414, size: 32, offset: 3232)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !739, file: !616, line: 49, baseType: !414, size: 32, offset: 3264)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !714, file: !616, line: 77, baseType: !390, size: 32, offset: 3936)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !714, file: !616, line: 78, baseType: !738, size: 3296, offset: 3968)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !714, file: !616, line: 80, baseType: !390, size: 32, offset: 7264)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !714, file: !616, line: 81, baseType: !390, size: 32, offset: 7296)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !714, file: !616, line: 82, baseType: !390, size: 32, offset: 7328)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !714, file: !616, line: 83, baseType: !390, size: 32, offset: 7360)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !714, file: !616, line: 84, baseType: !414, size: 32, offset: 7392)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !714, file: !616, line: 85, baseType: !414, size: 32, offset: 7424)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !714, file: !616, line: 86, baseType: !414, size: 32, offset: 7456)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !714, file: !616, line: 87, baseType: !414, size: 32, offset: 7488)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !714, file: !616, line: 88, baseType: !414, size: 32, offset: 7520)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !714, file: !616, line: 89, baseType: !414, size: 32, offset: 7552)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !668, file: !616, line: 193, baseType: !414, size: 32, offset: 32960)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !668, file: !616, line: 195, baseType: !390, size: 32, offset: 32992)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !527, file: !526, line: 571, baseType: !767, size: 1056768, offset: 192)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 1056768, elements: !104)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !527, file: !526, line: 572, baseType: !769, size: 4538368, offset: 1056960)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 4538368, elements: !697)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !527, file: !526, line: 575, baseType: !771, size: 64, offset: 5595328)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !616, line: 256, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !616, line: 228, size: 37312, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !795, !796, !797, !798}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !773, file: !616, line: 230, baseType: !667, size: 33024)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !773, file: !616, line: 232, baseType: !414, size: 32, offset: 33024)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !773, file: !616, line: 233, baseType: !390, size: 32, offset: 33056)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !773, file: !616, line: 234, baseType: !600, size: 64, offset: 33088)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !773, file: !616, line: 235, baseType: !600, size: 64, offset: 33152)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !773, file: !616, line: 236, baseType: !781, size: 64, offset: 33216)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !773, file: !616, line: 237, baseType: !600, size: 64, offset: 33280)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !773, file: !616, line: 238, baseType: !781, size: 64, offset: 33344)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !773, file: !616, line: 240, baseType: !600, size: 64, offset: 33408)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !773, file: !616, line: 241, baseType: !781, size: 64, offset: 33472)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !773, file: !616, line: 242, baseType: !600, size: 64, offset: 33536)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !773, file: !616, line: 243, baseType: !781, size: 64, offset: 33600)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !773, file: !616, line: 245, baseType: !390, size: 32, offset: 33664)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !773, file: !616, line: 246, baseType: !600, size: 64, offset: 33728)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !773, file: !616, line: 247, baseType: !600, size: 64, offset: 33792)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !773, file: !616, line: 248, baseType: !781, size: 64, offset: 33856)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !773, file: !616, line: 249, baseType: !781, size: 64, offset: 33920)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !773, file: !616, line: 250, baseType: !794, size: 64, offset: 33984)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !773, file: !616, line: 251, baseType: !781, size: 64, offset: 34048)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !773, file: !616, line: 253, baseType: !414, size: 32, offset: 34112)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !773, file: !616, line: 254, baseType: !390, size: 32, offset: 34144)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !773, file: !616, line: 255, baseType: !799, size: 3136, offset: 34176)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !616, line: 226, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !616, line: 200, size: 3136, elements: !801)
!801 = !{!802, !803, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !821, !822, !824, !825, !826, !827}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !800, file: !616, line: 202, baseType: !390, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !800, file: !616, line: 203, baseType: !804, size: 64, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !800, file: !616, line: 204, baseType: !600, size: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !800, file: !616, line: 205, baseType: !781, size: 64, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !800, file: !616, line: 206, baseType: !804, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !800, file: !616, line: 207, baseType: !600, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !800, file: !616, line: 208, baseType: !600, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !800, file: !616, line: 209, baseType: !804, size: 64, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !800, file: !616, line: 210, baseType: !804, size: 64, offset: 512)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !800, file: !616, line: 211, baseType: !804, size: 64, offset: 576)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !800, file: !616, line: 212, baseType: !804, size: 64, offset: 640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !800, file: !616, line: 213, baseType: !804, size: 64, offset: 704)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !800, file: !616, line: 216, baseType: !805, size: 8, offset: 768)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !800, file: !616, line: 217, baseType: !805, size: 8, offset: 776)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !800, file: !616, line: 218, baseType: !805, size: 8, offset: 784)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !800, file: !616, line: 219, baseType: !820, size: 1024, offset: 800)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 1024, elements: !104)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !800, file: !616, line: 220, baseType: !820, size: 1024, offset: 1824)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !800, file: !616, line: 221, baseType: !823, size: 256, offset: 2848)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !805, size: 256, elements: !104)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !800, file: !616, line: 222, baseType: !805, size: 8, offset: 3104)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !800, file: !616, line: 223, baseType: !805, size: 8, offset: 3112)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !800, file: !616, line: 224, baseType: !805, size: 8, offset: 3120)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !800, file: !616, line: 225, baseType: !805, size: 8, offset: 3128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !527, file: !526, line: 577, baseType: !829, size: 1193984, offset: 5595392)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !772, size: 1193984, elements: !104)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !527, file: !526, line: 578, baseType: !390, size: 32, offset: 6789376)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !527, file: !526, line: 579, baseType: !390, size: 32, offset: 6789408)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !527, file: !526, line: 580, baseType: !390, size: 32, offset: 6789440)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !527, file: !526, line: 581, baseType: !390, size: 32, offset: 6789472)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !527, file: !526, line: 584, baseType: !835, size: 64, offset: 6789504)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !526, line: 584, flags: DIFlagFwdDecl)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !527, file: !526, line: 586, baseType: !838, size: 64, offset: 6789568)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !526, line: 902, size: 416, elements: !840)
!840 = !{!841, !842, !843, !844, !845, !846, !850, !851, !852, !853, !854, !855, !856}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !839, file: !526, line: 904, baseType: !414, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !839, file: !526, line: 905, baseType: !414, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !839, file: !526, line: 906, baseType: !390, size: 32, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !839, file: !526, line: 907, baseType: !414, size: 32, offset: 96)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !839, file: !526, line: 908, baseType: !390, size: 32, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !839, file: !526, line: 909, baseType: !847, size: 64, offset: 160)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 64, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 2)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !839, file: !526, line: 910, baseType: !503, size: 8, offset: 224)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !839, file: !526, line: 911, baseType: !503, size: 8, offset: 232)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !839, file: !526, line: 912, baseType: !390, size: 32, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !839, file: !526, line: 913, baseType: !390, size: 32, offset: 288)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !839, file: !526, line: 915, baseType: !390, size: 32, offset: 320)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !839, file: !526, line: 916, baseType: !390, size: 32, offset: 352)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !839, file: !526, line: 917, baseType: !390, size: 32, offset: 384)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !527, file: !526, line: 587, baseType: !858, size: 64, offset: 6789632)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !526, line: 839, size: 512, elements: !860)
!860 = !{!861, !862, !865, !866, !867, !868}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !859, file: !526, line: 841, baseType: !390, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !859, file: !526, line: 842, baseType: !863, size: 96, offset: 32)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !864, size: 96, elements: !556)
!864 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !859, file: !526, line: 843, baseType: !863, size: 96, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !859, file: !526, line: 844, baseType: !863, size: 96, offset: 224)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !859, file: !526, line: 845, baseType: !863, size: 96, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !859, file: !526, line: 846, baseType: !863, size: 96, offset: 416)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !527, file: !526, line: 588, baseType: !390, size: 32, offset: 6789696)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !527, file: !526, line: 591, baseType: !414, size: 32, offset: 6789728)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !527, file: !526, line: 592, baseType: !390, size: 32, offset: 6789760)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !527, file: !526, line: 593, baseType: !390, size: 32, offset: 6789792)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !527, file: !526, line: 594, baseType: !390, size: 32, offset: 6789824)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !527, file: !526, line: 595, baseType: !875, size: 64, offset: 6789888)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !526, line: 542, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !526, line: 341, size: 109184, elements: !879)
!879 = !{!880, !882, !883, !884, !885, !886, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1106, !1108, !1271, !1300, !1325, !1328, !1329, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1363, !1364, !1365, !1366, !1367, !1368, !1371, !1372, !1375, !1376, !1378, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1391, !1392, !1393, !1394, !1395, !1398, !1399, !1400, !1402, !1406, !1410, !1414, !1418, !1419, !1420, !1421, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1435, !1436}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !878, file: !526, line: 343, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !878, file: !526, line: 344, baseType: !530, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !878, file: !526, line: 345, baseType: !614, size: 64, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !878, file: !526, line: 346, baseType: !666, size: 64, offset: 192)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "svc_extension_flag", scope: !878, file: !526, line: 347, baseType: !390, size: 32, offset: 256)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !878, file: !526, line: 350, baseType: !887, size: 64, offset: 320)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !889, line: 186, size: 33408, elements: !890)
!889 = !DIFile(filename: "ldecod_src/inc/mbuffer.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1ba7faf5f978b0f36a8f480bbf7b3401")
!890 = !{!891, !892, !895, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1052, !1053, !1054}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !888, file: !889, line: 188, baseType: !524, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !888, file: !889, line: 189, baseType: !893, size: 64, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "InputParameters", file: !526, line: 900, baseType: !531)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !888, file: !889, line: 190, baseType: !896, size: 64, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameStore", file: !889, line: 182, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !889, line: 152, size: 768, elements: !900)
!900 = !{!901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !1035, !1036, !1037, !1038, !1039}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !899, file: !889, line: 154, baseType: !390, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "is_reference", scope: !899, file: !889, line: 155, baseType: !390, size: 32, offset: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !899, file: !889, line: 156, baseType: !390, size: 32, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "is_orig_reference", scope: !899, file: !889, line: 157, baseType: !390, size: 32, offset: 96)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "is_non_existent", scope: !899, file: !889, line: 159, baseType: !390, size: 32, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !899, file: !889, line: 161, baseType: !414, size: 32, offset: 160)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !899, file: !889, line: 162, baseType: !414, size: 32, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num_wrap", scope: !899, file: !889, line: 164, baseType: !390, size: 32, offset: 224)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !899, file: !889, line: 165, baseType: !390, size: 32, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !899, file: !889, line: 166, baseType: !390, size: 32, offset: 288)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !899, file: !889, line: 167, baseType: !390, size: 32, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_reference", scope: !899, file: !889, line: 170, baseType: !390, size: 32, offset: 352)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !899, file: !889, line: 172, baseType: !914, size: 64, offset: 384)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "StorablePicture", file: !889, line: 138, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !889, line: 46, size: 3328, elements: !917)
!917 = !{!918, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !955, !957, !958, !975, !977, !981, !983, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !916, file: !889, line: 48, baseType: !919, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !413, line: 140, baseType: !412)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "poc", scope: !916, file: !889, line: 50, baseType: !390, size: 32, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "top_poc", scope: !916, file: !889, line: 51, baseType: !390, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_poc", scope: !916, file: !889, line: 52, baseType: !390, size: 32, offset: 96)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "frame_poc", scope: !916, file: !889, line: 53, baseType: !390, size: 32, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !916, file: !889, line: 54, baseType: !414, size: 32, offset: 160)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame", scope: !916, file: !889, line: 55, baseType: !414, size: 32, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "pic_num", scope: !916, file: !889, line: 57, baseType: !390, size: 32, offset: 224)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !916, file: !889, line: 58, baseType: !390, size: 32, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !916, file: !889, line: 59, baseType: !390, size: 32, offset: 288)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "is_long_term", scope: !916, file: !889, line: 61, baseType: !503, size: 8, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "used_for_reference", scope: !916, file: !889, line: 62, baseType: !390, size: 32, offset: 352)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "is_output", scope: !916, file: !889, line: 63, baseType: !390, size: 32, offset: 384)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "non_existing", scope: !916, file: !889, line: 64, baseType: !390, size: 32, offset: 416)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !916, file: !889, line: 65, baseType: !390, size: 32, offset: 448)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "max_slice_id", scope: !916, file: !889, line: 67, baseType: !935, size: 16, offset: 480)
!935 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "size_x", scope: !916, file: !889, line: 69, baseType: !390, size: 32, offset: 512)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "size_y", scope: !916, file: !889, line: 69, baseType: !390, size: 32, offset: 544)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr", scope: !916, file: !889, line: 69, baseType: !390, size: 32, offset: 576)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr", scope: !916, file: !889, line: 69, baseType: !390, size: 32, offset: 608)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_m1", scope: !916, file: !889, line: 70, baseType: !390, size: 32, offset: 640)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_m1", scope: !916, file: !889, line: 70, baseType: !390, size: 32, offset: 672)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "size_x_cr_m1", scope: !916, file: !889, line: 70, baseType: !390, size: 32, offset: 704)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "size_y_cr_m1", scope: !916, file: !889, line: 70, baseType: !390, size: 32, offset: 736)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !916, file: !889, line: 71, baseType: !390, size: 32, offset: 768)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !916, file: !889, line: 72, baseType: !390, size: 32, offset: 800)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !916, file: !889, line: 73, baseType: !414, size: 32, offset: 832)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !916, file: !889, line: 74, baseType: !414, size: 32, offset: 864)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !916, file: !889, line: 75, baseType: !390, size: 32, offset: 896)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !916, file: !889, line: 75, baseType: !390, size: 32, offset: 928)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !916, file: !889, line: 76, baseType: !390, size: 32, offset: 960)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !916, file: !889, line: 76, baseType: !390, size: 32, offset: 992)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "imgY", scope: !916, file: !889, line: 79, baseType: !953, size: 64, offset: 1024)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV", scope: !916, file: !889, line: 80, baseType: !956, size: 64, offset: 1088)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "img_comp", scope: !916, file: !889, line: 81, baseType: !956, size: 64, offset: 1152)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "mv_info", scope: !916, file: !889, line: 84, baseType: !959, size: 64, offset: 1216)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params", file: !889, line: 36, size: 256, elements: !962)
!962 = !{!963, !966, !973}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic", scope: !961, file: !889, line: 38, baseType: !964, size: 128)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 128, elements: !848)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !961, file: !889, line: 39, baseType: !967, size: 64, offset: 128)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 64, elements: !848)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "MotionVector", file: !526, line: 104, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !526, line: 100, size: 32, elements: !970)
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "mv_x", scope: !969, file: !526, line: 102, baseType: !935, size: 16)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "mv_y", scope: !969, file: !526, line: 103, baseType: !935, size: 16, offset: 16)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idx", scope: !961, file: !889, line: 40, baseType: !974, size: 16, offset: 192)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !805, size: 16, elements: !848)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "JVmv_info", scope: !916, file: !889, line: 85, baseType: !976, size: 192, offset: 1280)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 192, elements: !556)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "motion", scope: !916, file: !889, line: 87, baseType: !978, size: 64, offset: 1472)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pic_motion_params_old", file: !889, line: 29, size: 64, elements: !979)
!979 = !{!980}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !978, file: !889, line: 31, baseType: !523, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "JVmotion", scope: !916, file: !889, line: 88, baseType: !982, size: 192, offset: 1536)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 192, elements: !556)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "slice_id", scope: !916, file: !889, line: 90, baseType: !984, size: 64, offset: 1728)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !916, file: !889, line: 92, baseType: !965, size: 64, offset: 1792)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !916, file: !889, line: 93, baseType: !965, size: 64, offset: 1856)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !916, file: !889, line: 94, baseType: !965, size: 64, offset: 1920)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !916, file: !889, line: 96, baseType: !390, size: 32, offset: 1984)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !916, file: !889, line: 97, baseType: !390, size: 32, offset: 2016)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !916, file: !889, line: 98, baseType: !390, size: 32, offset: 2048)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !916, file: !889, line: 99, baseType: !390, size: 32, offset: 2080)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !916, file: !889, line: 100, baseType: !390, size: 32, offset: 2112)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !916, file: !889, line: 102, baseType: !390, size: 32, offset: 2144)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !916, file: !889, line: 103, baseType: !390, size: 32, offset: 2176)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !916, file: !889, line: 104, baseType: !390, size: 32, offset: 2208)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !916, file: !889, line: 105, baseType: !390, size: 32, offset: 2240)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !916, file: !889, line: 106, baseType: !390, size: 32, offset: 2272)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !916, file: !889, line: 107, baseType: !390, size: 32, offset: 2304)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !916, file: !889, line: 108, baseType: !390, size: 32, offset: 2336)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !916, file: !889, line: 109, baseType: !390, size: 32, offset: 2368)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset", scope: !916, file: !889, line: 110, baseType: !847, size: 64, offset: 2400)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !916, file: !889, line: 111, baseType: !390, size: 32, offset: 2464)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !916, file: !889, line: 112, baseType: !1005, size: 64, offset: 2496)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !526, line: 194, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !526, line: 186, size: 256, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1012, !1013, !1014}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !1007, file: !526, line: 188, baseType: !390, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !1007, file: !526, line: 189, baseType: !390, size: 32, offset: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !1007, file: !526, line: 190, baseType: !390, size: 32, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !1007, file: !526, line: 191, baseType: !390, size: 32, offset: 96)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !1007, file: !526, line: 192, baseType: !390, size: 32, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !1007, file: !526, line: 193, baseType: !1015, size: 64, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "concealed_pic", scope: !916, file: !889, line: 115, baseType: !390, size: 32, offset: 2560)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "seiHasTone_mapping", scope: !916, file: !889, line: 118, baseType: !390, size: 32, offset: 2592)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_model_id", scope: !916, file: !889, line: 119, baseType: !390, size: 32, offset: 2624)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "tonemapped_bit_depth", scope: !916, file: !889, line: 120, baseType: !390, size: 32, offset: 2656)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "tone_mapping_lut", scope: !916, file: !889, line: 121, baseType: !954, size: 64, offset: 2688)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !916, file: !889, line: 124, baseType: !390, size: 32, offset: 2752)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !916, file: !889, line: 125, baseType: !390, size: 32, offset: 2784)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !916, file: !889, line: 126, baseType: !390, size: 32, offset: 2816)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaStride", scope: !916, file: !889, line: 128, baseType: !390, size: 32, offset: 2848)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaStride", scope: !916, file: !889, line: 129, baseType: !390, size: 32, offset: 2880)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaExpandedHeight", scope: !916, file: !889, line: 130, baseType: !390, size: 32, offset: 2912)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaExpandedHeight", scope: !916, file: !889, line: 131, baseType: !390, size: 32, offset: 2944)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "cur_imgY", scope: !916, file: !889, line: 132, baseType: !953, size: 64, offset: 3008)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "no_ref", scope: !916, file: !889, line: 133, baseType: !390, size: 32, offset: 3072)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "iCodingType", scope: !916, file: !889, line: 134, baseType: !390, size: 32, offset: 3104)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !916, file: !889, line: 136, baseType: !974, size: 16, offset: 3136)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !916, file: !889, line: 137, baseType: !1033, size: 128, offset: 3200)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1034, size: 128, elements: !848)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "top_field", scope: !899, file: !889, line: 173, baseType: !914, size: 64, offset: 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field", scope: !899, file: !889, line: 174, baseType: !914, size: 64, offset: 512)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !899, file: !889, line: 177, baseType: !390, size: 32, offset: 576)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !899, file: !889, line: 178, baseType: !847, size: 64, offset: 608)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !899, file: !889, line: 179, baseType: !847, size: 64, offset: 672)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ref", scope: !888, file: !889, line: 191, baseType: !896, size: 64, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "fs_ltref", scope: !888, file: !889, line: 192, baseType: !896, size: 64, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !888, file: !889, line: 193, baseType: !414, size: 32, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "used_size", scope: !888, file: !889, line: 194, baseType: !414, size: 32, offset: 352)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frames_in_buffer", scope: !888, file: !889, line: 195, baseType: !414, size: 32, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ltref_frames_in_buffer", scope: !888, file: !889, line: 196, baseType: !414, size: 32, offset: 416)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_poc", scope: !888, file: !889, line: 197, baseType: !390, size: 32, offset: 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "last_output_view_id", scope: !888, file: !889, line: 199, baseType: !390, size: 32, offset: 480)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_pic_idx", scope: !888, file: !889, line: 200, baseType: !1049, size: 32768, offset: 512)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 32768, elements: !1050)
!1050 = !{!1051}
!1051 = !DISubrange(count: 1024)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "init_done", scope: !888, file: !889, line: 205, baseType: !390, size: 32, offset: 33280)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !888, file: !889, line: 206, baseType: !390, size: 32, offset: 33312)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "last_picture", scope: !888, file: !889, line: 208, baseType: !897, size: 64, offset: 33344)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !878, file: !526, line: 353, baseType: !390, size: 32, offset: 384)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !878, file: !526, line: 354, baseType: !390, size: 32, offset: 416)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !878, file: !526, line: 355, baseType: !390, size: 32, offset: 448)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "Transform8x8Mode", scope: !878, file: !526, line: 356, baseType: !390, size: 32, offset: 480)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "is_not_independent", scope: !878, file: !526, line: 357, baseType: !390, size: 32, offset: 512)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "toppoc", scope: !878, file: !526, line: 359, baseType: !390, size: 32, offset: 544)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "bottompoc", scope: !878, file: !526, line: 360, baseType: !390, size: 32, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "framepoc", scope: !878, file: !526, line: 361, baseType: !390, size: 32, offset: 608)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !878, file: !526, line: 365, baseType: !414, size: 32, offset: 640)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !878, file: !526, line: 366, baseType: !390, size: 32, offset: 672)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !878, file: !526, line: 368, baseType: !847, size: 64, offset: 704)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntMsb", scope: !878, file: !526, line: 372, baseType: !390, size: 32, offset: 768)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "AbsFrameNum", scope: !878, file: !526, line: 378, baseType: !414, size: 32, offset: 800)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !878, file: !526, line: 379, baseType: !390, size: 32, offset: 832)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "current_mb_nr", scope: !878, file: !526, line: 387, baseType: !414, size: 32, offset: 864)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !878, file: !526, line: 388, baseType: !414, size: 32, offset: 896)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "current_slice_nr", scope: !878, file: !526, line: 389, baseType: !935, size: 16, offset: 928)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "cod_counter", scope: !878, file: !526, line: 396, baseType: !390, size: 32, offset: 960)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "allrefzero", scope: !878, file: !526, line: 397, baseType: !390, size: 32, offset: 992)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !878, file: !526, line: 400, baseType: !390, size: 32, offset: 1024)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !878, file: !526, line: 401, baseType: !390, size: 32, offset: 1056)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_active", scope: !878, file: !526, line: 402, baseType: !847, size: 64, offset: 1088)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !878, file: !526, line: 406, baseType: !390, size: 32, offset: 1152)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !878, file: !526, line: 407, baseType: !390, size: 32, offset: 1184)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !878, file: !526, line: 408, baseType: !390, size: 32, offset: 1216)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "qs", scope: !878, file: !526, line: 409, baseType: !390, size: 32, offset: 1248)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qs_delta", scope: !878, file: !526, line: 410, baseType: !390, size: 32, offset: 1280)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !878, file: !526, line: 411, baseType: !390, size: 32, offset: 1312)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "model_number", scope: !878, file: !526, line: 412, baseType: !390, size: 32, offset: 1344)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !878, file: !526, line: 413, baseType: !414, size: 32, offset: 1376)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !878, file: !526, line: 414, baseType: !414, size: 32, offset: 1408)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !878, file: !526, line: 415, baseType: !503, size: 8, offset: 1440)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !878, file: !526, line: 416, baseType: !919, size: 32, offset: 1472)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !878, file: !526, line: 417, baseType: !390, size: 32, offset: 1504)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "end_mb_nr_plus1", scope: !878, file: !526, line: 418, baseType: !390, size: 32, offset: 1536)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !878, file: !526, line: 419, baseType: !390, size: 32, offset: 1568)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "dp_mode", scope: !878, file: !526, line: 420, baseType: !390, size: 32, offset: 1600)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "current_header", scope: !878, file: !526, line: 421, baseType: !390, size: 32, offset: 1632)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "next_header", scope: !878, file: !526, line: 422, baseType: !390, size: 32, offset: 1664)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "last_dquant", scope: !878, file: !526, line: 423, baseType: !390, size: 32, offset: 1696)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "colour_plane_id", scope: !878, file: !526, line: 426, baseType: !390, size: 32, offset: 1728)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !878, file: !526, line: 427, baseType: !390, size: 32, offset: 1760)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "sp_switch", scope: !878, file: !526, line: 428, baseType: !390, size: 32, offset: 1792)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !878, file: !526, line: 429, baseType: !390, size: 32, offset: 1824)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_slice_ref_idx", scope: !878, file: !526, line: 430, baseType: !390, size: 32, offset: 1856)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !878, file: !526, line: 431, baseType: !390, size: 32, offset: 1888)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !878, file: !526, line: 432, baseType: !390, size: 32, offset: 1920)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !878, file: !526, line: 433, baseType: !390, size: 32, offset: 1952)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !878, file: !526, line: 434, baseType: !1005, size: 64, offset: 1984)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "listXsize", scope: !878, file: !526, line: 436, baseType: !1105, size: 48, offset: 2048)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !805, size: 48, elements: !639)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "listX", scope: !878, file: !526, line: 437, baseType: !1107, size: 384, offset: 2112)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1034, size: 384, elements: !639)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "partArr", scope: !878, file: !526, line: 440, baseType: !1109, size: 64, offset: 2496)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataPartition", file: !526, line: 324, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datapartition", file: !526, line: 314, size: 384, elements: !1112)
!1112 = !{!1113, !1124, !1133}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream", scope: !1111, file: !526, line: 317, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bitstream", file: !526, line: 47, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bit_stream", file: !526, line: 300, size: 256, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1121, !1122, !1123}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "read_len", scope: !1116, file: !526, line: 303, baseType: !390, size: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "code_len", scope: !1116, file: !526, line: 304, baseType: !390, size: 32, offset: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bitoffset", scope: !1116, file: !526, line: 306, baseType: !390, size: 32, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_length", scope: !1116, file: !526, line: 307, baseType: !390, size: 32, offset: 96)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "streamBuffer", scope: !1116, file: !526, line: 309, baseType: !523, size: 64, offset: 128)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !1116, file: !526, line: 310, baseType: !390, size: 32, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "de_cabac", scope: !1111, file: !526, line: 318, baseType: !1125, size: 256, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironment", file: !526, line: 95, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !526, line: 88, size: 256, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1131, !1132}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "Drange", scope: !1126, file: !526, line: 90, baseType: !414, size: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "Dvalue", scope: !1126, file: !526, line: 91, baseType: !414, size: 32, offset: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "DbitsLeft", scope: !1126, file: !526, line: 92, baseType: !390, size: 32, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm", scope: !1126, file: !526, line: 93, baseType: !523, size: 64, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "Dcodestrm_len", scope: !1126, file: !526, line: 94, baseType: !600, size: 64, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "readSyntaxElement", scope: !1111, file: !526, line: 320, baseType: !1134, size: 64, offset: 320)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!390, !1137, !1269, !1267}
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !526, line: 273, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !526, line: 197, size: 3840, elements: !1140)
!1140 = !{!1141, !1143, !1144, !1145, !1146, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1175, !1176, !1177, !1178, !1179, !1183, !1184, !1193, !1194, !1195, !1196, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1222, !1223, !1238, !1244, !1268}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !1139, file: !526, line: 199, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !1139, file: !526, line: 200, baseType: !881, size: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !1139, file: !526, line: 201, baseType: !530, size: 64, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrX", scope: !1139, file: !526, line: 202, baseType: !390, size: 32, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !1139, file: !526, line: 203, baseType: !1147, size: 32, offset: 224)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockPos", file: !526, line: 112, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !526, line: 108, size: 32, elements: !1149)
!1149 = !{!1150, !1151}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1148, file: !526, line: 110, baseType: !935, size: 16)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1148, file: !526, line: 111, baseType: !935, size: 16, offset: 16)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "block_x", scope: !1139, file: !526, line: 204, baseType: !390, size: 32, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "block_y", scope: !1139, file: !526, line: 205, baseType: !390, size: 32, offset: 288)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "block_y_aff", scope: !1139, file: !526, line: 206, baseType: !390, size: 32, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "pix_x", scope: !1139, file: !526, line: 207, baseType: !390, size: 32, offset: 352)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pix_y", scope: !1139, file: !526, line: 208, baseType: !390, size: 32, offset: 384)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_x", scope: !1139, file: !526, line: 209, baseType: !390, size: 32, offset: 416)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pix_c_y", scope: !1139, file: !526, line: 210, baseType: !390, size: 32, offset: 448)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_x", scope: !1139, file: !526, line: 212, baseType: !390, size: 32, offset: 480)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "subblock_y", scope: !1139, file: !526, line: 213, baseType: !390, size: 32, offset: 512)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !1139, file: !526, line: 215, baseType: !390, size: 32, offset: 544)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "qpc", scope: !1139, file: !526, line: 216, baseType: !847, size: 64, offset: 576)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "qp_scaled", scope: !1139, file: !526, line: 217, baseType: !555, size: 96, offset: 640)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "is_lossless", scope: !1139, file: !526, line: 218, baseType: !390, size: 32, offset: 736)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "is_intra_block", scope: !1139, file: !526, line: 219, baseType: !390, size: 32, offset: 768)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "is_v_block", scope: !1139, file: !526, line: 220, baseType: !390, size: 32, offset: 800)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "DeblockCall", scope: !1139, file: !526, line: 221, baseType: !390, size: 32, offset: 832)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "slice_nr", scope: !1139, file: !526, line: 223, baseType: !935, size: 16, offset: 864)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !1139, file: !526, line: 224, baseType: !805, size: 8, offset: 880)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "dpl_flag", scope: !1139, file: !526, line: 225, baseType: !805, size: 8, offset: 888)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "delta_quant", scope: !1139, file: !526, line: 226, baseType: !935, size: 16, offset: 896)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "list_offset", scope: !1139, file: !526, line: 227, baseType: !935, size: 16, offset: 912)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "mb_up", scope: !1139, file: !526, line: 229, baseType: !1174, size: 64, offset: 960)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "mb_left", scope: !1139, file: !526, line: 230, baseType: !1174, size: 64, offset: 1024)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "mbup", scope: !1139, file: !526, line: 232, baseType: !1174, size: 64, offset: 1088)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "mbleft", scope: !1139, file: !526, line: 233, baseType: !1174, size: 64, offset: 1152)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !1139, file: !526, line: 236, baseType: !935, size: 16, offset: 1216)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !1139, file: !526, line: 237, baseType: !1180, size: 1024, offset: 1232)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 1024, elements: !1181)
!1181 = !{!849, !1182, !1182, !849}
!1182 = !DISubrange(count: 4)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !1139, file: !526, line: 239, baseType: !390, size: 32, offset: 2272)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_blk", scope: !1139, file: !526, line: 240, baseType: !1185, size: 192, offset: 2304)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1186, size: 192, elements: !556)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !1187, line: 103, baseType: !1188)
!1187 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1189, line: 27, baseType: !1190)
!1189 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !1191, line: 44, baseType: !1192)
!1191 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!1192 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits", scope: !1139, file: !526, line: 241, baseType: !1185, size: 192, offset: 2496)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "cbp_bits_8x8", scope: !1139, file: !526, line: 242, baseType: !1185, size: 192, offset: 2688)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "i16mode", scope: !1139, file: !526, line: 244, baseType: !390, size: 32, offset: 2880)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "b8mode", scope: !1139, file: !526, line: 245, baseType: !1197, size: 32, offset: 2912)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !805, size: 32, elements: !1198)
!1198 = !{!1182}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "b8pdir", scope: !1139, file: !526, line: 246, baseType: !1197, size: 32, offset: 2944)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "ipmode_DPCM", scope: !1139, file: !526, line: 247, baseType: !805, size: 8, offset: 2976)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "c_ipred_mode", scope: !1139, file: !526, line: 248, baseType: !805, size: 8, offset: 2984)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "skip_flag", scope: !1139, file: !526, line: 249, baseType: !805, size: 8, offset: 2992)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "DFDisableIdc", scope: !1139, file: !526, line: 250, baseType: !935, size: 16, offset: 3008)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "DFAlphaC0Offset", scope: !1139, file: !526, line: 251, baseType: !935, size: 16, offset: 3024)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "DFBetaOffset", scope: !1139, file: !526, line: 252, baseType: !935, size: 16, offset: 3040)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "mb_field", scope: !1139, file: !526, line: 254, baseType: !390, size: 32, offset: 3072)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrA", scope: !1139, file: !526, line: 256, baseType: !390, size: 32, offset: 3104)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrB", scope: !1139, file: !526, line: 256, baseType: !390, size: 32, offset: 3136)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrC", scope: !1139, file: !526, line: 256, baseType: !390, size: 32, offset: 3168)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "mbAddrD", scope: !1139, file: !526, line: 256, baseType: !390, size: 32, offset: 3200)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailA", scope: !1139, file: !526, line: 257, baseType: !390, size: 32, offset: 3232)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailB", scope: !1139, file: !526, line: 257, baseType: !390, size: 32, offset: 3264)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailC", scope: !1139, file: !526, line: 257, baseType: !390, size: 32, offset: 3296)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "mbAvailD", scope: !1139, file: !526, line: 257, baseType: !390, size: 32, offset: 3328)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "luma_transform_size_8x8_flag", scope: !1139, file: !526, line: 259, baseType: !390, size: 32, offset: 3360)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "NoMbPartLessThan8x8Flag", scope: !1139, file: !526, line: 260, baseType: !390, size: 32, offset: 3392)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_4x4", scope: !1139, file: !526, line: 262, baseType: !1218, size: 64, offset: 3456)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{null, !1174, !1221, !390, !390}
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorPlane", file: !413, line: 32, baseType: !419)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "itrans_8x8", scope: !1139, file: !526, line: 263, baseType: !1218, size: 64, offset: 3520)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "GetMVPredictor", scope: !1139, file: !526, line: 265, baseType: !1224, size: 64, offset: 3584)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{null, !1174, !1227, !1237, !935, !959, !390, !390, !390, !390, !390}
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !526, line: 85, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !526, line: 77, size: 128, elements: !1230)
!1230 = !{!1231, !1232, !1233, !1234, !1235, !1236}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !1229, file: !526, line: 79, baseType: !390, size: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !1229, file: !526, line: 80, baseType: !390, size: 32, offset: 32)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1229, file: !526, line: 81, baseType: !935, size: 16, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1229, file: !526, line: 82, baseType: !935, size: 16, offset: 80)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !1229, file: !526, line: 83, baseType: !935, size: 16, offset: 96)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !1229, file: !526, line: 84, baseType: !935, size: 16, offset: 112)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "read_and_store_CBP_block_bit", scope: !1139, file: !526, line: 268, baseType: !1239, size: 64, offset: 3648)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!390, !1174, !1242, !390}
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodingEnvironmentPtr", file: !526, line: 97, baseType: !1243)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "readRefPictureIdx", scope: !1139, file: !526, line: 269, baseType: !1245, size: 64, offset: 3712)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!805, !1174, !1248, !1267, !805, !390}
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
