; ModuleID = 'ldecod_src/vlc.c'
source_filename = "ldecod_src/vlc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.syntaxelement = type { i32, i32, i32, i32, i32, i32, i32, i32, ptr, ptr }

@p_Dec = external local_unnamed_addr global ptr, align 8
@NTAB1 = internal unnamed_addr constant [4 x [8 x [2 x i8]]] [[8 x [2 x i8]] [[2 x i8] c"\01\00", [2 x i8] zeroinitializer, [2 x i8] zeroinitializer, [2 x i8] zeroinitializer, [2 x i8] zeroinitializer, [2 x i8] zeroinitializer, [2 x i8] zeroinitializer, [2 x i8] zeroinitializer], [8 x [2 x i8]] [[2 x i8] c"\01\01", [2 x i8] c"\01\02", [2 x i8] zeroinitializer, [2 x i8] zeroinitializer, [2 x i8] zeroinitializer, [2 x i8] zeroinitializer, [2 x i8] zeroinitializer, [2 x i8] zeroinitializer], [8 x [2 x i8]] [[2 x i8] c"\02\00", [2 x i8] c"\01\03", [2 x i8] c"\01\04", [2 x i8] c"\01\05", [2 x i8] zeroinitializer, [2 x i8] zeroinitializer, [2 x i8] zeroinitializer, [2 x i8] zeroinitializer], [8 x [2 x i8]] [[2 x i8] c"\03\00", [2 x i8] c"\02\01", [2 x i8] c"\02\02", [2 x i8] c"\01\06", [2 x i8] c"\01\07", [2 x i8] c"\01\08", [2 x i8] c"\01\09", [2 x i8] c"\04\00"]], align 16, !dbg !0
@LEVRUN1 = internal unnamed_addr constant [16 x i8] c"\04\02\02\01\01\01\01\01\01\01\00\00\00\00\00\00", align 16, !dbg !1203

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "NTAB1", scope: !2, file: !1199, line: 36, type: !1218, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !44, globals: !45, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "ldecod_src/vlc.c", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e8b2d3aa1f717a338bbdecbd91ac66cf")
!4 = !{!5, !14, !20, !29, !39}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 22, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "ldecod_src/inc/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "fd6ca9e1c707932f749220576db72b57")
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "CF_UNKNOWN", value: -1)
!10 = !DIEnumerator(name: "YUV400", value: 0)
!11 = !DIEnumerator(name: "YUV420", value: 1)
!12 = !DIEnumerator(name: "YUV422", value: 2)
!13 = !DIEnumerator(name: "YUV444", value: 3)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 15, baseType: !7, size: 32, elements: !15)
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "CM_UNKNOWN", value: -1)
!17 = !DIEnumerator(name: "CM_YUV", value: 0)
!18 = !DIEnumerator(name: "CM_RGB", value: 1)
!19 = !DIEnumerator(name: "CM_XYZ", value: 2)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 25, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "ldecod_src/inc/io_video.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1141c07f1801ad27d87214c419749431")
!22 = !{!23, !24, !25, !26, !27, !28}
!23 = !DIEnumerator(name: "VIDEO_UNKNOWN", value: -1)
!24 = !DIEnumerator(name: "VIDEO_YUV", value: 0)
!25 = !DIEnumerator(name: "VIDEO_RGB", value: 1)
!26 = !DIEnumerator(name: "VIDEO_XYZ", value: 2)
!27 = !DIEnumerator(name: "VIDEO_TIFF", value: 3)
!28 = !DIEnumerator(name: "VIDEO_AVI", value: 4)
!29 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 22, baseType: !31, size: 32, elements: !32)
!30 = !DIFile(filename: "ldecod_src/inc/types.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "64f87bd13f2911471c7313b4ac17e90c")
!31 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!32 = !{!33, !34, !35, !36, !37, !38}
!33 = !DIEnumerator(name: "PLANE_Y", value: 0)
!34 = !DIEnumerator(name: "PLANE_U", value: 1)
!35 = !DIEnumerator(name: "PLANE_V", value: 2)
!36 = !DIEnumerator(name: "PLANE_G", value: 0)
!37 = !DIEnumerator(name: "PLANE_B", value: 1)
!38 = !DIEnumerator(name: "PLANE_R", value: 2)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !30, line: 135, baseType: !31, size: 32, elements: !40)
!40 = !{!41, !42, !43}
!41 = !DIEnumerator(name: "FRAME", value: 0)
!42 = !DIEnumerator(name: "TOP_FIELD", value: 1)
!43 = !DIEnumerator(name: "BOTTOM_FIELD", value: 2)
!44 = !{!7, !31}
!45 = !{!46, !1113, !1115, !1120, !1134, !1136, !1141, !1154, !1156, !1161, !1174, !1176, !1181, !1190, !1192, !1197, !0, !1203, !1206, !1210, !1213}
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "lentab", scope: !48, file: !3, line: 703, type: !1110, isLocal: true, isDefinition: true)
!48 = distinct !DISubprogram(name: "readSyntaxElement_NumCoeffTrailingOnes", scope: !3, file: !3, line: 694, type: !49, scopeLine: 697, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1099)
!49 = !DISubroutineType(types: !50)
!50 = !{!7, !51, !809, !369}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "SyntaxElement", file: !53, line: 296, baseType: !54)
!53 = !DIFile(filename: "ldecod_src/inc/global.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "c4ca3c417c5616a2ff6b6266e7376fc1")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syntaxelement", file: !53, line: 276, size: 384, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !69}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !54, file: !53, line: 278, baseType: !7, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "value1", scope: !54, file: !53, line: 279, baseType: !7, size: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "value2", scope: !54, file: !53, line: 280, baseType: !7, size: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !54, file: !53, line: 281, baseType: !7, size: 32, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "inf", scope: !54, file: !53, line: 282, baseType: !7, size: 32, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "bitpattern", scope: !54, file: !53, line: 283, baseType: !31, size: 32, offset: 160)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !54, file: !53, line: 284, baseType: !7, size: 32, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !54, file: !53, line: 285, baseType: !7, size: 32, offset: 224)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !54, file: !53, line: 293, baseType: !65, size: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !7, !7, !68, !68}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "reading", scope: !54, file: !53, line: 295, baseType: !70, size: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !73, !1097, !1091}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "Macroblock", file: !53, line: 273, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "macroblock", file: !53, line: 197, size: 3840, elements: !76)
!76 = !{!77, !1004, !1005, !1006, !1007, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1036, !1037, !1038, !1039, !1040, !1043, !1044, !1046, !1047, !1048, !1049, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1073, !1074, !1087, !1093, !1098}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "p_Slice", scope: !75, file: !53, line: 199, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice", file: !53, line: 341, size: 109184, elements: !80)
!80 = !{!81, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !798, !800, !803, !833, !863, !890, !893, !894, !896, !897, !898, !899, !900, !901, !902, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !929, !930, !931, !932, !933, !934, !937, !938, !941, !942, !944, !947, !948, !949, !950, !951, !952, !953, !954, !955, !957, !958, !959, !960, !961, !963, !964, !965, !969, !973, !977, !981, !985, !986, !987, !988, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "p_Vid", scope: !79, file: !53, line: 343, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_par", file: !53, line: 566, size: 6855040, elements: !84)
!84 = !{!85, !170, !227, !331, !333, !335, !393, !395, !396, !397, !398, !399, !402, !422, !434, !435, !436, !437, !438, !439, !443, !444, !446, !447, !448, !449, !450, !451, !453, !455, !458, !459, !461, !462, !463, !464, !465, !467, !468, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !498, !499, !500, !501, !502, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !586, !587, !591, !592, !593, !594, !595, !596, !597, !598, !599, !601, !602, !603, !606, !610, !613, !615, !616, !619, !622, !623, !624, !628, !631, !634, !635, !636, !637, !638, !639, !642, !643, !645, !649, !650, !651, !652, !655, !660, !674, !679, !683, !684, !689, !690, !694, !695, !699, !720, !721, !724, !725, !726, !727, !728, !729, !730, !731}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !83, file: !53, line: 568, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inp_par", file: !53, line: 850, size: 32128, elements: !88)
!88 = !{!89, !94, !95, !96, !97, !98, !99, !100, !101, !102, !132, !133, !134, !135, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "infile", scope: !87, file: !53, line: 852, baseType: !90, size: 2040)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 2040, elements: !92)
!91 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!92 = !{!93}
!93 = !DISubrange(count: 255)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "outfile", scope: !87, file: !53, line: 853, baseType: !90, size: 2040, offset: 2040)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "reffile", scope: !87, file: !53, line: 854, baseType: !90, size: 2040, offset: 4080)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "FileFormat", scope: !87, file: !53, line: 856, baseType: !7, size: 32, offset: 6144)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "ref_offset", scope: !87, file: !53, line: 857, baseType: !7, size: 32, offset: 6176)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "poc_scale", scope: !87, file: !53, line: 858, baseType: !7, size: 32, offset: 6208)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "write_uv", scope: !87, file: !53, line: 859, baseType: !7, size: 32, offset: 6240)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "silent", scope: !87, file: !53, line: 860, baseType: !7, size: 32, offset: 6272)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "intra_profile_deblocking", scope: !87, file: !53, line: 861, baseType: !7, size: 32, offset: 6304)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !87, file: !53, line: 864, baseType: !103, size: 1088, offset: 6336)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrameFormat", file: !6, line: 52, baseType: !104)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "frame_format", file: !6, line: 30, size: 1088, elements: !105)
!105 = !{!106, !108, !110, !112, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !104, file: !6, line: 32, baseType: !107, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorFormat", file: !6, line: 28, baseType: !5)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "color_model", scope: !104, file: !6, line: 33, baseType: !109, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorModel", file: !6, line: 20, baseType: !14)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !104, file: !6, line: 34, baseType: !111, size: 64, offset: 64)
!111 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !104, file: !6, line: 35, baseType: !113, size: 96, offset: 128)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 96, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 3)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !104, file: !6, line: 36, baseType: !113, size: 96, offset: 224)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right", scope: !104, file: !6, line: 37, baseType: !7, size: 32, offset: 320)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom", scope: !104, file: !6, line: 38, baseType: !7, size: 32, offset: 352)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_right_cr", scope: !104, file: !6, line: 39, baseType: !7, size: 32, offset: 384)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "auto_crop_bottom_cr", scope: !104, file: !6, line: 40, baseType: !7, size: 32, offset: 416)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "width_crop", scope: !104, file: !6, line: 41, baseType: !7, size: 32, offset: 448)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "height_crop", scope: !104, file: !6, line: 42, baseType: !7, size: 32, offset: 480)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !104, file: !6, line: 43, baseType: !7, size: 32, offset: 512)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !104, file: !6, line: 44, baseType: !7, size: 32, offset: 544)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "size_cmp", scope: !104, file: !6, line: 45, baseType: !113, size: 96, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !104, file: !6, line: 46, baseType: !7, size: 32, offset: 672)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !104, file: !6, line: 47, baseType: !113, size: 96, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "max_value", scope: !104, file: !6, line: 48, baseType: !113, size: 96, offset: 800)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "max_value_sq", scope: !104, file: !6, line: 49, baseType: !113, size: 96, offset: 896)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !104, file: !6, line: 50, baseType: !7, size: 32, offset: 992)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_shift3", scope: !104, file: !6, line: 51, baseType: !7, size: 32, offset: 1024)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !87, file: !53, line: 865, baseType: !103, size: 1088, offset: 7424)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ProcessInput", scope: !87, file: !53, line: 867, baseType: !7, size: 32, offset: 8512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "enable_32_pulldown", scope: !87, file: !53, line: 868, baseType: !7, size: 32, offset: 8544)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "input_file1", scope: !87, file: !53, line: 869, baseType: !136, size: 7744, offset: 8576)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDataFile", file: !21, line: 60, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "video_data_file", file: !21, line: 34, size: 7744, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "fname", scope: !137, file: !21, line: 37, baseType: !90, size: 2040)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "fhead", scope: !137, file: !21, line: 38, baseType: !90, size: 2040, offset: 2040)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "ftail", scope: !137, file: !21, line: 39, baseType: !90, size: 2040, offset: 4080)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "f_num", scope: !137, file: !21, line: 40, baseType: !7, size: 32, offset: 6144)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "vdtype", scope: !137, file: !21, line: 41, baseType: !144, size: 32, offset: 6176)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoFileType", file: !21, line: 32, baseType: !20)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !137, file: !21, line: 42, baseType: !103, size: 1088, offset: 6208)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "is_concatenated", scope: !137, file: !21, line: 43, baseType: !7, size: 32, offset: 7296)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "is_interleaved", scope: !137, file: !21, line: 44, baseType: !7, size: 32, offset: 7328)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "zero_pad", scope: !137, file: !21, line: 45, baseType: !7, size: 32, offset: 7360)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "num_digits", scope: !137, file: !21, line: 46, baseType: !7, size: 32, offset: 7392)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !137, file: !21, line: 47, baseType: !7, size: 32, offset: 7424)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !137, file: !21, line: 48, baseType: !7, size: 32, offset: 7456)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "nframes", scope: !137, file: !21, line: 49, baseType: !7, size: 32, offset: 7488)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_size", scope: !137, file: !21, line: 50, baseType: !7, size: 32, offset: 7520)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_size", scope: !137, file: !21, line: 51, baseType: !7, size: 32, offset: 7552)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "crop_x_offset", scope: !137, file: !21, line: 52, baseType: !7, size: 32, offset: 7584)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "crop_y_offset", scope: !137, file: !21, line: 53, baseType: !7, size: 32, offset: 7616)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "avi", scope: !137, file: !21, line: 56, baseType: !68, size: 64, offset: 7680)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "input_file2", scope: !87, file: !53, line: 870, baseType: !136, size: 7744, offset: 16320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "input_file3", scope: !87, file: !53, line: 871, baseType: !136, size: 7744, offset: 24064)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "DecodeAllLayers", scope: !87, file: !53, line: 873, baseType: !7, size: 32, offset: 31808)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !87, file: !53, line: 884, baseType: !7, size: 32, offset: 31840)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !87, file: !53, line: 885, baseType: !7, size: 32, offset: 31872)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !87, file: !53, line: 886, baseType: !7, size: 32, offset: 31904)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !87, file: !53, line: 890, baseType: !7, size: 32, offset: 31936)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "stdRange", scope: !87, file: !53, line: 893, baseType: !7, size: 32, offset: 31968)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "videoCode", scope: !87, file: !53, line: 894, baseType: !7, size: 32, offset: 32000)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "export_views", scope: !87, file: !53, line: 895, baseType: !7, size: 32, offset: 32032)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "iDecFrmNum", scope: !87, file: !53, line: 897, baseType: !7, size: 32, offset: 32064)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "bDisplayDecParams", scope: !87, file: !53, line: 899, baseType: !7, size: 32, offset: 32096)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !83, file: !53, line: 569, baseType: !171, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "pic_parameter_set_rbsp_t", file: !173, line: 138, baseType: !174)
!173 = !DIFile(filename: "ldecod_src/inc/parsetcommon.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "d59d7e00f3aec3a23ed88314ae35b687")
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 94, size: 17728, elements: !175)
!175 = !{!176, !177, !178, !179, !180, !181, !182, !186, !191, !195, !198, !199, !200, !201, !202, !206, !207, !208, !209, !210, !211, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !174, file: !173, line: 96, baseType: !7, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pic_parameter_set_id", scope: !174, file: !173, line: 97, baseType: !31, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !174, file: !173, line: 98, baseType: !31, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_mode_flag", scope: !174, file: !173, line: 99, baseType: !7, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode_flag", scope: !174, file: !173, line: 100, baseType: !7, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_matrix_present_flag", scope: !174, file: !173, line: 102, baseType: !7, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pic_scaling_list_present_flag", scope: !174, file: !173, line: 103, baseType: !183, size: 384, offset: 192)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 384, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 12)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !174, file: !173, line: 104, baseType: !187, size: 3072, offset: 576)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3072, elements: !188)
!188 = !{!189, !190}
!189 = !DISubrange(count: 6)
!190 = !DISubrange(count: 16)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !174, file: !173, line: 105, baseType: !192, size: 12288, offset: 3648)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 12288, elements: !193)
!193 = !{!189, !194}
!194 = !DISubrange(count: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !174, file: !173, line: 106, baseType: !196, size: 192, offset: 15936)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !197)
!197 = !{!189}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !174, file: !173, line: 107, baseType: !196, size: 192, offset: 16128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_pic_order_in_frame_present_flag", scope: !174, file: !173, line: 110, baseType: !7, size: 32, offset: 16320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "num_slice_groups_minus1", scope: !174, file: !173, line: 111, baseType: !31, size: 32, offset: 16352)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_map_type", scope: !174, file: !173, line: 112, baseType: !31, size: 32, offset: 16384)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "run_length_minus1", scope: !174, file: !173, line: 114, baseType: !203, size: 256, offset: 16416)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 256, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 8)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "top_left", scope: !174, file: !173, line: 116, baseType: !203, size: 256, offset: 16672)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_right", scope: !174, file: !173, line: 117, baseType: !203, size: 256, offset: 16928)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_direction_flag", scope: !174, file: !173, line: 119, baseType: !7, size: 32, offset: 17184)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_rate_minus1", scope: !174, file: !173, line: 120, baseType: !31, size: 32, offset: 17216)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "pic_size_in_map_units_minus1", scope: !174, file: !173, line: 122, baseType: !31, size: 32, offset: 17248)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_id", scope: !174, file: !173, line: 123, baseType: !212, size: 64, offset: 17280)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !214, line: 21, baseType: !215)
!214 = !DIFile(filename: "ldecod_src/inc/typedefs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e1393d024b72e653f4e6dbeffdb0b154")
!215 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_active_minus1", scope: !174, file: !173, line: 125, baseType: !7, size: 32, offset: 17344)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_active_minus1", scope: !174, file: !173, line: 126, baseType: !7, size: 32, offset: 17376)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !174, file: !173, line: 127, baseType: !7, size: 32, offset: 17408)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !174, file: !173, line: 128, baseType: !31, size: 32, offset: 17440)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !174, file: !173, line: 129, baseType: !7, size: 32, offset: 17472)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qs_minus26", scope: !174, file: !173, line: 130, baseType: !7, size: 32, offset: 17504)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !174, file: !173, line: 131, baseType: !7, size: 32, offset: 17536)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "second_chroma_qp_index_offset", scope: !174, file: !173, line: 133, baseType: !7, size: 32, offset: 17568)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !174, file: !173, line: 135, baseType: !7, size: 32, offset: 17600)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !174, file: !173, line: 136, baseType: !7, size: 32, offset: 17632)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present_flag", scope: !174, file: !173, line: 137, baseType: !7, size: 32, offset: 17664)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !83, file: !53, line: 570, baseType: !228, size: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "seq_parameter_set_rbsp_t", file: !173, line: 197, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 142, size: 33024, elements: !231)
!231 = !{!232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !329, !330}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !230, file: !173, line: 144, baseType: !7, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !230, file: !173, line: 146, baseType: !31, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set0_flag", scope: !230, file: !173, line: 147, baseType: !7, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set1_flag", scope: !230, file: !173, line: 148, baseType: !7, size: 32, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set2_flag", scope: !230, file: !173, line: 149, baseType: !7, size: 32, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set3_flag", scope: !230, file: !173, line: 150, baseType: !7, size: 32, offset: 160)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_set4_flag", scope: !230, file: !173, line: 152, baseType: !7, size: 32, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !230, file: !173, line: 154, baseType: !31, size: 32, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "seq_parameter_set_id", scope: !230, file: !173, line: 155, baseType: !31, size: 32, offset: 256)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !230, file: !173, line: 156, baseType: !31, size: 32, offset: 288)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_matrix_present_flag", scope: !230, file: !173, line: 158, baseType: !7, size: 32, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "seq_scaling_list_present_flag", scope: !230, file: !173, line: 159, baseType: !183, size: 384, offset: 352)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList4x4", scope: !230, file: !173, line: 160, baseType: !187, size: 3072, offset: 736)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ScalingList8x8", scope: !230, file: !173, line: 161, baseType: !192, size: 12288, offset: 3808)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix4x4Flag", scope: !230, file: !173, line: 162, baseType: !196, size: 192, offset: 16096)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "UseDefaultScalingMatrix8x8Flag", scope: !230, file: !173, line: 163, baseType: !196, size: 192, offset: 16288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !230, file: !173, line: 165, baseType: !31, size: 32, offset: 16480)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !230, file: !173, line: 166, baseType: !31, size: 32, offset: 16512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num_minus4", scope: !230, file: !173, line: 167, baseType: !31, size: 32, offset: 16544)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_type", scope: !230, file: !173, line: 168, baseType: !31, size: 32, offset: 16576)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !230, file: !173, line: 170, baseType: !31, size: 32, offset: 16608)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !230, file: !173, line: 172, baseType: !7, size: 32, offset: 16640)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !230, file: !173, line: 173, baseType: !7, size: 32, offset: 16672)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !230, file: !173, line: 174, baseType: !7, size: 32, offset: 16704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames_in_pic_order_cnt_cycle", scope: !230, file: !173, line: 175, baseType: !31, size: 32, offset: 16736)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !230, file: !173, line: 177, baseType: !258, size: 8192, offset: 16768)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_frames", scope: !230, file: !173, line: 178, baseType: !31, size: 32, offset: 24960)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_value_allowed_flag", scope: !230, file: !173, line: 179, baseType: !7, size: 32, offset: 24992)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_mbs_minus1", scope: !230, file: !173, line: 180, baseType: !31, size: 32, offset: 25024)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_map_units_minus1", scope: !230, file: !173, line: 181, baseType: !31, size: 32, offset: 25056)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !230, file: !173, line: 182, baseType: !7, size: 32, offset: 25088)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "mb_adaptive_frame_field_flag", scope: !230, file: !173, line: 184, baseType: !7, size: 32, offset: 25120)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !230, file: !173, line: 185, baseType: !7, size: 32, offset: 25152)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_flag", scope: !230, file: !173, line: 186, baseType: !7, size: 32, offset: 25184)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_left_offset", scope: !230, file: !173, line: 187, baseType: !31, size: 32, offset: 25216)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_right_offset", scope: !230, file: !173, line: 188, baseType: !31, size: 32, offset: 25248)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_top_offset", scope: !230, file: !173, line: 189, baseType: !31, size: 32, offset: 25280)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "frame_cropping_rect_bottom_offset", scope: !230, file: !173, line: 190, baseType: !31, size: 32, offset: 25312)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !230, file: !173, line: 191, baseType: !7, size: 32, offset: 25344)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "vui_seq_parameters", scope: !230, file: !173, line: 192, baseType: !275, size: 7584, offset: 25376)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "vui_seq_parameters_t", file: !173, line: 90, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 53, size: 7584, elements: !277)
!277 = !{!278, !279, !280, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !276, file: !173, line: 55, baseType: !7, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !276, file: !173, line: 56, baseType: !31, size: 32, offset: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !276, file: !173, line: 57, baseType: !281, size: 16, offset: 64)
!281 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !276, file: !173, line: 58, baseType: !281, size: 16, offset: 80)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !276, file: !173, line: 59, baseType: !7, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !276, file: !173, line: 60, baseType: !7, size: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !276, file: !173, line: 61, baseType: !7, size: 32, offset: 160)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !276, file: !173, line: 62, baseType: !31, size: 32, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !276, file: !173, line: 63, baseType: !7, size: 32, offset: 224)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !276, file: !173, line: 64, baseType: !7, size: 32, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !276, file: !173, line: 65, baseType: !31, size: 32, offset: 288)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !276, file: !173, line: 66, baseType: !31, size: 32, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !276, file: !173, line: 67, baseType: !31, size: 32, offset: 352)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location_info_present_flag", scope: !276, file: !173, line: 68, baseType: !7, size: 32, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !276, file: !173, line: 69, baseType: !31, size: 32, offset: 416)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !276, file: !173, line: 70, baseType: !31, size: 32, offset: 448)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !276, file: !173, line: 71, baseType: !7, size: 32, offset: 480)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !276, file: !173, line: 72, baseType: !31, size: 32, offset: 512)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !276, file: !173, line: 73, baseType: !31, size: 32, offset: 544)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !276, file: !173, line: 74, baseType: !7, size: 32, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !276, file: !173, line: 75, baseType: !7, size: 32, offset: 608)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters", scope: !276, file: !173, line: 76, baseType: !301, size: 3296, offset: 640)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "hrd_parameters_t", file: !173, line: 50, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 38, size: 3296, elements: !303)
!303 = !{!304, !305, !306, !307, !311, !312, !313, !314, !315, !316}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !302, file: !173, line: 40, baseType: !31, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !302, file: !173, line: 41, baseType: !31, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !302, file: !173, line: 42, baseType: !31, size: 32, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !302, file: !173, line: 43, baseType: !308, size: 1024, offset: 96)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 1024, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !302, file: !173, line: 44, baseType: !308, size: 1024, offset: 1120)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !302, file: !173, line: 45, baseType: !308, size: 1024, offset: 2144)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !302, file: !173, line: 46, baseType: !31, size: 32, offset: 3168)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !302, file: !173, line: 47, baseType: !31, size: 32, offset: 3200)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !302, file: !173, line: 48, baseType: !31, size: 32, offset: 3232)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !302, file: !173, line: 49, baseType: !31, size: 32, offset: 3264)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !276, file: !173, line: 77, baseType: !7, size: 32, offset: 3936)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters", scope: !276, file: !173, line: 78, baseType: !301, size: 3296, offset: 3968)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !276, file: !173, line: 80, baseType: !7, size: 32, offset: 7264)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !276, file: !173, line: 81, baseType: !7, size: 32, offset: 7296)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !276, file: !173, line: 82, baseType: !7, size: 32, offset: 7328)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !276, file: !173, line: 83, baseType: !7, size: 32, offset: 7360)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !276, file: !173, line: 84, baseType: !31, size: 32, offset: 7392)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_mb_denom", scope: !276, file: !173, line: 85, baseType: !31, size: 32, offset: 7424)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !276, file: !173, line: 86, baseType: !31, size: 32, offset: 7456)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !276, file: !173, line: 87, baseType: !31, size: 32, offset: 7488)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !276, file: !173, line: 88, baseType: !31, size: 32, offset: 7520)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !276, file: !173, line: 89, baseType: !31, size: 32, offset: 7552)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !230, file: !173, line: 193, baseType: !31, size: 32, offset: 32960)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_frame_buffering", scope: !230, file: !173, line: 195, baseType: !7, size: 32, offset: 32992)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "SeqParSet", scope: !83, file: !53, line: 571, baseType: !332, size: 1056768, offset: 192)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 1056768, elements: !309)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "PicParSet", scope: !83, file: !53, line: 572, baseType: !334, size: 4538368, offset: 1056960)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 4538368, elements: !259)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "active_subset_sps", scope: !83, file: !53, line: 575, baseType: !336, size: 64, offset: 5595328)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "subset_seq_parameter_set_rbsp_t", file: !173, line: 256, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 228, size: 37312, elements: !339)
!339 = !{!340, !341, !342, !343, !344, !345, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !360, !361, !362, !363}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !338, file: !173, line: 230, baseType: !229, size: 33024)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "bit_equal_to_one", scope: !338, file: !173, line: 232, baseType: !31, size: 32, offset: 33024)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "num_views_minus1", scope: !338, file: !173, line: 233, baseType: !7, size: 32, offset: 33056)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !338, file: !173, line: 234, baseType: !68, size: 64, offset: 33088)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l0", scope: !338, file: !173, line: 235, baseType: !68, size: 64, offset: 33152)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l0", scope: !338, file: !173, line: 236, baseType: !346, size: 64, offset: 33216)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "num_anchor_refs_l1", scope: !338, file: !173, line: 237, baseType: !68, size: 64, offset: 33280)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_ref_l1", scope: !338, file: !173, line: 238, baseType: !346, size: 64, offset: 33344)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l0", scope: !338, file: !173, line: 240, baseType: !68, size: 64, offset: 33408)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l0", scope: !338, file: !173, line: 241, baseType: !346, size: 64, offset: 33472)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "num_non_anchor_refs_l1", scope: !338, file: !173, line: 242, baseType: !68, size: 64, offset: 33536)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "non_anchor_ref_l1", scope: !338, file: !173, line: 243, baseType: !346, size: 64, offset: 33600)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "num_level_values_signalled_minus1", scope: !338, file: !173, line: 245, baseType: !7, size: 32, offset: 33664)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !338, file: !173, line: 246, baseType: !68, size: 64, offset: 33728)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "num_applicable_ops_minus1", scope: !338, file: !173, line: 247, baseType: !68, size: 64, offset: 33792)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_temporal_id", scope: !338, file: !173, line: 248, baseType: !346, size: 64, offset: 33856)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_target_views_minus1", scope: !338, file: !173, line: 249, baseType: !346, size: 64, offset: 33920)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_target_view_id", scope: !338, file: !173, line: 250, baseType: !359, size: 64, offset: 33984)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "applicable_op_num_views_minus1", scope: !338, file: !173, line: 251, baseType: !346, size: 64, offset: 34048)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mvc_vui_parameters_present_flag", scope: !338, file: !173, line: 253, baseType: !31, size: 32, offset: 34112)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Valid", scope: !338, file: !173, line: 254, baseType: !7, size: 32, offset: 34144)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "MVCVUIParams", scope: !338, file: !173, line: 255, baseType: !364, size: 3136, offset: 34176)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "MVCVUI_t", file: !173, line: 226, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mvcvui_tag", file: !173, line: 200, size: 3136, elements: !366)
!366 = !{!367, !368, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !386, !387, !389, !390, !391, !392}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops_minus1", scope: !365, file: !173, line: 202, baseType: !7, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !365, file: !173, line: 203, baseType: !369, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "num_target_output_views_minus1", scope: !365, file: !173, line: 204, baseType: !68, size: 64, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !365, file: !173, line: 205, baseType: !346, size: 64, offset: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !365, file: !173, line: 206, baseType: !369, size: 64, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !365, file: !173, line: 207, baseType: !68, size: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !365, file: !173, line: 208, baseType: !68, size: 64, offset: 384)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !365, file: !173, line: 209, baseType: !369, size: 64, offset: 448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !365, file: !173, line: 210, baseType: !369, size: 64, offset: 512)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !365, file: !173, line: 211, baseType: !369, size: 64, offset: 576)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !365, file: !173, line: 212, baseType: !369, size: 64, offset: 640)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !365, file: !173, line: 213, baseType: !369, size: 64, offset: 704)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !365, file: !173, line: 216, baseType: !370, size: 8, offset: 768)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !365, file: !173, line: 217, baseType: !370, size: 8, offset: 776)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !365, file: !173, line: 218, baseType: !370, size: 8, offset: 784)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !365, file: !173, line: 219, baseType: !385, size: 1024, offset: 800)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !309)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !365, file: !173, line: 220, baseType: !385, size: 1024, offset: 1824)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !365, file: !173, line: 221, baseType: !388, size: 256, offset: 2848)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 256, elements: !309)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !365, file: !173, line: 222, baseType: !370, size: 8, offset: 3104)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length_minus1", scope: !365, file: !173, line: 223, baseType: !370, size: 8, offset: 3112)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !365, file: !173, line: 224, baseType: !370, size: 8, offset: 3120)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !365, file: !173, line: 225, baseType: !370, size: 8, offset: 3128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "SubsetSeqParSet", scope: !83, file: !53, line: 577, baseType: !394, size: 1193984, offset: 5595392)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 1193984, elements: !309)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_width_in_mbs_minus1", scope: !83, file: !53, line: 578, baseType: !7, size: 32, offset: 6789376)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_height_in_map_units_minus1", scope: !83, file: !53, line: 579, baseType: !7, size: 32, offset: 6789408)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "last_max_dec_frame_buffering", scope: !83, file: !53, line: 580, baseType: !7, size: 32, offset: 6789440)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "last_profile_idc", scope: !83, file: !53, line: 581, baseType: !7, size: 32, offset: 6789472)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "p_SEI", scope: !83, file: !53, line: 584, baseType: !400, size: 64, offset: 6789504)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "sei_params", file: !53, line: 584, flags: DIFlagFwdDecl)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "old_slice", scope: !83, file: !53, line: 586, baseType: !403, size: 64, offset: 6789568)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_slice_par", file: !53, line: 902, size: 416, elements: !405)
!405 = !{!406, !407, !408, !409, !410, !411, !415, !416, !417, !418, !419, !420, !421}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !404, file: !53, line: 904, baseType: !31, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !404, file: !53, line: 905, baseType: !31, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "nal_ref_idc", scope: !404, file: !53, line: 906, baseType: !7, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "pic_oder_cnt_lsb", scope: !404, file: !53, line: 907, baseType: !31, size: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_oder_cnt_bottom", scope: !404, file: !53, line: 908, baseType: !7, size: 32, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !404, file: !53, line: 909, baseType: !412, size: 64, offset: 160)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 2)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !404, file: !53, line: 910, baseType: !213, size: 8, offset: 224)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !404, file: !53, line: 911, baseType: !213, size: 8, offset: 232)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !404, file: !53, line: 912, baseType: !7, size: 32, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pps_id", scope: !404, file: !53, line: 913, baseType: !7, size: 32, offset: 288)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "view_id", scope: !404, file: !53, line: 915, baseType: !7, size: 32, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "inter_view_flag", scope: !404, file: !53, line: 916, baseType: !7, size: 32, offset: 352)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "anchor_pic_flag", scope: !404, file: !53, line: 917, baseType: !7, size: 32, offset: 384)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !83, file: !53, line: 587, baseType: !423, size: 64, offset: 6789632)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "snr_par", file: !53, line: 839, size: 512, elements: !425)
!425 = !{!426, !427, !430, !431, !432, !433}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ctr", scope: !424, file: !53, line: 841, baseType: !7, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "snr", scope: !424, file: !53, line: 842, baseType: !428, size: 96, offset: 32)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 96, elements: !114)
!429 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "snr1", scope: !424, file: !53, line: 843, baseType: !428, size: 96, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "snra", scope: !424, file: !53, line: 844, baseType: !428, size: 96, offset: 224)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "sse", scope: !424, file: !53, line: 845, baseType: !428, size: 96, offset: 320)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "msse", scope: !424, file: !53, line: 846, baseType: !428, size: 96, offset: 416)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !83, file: !53, line: 588, baseType: !7, size: 32, offset: 6789696)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !83, file: !53, line: 591, baseType: !31, size: 32, offset: 6789728)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "iSliceNumOfCurrPic", scope: !83, file: !53, line: 592, baseType: !7, size: 32, offset: 6789760)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesAllocated", scope: !83, file: !53, line: 593, baseType: !7, size: 32, offset: 6789792)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "iNumOfSlicesDecoded", scope: !83, file: !53, line: 594, baseType: !7, size: 32, offset: 6789824)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ppSliceList", scope: !83, file: !53, line: 595, baseType: !440, size: 64, offset: 6789888)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "Slice", file: !53, line: 542, baseType: !79)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block", scope: !83, file: !53, line: 596, baseType: !369, size: 64, offset: 6789952)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "intra_block_JV", scope: !83, file: !53, line: 597, baseType: !445, size: 192, offset: 6790016)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 192, elements: !114)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !83, file: !53, line: 601, baseType: !7, size: 32, offset: 6790208)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !83, file: !53, line: 602, baseType: !7, size: 32, offset: 6790240)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !83, file: !53, line: 603, baseType: !7, size: 32, offset: 6790272)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "width_cr", scope: !83, file: !53, line: 604, baseType: !7, size: 32, offset: 6790304)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "height_cr", scope: !83, file: !53, line: 605, baseType: !7, size: 32, offset: 6790336)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode", scope: !83, file: !53, line: 607, baseType: !452, size: 64, offset: 6790400)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ipredmode_JV", scope: !83, file: !53, line: 608, baseType: !454, size: 192, offset: 6790464)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 192, elements: !114)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "nz_coeff", scope: !83, file: !53, line: 609, baseType: !456, size: 64, offset: 6790656)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "siblock", scope: !83, file: !53, line: 610, baseType: !346, size: 64, offset: 6790720)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "siblock_JV", scope: !83, file: !53, line: 611, baseType: !460, size: 192, offset: 6790784)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 192, elements: !114)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "newframe", scope: !83, file: !53, line: 613, baseType: !7, size: 32, offset: 6790976)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !83, file: !53, line: 614, baseType: !7, size: 32, offset: 6791008)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "pNextSlice", scope: !83, file: !53, line: 617, baseType: !441, size: 64, offset: 6791040)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data", scope: !83, file: !53, line: 618, baseType: !73, size: 64, offset: 6791104)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mb_data_JV", scope: !83, file: !53, line: 619, baseType: !466, size: 192, offset: 6791168)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 192, elements: !114)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ChromaArrayType", scope: !83, file: !53, line: 621, baseType: !7, size: 32, offset: 6791360)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_head", scope: !83, file: !53, line: 626, baseType: !469, size: 64, offset: 6791424)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "concealment_node", file: !53, line: 626, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "concealment_end", scope: !83, file: !53, line: 627, baseType: !469, size: 64, offset: 6791488)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pre_frame_num", scope: !83, file: !53, line: 629, baseType: !31, size: 32, offset: 6791552)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "non_conforming_stream", scope: !83, file: !53, line: 630, baseType: !7, size: 32, offset: 6791584)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntMsb", scope: !83, file: !53, line: 634, baseType: !7, size: 32, offset: 6791616)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "PrevPicOrderCntLsb", scope: !83, file: !53, line: 635, baseType: !31, size: 32, offset: 6791648)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedPicOrderCnt", scope: !83, file: !53, line: 638, baseType: !7, size: 32, offset: 6791680)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntCycleCnt", scope: !83, file: !53, line: 638, baseType: !7, size: 32, offset: 6791712)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumInPicOrderCntCycle", scope: !83, file: !53, line: 638, baseType: !7, size: 32, offset: 6791744)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNum", scope: !83, file: !53, line: 639, baseType: !31, size: 32, offset: 6791776)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "FrameNumOffset", scope: !83, file: !53, line: 639, baseType: !31, size: 32, offset: 6791808)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDeltaPerPicOrderCntCycle", scope: !83, file: !53, line: 640, baseType: !7, size: 32, offset: 6791840)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !83, file: !53, line: 641, baseType: !7, size: 32, offset: 6791872)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "PreviousFrameNumOffset", scope: !83, file: !53, line: 642, baseType: !7, size: 32, offset: 6791904)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "MaxFrameNum", scope: !83, file: !53, line: 645, baseType: !7, size: 32, offset: 6791936)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "PicWidthInMbs", scope: !83, file: !53, line: 647, baseType: !31, size: 32, offset: 6791968)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMapUnits", scope: !83, file: !53, line: 648, baseType: !31, size: 32, offset: 6792000)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "FrameHeightInMbs", scope: !83, file: !53, line: 649, baseType: !31, size: 32, offset: 6792032)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "PicHeightInMbs", scope: !83, file: !53, line: 650, baseType: !31, size: 32, offset: 6792064)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "PicSizeInMbs", scope: !83, file: !53, line: 651, baseType: !31, size: 32, offset: 6792096)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "FrameSizeInMbs", scope: !83, file: !53, line: 652, baseType: !31, size: 32, offset: 6792128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "oldFrameSizeInMbs", scope: !83, file: !53, line: 653, baseType: !31, size: 32, offset: 6792160)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !83, file: !53, line: 655, baseType: !7, size: 32, offset: 6792192)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "last_has_mmco_5", scope: !83, file: !53, line: 657, baseType: !7, size: 32, offset: 6792224)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "last_pic_bottom_field", scope: !83, file: !53, line: 658, baseType: !7, size: 32, offset: 6792256)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_bitsize_on_disk", scope: !83, file: !53, line: 661, baseType: !7, size: 32, offset: 6792288)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma", scope: !83, file: !53, line: 662, baseType: !497, size: 16, offset: 6792320)
!497 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma", scope: !83, file: !53, line: 663, baseType: !497, size: 16, offset: 6792336)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_scale", scope: !83, file: !53, line: 664, baseType: !412, size: 64, offset: 6792352)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_luma_qp_scale", scope: !83, file: !53, line: 665, baseType: !7, size: 32, offset: 6792416)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bitdepth_chroma_qp_scale", scope: !83, file: !53, line: 666, baseType: !7, size: 32, offset: 6792448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "dc_pred_value_comp", scope: !83, file: !53, line: 667, baseType: !503, size: 96, offset: 6792480)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 96, elements: !114)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "max_pel_value_comp", scope: !83, file: !53, line: 668, baseType: !113, size: 96, offset: 6792576)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !83, file: !53, line: 670, baseType: !7, size: 32, offset: 6792672)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "yuv_format", scope: !83, file: !53, line: 671, baseType: !7, size: 32, offset: 6792704)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "lossless_qpprime_flag", scope: !83, file: !53, line: 672, baseType: !7, size: 32, offset: 6792736)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "num_blk8x8_uv", scope: !83, file: !53, line: 673, baseType: !7, size: 32, offset: 6792768)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "num_uv_blocks", scope: !83, file: !53, line: 674, baseType: !7, size: 32, offset: 6792800)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "num_cdc_coeff", scope: !83, file: !53, line: 675, baseType: !7, size: 32, offset: 6792832)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x", scope: !83, file: !53, line: 676, baseType: !7, size: 32, offset: 6792864)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y", scope: !83, file: !53, line: 677, baseType: !7, size: 32, offset: 6792896)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_x_blk", scope: !83, file: !53, line: 678, baseType: !7, size: 32, offset: 6792928)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cr_size_y_blk", scope: !83, file: !53, line: 679, baseType: !7, size: 32, offset: 6792960)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size", scope: !83, file: !53, line: 680, baseType: !516, size: 192, offset: 6792992)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 192, elements: !517)
!517 = !{!115, !414}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_blk", scope: !83, file: !53, line: 681, baseType: !516, size: 192, offset: 6793184)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mb_size_shift", scope: !83, file: !53, line: 682, baseType: !516, size: 192, offset: 6793376)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_x", scope: !83, file: !53, line: 683, baseType: !7, size: 32, offset: 6793568)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "subpel_y", scope: !83, file: !53, line: 684, baseType: !7, size: 32, offset: 6793600)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_x", scope: !83, file: !53, line: 685, baseType: !7, size: 32, offset: 6793632)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "shiftpel_y", scope: !83, file: !53, line: 686, baseType: !7, size: 32, offset: 6793664)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "total_scale", scope: !83, file: !53, line: 687, baseType: !7, size: 32, offset: 6793696)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "max_vmv_r", scope: !83, file: !53, line: 689, baseType: !7, size: 32, offset: 6793728)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "idr_psnr_number", scope: !83, file: !53, line: 692, baseType: !7, size: 32, offset: 6793760)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "psnr_number", scope: !83, file: !53, line: 693, baseType: !7, size: 32, offset: 6793792)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "last_ref_pic_poc", scope: !83, file: !53, line: 700, baseType: !7, size: 32, offset: 6793824)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc_gap", scope: !83, file: !53, line: 701, baseType: !7, size: 32, offset: 6793856)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "poc_gap", scope: !83, file: !53, line: 702, baseType: !7, size: 32, offset: 6793888)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_mode", scope: !83, file: !53, line: 703, baseType: !7, size: 32, offset: 6793920)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "earlier_missing_poc", scope: !83, file: !53, line: 704, baseType: !7, size: 32, offset: 6793952)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_conceal", scope: !83, file: !53, line: 705, baseType: !31, size: 32, offset: 6793984)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "IDR_concealment_flag", scope: !83, file: !53, line: 706, baseType: !7, size: 32, offset: 6794016)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "conceal_slice_type", scope: !83, file: !53, line: 707, baseType: !7, size: 32, offset: 6794048)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point", scope: !83, file: !53, line: 710, baseType: !7, size: 32, offset: 6794080)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_point_found", scope: !83, file: !53, line: 711, baseType: !7, size: 32, offset: 6794112)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_cnt", scope: !83, file: !53, line: 712, baseType: !7, size: 32, offset: 6794144)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_frame_num", scope: !83, file: !53, line: 713, baseType: !7, size: 32, offset: 6794176)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_poc", scope: !83, file: !53, line: 714, baseType: !7, size: 32, offset: 6794208)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !83, file: !53, line: 716, baseType: !7, size: 32, offset: 6794240)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pic_unit_size_on_disk", scope: !83, file: !53, line: 717, baseType: !7, size: 32, offset: 6794272)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !83, file: !53, line: 719, baseType: !212, size: 64, offset: 6794304)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ibuf", scope: !83, file: !53, line: 720, baseType: !212, size: 64, offset: 6794368)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "imgData", scope: !83, file: !53, line: 722, baseType: !546, size: 2560, offset: 6794432)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "ImageData", file: !547, line: 38, baseType: !548)
!547 = !DIFile(filename: "ldecod_src/inc/io_image.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "8caef624e6f5391b0c6ab2984e7f77c6")
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "image_data", file: !547, line: 20, size: 2560, elements: !549)
!549 = !{!550, !551, !557, !558, !559, !563, !564, !565, !566, !567}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !548, file: !547, line: 22, baseType: !103, size: 1088)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "frm_data", scope: !548, file: !547, line: 24, baseType: !552, size: 192, offset: 1088)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 192, elements: !114)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "imgpel", file: !214, line: 41, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16", file: !214, line: 23, baseType: !281)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "top_data", scope: !548, file: !547, line: 25, baseType: !552, size: 192, offset: 1280)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "bot_data", scope: !548, file: !547, line: 26, baseType: !552, size: 192, offset: 1472)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "frm_uint16", scope: !548, file: !547, line: 31, baseType: !560, size: 192, offset: 1664)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 192, elements: !114)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "top_uint16", scope: !548, file: !547, line: 32, baseType: !560, size: 192, offset: 1856)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "bot_uint16", scope: !548, file: !547, line: 33, baseType: !560, size: 192, offset: 2048)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "frm_stride", scope: !548, file: !547, line: 35, baseType: !113, size: 96, offset: 2240)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "top_stride", scope: !548, file: !547, line: 36, baseType: !113, size: 96, offset: 2336)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "bot_stride", scope: !548, file: !547, line: 37, baseType: !113, size: 96, offset: 2432)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "imgData0", scope: !83, file: !53, line: 723, baseType: !546, size: 2560, offset: 6796992)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "imgData1", scope: !83, file: !53, line: 724, baseType: !546, size: 2560, offset: 6799552)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "imgData2", scope: !83, file: !53, line: 725, baseType: !546, size: 2560, offset: 6802112)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "imgData32", scope: !83, file: !53, line: 728, baseType: !546, size: 2560, offset: 6804672)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "imgData4", scope: !83, file: !53, line: 729, baseType: !546, size: 2560, offset: 6807232)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "imgData5", scope: !83, file: !53, line: 730, baseType: !546, size: 2560, offset: 6809792)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "imgData6", scope: !83, file: !53, line: 731, baseType: !546, size: 2560, offset: 6812352)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "previous_frame_num", scope: !83, file: !53, line: 735, baseType: !31, size: 32, offset: 6814912)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Is_primary_correct", scope: !83, file: !53, line: 737, baseType: !7, size: 32, offset: 6814944)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "Is_redundant_correct", scope: !83, file: !53, line: 738, baseType: !7, size: 32, offset: 6814976)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "tot_time", scope: !83, file: !53, line: 741, baseType: !579, size: 64, offset: 6815040)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64", file: !580, line: 103, baseType: !581)
!580 = !DIFile(filename: "ldecod_src/inc/win32.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "100def0ffeee72ecdc377183538a04bb")
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !582, line: 27, baseType: !583)
!582 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !584, line: 44, baseType: !585)
!584 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!585 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "p_out", scope: !83, file: !53, line: 744, baseType: !7, size: 32, offset: 6815104)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "p_out_mvc", scope: !83, file: !53, line: 746, baseType: !588, size: 32768, offset: 6815136)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32768, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 1024)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "p_ref", scope: !83, file: !53, line: 748, baseType: !7, size: 32, offset: 6847904)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "LastAccessUnitExists", scope: !83, file: !53, line: 751, baseType: !7, size: 32, offset: 6847936)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "NALUCount", scope: !83, file: !53, line: 752, baseType: !7, size: 32, offset: 6847968)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "Bframe_ctr", scope: !83, file: !53, line: 755, baseType: !7, size: 32, offset: 6848000)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "frame_no", scope: !83, file: !53, line: 756, baseType: !7, size: 32, offset: 6848032)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "g_nFrame", scope: !83, file: !53, line: 758, baseType: !7, size: 32, offset: 6848064)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "global_init_done", scope: !83, file: !53, line: 759, baseType: !7, size: 32, offset: 6848096)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "imgY_ref", scope: !83, file: !53, line: 762, baseType: !553, size: 64, offset: 6848128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "imgUV_ref", scope: !83, file: !53, line: 763, baseType: !600, size: 64, offset: 6848192)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "qp_per_matrix", scope: !83, file: !53, line: 765, baseType: !68, size: 64, offset: 6848256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "qp_rem_matrix", scope: !83, file: !53, line: 766, baseType: !68, size: 64, offset: 6848320)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "last_out_fs", scope: !83, file: !53, line: 768, baseType: !604, size: 64, offset: 6848384)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "frame_store", file: !53, line: 514, flags: DIFlagFwdDecl)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pocs_in_dpb", scope: !83, file: !53, line: 769, baseType: !607, size: 3200, offset: 6848448)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 3200, elements: !608)
!608 = !{!609}
!609 = !DISubrange(count: 100)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture", scope: !83, file: !53, line: 771, baseType: !611, size: 64, offset: 6851648)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "storable_picture", file: !53, line: 141, flags: DIFlagFwdDecl)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "dec_picture_JV", scope: !83, file: !53, line: 772, baseType: !614, size: 192, offset: 6851712)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 192, elements: !114)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "no_reference_picture", scope: !83, file: !53, line: 773, baseType: !611, size: 64, offset: 6851904)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "erc_object_list", scope: !83, file: !53, line: 776, baseType: !617, size: 64, offset: 6851968)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "object_buffer", file: !53, line: 776, flags: DIFlagFwdDecl)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "erc_errorVar", scope: !83, file: !53, line: 777, baseType: !620, size: 64, offset: 6852032)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "ercVariables_s", file: !53, line: 777, flags: DIFlagFwdDecl)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "erc_mvperMB", scope: !83, file: !53, line: 779, baseType: !7, size: 32, offset: 6852096)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "erc_img", scope: !83, file: !53, line: 780, baseType: !82, size: 64, offset: 6852160)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ec_flag", scope: !83, file: !53, line: 781, baseType: !625, size: 640, offset: 6852224)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 640, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 20)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "annex_b", scope: !83, file: !53, line: 783, baseType: !629, size: 64, offset: 6852864)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "annex_b_struct", file: !53, line: 783, flags: DIFlagFwdDecl)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "bitsfile", scope: !83, file: !53, line: 784, baseType: !632, size: 64, offset: 6852928)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_structure_type, name: "sBitsFile", file: !53, line: 784, flags: DIFlagFwdDecl)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "out_buffer", scope: !83, file: !53, line: 786, baseType: !604, size: 64, offset: 6852992)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output", scope: !83, file: !53, line: 788, baseType: !611, size: 64, offset: 6853056)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "pending_output_state", scope: !83, file: !53, line: 789, baseType: !7, size: 32, offset: 6853120)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "recovery_flag", scope: !83, file: !53, line: 790, baseType: !7, size: 32, offset: 6853152)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "BitStreamFile", scope: !83, file: !53, line: 792, baseType: !7, size: 32, offset: 6853184)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !83, file: !53, line: 794, baseType: !640, size: 64, offset: 6853248)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "decoded_picture_buffer", file: !53, line: 350, flags: DIFlagFwdDecl)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb_legacy", scope: !83, file: !53, line: 795, baseType: !640, size: 64, offset: 6853312)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb_layer", scope: !83, file: !53, line: 796, baseType: !644, size: 128, offset: 6853376)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 128, elements: !413)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "cslice_type", scope: !83, file: !53, line: 800, baseType: !646, size: 72, offset: 6853504)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 72, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 9)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "MbToSliceGroupMap", scope: !83, file: !53, line: 802, baseType: !68, size: 64, offset: 6853632)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "MapUnitToSliceGroupMap", scope: !83, file: !53, line: 803, baseType: !68, size: 64, offset: 6853696)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOfSliceGroups", scope: !83, file: !53, line: 804, baseType: !7, size: 32, offset: 6853760)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "seiToneMapping", scope: !83, file: !53, line: 807, baseType: !653, size: 64, offset: 6853824)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "tone_mapping_struct_s", file: !53, line: 807, flags: DIFlagFwdDecl)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "buf2img", scope: !83, file: !53, line: 810, baseType: !656, size: 64, offset: 6853888)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !553, !659, !7, !7, !7, !7, !7, !7}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "getNeighbour", scope: !83, file: !53, line: 811, baseType: !661, size: 64, offset: 6853952)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DISubroutineType(types: !663)
!663 = !{null, !73, !7, !7, !68, !664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixelPos", file: !53, line: 85, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pix_pos", file: !53, line: 77, size: 128, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !666, file: !53, line: 79, baseType: !7, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "mb_addr", scope: !666, file: !53, line: 80, baseType: !7, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !666, file: !53, line: 81, baseType: !497, size: 16, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !666, file: !53, line: 82, baseType: !497, size: 16, offset: 80)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pos_x", scope: !666, file: !53, line: 83, baseType: !497, size: 16, offset: 96)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "pos_y", scope: !666, file: !53, line: 84, baseType: !497, size: 16, offset: 112)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "get_mb_block_pos", scope: !83, file: !53, line: 812, baseType: !675, size: 64, offset: 6854016)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !7, !678, !678}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "GetStrengthVer", scope: !83, file: !53, line: 813, baseType: !680, size: 64, offset: 6854080)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{null, !212, !73, !7, !7, !611}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "GetStrengthHor", scope: !83, file: !53, line: 814, baseType: !680, size: 64, offset: 6854144)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "EdgeLoopLumaVer", scope: !83, file: !53, line: 815, baseType: !685, size: 64, offset: 6854208)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !688, !553, !212, !73, !7, !611}
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorPlane", file: !30, line: 32, baseType: !29)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "EdgeLoopLumaHor", scope: !83, file: !53, line: 816, baseType: !685, size: 64, offset: 6854272)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "EdgeLoopChromaVer", scope: !83, file: !53, line: 817, baseType: !691, size: 64, offset: 6854336)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !553, !212, !73, !7, !7, !611}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "EdgeLoopChromaHor", scope: !83, file: !53, line: 818, baseType: !691, size: 64, offset: 6854400)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "img2buf", scope: !83, file: !53, line: 819, baseType: !696, size: 64, offset: 6854464)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !553, !659, !7, !7, !7, !7, !7, !7, !7, !7}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "pDecOuputPic", scope: !83, file: !53, line: 821, baseType: !700, size: 64, offset: 6854528)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodedPicList", file: !53, line: 561, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "decodedpic_t", file: !53, line: 544, size: 640, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bValid", scope: !702, file: !53, line: 546, baseType: !7, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "iViewId", scope: !702, file: !53, line: 547, baseType: !7, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "iPOC", scope: !702, file: !53, line: 548, baseType: !7, size: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "iYUVFormat", scope: !702, file: !53, line: 549, baseType: !7, size: 32, offset: 96)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "iYUVStorageFormat", scope: !702, file: !53, line: 550, baseType: !7, size: 32, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "iBitDepth", scope: !702, file: !53, line: 551, baseType: !7, size: 32, offset: 160)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pY", scope: !702, file: !53, line: 552, baseType: !212, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "pU", scope: !702, file: !53, line: 553, baseType: !212, size: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "pV", scope: !702, file: !53, line: 554, baseType: !212, size: 64, offset: 320)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "iWidth", scope: !702, file: !53, line: 555, baseType: !7, size: 32, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "iHeight", scope: !702, file: !53, line: 556, baseType: !7, size: 32, offset: 416)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "iYBufStride", scope: !702, file: !53, line: 557, baseType: !7, size: 32, offset: 448)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "iUVBufStride", scope: !702, file: !53, line: 558, baseType: !7, size: 32, offset: 480)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "iSkipPicNum", scope: !702, file: !53, line: 559, baseType: !7, size: 32, offset: 512)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "pNext", scope: !702, file: !53, line: 560, baseType: !719, size: 64, offset: 576)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "iDeblockMode", scope: !83, file: !53, line: 822, baseType: !7, size: 32, offset: 6854592)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "nalu", scope: !83, file: !53, line: 823, baseType: !722, size: 64, offset: 6854656)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "nalu_t", file: !53, line: 823, flags: DIFlagFwdDecl)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadX", scope: !83, file: !53, line: 824, baseType: !7, size: 32, offset: 6854720)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "iLumaPadY", scope: !83, file: !53, line: 825, baseType: !7, size: 32, offset: 6854752)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadX", scope: !83, file: !53, line: 826, baseType: !7, size: 32, offset: 6854784)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "iChromaPadY", scope: !83, file: !53, line: 827, baseType: !7, size: 32, offset: 6854816)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "bDeblockEnable", scope: !83, file: !53, line: 829, baseType: !7, size: 32, offset: 6854848)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "iPostProcess", scope: !83, file: !53, line: 830, baseType: !7, size: 32, offset: 6854880)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "bFrameInit", scope: !83, file: !53, line: 831, baseType: !7, size: 32, offset: 6854912)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "pNextPPS", scope: !83, file: !53, line: 835, baseType: !171, size: 64, offset: 6854976)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "p_Inp", scope: !79, file: !53, line: 344, baseType: !86, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "active_pps", scope: !79, file: !53, line: 345, baseType: !171, size: 64, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "active_sps", scope: !79, file: !53, line: 346, baseType: !228, size: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "svc_extension_flag", scope: !79, file: !53, line: 347, baseType: !7, size: 32, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "p_Dpb", scope: !79, file: !53, line: 350, baseType: !640, size: 64, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "idr_flag", scope: !79, file: !53, line: 353, baseType: !7, size: 32, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pic_id", scope: !79, file: !53, line: 354, baseType: !7, size: 32, offset: 416)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "nal_reference_idc", scope: !79, file: !53, line: 355, baseType: !7, size: 32, offset: 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Transform8x8Mode", scope: !79, file: !53, line: 356, baseType: !7, size: 32, offset: 480)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "is_not_independent", scope: !79, file: !53, line: 357, baseType: !7, size: 32, offset: 512)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "toppoc", scope: !79, file: !53, line: 359, baseType: !7, size: 32, offset: 544)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "bottompoc", scope: !79, file: !53, line: 360, baseType: !7, size: 32, offset: 576)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "framepoc", scope: !79, file: !53, line: 361, baseType: !7, size: 32, offset: 608)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_cnt_lsb", scope: !79, file: !53, line: 365, baseType: !31, size: 32, offset: 640)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt_bottom", scope: !79, file: !53, line: 366, baseType: !7, size: 32, offset: 672)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_cnt", scope: !79, file: !53, line: 368, baseType: !412, size: 64, offset: 704)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "PicOrderCntMsb", scope: !79, file: !53, line: 372, baseType: !7, size: 32, offset: 768)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "AbsFrameNum", scope: !79, file: !53, line: 378, baseType: !31, size: 32, offset: 800)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ThisPOC", scope: !79, file: !53, line: 379, baseType: !7, size: 32, offset: 832)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "current_mb_nr", scope: !79, file: !53, line: 387, baseType: !31, size: 32, offset: 864)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "num_dec_mb", scope: !79, file: !53, line: 388, baseType: !31, size: 32, offset: 896)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "current_slice_nr", scope: !79, file: !53, line: 389, baseType: !497, size: 16, offset: 928)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "cod_counter", scope: !79, file: !53, line: 396, baseType: !7, size: 32, offset: 960)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "allrefzero", scope: !79, file: !53, line: 397, baseType: !7, size: 32, offset: 992)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff_frame_flag", scope: !79, file: !53, line: 400, baseType: !7, size: 32, offset: 1024)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "direct_spatial_mv_pred_flag", scope: !79, file: !53, line: 401, baseType: !7, size: 32, offset: 1056)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_active", scope: !79, file: !53, line: 402, baseType: !412, size: 64, offset: 1088)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ei_flag", scope: !79, file: !53, line: 406, baseType: !7, size: 32, offset: 1152)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !79, file: !53, line: 407, baseType: !7, size: 32, offset: 1184)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qp_delta", scope: !79, file: !53, line: 408, baseType: !7, size: 32, offset: 1216)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "qs", scope: !79, file: !53, line: 409, baseType: !7, size: 32, offset: 1248)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "slice_qs_delta", scope: !79, file: !53, line: 410, baseType: !7, size: 32, offset: 1280)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "slice_type", scope: !79, file: !53, line: 411, baseType: !7, size: 32, offset: 1312)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "model_number", scope: !79, file: !53, line: 412, baseType: !7, size: 32, offset: 1344)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !79, file: !53, line: 413, baseType: !31, size: 32, offset: 1376)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "field_pic_flag", scope: !79, file: !53, line: 414, baseType: !31, size: 32, offset: 1408)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_field_flag", scope: !79, file: !53, line: 415, baseType: !213, size: 8, offset: 1440)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "structure", scope: !79, file: !53, line: 416, baseType: !770, size: 32, offset: 1472)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "PictureStructure", file: !30, line: 140, baseType: !39)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "start_mb_nr", scope: !79, file: !53, line: 417, baseType: !7, size: 32, offset: 1504)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "end_mb_nr_plus1", scope: !79, file: !53, line: 418, baseType: !7, size: 32, offset: 1536)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "max_part_nr", scope: !79, file: !53, line: 419, baseType: !7, size: 32, offset: 1568)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "dp_mode", scope: !79, file: !53, line: 420, baseType: !7, size: 32, offset: 1600)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "current_header", scope: !79, file: !53, line: 421, baseType: !7, size: 32, offset: 1632)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "next_header", scope: !79, file: !53, line: 422, baseType: !7, size: 32, offset: 1664)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "last_dquant", scope: !79, file: !53, line: 423, baseType: !7, size: 32, offset: 1696)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "colour_plane_id", scope: !79, file: !53, line: 426, baseType: !7, size: 32, offset: 1728)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt", scope: !79, file: !53, line: 427, baseType: !7, size: 32, offset: 1760)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "sp_switch", scope: !79, file: !53, line: 428, baseType: !7, size: 32, offset: 1792)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_change_cycle", scope: !79, file: !53, line: 429, baseType: !7, size: 32, offset: 1824)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_slice_ref_idx", scope: !79, file: !53, line: 430, baseType: !7, size: 32, offset: 1856)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !79, file: !53, line: 431, baseType: !7, size: 32, offset: 1888)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_reference_flag", scope: !79, file: !53, line: 432, baseType: !7, size: 32, offset: 1920)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "adaptive_ref_pic_buffering_flag", scope: !79, file: !53, line: 433, baseType: !7, size: 32, offset: 1952)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "dec_ref_pic_marking_buffer", scope: !79, file: !53, line: 434, baseType: !787, size: 64, offset: 1984)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecRefPicMarking_t", file: !53, line: 194, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecRefPicMarking_s", file: !53, line: 186, size: 256, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "memory_management_control_operation", scope: !789, file: !53, line: 188, baseType: !7, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "difference_of_pic_nums_minus1", scope: !789, file: !53, line: 189, baseType: !7, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_pic_num", scope: !789, file: !53, line: 190, baseType: !7, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_frame_idx", scope: !789, file: !53, line: 191, baseType: !7, size: 32, offset: 96)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "max_long_term_frame_idx_plus1", scope: !789, file: !53, line: 192, baseType: !7, size: 32, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Next", scope: !789, file: !53, line: 193, baseType: !797, size: 64, offset: 192)
