; ModuleID = 'x264_src/output/flv.c'
source_filename = "x264_src/output/flv.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cli_output_t = type { ptr, ptr, ptr, ptr, ptr }

@flv_output = dso_local local_unnamed_addr constant %struct.cli_output_t { ptr @open_file, ptr @set_param, ptr @write_headers, ptr @write_frame, ptr @close_file }, align 8, !dbg !0
@.str = private unnamed_addr constant [4 x i8] c"FLV\00", align 1, !dbg !47
@.str.1 = private unnamed_addr constant [11 x i8] c"onMetaData\00", align 1, !dbg !53
@.str.2 = private unnamed_addr constant [6 x i8] c"width\00", align 1, !dbg !58
@.str.3 = private unnamed_addr constant [7 x i8] c"height\00", align 1, !dbg !63
@.str.4 = private unnamed_addr constant [10 x i8] c"framerate\00", align 1, !dbg !68
@.str.5 = private unnamed_addr constant [13 x i8] c"videocodecid\00", align 1, !dbg !73
@.str.6 = private unnamed_addr constant [9 x i8] c"duration\00", align 1, !dbg !78
@.str.7 = private unnamed_addr constant [9 x i8] c"filesize\00", align 1, !dbg !83
@.str.8 = private unnamed_addr constant [14 x i8] c"videodatarate\00", align 1, !dbg !85
@.str.9 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !90
@stderr = external local_unnamed_addr global ptr, align 8

!36 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !38, line: 27, baseType: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !40, line: 44, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!41 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !43, line: 27, baseType: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !40, line: 45, baseType: !45)
!45 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!46 = !{!0, !47, !53, !58, !63, !68, !73, !78, !83, !85, !90, !95, !100}
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(scope: null, file: !3, line: 59, type: !49, isLocal: true, isDefinition: true)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 32, elements: !51)
!50 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!51 = !{!52}
!52 = !DISubrange(count: 4)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(scope: null, file: !3, line: 99, type: !55, isLocal: true, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 88, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 11)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(scope: null, file: !3, line: 104, type: !60, isLocal: true, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 48, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 6)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(scope: null, file: !3, line: 107, type: !65, isLocal: true, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 56, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 7)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(scope: null, file: !3, line: 110, type: !70, isLocal: true, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 80, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 10)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(scope: null, file: !3, line: 120, type: !75, isLocal: true, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 104, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 13)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(scope: null, file: !3, line: 123, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 72, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 9)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(scope: null, file: !3, line: 127, type: !80, isLocal: true, isDefinition: true)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(scope: null, file: !3, line: 131, type: !87, isLocal: true, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 112, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 14)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(scope: null, file: !3, line: 135, type: !92, isLocal: true, isDefinition: true)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 1)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(scope: null, file: !3, line: 226, type: !97, isLocal: true, isDefinition: true)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 936, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 117)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(scope: null, file: !3, line: 232, type: !102, isLocal: true, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 960, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 120)
!105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_output_t", file: !107, line: 34, baseType: !108)
!107 = !DIFile(filename: "x264_src/output/output.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "2609bd03b72b40b15579de35b2e5f690")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !107, line: 27, size: 320, elements: !109)
!109 = !{!110, !119, !296, !309, !343}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "open_file", scope: !108, file: !107, line: 29, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!114, !115, !116}
!114 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "hnd_t", file: !118, line: 30, baseType: !35)
!118 = !DIFile(filename: "x264_src/muxers.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "bcea0820748b2dc47392b7f6393a96ff")
!119 = !DIDerivedType(tag: DW_TAG_member, name: "set_param", scope: !108, file: !107, line: 30, baseType: !120, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{!114, !117, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !125, line: 376, baseType: !126)
!125 = !DIFile(filename: "x264_src/x264.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !125, line: 176, size: 5632, elements: !127)
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !176, !177, !178, !179, !183, !184, !197, !198, !199, !200, !201, !232, !274, !275, !276, !277, !278, !279, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !126, file: !125, line: 179, baseType: !7, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !126, file: !125, line: 180, baseType: !114, size: 32, offset: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !126, file: !125, line: 181, baseType: !114, size: 32, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !126, file: !125, line: 182, baseType: !114, size: 32, offset: 96)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !126, file: !125, line: 183, baseType: !114, size: 32, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !126, file: !125, line: 186, baseType: !114, size: 32, offset: 160)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !126, file: !125, line: 187, baseType: !114, size: 32, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !126, file: !125, line: 188, baseType: !114, size: 32, offset: 224)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !126, file: !125, line: 189, baseType: !114, size: 32, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !126, file: !125, line: 190, baseType: !114, size: 32, offset: 288)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !126, file: !125, line: 198, baseType: !114, size: 32, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !126, file: !125, line: 215, baseType: !140, size: 288, offset: 352)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !126, file: !125, line: 200, size: 288, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147, !148, !149, !150}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !140, file: !125, line: 203, baseType: !114, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !140, file: !125, line: 204, baseType: !114, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !140, file: !125, line: 206, baseType: !114, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !140, file: !125, line: 209, baseType: !114, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !140, file: !125, line: 210, baseType: !114, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !140, file: !125, line: 211, baseType: !114, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !140, file: !125, line: 212, baseType: !114, size: 32, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !140, file: !125, line: 213, baseType: !114, size: 32, offset: 224)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !140, file: !125, line: 214, baseType: !114, size: 32, offset: 256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !126, file: !125, line: 218, baseType: !114, size: 32, offset: 640)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !126, file: !125, line: 219, baseType: !114, size: 32, offset: 672)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !126, file: !125, line: 220, baseType: !114, size: 32, offset: 704)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !126, file: !125, line: 221, baseType: !114, size: 32, offset: 736)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !126, file: !125, line: 222, baseType: !114, size: 32, offset: 768)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !126, file: !125, line: 224, baseType: !114, size: 32, offset: 800)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !126, file: !125, line: 225, baseType: !114, size: 32, offset: 832)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !126, file: !125, line: 226, baseType: !114, size: 32, offset: 864)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !126, file: !125, line: 227, baseType: !114, size: 32, offset: 896)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !126, file: !125, line: 229, baseType: !114, size: 32, offset: 928)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !126, file: !125, line: 230, baseType: !114, size: 32, offset: 960)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !126, file: !125, line: 231, baseType: !114, size: 32, offset: 992)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !126, file: !125, line: 233, baseType: !114, size: 32, offset: 1024)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !126, file: !125, line: 234, baseType: !114, size: 32, offset: 1056)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !126, file: !125, line: 236, baseType: !114, size: 32, offset: 1088)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !126, file: !125, line: 237, baseType: !114, size: 32, offset: 1120)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !126, file: !125, line: 239, baseType: !114, size: 32, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !126, file: !125, line: 240, baseType: !115, size: 64, offset: 1216)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !126, file: !125, line: 241, baseType: !170, size: 128, offset: 1280)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 128, elements: !174)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !43, line: 24, baseType: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !40, line: 38, baseType: !173)
!173 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!174 = !{!175}
!175 = !DISubrange(count: 16)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !126, file: !125, line: 242, baseType: !170, size: 128, offset: 1408)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !126, file: !125, line: 243, baseType: !170, size: 128, offset: 1536)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !126, file: !125, line: 244, baseType: !170, size: 128, offset: 1664)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !126, file: !125, line: 245, baseType: !180, size: 512, offset: 1792)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 512, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !126, file: !125, line: 246, baseType: !180, size: 512, offset: 2304)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !126, file: !125, line: 249, baseType: !185, size: 64, offset: 2816)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !35, !114, !188, !190}
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !192)
!192 = !{!193, !194, !195, !196}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !191, file: !3, line: 308, baseType: !7, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !191, file: !3, line: 308, baseType: !7, size: 32, offset: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !191, file: !3, line: 308, baseType: !35, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !191, file: !3, line: 308, baseType: !35, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !126, file: !125, line: 250, baseType: !35, size: 64, offset: 2880)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !126, file: !125, line: 251, baseType: !114, size: 32, offset: 2944)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !126, file: !125, line: 252, baseType: !114, size: 32, offset: 2976)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !126, file: !125, line: 253, baseType: !115, size: 64, offset: 3008)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !126, file: !125, line: 287, baseType: !202, size: 800, offset: 3072)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !126, file: !125, line: 256, size: 800, elements: !203)
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !224, !225, !226, !230, !231}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !202, file: !125, line: 258, baseType: !7, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !202, file: !125, line: 259, baseType: !7, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !202, file: !125, line: 261, baseType: !114, size: 32, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !202, file: !125, line: 262, baseType: !114, size: 32, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !202, file: !125, line: 263, baseType: !114, size: 32, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !202, file: !125, line: 264, baseType: !114, size: 32, offset: 160)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !202, file: !125, line: 265, baseType: !114, size: 32, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !202, file: !125, line: 267, baseType: !114, size: 32, offset: 224)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !202, file: !125, line: 268, baseType: !114, size: 32, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !202, file: !125, line: 269, baseType: !114, size: 32, offset: 288)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !202, file: !125, line: 270, baseType: !114, size: 32, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !202, file: !125, line: 271, baseType: !114, size: 32, offset: 352)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !202, file: !125, line: 272, baseType: !114, size: 32, offset: 384)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !202, file: !125, line: 273, baseType: !114, size: 32, offset: 416)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !202, file: !125, line: 274, baseType: !114, size: 32, offset: 448)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !202, file: !125, line: 275, baseType: !114, size: 32, offset: 480)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !202, file: !125, line: 276, baseType: !114, size: 32, offset: 512)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !202, file: !125, line: 277, baseType: !114, size: 32, offset: 544)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !202, file: !125, line: 278, baseType: !223, size: 32, offset: 576)
!223 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !202, file: !125, line: 279, baseType: !223, size: 32, offset: 608)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !202, file: !125, line: 280, baseType: !114, size: 32, offset: 640)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !202, file: !125, line: 283, baseType: !227, size: 64, offset: 672)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 64, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 2)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !202, file: !125, line: 285, baseType: !114, size: 32, offset: 736)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !202, file: !125, line: 286, baseType: !114, size: 32, offset: 768)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !126, file: !125, line: 327, baseType: !233, size: 1152, offset: 3904)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !126, file: !125, line: 290, size: 1152, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !272, !273}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !233, file: !125, line: 292, baseType: !114, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !233, file: !125, line: 294, baseType: !114, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !233, file: !125, line: 295, baseType: !114, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !233, file: !125, line: 296, baseType: !114, size: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !233, file: !125, line: 297, baseType: !114, size: 32, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !233, file: !125, line: 299, baseType: !114, size: 32, offset: 160)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !233, file: !125, line: 300, baseType: !223, size: 32, offset: 192)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !233, file: !125, line: 301, baseType: !223, size: 32, offset: 224)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !233, file: !125, line: 302, baseType: !223, size: 32, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !233, file: !125, line: 303, baseType: !114, size: 32, offset: 288)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !233, file: !125, line: 304, baseType: !114, size: 32, offset: 320)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !233, file: !125, line: 305, baseType: !223, size: 32, offset: 352)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !233, file: !125, line: 306, baseType: !223, size: 32, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !233, file: !125, line: 307, baseType: !223, size: 32, offset: 416)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !233, file: !125, line: 309, baseType: !114, size: 32, offset: 448)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !233, file: !125, line: 310, baseType: !223, size: 32, offset: 480)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !233, file: !125, line: 311, baseType: !114, size: 32, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !233, file: !125, line: 312, baseType: !114, size: 32, offset: 544)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !233, file: !125, line: 315, baseType: !114, size: 32, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !233, file: !125, line: 316, baseType: !115, size: 64, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !233, file: !125, line: 317, baseType: !114, size: 32, offset: 704)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !233, file: !125, line: 318, baseType: !115, size: 64, offset: 768)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !233, file: !125, line: 321, baseType: !223, size: 32, offset: 832)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !233, file: !125, line: 322, baseType: !223, size: 32, offset: 864)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !233, file: !125, line: 323, baseType: !223, size: 32, offset: 896)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !233, file: !125, line: 324, baseType: !261, size: 64, offset: 960)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !125, line: 174, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !125, line: 167, size: 256, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !263, file: !125, line: 169, baseType: !114, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !263, file: !125, line: 169, baseType: !114, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !263, file: !125, line: 170, baseType: !114, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !263, file: !125, line: 171, baseType: !114, size: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !263, file: !125, line: 172, baseType: !223, size: 32, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !263, file: !125, line: 173, baseType: !271, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !233, file: !125, line: 325, baseType: !114, size: 32, offset: 1024)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !233, file: !125, line: 326, baseType: !115, size: 64, offset: 1088)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !126, file: !125, line: 330, baseType: !114, size: 32, offset: 5056)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !126, file: !125, line: 331, baseType: !114, size: 32, offset: 5088)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !126, file: !125, line: 332, baseType: !114, size: 32, offset: 5120)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !126, file: !125, line: 334, baseType: !114, size: 32, offset: 5152)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !126, file: !125, line: 335, baseType: !114, size: 32, offset: 5184)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !126, file: !125, line: 336, baseType: !280, size: 32, offset: 5216)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !43, line: 26, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !40, line: 42, baseType: !7)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !126, file: !125, line: 337, baseType: !280, size: 32, offset: 5248)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !126, file: !125, line: 338, baseType: !280, size: 32, offset: 5280)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !126, file: !125, line: 339, baseType: !280, size: 32, offset: 5312)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !126, file: !125, line: 340, baseType: !114, size: 32, offset: 5344)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !126, file: !125, line: 344, baseType: !114, size: 32, offset: 5376)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !126, file: !125, line: 356, baseType: !114, size: 32, offset: 5408)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !126, file: !125, line: 364, baseType: !114, size: 32, offset: 5440)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !126, file: !125, line: 367, baseType: !114, size: 32, offset: 5472)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !126, file: !125, line: 368, baseType: !114, size: 32, offset: 5504)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !126, file: !125, line: 369, baseType: !114, size: 32, offset: 5536)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !126, file: !125, line: 375, baseType: !293, size: 64, offset: 5568)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DISubroutineType(types: !295)
!295 = !{null, !35}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "write_headers", scope: !108, file: !107, line: 31, baseType: !297, size: 64, offset: 128)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!114, !117, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !125, line: 604, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !125, line: 593, size: 192, elements: !303)
!303 = !{!304, !305, !306, !307}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !302, file: !125, line: 595, baseType: !114, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !302, file: !125, line: 596, baseType: !114, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !302, file: !125, line: 599, baseType: !114, size: 32, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !302, file: !125, line: 603, baseType: !308, size: 64, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "write_frame", scope: !108, file: !107, line: 32, baseType: !310, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DISubroutineType(types: !312)
!312 = !{!114, !117, !308, !114, !313}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_picture_t", file: !125, line: 549, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !125, line: 513, size: 1088, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323, !324, !334, !342}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !315, file: !125, line: 521, baseType: !114, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !315, file: !125, line: 523, baseType: !114, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !315, file: !125, line: 526, baseType: !114, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !315, file: !125, line: 529, baseType: !114, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !315, file: !125, line: 531, baseType: !37, size: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !315, file: !125, line: 534, baseType: !37, size: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !315, file: !125, line: 541, baseType: !123, size: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "img", scope: !315, file: !125, line: 543, baseType: !325, size: 448, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_image_t", file: !125, line: 511, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !125, line: 505, size: 448, elements: !327)
!327 = !{!328, !329, !330, !332}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !326, file: !125, line: 507, baseType: !114, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !326, file: !125, line: 508, baseType: !114, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !326, file: !125, line: 509, baseType: !331, size: 128, offset: 64)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 128, elements: !51)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !326, file: !125, line: 510, baseType: !333, size: 256, offset: 192)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 256, elements: !51)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !315, file: !125, line: 545, baseType: !335, size: 256, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !125, line: 503, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !125, line: 496, size: 256, elements: !337)
!337 = !{!338, !339, !340, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !336, file: !125, line: 498, baseType: !36, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !336, file: !125, line: 499, baseType: !36, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !336, file: !125, line: 500, baseType: !36, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !336, file: !125, line: 502, baseType: !36, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !315, file: !125, line: 548, baseType: !35, size: 64, offset: 1024)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "close_file", scope: !108, file: !107, line: 33, baseType: !344, size: 64, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DISubroutineType(types: !346)
!346 = !{!114, !117, !37, !37}
!347 = !{i32 7, !"Dwarf Version", i32 5}
!348 = !{i32 2, !"Debug Info Version", i32 3}
!349 = !{i32 1, !"wchar_size", i32 4}
!350 = !{i32 8, !"PIC Level", i32 2}
!351 = !{i32 7, !"PIE Level", i32 2}
!352 = !{i32 7, !"uwtable", i32 2}
!353 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!354 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!355 = distinct !DISubprogram(name: "open_file", scope: !3, file: !3, line: 68, type: !112, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !356)
!356 = !{!357, !358, !359}
!357 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !355, file: !3, line: 68, type: !115)
!358 = !DILocalVariable(name: "p_handle", arg: 2, scope: !355, file: !3, line: 68, type: !116)
!359 = !DILocalVariable(name: "p_flv", scope: !355, file: !3, line: 70, type: !360)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "flv_hnd_t", file: !3, line: 55, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 30, size: 960, elements: !363)
!363 = !{!364, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !362, file: !3, line: 32, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "flv_buffer", file: !6, line: 116, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flv_buffer", file: !6, line: 109, size: 256, elements: !368)
!368 = !{!369, !370, !371, !372, !426}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !367, file: !6, line: 111, baseType: !308, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "d_cur", scope: !367, file: !6, line: 112, baseType: !7, size: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "d_max", scope: !367, file: !6, line: 113, baseType: !7, size: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !367, file: !6, line: 114, baseType: !373, size: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !375, line: 7, baseType: !376)
!375 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !377, line: 49, size: 1728, elements: !378)
!377 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !394, !396, !397, !398, !400, !402, !404, !405, !408, !410, !413, !416, !417, !418, !421, !422}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !376, file: !377, line: 51, baseType: !114, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !376, file: !377, line: 54, baseType: !115, size: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !376, file: !377, line: 55, baseType: !115, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !376, file: !377, line: 56, baseType: !115, size: 64, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !376, file: !377, line: 57, baseType: !115, size: 64, offset: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !376, file: !377, line: 58, baseType: !115, size: 64, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !376, file: !377, line: 59, baseType: !115, size: 64, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !376, file: !377, line: 60, baseType: !115, size: 64, offset: 448)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !376, file: !377, line: 61, baseType: !115, size: 64, offset: 512)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !376, file: !377, line: 64, baseType: !115, size: 64, offset: 576)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !376, file: !377, line: 65, baseType: !115, size: 64, offset: 640)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !376, file: !377, line: 66, baseType: !115, size: 64, offset: 704)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !376, file: !377, line: 68, baseType: !392, size: 64, offset: 768)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !377, line: 36, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !376, file: !377, line: 70, baseType: !395, size: 64, offset: 832)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !376, file: !377, line: 72, baseType: !114, size: 32, offset: 896)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !376, file: !377, line: 73, baseType: !114, size: 32, offset: 928)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !376, file: !377, line: 74, baseType: !399, size: 64, offset: 960)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !40, line: 152, baseType: !41)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !376, file: !377, line: 77, baseType: !401, size: 16, offset: 1024)
!401 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !376, file: !377, line: 78, baseType: !403, size: 8, offset: 1040)
!403 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !376, file: !377, line: 79, baseType: !92, size: 8, offset: 1048)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !376, file: !377, line: 81, baseType: !406, size: 64, offset: 1088)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !377, line: 43, baseType: null)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !376, file: !377, line: 89, baseType: !409, size: 64, offset: 1152)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !40, line: 153, baseType: !41)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !376, file: !377, line: 91, baseType: !411, size: 64, offset: 1216)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !377, line: 37, flags: DIFlagFwdDecl)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !376, file: !377, line: 92, baseType: !414, size: 64, offset: 1280)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !377, line: 38, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !376, file: !377, line: 93, baseType: !395, size: 64, offset: 1344)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !376, file: !377, line: 94, baseType: !35, size: 64, offset: 1408)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !376, file: !377, line: 95, baseType: !419, size: 64, offset: 1472)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !420, line: 18, baseType: !45)
!420 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !376, file: !377, line: 96, baseType: !114, size: 32, offset: 1536)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !376, file: !377, line: 98, baseType: !423, size: 160, offset: 1568)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 160, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 20)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "d_total", scope: !367, file: !6, line: 115, baseType: !42, size: 64, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "sei", scope: !362, file: !3, line: 34, baseType: !308, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sei_len", scope: !362, file: !3, line: 35, baseType: !114, size: 32, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !362, file: !3, line: 37, baseType: !37, size: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !362, file: !3, line: 38, baseType: !37, size: 64, offset: 256)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "i_framenum", scope: !362, file: !3, line: 39, baseType: !37, size: 64, offset: 320)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "i_framerate_pos", scope: !362, file: !3, line: 41, baseType: !42, size: 64, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration_pos", scope: !362, file: !3, line: 42, baseType: !42, size: 64, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "i_filesize_pos", scope: !362, file: !3, line: 43, baseType: !42, size: 64, offset: 512)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate_pos", scope: !362, file: !3, line: 44, baseType: !42, size: 64, offset: 576)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "b_write_length", scope: !362, file: !3, line: 46, baseType: !171, size: 8, offset: 640)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_dts", scope: !362, file: !3, line: 47, baseType: !37, size: 64, offset: 704)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_pts", scope: !362, file: !3, line: 48, baseType: !37, size: 64, offset: 768)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !362, file: !3, line: 50, baseType: !280, size: 32, offset: 832)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !362, file: !3, line: 51, baseType: !280, size: 32, offset: 864)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !362, file: !3, line: 52, baseType: !114, size: 32, offset: 896)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !362, file: !3, line: 54, baseType: !7, size: 32, offset: 928)
!443 = !DILocation(line: 0, scope: !355)
!444 = !DILocation(line: 70, column: 24, scope: !355)
!445 = !DILocation(line: 71, column: 15, scope: !355)
!446 = !DILocation(line: 72, column: 10, scope: !447)
!447 = distinct !DILexicalBlock(scope: !355, file: !3, line: 72, column: 9)
!448 = !DILocation(line: 72, column: 9, scope: !355)
!449 = !DILocation(line: 76, column: 16, scope: !355)
!450 = !DILocation(line: 76, column: 14, scope: !355)
!451 = !DILocation(line: 77, column: 10, scope: !452)
!452 = distinct !DILexicalBlock(scope: !355, file: !3, line: 77, column: 9)
!453 = !DILocation(line: 77, column: 9, scope: !355)
!454 = !DILocalVariable(name: "c", arg: 1, scope: !455, file: !3, line: 57, type: !365)
!455 = distinct !DISubprogram(name: "write_header", scope: !3, file: !3, line: 57, type: !456, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !458)
!456 = !DISubroutineType(types: !457)
!457 = !{!114, !365}
!458 = !{!454}
!459 = !DILocation(line: 0, scope: !455, inlinedAt: !460)
!460 = distinct !DILocation(line: 80, column: 5, scope: !461)
!461 = distinct !DILexicalBlock(scope: !462, file: !3, line: 80, column: 5)
!462 = distinct !DILexicalBlock(scope: !355, file: !3, line: 80, column: 5)
!463 = !DILocation(line: 59, column: 5, scope: !455, inlinedAt: !460)
!464 = !DILocation(line: 60, column: 5, scope: !455, inlinedAt: !460)
!465 = !DILocation(line: 61, column: 5, scope: !455, inlinedAt: !460)
!466 = !DILocation(line: 62, column: 5, scope: !455, inlinedAt: !460)
!467 = !DILocation(line: 63, column: 5, scope: !455, inlinedAt: !460)
!468 = !DILocation(line: 65, column: 12, scope: !455, inlinedAt: !460)
!469 = !DILocation(line: 80, column: 5, scope: !461)
!470 = !DILocation(line: 80, column: 5, scope: !462)
!471 = !DILocation(line: 81, column: 15, scope: !355)
!472 = !DILocation(line: 83, column: 5, scope: !355)
!473 = !DILocation(line: 84, column: 1, scope: !355)
!474 = distinct !DISubprogram(name: "set_param", scope: !3, file: !3, line: 86, type: !121, scopeLine: 87, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !475)
!475 = !{!476, !477, !478, !479, !480, !481}
!476 = !DILocalVariable(name: "handle", arg: 1, scope: !474, file: !3, line: 86, type: !117)
!477 = !DILocalVariable(name: "p_param", arg: 2, scope: !474, file: !3, line: 86, type: !123)
!478 = !DILocalVariable(name: "p_flv", scope: !474, file: !3, line: 88, type: !360)
!479 = !DILocalVariable(name: "c", scope: !474, file: !3, line: 89, type: !365)
!480 = !DILocalVariable(name: "start", scope: !474, file: !3, line: 93, type: !114)
!481 = !DILocalVariable(name: "length", scope: !474, file: !3, line: 138, type: !7)
!482 = !DILocation(line: 0, scope: !474)
!483 = !DILocation(line: 89, column: 28, scope: !474)
!484 = !DILocation(line: 91, column: 5, scope: !474)
!485 = !DILocation(line: 93, column: 20, scope: !474)
!486 = !DILocation(line: 94, column: 5, scope: !474)
!487 = !DILocation(line: 95, column: 5, scope: !474)
!488 = !DILocation(line: 96, column: 5, scope: !474)
!489 = !DILocation(line: 98, column: 5, scope: !474)
!490 = !DILocation(line: 99, column: 5, scope: !474)
!491 = !DILocation(line: 101, column: 5, scope: !474)
!492 = !DILocation(line: 102, column: 5, scope: !474)
!493 = !DILocation(line: 104, column: 5, scope: !474)
!494 = !DILocation(line: 105, column: 38, scope: !474)
!495 = !DILocation(line: 105, column: 29, scope: !474)
!496 = !DILocation(line: 105, column: 5, scope: !474)
!497 = !DILocation(line: 107, column: 5, scope: !474)
!498 = !DILocation(line: 108, column: 38, scope: !474)
!499 = !DILocation(line: 108, column: 29, scope: !474)
!500 = !DILocation(line: 108, column: 5, scope: !474)
!501 = !DILocation(line: 110, column: 5, scope: !474)
