; ModuleID = 'x264_src/output/flv_bytestream.c'
source_filename = "x264_src/output/flv_bytestream.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@stdout = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [3 x i8] c"wb\00", align 1, !dbg !0

; Function Attrs: mustprogress nofree norecurse nosync nounwind willreturn memory(none) uwtable
define dso_local noundef i64 @dbl2int(double noundef %value) local_unnamed_addr #0 !dbg !47 {
entry:
    #dbg_value(double %value, !55, !DIExpression(), !61)
    #dbg_value(double %value, !56, !DIExpression(), !61)
  %0 = bitcast double %value to i64, !dbg !62
  ret i64 %0, !dbg !63
}

; Function Attrs: nounwind uwtable
define dso_local void @x264_put_byte(ptr nocapture noundef %c, i8 noundef zeroext %b) local_unnamed_addr #1 !dbg !64 {
entry:
    #dbg_value(ptr %c, !137, !DIExpression(), !139)
    #dbg_value(i8 %b, !138, !DIExpression(), !139)
    #dbg_value(ptr %c, !140, !DIExpression(), !152)
    #dbg_value(ptr undef, !145, !DIExpression(), !152)
    #dbg_value(i32 1, !146, !DIExpression(), !152)
  %d_cur.i = getelementptr inbounds i8, ptr %c, i64 8, !dbg !154
  %0 = load i32, ptr %d_cur.i, align 8, !dbg !154
  %add.i = add i32 %0, 1, !dbg !155
    #dbg_value(i32 %add.i, !147, !DIExpression(), !152)
  %d_max.i = getelementptr inbounds i8, ptr %c, i64 12, !dbg !156

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 104, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "x264_src/output/flv_bytestream.c", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "754853b2670cdf5b3e2e77d5a393aff1")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 3)
!7 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, retainedTypes: !26, globals: !33, splitDebugInlining: false, nameTableKind: None)
!8 = !{!9}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !10, line: 92, baseType: !11, size: 32, elements: !12)
!10 = !DIFile(filename: "x264_src/output/flv_bytestream.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "7a2361cbd7a5379baf9a3e8d1b18ee49")
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25}
!13 = !DIEnumerator(name: "AMF_DATA_TYPE_NUMBER", value: 0)
!14 = !DIEnumerator(name: "AMF_DATA_TYPE_BOOL", value: 1)
!15 = !DIEnumerator(name: "AMF_DATA_TYPE_STRING", value: 2)
!16 = !DIEnumerator(name: "AMF_DATA_TYPE_OBJECT", value: 3)
!17 = !DIEnumerator(name: "AMF_DATA_TYPE_NULL", value: 5)
!18 = !DIEnumerator(name: "AMF_DATA_TYPE_UNDEFINED", value: 6)
!19 = !DIEnumerator(name: "AMF_DATA_TYPE_REFERENCE", value: 7)
!20 = !DIEnumerator(name: "AMF_DATA_TYPE_MIXEDARRAY", value: 8)
!21 = !DIEnumerator(name: "AMF_DATA_TYPE_OBJECT_END", value: 9)
!22 = !DIEnumerator(name: "AMF_DATA_TYPE_ARRAY", value: 10)
!23 = !DIEnumerator(name: "AMF_DATA_TYPE_DATE", value: 11)
!24 = !DIEnumerator(name: "AMF_DATA_TYPE_LONG_STRING", value: 12)
!25 = !DIEnumerator(name: "AMF_DATA_TYPE_UNSUPPORTED", value: 13)
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !29, line: 24, baseType: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !31, line: 38, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !{!34, !0}
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(scope: null, file: !2, line: 101, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 2)
!39 = !{i32 7, !"Dwarf Version", i32 5}
!40 = !{i32 2, !"Debug Info Version", i32 3}
!41 = !{i32 1, !"wchar_size", i32 4}
!42 = !{i32 8, !"PIC Level", i32 2}
!43 = !{i32 7, !"PIE Level", i32 2}
!44 = !{i32 7, !"uwtable", i32 2}
!45 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!46 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!47 = distinct !DISubprogram(name: "dbl2int", scope: !2, file: !2, line: 24, type: !48, scopeLine: 25, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !54)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !53}
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !29, line: 27, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !31, line: 45, baseType: !52)
!52 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!53 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!54 = !{!55, !56}
!55 = !DILocalVariable(name: "value", arg: 1, scope: !47, file: !2, line: 24, type: !53)
!56 = !DILocalVariable(name: "cvrt", scope: !47, file: !2, line: 31, type: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "dbl2int_cvrt", scope: !47, file: !2, line: 28, size: 64, elements: !58)
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !57, file: !2, line: 29, baseType: !53, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !57, file: !2, line: 30, baseType: !50, size: 64)
!61 = !DILocation(line: 0, scope: !47)
!62 = !DILocation(line: 33, column: 16, scope: !47)
!63 = !DILocation(line: 33, column: 4, scope: !47)
!64 = distinct !DISubprogram(name: "x264_put_byte", scope: !2, file: !2, line: 41, type: !65, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !136)
!65 = !DISubroutineType(types: !66)
!66 = !{null, !67, !28}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "flv_buffer", file: !10, line: 116, baseType: !69)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "flv_buffer", file: !10, line: 109, size: 256, elements: !70)
!70 = !{!71, !72, !73, !74, !135}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !69, file: !10, line: 111, baseType: !27, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "d_cur", scope: !69, file: !10, line: 112, baseType: !11, size: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "d_max", scope: !69, file: !10, line: 113, baseType: !11, size: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !69, file: !10, line: 114, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !77, line: 7, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !79, line: 49, size: 1728, elements: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!80 = !{!81, !83, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !98, !100, !101, !102, !105, !107, !109, !113, !116, !118, !121, !124, !125, !127, !130, !131}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !79, line: 51, baseType: !82, size: 32)
!82 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !78, file: !79, line: 54, baseType: !84, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !78, file: !79, line: 55, baseType: !84, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !78, file: !79, line: 56, baseType: !84, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !78, file: !79, line: 57, baseType: !84, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !78, file: !79, line: 58, baseType: !84, size: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !78, file: !79, line: 59, baseType: !84, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !78, file: !79, line: 60, baseType: !84, size: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !78, file: !79, line: 61, baseType: !84, size: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !78, file: !79, line: 64, baseType: !84, size: 64, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !78, file: !79, line: 65, baseType: !84, size: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !78, file: !79, line: 66, baseType: !84, size: 64, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !78, file: !79, line: 68, baseType: !96, size: 64, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !79, line: 36, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !78, file: !79, line: 70, baseType: !99, size: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !78, file: !79, line: 72, baseType: !82, size: 32, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !78, file: !79, line: 73, baseType: !82, size: 32, offset: 928)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !78, file: !79, line: 74, baseType: !103, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !31, line: 152, baseType: !104)
!104 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !78, file: !79, line: 77, baseType: !106, size: 16, offset: 1024)
!106 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !78, file: !79, line: 78, baseType: !108, size: 8, offset: 1040)
!108 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !78, file: !79, line: 79, baseType: !110, size: 8, offset: 1048)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 1)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !78, file: !79, line: 81, baseType: !114, size: 64, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !79, line: 43, baseType: null)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !79, line: 89, baseType: !117, size: 64, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !31, line: 153, baseType: !104)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !78, file: !79, line: 91, baseType: !119, size: 64, offset: 1216)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !79, line: 37, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !78, file: !79, line: 92, baseType: !122, size: 64, offset: 1280)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !79, line: 38, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !78, file: !79, line: 93, baseType: !99, size: 64, offset: 1344)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !78, file: !79, line: 94, baseType: !126, size: 64, offset: 1408)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !78, file: !79, line: 95, baseType: !128, size: 64, offset: 1472)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !129, line: 18, baseType: !52)
!129 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !78, file: !79, line: 96, baseType: !82, size: 32, offset: 1536)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !78, file: !79, line: 98, baseType: !132, size: 160, offset: 1568)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 20)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "d_total", scope: !69, file: !10, line: 115, baseType: !50, size: 64, offset: 192)
!136 = !{!137, !138}
!137 = !DILocalVariable(name: "c", arg: 1, scope: !64, file: !2, line: 41, type: !67)
!138 = !DILocalVariable(name: "b", arg: 2, scope: !64, file: !2, line: 41, type: !28)
!139 = !DILocation(line: 0, scope: !64)
!140 = !DILocalVariable(name: "c", arg: 1, scope: !141, file: !2, line: 114, type: !67)
!141 = distinct !DISubprogram(name: "flv_append_data", scope: !2, file: !2, line: 114, type: !142, scopeLine: 115, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !7, retainedNodes: !144)
!142 = !DISubroutineType(types: !143)
!143 = !{!82, !67, !27, !11}
!144 = !{!140, !145, !146, !147, !148, !151}
!145 = !DILocalVariable(name: "data", arg: 2, scope: !141, file: !2, line: 114, type: !27)
!146 = !DILocalVariable(name: "size", arg: 3, scope: !141, file: !2, line: 114, type: !11)
!147 = !DILocalVariable(name: "ns", scope: !141, file: !2, line: 116, type: !11)
!148 = !DILocalVariable(name: "dp", scope: !149, file: !2, line: 120, type: !126)
!149 = distinct !DILexicalBlock(scope: !150, file: !2, line: 119, column: 5)
!150 = distinct !DILexicalBlock(scope: !141, file: !2, line: 118, column: 9)
!151 = !DILocalVariable(name: "dn", scope: !149, file: !2, line: 121, type: !11)
!152 = !DILocation(line: 0, scope: !141, inlinedAt: !153)
!153 = distinct !DILocation(line: 43, column: 5, scope: !64)
!154 = !DILocation(line: 116, column: 22, scope: !141, inlinedAt: !153)
!155 = !DILocation(line: 116, column: 28, scope: !141, inlinedAt: !153)
!156 = !DILocation(line: 118, column: 17, scope: !150, inlinedAt: !153)
!157 = !DILocation(line: 118, column: 12, scope: !150, inlinedAt: !153)
!158 = !DILocation(line: 118, column: 9, scope: !141, inlinedAt: !153)
!159 = !DILocation(line: 133, column: 16, scope: !141, inlinedAt: !153)
!160 = !DILocation(line: 0, scope: !149, inlinedAt: !153)
!161 = !DILocation(line: 122, column: 19, scope: !149, inlinedAt: !153)
!162 = !DILocation(line: 123, column: 16, scope: !149, inlinedAt: !153)
!163 = !DILocation(line: 122, column: 9, scope: !149, inlinedAt: !153)
!164 = distinct !{!164, !163, !165}
!165 = !DILocation(line: 123, column: 20, scope: !149, inlinedAt: !153)
!166 = !DILocation(line: 125, column: 26, scope: !149, inlinedAt: !153)
!167 = !DILocation(line: 125, column: 32, scope: !149, inlinedAt: !153)
!168 = !DILocation(line: 125, column: 14, scope: !149, inlinedAt: !153)
!169 = !DILocation(line: 126, column: 14, scope: !170, inlinedAt: !153)
!170 = distinct !DILexicalBlock(scope: !149, file: !2, line: 126, column: 13)
!171 = !DILocation(line: 126, column: 13, scope: !149, inlinedAt: !153)
!172 = !DILocation(line: 129, column: 17, scope: !149, inlinedAt: !153)
!173 = !DILocation(line: 130, column: 18, scope: !149, inlinedAt: !153)
!174 = !DILocation(line: 133, column: 26, scope: !141, inlinedAt: !153)
!175 = !DILocation(line: 133, column: 21, scope: !141, inlinedAt: !153)
!176 = !DILocation(line: 133, column: 5, scope: !141, inlinedAt: !153)
!177 = !DILocation(line: 135, column: 14, scope: !141, inlinedAt: !153)
!178 = !DILocation(line: 137, column: 5, scope: !141, inlinedAt: !153)
!179 = !DILocation(line: 44, column: 1, scope: !64)
!180 = !DILocation(line: 0, scope: !141)
!181 = !DILocation(line: 116, column: 22, scope: !141)
!182 = !DILocation(line: 116, column: 28, scope: !141)
!183 = !DILocation(line: 118, column: 17, scope: !150)
!184 = !DILocation(line: 118, column: 12, scope: !150)
!185 = !DILocation(line: 118, column: 9, scope: !141)
!186 = !DILocation(line: 133, column: 16, scope: !141)
!187 = !DILocation(line: 0, scope: !149)
!188 = !DILocation(line: 122, column: 19, scope: !149)
!189 = !DILocation(line: 123, column: 16, scope: !149)
!190 = !DILocation(line: 122, column: 9, scope: !149)
!191 = distinct !{!191, !190, !192}
!192 = !DILocation(line: 123, column: 20, scope: !149)
