; ModuleID = 'x264_src/output/matroska_ebml.c'
source_filename = "x264_src/output/matroska_ebml.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@stdout = external local_unnamed_addr global ptr, align 8
@.str.1 = private unnamed_addr constant [3 x i8] c"wb\00", align 1, !dbg !0
@.str.3 = private unnamed_addr constant [25 x i8] c"Haali Matroska Writer b0\00", align 1, !dbg !7

; Function Attrs: nounwind uwtable
define dso_local noundef ptr @mk_create_writer(ptr nocapture noundef readonly %filename) local_unnamed_addr #0 !dbg !37 {
entry:
    #dbg_value(ptr %filename, !142, !DIExpression(), !144)
  %calloc = tail call dereferenceable_or_null(104) ptr @calloc(i64 1, i64 104), !dbg !145
    #dbg_value(ptr %calloc, !143, !DIExpression(), !144)
  %tobool.not = icmp eq ptr %calloc, null, !dbg !146
  br i1 %tobool.not, label %cleanup, label %if.else.i, !dbg !148

if.else.i:                                        ; preds = %entry
    #dbg_value(ptr %calloc, !149, !DIExpression(), !157)
    #dbg_value(ptr null, !154, !DIExpression(), !157)
    #dbg_value(i32 0, !155, !DIExpression(), !157)
  %freelist.i = getelementptr inbounds i8, ptr %calloc, i64 40, !dbg !159
  %calloc.i = tail call dereferenceable_or_null(56) ptr @calloc(i64 1, i64 56), !dbg !161
    #dbg_value(ptr %calloc.i, !156, !DIExpression(), !157)
  %tobool4.not.i = icmp eq ptr %calloc.i, null, !dbg !163

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 305, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "x264_src/output/matroska_ebml.c", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1fa174e60935636d7a8dc8807d29ae1b")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 24, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 3)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 352, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 25)
!12 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !13, globals: !18, splitDebugInlining: false, nameTableKind: None)
!13 = !{!14, !15, !16, !17}
!14 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!15 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !{!19, !0, !24, !7}
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(scope: null, file: !2, line: 302, type: !21, isLocal: true, isDefinition: true)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 2)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: 9)
!29 = !{i32 7, !"Dwarf Version", i32 5}
!30 = !{i32 2, !"Debug Info Version", i32 3}
!31 = !{i32 1, !"wchar_size", i32 4}
!32 = !{i32 8, !"PIC Level", i32 2}
!33 = !{i32 7, !"PIE Level", i32 2}
!34 = !{i32 7, !"uwtable", i32 2}
!35 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!36 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!37 = distinct !DISubprogram(name: "mk_create_writer", scope: !2, file: !2, line: 287, type: !38, scopeLine: 288, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !141)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !139}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "mk_writer", file: !42, line: 24, baseType: !43)
!42 = !DIFile(filename: "x264_src/output/matroska_ebml.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1745c5eb41455b01e98496f56a8b1e8e")
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mk_writer", file: !2, line: 43, size: 832, elements: !44)
!44 = !{!45, !106, !108, !123, !124, !125, !126, !127, !131, !132, !133, !134, !135, !136, !137, !138}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "fp", scope: !43, file: !2, line: 45, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !48, line: 7, baseType: !49)
!48 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !50, line: 49, size: 1728, elements: !51)
!50 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "1bad07471b7974df4ecc1d1c2ca207e6")
!51 = !{!52, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !68, !70, !71, !72, !76, !78, !80, !84, !87, !89, !92, !95, !96, !97, !101, !102}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !49, file: !50, line: 51, baseType: !53, size: 32)
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !49, file: !50, line: 54, baseType: !16, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !49, file: !50, line: 55, baseType: !16, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !49, file: !50, line: 56, baseType: !16, size: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !49, file: !50, line: 57, baseType: !16, size: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !49, file: !50, line: 58, baseType: !16, size: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !49, file: !50, line: 59, baseType: !16, size: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !49, file: !50, line: 60, baseType: !16, size: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !49, file: !50, line: 61, baseType: !16, size: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !49, file: !50, line: 64, baseType: !16, size: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !49, file: !50, line: 65, baseType: !16, size: 64, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !49, file: !50, line: 66, baseType: !16, size: 64, offset: 704)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !49, file: !50, line: 68, baseType: !66, size: 64, offset: 768)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !50, line: 36, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !49, file: !50, line: 70, baseType: !69, size: 64, offset: 832)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !49, file: !50, line: 72, baseType: !53, size: 32, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !49, file: !50, line: 73, baseType: !53, size: 32, offset: 928)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !49, file: !50, line: 74, baseType: !73, size: 64, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !74, line: 152, baseType: !75)
!74 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!75 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !49, file: !50, line: 77, baseType: !77, size: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !49, file: !50, line: 78, baseType: !79, size: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !49, file: !50, line: 79, baseType: !81, size: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !49, file: !50, line: 81, baseType: !85, size: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !50, line: 43, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !49, file: !50, line: 89, baseType: !88, size: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !74, line: 153, baseType: !75)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !49, file: !50, line: 91, baseType: !90, size: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !50, line: 37, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !49, file: !50, line: 92, baseType: !93, size: 64, offset: 1280)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !50, line: 38, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !49, file: !50, line: 93, baseType: !69, size: 64, offset: 1344)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !49, file: !50, line: 94, baseType: !17, size: 64, offset: 1408)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !49, file: !50, line: 95, baseType: !98, size: 64, offset: 1472)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !99, line: 18, baseType: !100)
!99 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!100 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !49, file: !50, line: 96, baseType: !53, size: 32, offset: 1536)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !49, file: !50, line: 98, baseType: !103, size: 160, offset: 1568)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 20)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "duration_ptr", scope: !43, file: !2, line: 47, baseType: !107, size: 32, offset: 64)
!107 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !43, file: !2, line: 49, baseType: !109, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "mk_context", file: !2, line: 41, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mk_context", file: !2, line: 31, size: 448, elements: !112)
!112 = !{!113, !115, !117, !118, !119, !120, !121, !122}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !111, file: !2, line: 33, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !111, file: !2, line: 33, baseType: !116, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !111, file: !2, line: 33, baseType: !114, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !111, file: !2, line: 34, baseType: !40, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !111, file: !2, line: 35, baseType: !107, size: 32, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !111, file: !2, line: 37, baseType: !17, size: 64, offset: 320)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "d_cur", scope: !111, file: !2, line: 38, baseType: !107, size: 32, offset: 384)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "d_max", scope: !111, file: !2, line: 38, baseType: !107, size: 32, offset: 416)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "cluster", scope: !43, file: !2, line: 49, baseType: !109, size: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !43, file: !2, line: 49, baseType: !109, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "freelist", scope: !43, file: !2, line: 50, baseType: !109, size: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "actlist", scope: !43, file: !2, line: 51, baseType: !109, size: 64, offset: 384)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "def_duration", scope: !43, file: !2, line: 53, baseType: !128, size: 64, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !129, line: 27, baseType: !130)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !74, line: 44, baseType: !75)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "timescale", scope: !43, file: !2, line: 54, baseType: !128, size: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "cluster_tc_scaled", scope: !43, file: !2, line: 55, baseType: !128, size: 64, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "frame_tc", scope: !43, file: !2, line: 56, baseType: !128, size: 64, offset: 640)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "max_frame_tc", scope: !43, file: !2, line: 56, baseType: !128, size: 64, offset: 704)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "wrote_header", scope: !43, file: !2, line: 58, baseType: !79, size: 8, offset: 768)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "in_frame", scope: !43, file: !2, line: 58, baseType: !79, size: 8, offset: 776)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe", scope: !43, file: !2, line: 58, baseType: !79, size: 8, offset: 784)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "skippable", scope: !43, file: !2, line: 58, baseType: !79, size: 8, offset: 792)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!141 = !{!142, !143}
!142 = !DILocalVariable(name: "filename", arg: 1, scope: !37, file: !2, line: 287, type: !139)
!143 = !DILocalVariable(name: "w", scope: !37, file: !2, line: 289, type: !40)
!144 = !DILocation(line: 0, scope: !37)
!145 = !DILocation(line: 289, column: 20, scope: !37)
!146 = !DILocation(line: 290, column: 10, scope: !147)
!147 = distinct !DILexicalBlock(scope: !37, file: !2, line: 290, column: 9)
!148 = !DILocation(line: 290, column: 9, scope: !37)
!149 = !DILocalVariable(name: "w", arg: 1, scope: !150, file: !2, line: 61, type: !40)
!150 = distinct !DISubprogram(name: "mk_create_context", scope: !2, file: !2, line: 61, type: !151, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !153)
!151 = !DISubroutineType(types: !152)
!152 = !{!109, !40, !109, !107}
!153 = !{!149, !154, !155, !156}
!154 = !DILocalVariable(name: "parent", arg: 2, scope: !150, file: !2, line: 61, type: !109)
!155 = !DILocalVariable(name: "id", arg: 3, scope: !150, file: !2, line: 61, type: !107)
!156 = !DILocalVariable(name: "c", scope: !150, file: !2, line: 63, type: !109)
!157 = !DILocation(line: 0, scope: !150, inlinedAt: !158)
!158 = distinct !DILocation(line: 295, column: 15, scope: !37)
!159 = !DILocation(line: 65, column: 12, scope: !160, inlinedAt: !158)
!160 = distinct !DILexicalBlock(scope: !150, file: !2, line: 65, column: 9)
!161 = !DILocation(line: 72, column: 13, scope: !162, inlinedAt: !158)
!162 = distinct !DILexicalBlock(scope: !160, file: !2, line: 71, column: 5)
!163 = !DILocation(line: 73, column: 14, scope: !164, inlinedAt: !158)
!164 = distinct !DILexicalBlock(scope: !162, file: !2, line: 73, column: 13)
!165 = !DILocation(line: 73, column: 13, scope: !162, inlinedAt: !158)
!166 = !DILocation(line: 298, column: 9, scope: !167)
!167 = distinct !DILexicalBlock(scope: !168, file: !2, line: 297, column: 5)
!168 = distinct !DILexicalBlock(scope: !37, file: !2, line: 296, column: 9)
!169 = !DILocation(line: 299, column: 9, scope: !167)
!170 = !DILocation(line: 79, column: 8, scope: !150, inlinedAt: !158)
!171 = !DILocation(line: 79, column: 14, scope: !150, inlinedAt: !158)
!172 = !DILocation(line: 82, column: 19, scope: !173, inlinedAt: !158)
!173 = distinct !DILexicalBlock(scope: !150, file: !2, line: 82, column: 9)
!174 = !DILocation(line: 85, column: 8, scope: !150, inlinedAt: !158)
!175 = !DILocation(line: 85, column: 13, scope: !150, inlinedAt: !158)
!176 = !DILocation(line: 86, column: 23, scope: !150, inlinedAt: !158)
!177 = !DILocation(line: 295, column: 8, scope: !37)
!178 = !DILocation(line: 295, column: 13, scope: !37)
!179 = !DILocation(line: 302, column: 10, scope: !180)
!180 = distinct !DILexicalBlock(scope: !37, file: !2, line: 302, column: 9)
!181 = !DILocation(line: 302, column: 9, scope: !37)
!182 = !DILocation(line: 303, column: 17, scope: !180)
!183 = !DILocation(line: 303, column: 9, scope: !180)
!184 = !DILocation(line: 305, column: 17, scope: !180)
!185 = !DILocation(line: 0, scope: !180)
!186 = !DILocation(line: 306, column: 10, scope: !187)
!187 = distinct !DILexicalBlock(scope: !37, file: !2, line: 306, column: 9)
!188 = !DILocation(line: 306, column: 9, scope: !37)
!189 = !DILocalVariable(name: "w", arg: 1, scope: !190, file: !2, line: 209, type: !40)
!190 = distinct !DISubprogram(name: "mk_destroy_contexts", scope: !2, file: !2, line: 209, type: !191, scopeLine: 210, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !193)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !40}
!193 = !{!189, !194, !195, !197}
