; ModuleID = 'x264_src/output/matroska.c'
source_filename = "x264_src/output/matroska.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.cli_output_t = type { ptr, ptr, ptr, ptr, ptr }

@mkv_output = dso_local local_unnamed_addr constant %struct.cli_output_t { ptr @open_file, ptr @set_param, ptr @write_headers, ptr @write_frame, ptr @close_file }, align 8, !dbg !0
@.str = private unnamed_addr constant [5 x i8] c"x264\00", align 1, !dbg !13
@.str.1 = private unnamed_addr constant [16 x i8] c"V_MPEG4/ISO/AVC\00", align 1, !dbg !19

; Function Attrs: nounwind uwtable
define internal range(i32 -1, 1) i32 @open_file(ptr noundef %psz_filename, ptr nocapture noundef writeonly %p_handle) #0 !dbg !276 {
entry:
    #dbg_value(ptr %psz_filename, !278, !DIExpression(), !299)
    #dbg_value(ptr %p_handle, !279, !DIExpression(), !299)
  store ptr null, ptr %p_handle, align 8, !dbg !300
  %calloc = tail call dereferenceable_or_null(48) ptr @calloc(i64 1, i64 48), !dbg !301
    #dbg_value(ptr %calloc, !280, !DIExpression(), !299)
  %tobool.not = icmp eq ptr %calloc, null, !dbg !302
  br i1 %tobool.not, label %cleanup, label %if.end, !dbg !304

if.end:                                           ; preds = %entry
  %call1 = tail call ptr @mk_create_writer(ptr noundef %psz_filename) #7, !dbg !305
  store ptr %call1, ptr %calloc, align 8, !dbg !306

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mkv_output", scope: !2, file: !3, line: 211, type: !24, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !12, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "x264_src/output/matroska.c", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1a7ca5fe13daa7a376c13c3ae71ee0de")
!4 = !{!5, !6, !11}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !7, line: 27, baseType: !8)
!7 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !9, line: 44, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!10 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !{!0, !13, !19}
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(scope: null, file: !3, line: 149, type: !15, isLocal: true, isDefinition: true)
!15 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 40, elements: !17)
!16 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!17 = !{!18}
!18 = !DISubrange(count: 5)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(scope: null, file: !3, line: 149, type: !21, isLocal: true, isDefinition: true)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 128, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 16)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_output_t", file: !26, line: 34, baseType: !27)
!26 = !DIFile(filename: "x264_src/output/output.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "2609bd03b72b40b15579de35b2e5f690")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !26, line: 27, size: 320, elements: !28)
!28 = !{!29, !37, !214, !227, !264}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "open_file", scope: !27, file: !26, line: 29, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{!11, !33, !34}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "hnd_t", file: !36, line: 30, baseType: !5)
!36 = !DIFile(filename: "x264_src/muxers.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "bcea0820748b2dc47392b7f6393a96ff")
!37 = !DIDerivedType(tag: DW_TAG_member, name: "set_param", scope: !27, file: !26, line: 30, baseType: !38, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!11, !35, !41}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !43, line: 376, baseType: !44)
!43 = !DIFile(filename: "x264_src/x264.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !43, line: 176, size: 5632, elements: !45)
!45 = !{!46, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !94, !95, !96, !97, !101, !102, !115, !116, !117, !118, !119, !150, !192, !193, !194, !195, !196, !197, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !44, file: !43, line: 179, baseType: !47, size: 32)
!47 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !44, file: !43, line: 180, baseType: !11, size: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !44, file: !43, line: 181, baseType: !11, size: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !44, file: !43, line: 182, baseType: !11, size: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !44, file: !43, line: 183, baseType: !11, size: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !44, file: !43, line: 186, baseType: !11, size: 32, offset: 160)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !44, file: !43, line: 187, baseType: !11, size: 32, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !44, file: !43, line: 188, baseType: !11, size: 32, offset: 224)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !44, file: !43, line: 189, baseType: !11, size: 32, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !44, file: !43, line: 190, baseType: !11, size: 32, offset: 288)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !44, file: !43, line: 198, baseType: !11, size: 32, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !44, file: !43, line: 215, baseType: !59, size: 288, offset: 352)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !44, file: !43, line: 200, size: 288, elements: !60)
!60 = !{!61, !62, !63, !64, !65, !66, !67, !68, !69}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !59, file: !43, line: 203, baseType: !11, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !59, file: !43, line: 204, baseType: !11, size: 32, offset: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !59, file: !43, line: 206, baseType: !11, size: 32, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !59, file: !43, line: 209, baseType: !11, size: 32, offset: 96)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !59, file: !43, line: 210, baseType: !11, size: 32, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !59, file: !43, line: 211, baseType: !11, size: 32, offset: 160)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !59, file: !43, line: 212, baseType: !11, size: 32, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !59, file: !43, line: 213, baseType: !11, size: 32, offset: 224)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !59, file: !43, line: 214, baseType: !11, size: 32, offset: 256)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !44, file: !43, line: 218, baseType: !11, size: 32, offset: 640)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !44, file: !43, line: 219, baseType: !11, size: 32, offset: 672)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !44, file: !43, line: 220, baseType: !11, size: 32, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !44, file: !43, line: 221, baseType: !11, size: 32, offset: 736)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !44, file: !43, line: 222, baseType: !11, size: 32, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !44, file: !43, line: 224, baseType: !11, size: 32, offset: 800)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !44, file: !43, line: 225, baseType: !11, size: 32, offset: 832)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !44, file: !43, line: 226, baseType: !11, size: 32, offset: 864)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !44, file: !43, line: 227, baseType: !11, size: 32, offset: 896)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !44, file: !43, line: 229, baseType: !11, size: 32, offset: 928)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !44, file: !43, line: 230, baseType: !11, size: 32, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !44, file: !43, line: 231, baseType: !11, size: 32, offset: 992)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !44, file: !43, line: 233, baseType: !11, size: 32, offset: 1024)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !44, file: !43, line: 234, baseType: !11, size: 32, offset: 1056)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !44, file: !43, line: 236, baseType: !11, size: 32, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !44, file: !43, line: 237, baseType: !11, size: 32, offset: 1120)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !44, file: !43, line: 239, baseType: !11, size: 32, offset: 1152)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !44, file: !43, line: 240, baseType: !33, size: 64, offset: 1216)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !44, file: !43, line: 241, baseType: !89, size: 128, offset: 1280)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 128, elements: !22)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !91, line: 24, baseType: !92)
!91 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !9, line: 38, baseType: !93)
!93 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !44, file: !43, line: 242, baseType: !89, size: 128, offset: 1408)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !44, file: !43, line: 243, baseType: !89, size: 128, offset: 1536)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !44, file: !43, line: 244, baseType: !89, size: 128, offset: 1664)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !44, file: !43, line: 245, baseType: !98, size: 512, offset: 1792)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 512, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !44, file: !43, line: 246, baseType: !98, size: 512, offset: 2304)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !44, file: !43, line: 249, baseType: !103, size: 64, offset: 2816)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !5, !11, !106, !108}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !110)
!110 = !{!111, !112, !113, !114}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !109, file: !3, line: 211, baseType: !47, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !109, file: !3, line: 211, baseType: !47, size: 32, offset: 32)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !109, file: !3, line: 211, baseType: !5, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !109, file: !3, line: 211, baseType: !5, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !44, file: !43, line: 250, baseType: !5, size: 64, offset: 2880)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !44, file: !43, line: 251, baseType: !11, size: 32, offset: 2944)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !44, file: !43, line: 252, baseType: !11, size: 32, offset: 2976)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !44, file: !43, line: 253, baseType: !33, size: 64, offset: 3008)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !44, file: !43, line: 287, baseType: !120, size: 800, offset: 3072)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !44, file: !43, line: 256, size: 800, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !142, !143, !144, !148, !149}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !120, file: !43, line: 258, baseType: !47, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !120, file: !43, line: 259, baseType: !47, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !120, file: !43, line: 261, baseType: !11, size: 32, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !120, file: !43, line: 262, baseType: !11, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !120, file: !43, line: 263, baseType: !11, size: 32, offset: 128)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !120, file: !43, line: 264, baseType: !11, size: 32, offset: 160)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !120, file: !43, line: 265, baseType: !11, size: 32, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !120, file: !43, line: 267, baseType: !11, size: 32, offset: 224)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !120, file: !43, line: 268, baseType: !11, size: 32, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !120, file: !43, line: 269, baseType: !11, size: 32, offset: 288)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !120, file: !43, line: 270, baseType: !11, size: 32, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !120, file: !43, line: 271, baseType: !11, size: 32, offset: 352)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !120, file: !43, line: 272, baseType: !11, size: 32, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !120, file: !43, line: 273, baseType: !11, size: 32, offset: 416)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !120, file: !43, line: 274, baseType: !11, size: 32, offset: 448)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !120, file: !43, line: 275, baseType: !11, size: 32, offset: 480)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !120, file: !43, line: 276, baseType: !11, size: 32, offset: 512)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !120, file: !43, line: 277, baseType: !11, size: 32, offset: 544)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !120, file: !43, line: 278, baseType: !141, size: 32, offset: 576)
!141 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !120, file: !43, line: 279, baseType: !141, size: 32, offset: 608)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !120, file: !43, line: 280, baseType: !11, size: 32, offset: 640)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !120, file: !43, line: 283, baseType: !145, size: 64, offset: 672)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 2)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !120, file: !43, line: 285, baseType: !11, size: 32, offset: 736)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !120, file: !43, line: 286, baseType: !11, size: 32, offset: 768)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !44, file: !43, line: 327, baseType: !151, size: 1152, offset: 3904)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !44, file: !43, line: 290, size: 1152, elements: !152)
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !190, !191}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !151, file: !43, line: 292, baseType: !11, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !151, file: !43, line: 294, baseType: !11, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !151, file: !43, line: 295, baseType: !11, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !151, file: !43, line: 296, baseType: !11, size: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !151, file: !43, line: 297, baseType: !11, size: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !151, file: !43, line: 299, baseType: !11, size: 32, offset: 160)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !151, file: !43, line: 300, baseType: !141, size: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !151, file: !43, line: 301, baseType: !141, size: 32, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !151, file: !43, line: 302, baseType: !141, size: 32, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !151, file: !43, line: 303, baseType: !11, size: 32, offset: 288)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !151, file: !43, line: 304, baseType: !11, size: 32, offset: 320)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !151, file: !43, line: 305, baseType: !141, size: 32, offset: 352)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !151, file: !43, line: 306, baseType: !141, size: 32, offset: 384)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !151, file: !43, line: 307, baseType: !141, size: 32, offset: 416)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !151, file: !43, line: 309, baseType: !11, size: 32, offset: 448)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !151, file: !43, line: 310, baseType: !141, size: 32, offset: 480)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !151, file: !43, line: 311, baseType: !11, size: 32, offset: 512)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !151, file: !43, line: 312, baseType: !11, size: 32, offset: 544)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !151, file: !43, line: 315, baseType: !11, size: 32, offset: 576)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !151, file: !43, line: 316, baseType: !33, size: 64, offset: 640)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !151, file: !43, line: 317, baseType: !11, size: 32, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !151, file: !43, line: 318, baseType: !33, size: 64, offset: 768)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !151, file: !43, line: 321, baseType: !141, size: 32, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !151, file: !43, line: 322, baseType: !141, size: 32, offset: 864)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !151, file: !43, line: 323, baseType: !141, size: 32, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !151, file: !43, line: 324, baseType: !179, size: 64, offset: 960)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !43, line: 174, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 167, size: 256, elements: !182)
!182 = !{!183, !184, !185, !186, !187, !188}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !181, file: !43, line: 169, baseType: !11, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !181, file: !43, line: 169, baseType: !11, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !181, file: !43, line: 170, baseType: !11, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !181, file: !43, line: 171, baseType: !11, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !181, file: !43, line: 172, baseType: !141, size: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !181, file: !43, line: 173, baseType: !189, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !151, file: !43, line: 325, baseType: !11, size: 32, offset: 1024)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !151, file: !43, line: 326, baseType: !33, size: 64, offset: 1088)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !44, file: !43, line: 330, baseType: !11, size: 32, offset: 5056)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !44, file: !43, line: 331, baseType: !11, size: 32, offset: 5088)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !44, file: !43, line: 332, baseType: !11, size: 32, offset: 5120)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !44, file: !43, line: 334, baseType: !11, size: 32, offset: 5152)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !44, file: !43, line: 335, baseType: !11, size: 32, offset: 5184)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !44, file: !43, line: 336, baseType: !198, size: 32, offset: 5216)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !91, line: 26, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !9, line: 42, baseType: !47)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !44, file: !43, line: 337, baseType: !198, size: 32, offset: 5248)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !44, file: !43, line: 338, baseType: !198, size: 32, offset: 5280)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !44, file: !43, line: 339, baseType: !198, size: 32, offset: 5312)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !44, file: !43, line: 340, baseType: !11, size: 32, offset: 5344)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !44, file: !43, line: 344, baseType: !11, size: 32, offset: 5376)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !44, file: !43, line: 356, baseType: !11, size: 32, offset: 5408)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !44, file: !43, line: 364, baseType: !11, size: 32, offset: 5440)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !44, file: !43, line: 367, baseType: !11, size: 32, offset: 5472)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !44, file: !43, line: 368, baseType: !11, size: 32, offset: 5504)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !44, file: !43, line: 369, baseType: !11, size: 32, offset: 5536)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !44, file: !43, line: 375, baseType: !211, size: 64, offset: 5568)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64)
!212 = !DISubroutineType(types: !213)
!213 = !{null, !5}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "write_headers", scope: !27, file: !26, line: 31, baseType: !215, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!11, !35, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !43, line: 604, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 593, size: 192, elements: !221)
!221 = !{!222, !223, !224, !225}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !220, file: !43, line: 595, baseType: !11, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !220, file: !43, line: 596, baseType: !11, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !220, file: !43, line: 599, baseType: !11, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !220, file: !43, line: 603, baseType: !226, size: 64, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "write_frame", scope: !27, file: !26, line: 32, baseType: !228, size: 64, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DISubroutineType(types: !230)
!230 = !{!11, !35, !226, !11, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_picture_t", file: !43, line: 549, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 513, size: 1088, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !254, !263}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !233, file: !43, line: 521, baseType: !11, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !233, file: !43, line: 523, baseType: !11, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !233, file: !43, line: 526, baseType: !11, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !233, file: !43, line: 529, baseType: !11, size: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !233, file: !43, line: 531, baseType: !6, size: 64, offset: 128)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts", scope: !233, file: !43, line: 534, baseType: !6, size: 64, offset: 192)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !233, file: !43, line: 541, baseType: !41, size: 64, offset: 256)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "img", scope: !233, file: !43, line: 543, baseType: !243, size: 448, offset: 320)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_image_t", file: !43, line: 511, baseType: !244)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 505, size: 448, elements: !245)
!245 = !{!246, !247, !248, !252}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !244, file: !43, line: 507, baseType: !11, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !244, file: !43, line: 508, baseType: !11, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !244, file: !43, line: 509, baseType: !249, size: 128, offset: 64)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 128, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 4)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !244, file: !43, line: 510, baseType: !253, size: 256, offset: 192)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 256, elements: !250)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !233, file: !43, line: 545, baseType: !255, size: 256, offset: 768)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !43, line: 503, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !43, line: 496, size: 256, elements: !257)
!257 = !{!258, !260, !261, !262}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !256, file: !43, line: 498, baseType: !259, size: 64)
!259 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !256, file: !43, line: 499, baseType: !259, size: 64, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !256, file: !43, line: 500, baseType: !259, size: 64, offset: 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !256, file: !43, line: 502, baseType: !259, size: 64, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !233, file: !43, line: 548, baseType: !5, size: 64, offset: 1024)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "close_file", scope: !27, file: !26, line: 33, baseType: !265, size: 64, offset: 256)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64)
!266 = !DISubroutineType(types: !267)
!267 = !{!11, !35, !6, !6}
!268 = !{i32 7, !"Dwarf Version", i32 5}
!269 = !{i32 2, !"Debug Info Version", i32 3}
!270 = !{i32 1, !"wchar_size", i32 4}
!271 = !{i32 8, !"PIC Level", i32 2}
!272 = !{i32 7, !"PIE Level", i32 2}
!273 = !{i32 7, !"uwtable", i32 2}
!274 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!275 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!276 = distinct !DISubprogram(name: "open_file", scope: !3, file: !3, line: 38, type: !31, scopeLine: 39, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !277)
!277 = !{!278, !279, !280}
!278 = !DILocalVariable(name: "psz_filename", arg: 1, scope: !276, file: !3, line: 38, type: !33)
!279 = !DILocalVariable(name: "p_handle", arg: 2, scope: !276, file: !3, line: 38, type: !34)
!280 = !DILocalVariable(name: "p_mkv", scope: !276, file: !3, line: 40, type: !281)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "mkv_hnd_t", file: !3, line: 36, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 24, size: 384, elements: !284)
!284 = !{!285, !290, !291, !292, !293, !294, !295, !297, !298}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !283, file: !3, line: 26, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "mk_writer", file: !288, line: 24, baseType: !289)
!288 = !DIFile(filename: "x264_src/output/matroska_ebml.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "1745c5eb41455b01e98496f56a8b1e8e")
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "mk_writer", file: !288, line: 24, flags: DIFlagFwdDecl)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !283, file: !3, line: 28, baseType: !11, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !283, file: !3, line: 28, baseType: !11, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "d_width", scope: !283, file: !3, line: 28, baseType: !11, size: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "d_height", scope: !283, file: !3, line: 28, baseType: !11, size: 32, offset: 160)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "frame_duration", scope: !283, file: !3, line: 30, baseType: !6, size: 64, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "b_writing_frame", scope: !283, file: !3, line: 32, baseType: !296, size: 8, offset: 256)
!296 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !283, file: !3, line: 33, baseType: !198, size: 32, offset: 288)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !283, file: !3, line: 34, baseType: !198, size: 32, offset: 320)
!299 = !DILocation(line: 0, scope: !276)
!300 = !DILocation(line: 42, column: 15, scope: !276)
!301 = !DILocation(line: 44, column: 14, scope: !276)
!302 = !DILocation(line: 45, column: 10, scope: !303)
!303 = distinct !DILexicalBlock(scope: !276, file: !3, line: 45, column: 9)
!304 = !DILocation(line: 45, column: 9, scope: !276)
!305 = !DILocation(line: 50, column: 16, scope: !276)
!306 = !DILocation(line: 50, column: 14, scope: !276)
!307 = !DILocation(line: 51, column: 10, scope: !308)
!308 = distinct !DILexicalBlock(scope: !276, file: !3, line: 51, column: 9)
!309 = !DILocation(line: 51, column: 9, scope: !276)
!310 = !DILocation(line: 53, column: 9, scope: !311)
!311 = distinct !DILexicalBlock(scope: !308, file: !3, line: 52, column: 5)
!312 = !DILocation(line: 54, column: 9, scope: !311)
!313 = !DILocation(line: 57, column: 15, scope: !276)
!314 = !DILocation(line: 59, column: 5, scope: !276)
!315 = !DILocation(line: 60, column: 1, scope: !276)
!316 = distinct !DISubprogram(name: "set_param", scope: !3, file: !3, line: 62, type: !39, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !317)
!317 = !{!318, !319, !320, !321, !322, !323}
!318 = !DILocalVariable(name: "handle", arg: 1, scope: !316, file: !3, line: 62, type: !35)
!319 = !DILocalVariable(name: "p_param", arg: 2, scope: !316, file: !3, line: 62, type: !41)
!320 = !DILocalVariable(name: "p_mkv", scope: !316, file: !3, line: 64, type: !281)
!321 = !DILocalVariable(name: "dw", scope: !316, file: !3, line: 65, type: !6)
!322 = !DILocalVariable(name: "dh", scope: !316, file: !3, line: 65, type: !6)
!323 = !DILocalVariable(name: "x", scope: !324, file: !3, line: 93, type: !6)
!324 = distinct !DILexicalBlock(scope: !325, file: !3, line: 92, column: 5)
!325 = distinct !DILexicalBlock(scope: !316, file: !3, line: 91, column: 9)
!326 = !DILocation(line: 0, scope: !316)
!327 = !DILocation(line: 67, column: 18, scope: !328)
!328 = distinct !DILexicalBlock(scope: !316, file: !3, line: 67, column: 9)
!329 = !DILocation(line: 67, column: 28, scope: !328)
!330 = !DILocation(line: 67, column: 32, scope: !328)
!331 = !DILocation(line: 67, column: 45, scope: !328)
!332 = !DILocation(line: 67, column: 36, scope: !328)
!333 = !DILocation(line: 67, column: 9, scope: !316)
!334 = !DILocation(line: 69, column: 51, scope: !335)
!335 = distinct !DILexicalBlock(scope: !328, file: !3, line: 68, column: 5)
!336 = !DILocation(line: 69, column: 33, scope: !335)
!337 = !DILocation(line: 69, column: 61, scope: !335)
!338 = !DILocation(line: 70, column: 55, scope: !335)
!339 = !DILocation(line: 70, column: 53, scope: !335)
!340 = !DILocation(line: 71, column: 5, scope: !335)
!341 = !DILocation(line: 0, scope: !328)
!342 = !DILocation(line: 77, column: 29, scope: !316)
!343 = !DILocation(line: 77, column: 12, scope: !316)
!344 = !DILocation(line: 77, column: 18, scope: !316)
!345 = !DILocation(line: 78, column: 30, scope: !316)
!346 = !DILocation(line: 78, column: 12, scope: !316)
!347 = !DILocation(line: 78, column: 19, scope: !316)
!348 = !DILocation(line: 80, column: 22, scope: !349)
!349 = distinct !DILexicalBlock(scope: !316, file: !3, line: 80, column: 9)
!350 = !DILocation(line: 80, column: 9, scope: !349)
!351 = !DILocation(line: 80, column: 34, scope: !349)
!352 = !DILocation(line: 80, column: 18, scope: !349)
!353 = !DILocation(line: 80, column: 50, scope: !349)
!354 = !DILocation(line: 80, column: 37, scope: !349)
!355 = !DILocation(line: 80, column: 9, scope: !316)
!356 = !DILocation(line: 82, column: 32, scope: !357)
!357 = distinct !DILexicalBlock(scope: !349, file: !3, line: 81, column: 5)
!358 = !DILocation(line: 82, column: 14, scope: !357)
!359 = !DILocation(line: 82, column: 43, scope: !357)
!360 = !DILocation(line: 82, column: 41, scope: !357)
