; ModuleID = 'x264_src/common/cabac.c'
source_filename = "x264_src/common/cabac.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !14, globals: !16, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "x264_src/common/cabac.c", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "81e922f79a78663e77ecb0915f9a62f5")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "slice_type_e", file: !6, line: 280, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "x264_src/common/common.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5afac7bf2f5673f1628c455d7d320ad7")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "SLICE_TYPE_P", value: 0)
!10 = !DIEnumerator(name: "SLICE_TYPE_B", value: 1)
!11 = !DIEnumerator(name: "SLICE_TYPE_I", value: 2)
!12 = !DIEnumerator(name: "SLICE_TYPE_SP", value: 3)
!13 = !DIEnumerator(name: "SLICE_TYPE_SI", value: 4)
!14 = !{!15}
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !{!0, !17, !29, !34, !42, !52}
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "x264_cabac_transition", scope: !2, file: !3, line: 687, type: !19, isLocal: false, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 2048, elements: !26)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !22, line: 24, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !24, line: 38, baseType: !25)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!27, !28}
!27 = !DISubrange(count: 128)
!28 = !DISubrange(count: 2)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "x264_cabac_renorm_shift", scope: !2, file: !3, line: 707, type: !31, isLocal: false, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 512, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 64)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "x264_cabac_entropy", scope: !2, file: !3, line: 715, type: !36, isLocal: false, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 2048, elements: !41)
!37 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !22, line: 25, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !24, line: 40, baseType: !40)
!40 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!41 = !{!27}
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "x264_cabac_context_init_I", scope: !2, file: !3, line: 27, type: !44, isLocal: true, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 7360, elements: !50)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !47, line: 24, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !24, line: 37, baseType: !49)
!49 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!50 = !{!51, !28}
!51 = !DISubrange(count: 460)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "x264_cabac_context_init_PB", scope: !2, file: !3, line: 196, type: !54, isLocal: true, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 22080, elements: !55)
!55 = !{!56, !51, !28}
!56 = !DISubrange(count: 3)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 2048, elements: !58)
!58 = !{!33, !59}
!59 = !DISubrange(count: 4)
!60 = !{i32 7, !"Dwarf Version", i32 5}
!61 = !{i32 2, !"Debug Info Version", i32 3}
!62 = !{i32 1, !"wchar_size", i32 4}
!63 = !{i32 8, !"PIC Level", i32 2}
!64 = !{i32 7, !"PIE Level", i32 2}
!65 = !{i32 7, !"uwtable", i32 2}
!66 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!67 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!68 = distinct !DISubprogram(name: "x264_cabac_context_init", scope: !3, file: !3, line: 755, type: !69, scopeLine: 756, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !88)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !71, !15, !15, !15}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !73, line: 46, baseType: !74)
!73 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !73, line: 27, size: 4096, elements: !75)
!75 = !{!76, !77, !78, !79, !80, !82, !83, !84, !85}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !74, file: !73, line: 30, baseType: !15, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !74, file: !73, line: 31, baseType: !15, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !74, file: !73, line: 34, baseType: !15, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !74, file: !73, line: 35, baseType: !15, size: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !74, file: !73, line: 37, baseType: !81, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !74, file: !73, line: 38, baseType: !81, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !74, file: !73, line: 39, baseType: !81, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !74, file: !73, line: 42, baseType: !15, size: 32, align: 128, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !74, file: !73, line: 45, baseType: !86, size: 3680, offset: 416)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 3680, elements: !87)
!87 = !{!51}
!88 = !{!89, !90, !91, !92, !93, !95, !97}
!89 = !DILocalVariable(name: "cb", arg: 1, scope: !68, file: !3, line: 755, type: !71)
!90 = !DILocalVariable(name: "i_slice_type", arg: 2, scope: !68, file: !3, line: 755, type: !15)
!91 = !DILocalVariable(name: "i_qp", arg: 3, scope: !68, file: !3, line: 755, type: !15)
!92 = !DILocalVariable(name: "i_model", arg: 4, scope: !68, file: !3, line: 755, type: !15)
!93 = !DILocalVariable(name: "cabac_context_init", scope: !68, file: !3, line: 757, type: !94)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!95 = !DILocalVariable(name: "i", scope: !96, file: !3, line: 764, type: !15)
!96 = distinct !DILexicalBlock(scope: !68, file: !3, line: 764, column: 5)
!97 = !DILocalVariable(name: "state", scope: !98, file: !3, line: 766, type: !15)
!98 = distinct !DILexicalBlock(scope: !99, file: !3, line: 765, column: 5)
!99 = distinct !DILexicalBlock(scope: !96, file: !3, line: 764, column: 5)
!100 = !DILocation(line: 0, scope: !68)
!101 = !DILocation(line: 759, column: 22, scope: !102)
!102 = distinct !DILexicalBlock(scope: !68, file: !3, line: 759, column: 9)
!103 = !DILocation(line: 759, column: 9, scope: !68)
!104 = !DILocation(line: 0, scope: !96)
!105 = !DILocation(line: 764, column: 5, scope: !96)
!106 = !DILocation(line: 764, column: 31, scope: !99)
!107 = !DILocation(line: 766, column: 35, scope: !98)
!108 = !{!109}
!109 = distinct !{!109, !110}
!110 = distinct !{!110, !"LVerDomain"}
!111 = !DILocation(line: 766, column: 63, scope: !98)
!112 = !DILocation(line: 766, column: 71, scope: !98)
!113 = !DILocation(line: 766, column: 79, scope: !98)
!114 = !DILocation(line: 766, column: 77, scope: !98)
!115 = !DILocation(line: 202, column: 17, scope: !116, inlinedAt: !123)
!116 = distinct !DISubprogram(name: "x264_clip3", scope: !6, file: !6, line: 200, type: !117, scopeLine: 201, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !119)
!117 = !DISubroutineType(types: !118)
!118 = !{!15, !15, !15, !15}
!119 = !{!120, !121, !122}
!120 = !DILocalVariable(name: "v", arg: 1, scope: !116, file: !6, line: 200, type: !15)
!121 = !DILocalVariable(name: "i_min", arg: 2, scope: !116, file: !6, line: 200, type: !15)
!122 = !DILocalVariable(name: "i_max", arg: 3, scope: !116, file: !6, line: 200, type: !15)
!123 = distinct !DILocation(line: 766, column: 21, scope: !98)
!124 = !DILocation(line: 202, column: 14, scope: !116, inlinedAt: !123)
!125 = !DILocation(line: 767, column: 25, scope: !98)
!126 = !DILocation(line: 767, column: 54, scope: !98)
!127 = !DILocation(line: 767, column: 69, scope: !98)
!128 = !DILocation(line: 767, column: 60, scope: !98)
!129 = !DILocation(line: 767, column: 24, scope: !98)
!130 = !DILocation(line: 767, column: 9, scope: !98)
!131 = !DILocation(line: 767, column: 22, scope: !98)
!132 = !{!133}
!133 = distinct !{!133, !110}
!134 = distinct !{!134, !105, !135, !136, !137}
!135 = !DILocation(line: 768, column: 5, scope: !96)
!136 = !{!"llvm.loop.isvectorized", i32 1}
!137 = !{!"llvm.loop.unroll.runtime.disable"}
!138 = !{!139}
!139 = distinct !{!139, !140}
!140 = distinct !{!140, !"LVerDomain"}
!141 = !{!142}
!142 = distinct !{!142, !140}
!143 = !DILocation(line: 769, column: 1, scope: !68)
!144 = !DILocation(line: 0, scope: !116, inlinedAt: !123)
!145 = !DILocation(line: 0, scope: !98)
!146 = !DILocation(line: 764, column: 23, scope: !99)
!147 = distinct !{!147, !105, !135, !136}
!148 = distinct !DISubprogram(name: "x264_cabac_encode_init_core", scope: !3, file: !3, line: 771, type: !149, scopeLine: 772, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !151)
!149 = !DISubroutineType(types: !150)
!150 = !{null, !71}
!151 = !{!152}
!152 = !DILocalVariable(name: "cb", arg: 1, scope: !148, file: !3, line: 771, type: !71)
!153 = !DILocation(line: 0, scope: !148)
!154 = !DILocation(line: 773, column: 17, scope: !148)
!155 = !DILocation(line: 777, column: 1, scope: !148)
!156 = distinct !DISubprogram(name: "x264_cabac_encode_init", scope: !3, file: !3, line: 779, type: !157, scopeLine: 780, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !159)
!157 = !DISubroutineType(types: !158)
!158 = !{null, !71, !81, !81}
!159 = !{!160, !161, !162}
!160 = !DILocalVariable(name: "cb", arg: 1, scope: !156, file: !3, line: 779, type: !71)
!161 = !DILocalVariable(name: "p_data", arg: 2, scope: !156, file: !3, line: 779, type: !81)
!162 = !DILocalVariable(name: "p_end", arg: 3, scope: !156, file: !3, line: 779, type: !81)
!163 = !DILocation(line: 0, scope: !156)
!164 = !DILocation(line: 0, scope: !148, inlinedAt: !165)
!165 = distinct !DILocation(line: 781, column: 5, scope: !156)
!166 = !DILocation(line: 773, column: 17, scope: !148, inlinedAt: !165)
!167 = !DILocation(line: 782, column: 9, scope: !156)
!168 = !DILocation(line: 782, column: 17, scope: !156)
!169 = !DILocation(line: 783, column: 9, scope: !156)
!170 = !DILocation(line: 783, column: 17, scope: !156)
!171 = !DILocation(line: 784, column: 9, scope: !156)
!172 = !DILocation(line: 784, column: 17, scope: !156)
!173 = !DILocation(line: 785, column: 1, scope: !156)
!174 = distinct !DISubprogram(name: "x264_cabac_encode_decision_c", scope: !3, file: !3, line: 831, type: !175, scopeLine: 832, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !177)
!175 = !DISubroutineType(types: !176)
!176 = !{null, !71, !15, !15}
!177 = !{!178, !179, !180, !181, !182}
!178 = !DILocalVariable(name: "cb", arg: 1, scope: !174, file: !3, line: 831, type: !71)
!179 = !DILocalVariable(name: "i_ctx", arg: 2, scope: !174, file: !3, line: 831, type: !15)
!180 = !DILocalVariable(name: "b", arg: 3, scope: !174, file: !3, line: 831, type: !15)
!181 = !DILocalVariable(name: "i_state", scope: !174, file: !3, line: 833, type: !15)
!182 = !DILocalVariable(name: "i_range_lps", scope: !174, file: !3, line: 834, type: !15)
!183 = !DILocation(line: 0, scope: !174)
!184 = !DILocation(line: 833, column: 23, scope: !174)
!185 = !DILocation(line: 833, column: 19, scope: !174)
!186 = !DILocation(line: 834, column: 51, scope: !174)
!187 = !DILocation(line: 834, column: 23, scope: !174)
!188 = !DILocation(line: 834, column: 61, scope: !174)
!189 = !DILocation(line: 834, column: 68, scope: !174)
!190 = !DILocation(line: 834, column: 72, scope: !174)
!191 = !DILocation(line: 835, column: 17, scope: !174)
!192 = !DILocation(line: 836, column: 23, scope: !193)
!193 = distinct !DILexicalBlock(scope: !174, file: !3, line: 836, column: 9)
!194 = !DILocation(line: 836, column: 11, scope: !193)
!195 = !DILocation(line: 836, column: 9, scope: !174)
!196 = !DILocation(line: 838, column: 19, scope: !197)
!197 = distinct !DILexicalBlock(scope: !193, file: !3, line: 837, column: 5)
!198 = !DILocation(line: 839, column: 21, scope: !197)
!199 = !DILocation(line: 840, column: 5, scope: !197)
!200 = !DILocation(line: 841, column: 24, scope: !174)
!201 = !DILocation(line: 841, column: 22, scope: !174)
!202 = !DILocalVariable(name: "cb", arg: 1, scope: !203, file: !3, line: 819, type: !71)
!203 = distinct !DISubprogram(name: "x264_cabac_encode_renorm", scope: !3, file: !3, line: 819, type: !149, scopeLine: 820, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !204)
!204 = !{!202, !205}
!205 = !DILocalVariable(name: "shift", scope: !203, file: !3, line: 821, type: !15)
!206 = !DILocation(line: 0, scope: !203, inlinedAt: !207)
!207 = distinct !DILocation(line: 842, column: 5, scope: !174)
!208 = !DILocation(line: 821, column: 45, scope: !203, inlinedAt: !207)
!209 = !DILocation(line: 821, column: 52, scope: !203, inlinedAt: !207)
!210 = !DILocation(line: 821, column: 17, scope: !203, inlinedAt: !207)
!211 = !DILocation(line: 822, column: 17, scope: !203, inlinedAt: !207)
!212 = !DILocation(line: 823, column: 17, scope: !203, inlinedAt: !207)
!213 = !DILocation(line: 824, column: 9, scope: !203, inlinedAt: !207)
!214 = !DILocation(line: 824, column: 18, scope: !203, inlinedAt: !207)
!215 = !DILocalVariable(name: "cb", arg: 1, scope: !216, file: !3, line: 787, type: !71)
!216 = distinct !DISubprogram(name: "x264_cabac_putbyte", scope: !3, file: !3, line: 787, type: !149, scopeLine: 788, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !217)
!217 = !{!215, !218, !221, !224}
!218 = !DILocalVariable(name: "out", scope: !219, file: !3, line: 791, type: !15)
!219 = distinct !DILexicalBlock(scope: !220, file: !3, line: 790, column: 5)
!220 = distinct !DILexicalBlock(scope: !216, file: !3, line: 789, column: 9)
!221 = !DILocalVariable(name: "carry", scope: !222, file: !3, line: 799, type: !15)
!222 = distinct !DILexicalBlock(scope: !223, file: !3, line: 798, column: 9)
!223 = distinct !DILexicalBlock(scope: !219, file: !3, line: 795, column: 13)
!224 = !DILocalVariable(name: "bytes_outstanding", scope: !222, file: !3, line: 800, type: !15)
!225 = !DILocation(line: 0, scope: !216, inlinedAt: !226)
!226 = distinct !DILocation(line: 825, column: 5, scope: !203, inlinedAt: !207)
!227 = !DILocation(line: 789, column: 21, scope: !220, inlinedAt: !226)
!228 = !DILocation(line: 789, column: 9, scope: !216, inlinedAt: !226)
!229 = !DILocation(line: 791, column: 44, scope: !219, inlinedAt: !226)
!230 = !DILocation(line: 791, column: 29, scope: !219, inlinedAt: !226)
!231 = !DILocation(line: 0, scope: !219, inlinedAt: !226)
!232 = !DILocation(line: 792, column: 28, scope: !219, inlinedAt: !226)
!233 = !DILocation(line: 792, column: 42, scope: !219, inlinedAt: !226)
!234 = !DILocation(line: 792, column: 19, scope: !219, inlinedAt: !226)
!235 = !DILocation(line: 793, column: 21, scope: !219, inlinedAt: !226)
!236 = !DILocation(line: 795, column: 18, scope: !223, inlinedAt: !226)
!237 = !DILocation(line: 795, column: 26, scope: !223, inlinedAt: !226)
!238 = !DILocation(line: 795, column: 13, scope: !219, inlinedAt: !226)
!239 = !DILocation(line: 796, column: 17, scope: !223, inlinedAt: !226)
!240 = !DILocation(line: 796, column: 36, scope: !223, inlinedAt: !226)
!241 = !DILocation(line: 796, column: 13, scope: !223, inlinedAt: !226)
!242 = !DILocation(line: 799, column: 29, scope: !222, inlinedAt: !226)
!243 = !DILocation(line: 0, scope: !222, inlinedAt: !226)
!244 = !DILocation(line: 800, column: 41, scope: !222, inlinedAt: !226)
!245 = !DILocation(line: 807, column: 17, scope: !222, inlinedAt: !226)
!246 = !DILocation(line: 807, column: 13, scope: !222, inlinedAt: !226)
!247 = !DILocation(line: 807, column: 23, scope: !222, inlinedAt: !226)
!248 = !DILocation(line: 808, column: 38, scope: !222, inlinedAt: !226)
!249 = !DILocation(line: 808, column: 13, scope: !222, inlinedAt: !226)
!250 = !DILocation(line: 810, column: 24, scope: !251, inlinedAt: !226)
!251 = distinct !DILexicalBlock(scope: !222, file: !3, line: 809, column: 13)
!252 = !DILocation(line: 810, column: 28, scope: !251, inlinedAt: !226)
!253 = !DILocation(line: 811, column: 34, scope: !251, inlinedAt: !226)
!254 = distinct !{!254, !255}
!255 = !{!"llvm.loop.unroll.disable"}
!256 = distinct !{!256, !249, !257}
!257 = !DILocation(line: 812, column: 13, scope: !222, inlinedAt: !226)
!258 = !DILocation(line: 813, column: 26, scope: !222, inlinedAt: !226)
!259 = !DILocation(line: 813, column: 20, scope: !222, inlinedAt: !226)
!260 = !DILocation(line: 813, column: 24, scope: !222, inlinedAt: !226)
!261 = !DILocation(line: 814, column: 37, scope: !222, inlinedAt: !226)
!262 = !DILocation(line: 843, column: 1, scope: !174)
!263 = distinct !DISubprogram(name: "x264_cabac_encode_bypass_c", scope: !3, file: !3, line: 845, type: !264, scopeLine: 846, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !266)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !71, !15}
!266 = !{!267, !268}
!267 = !DILocalVariable(name: "cb", arg: 1, scope: !263, file: !3, line: 845, type: !71)
!268 = !DILocalVariable(name: "b", arg: 2, scope: !263, file: !3, line: 845, type: !15)
!269 = !DILocation(line: 0, scope: !263)
!270 = !DILocation(line: 847, column: 15, scope: !263)
!271 = !DILocation(line: 848, column: 18, scope: !263)
!272 = !DILocation(line: 848, column: 27, scope: !263)
!273 = !DILocation(line: 848, column: 21, scope: !263)
!274 = !DILocation(line: 848, column: 15, scope: !263)
!275 = !DILocation(line: 849, column: 9, scope: !263)
!276 = !DILocation(line: 849, column: 17, scope: !263)
!277 = !DILocation(line: 0, scope: !216, inlinedAt: !278)
!278 = distinct !DILocation(line: 850, column: 5, scope: !263)
!279 = !DILocation(line: 789, column: 21, scope: !220, inlinedAt: !278)
!280 = !DILocation(line: 789, column: 9, scope: !216, inlinedAt: !278)
!281 = !DILocation(line: 791, column: 44, scope: !219, inlinedAt: !278)
!282 = !DILocation(line: 791, column: 29, scope: !219, inlinedAt: !278)
!283 = !DILocation(line: 0, scope: !219, inlinedAt: !278)
!284 = !DILocation(line: 792, column: 28, scope: !219, inlinedAt: !278)
!285 = !DILocation(line: 792, column: 42, scope: !219, inlinedAt: !278)
!286 = !DILocation(line: 792, column: 19, scope: !219, inlinedAt: !278)
!287 = !DILocation(line: 793, column: 21, scope: !219, inlinedAt: !278)
!288 = !DILocation(line: 795, column: 18, scope: !223, inlinedAt: !278)
!289 = !DILocation(line: 795, column: 26, scope: !223, inlinedAt: !278)
!290 = !DILocation(line: 795, column: 13, scope: !219, inlinedAt: !278)
!291 = !DILocation(line: 796, column: 17, scope: !223, inlinedAt: !278)
!292 = !DILocation(line: 796, column: 36, scope: !223, inlinedAt: !278)
!293 = !DILocation(line: 796, column: 13, scope: !223, inlinedAt: !278)
!294 = !DILocation(line: 799, column: 29, scope: !222, inlinedAt: !278)
!295 = !DILocation(line: 0, scope: !222, inlinedAt: !278)
!296 = !DILocation(line: 800, column: 41, scope: !222, inlinedAt: !278)
!297 = !DILocation(line: 807, column: 17, scope: !222, inlinedAt: !278)
!298 = !DILocation(line: 807, column: 13, scope: !222, inlinedAt: !278)
!299 = !DILocation(line: 807, column: 23, scope: !222, inlinedAt: !278)
!300 = !DILocation(line: 808, column: 38, scope: !222, inlinedAt: !278)
!301 = !DILocation(line: 808, column: 13, scope: !222, inlinedAt: !278)
!302 = !DILocation(line: 810, column: 24, scope: !251, inlinedAt: !278)
!303 = !DILocation(line: 810, column: 28, scope: !251, inlinedAt: !278)
!304 = !DILocation(line: 811, column: 34, scope: !251, inlinedAt: !278)
!305 = distinct !{!305, !255}
!306 = distinct !{!306, !301, !307}
!307 = !DILocation(line: 812, column: 13, scope: !222, inlinedAt: !278)
!308 = !DILocation(line: 813, column: 26, scope: !222, inlinedAt: !278)
!309 = !DILocation(line: 813, column: 20, scope: !222, inlinedAt: !278)
!310 = !DILocation(line: 813, column: 24, scope: !222, inlinedAt: !278)
!311 = !DILocation(line: 814, column: 37, scope: !222, inlinedAt: !278)
!312 = !DILocation(line: 851, column: 1, scope: !263)
!313 = distinct !DISubprogram(name: "x264_cabac_encode_ue_bypass", scope: !3, file: !3, line: 853, type: !175, scopeLine: 854, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !314)
!314 = !{!315, !316, !317, !318, !319, !320}
!315 = !DILocalVariable(name: "cb", arg: 1, scope: !313, file: !3, line: 853, type: !71)
!316 = !DILocalVariable(name: "exp_bits", arg: 2, scope: !313, file: !3, line: 853, type: !15)
!317 = !DILocalVariable(name: "val", arg: 3, scope: !313, file: !3, line: 853, type: !15)
!318 = !DILocalVariable(name: "k", scope: !313, file: !3, line: 855, type: !15)
!319 = !DILocalVariable(name: "i", scope: !313, file: !3, line: 855, type: !15)
!320 = !DILocalVariable(name: "x", scope: !313, file: !3, line: 858, type: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !22, line: 26, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !24, line: 42, baseType: !7)
!323 = !DILocation(line: 0, scope: !313)
!324 = !DILocation(line: 856, column: 33, scope: !325)
!325 = distinct !DILexicalBlock(scope: !326, file: !3, line: 856, column: 5)
!326 = distinct !DILexicalBlock(scope: !313, file: !3, line: 856, column: 5)
!327 = !DILocation(line: 856, column: 28, scope: !325)
!328 = !DILocation(line: 856, column: 5, scope: !326)
!329 = !DILocation(line: 857, column: 13, scope: !325)
!330 = !DILocation(line: 856, column: 40, scope: !325)
!331 = distinct !{!331, !328, !332}
!332 = !DILocation(line: 857, column: 19, scope: !326)
!333 = !DILocation(line: 856, scope: !326)
!334 = !DILocation(line: 858, column: 26, scope: !313)
!335 = !DILocation(line: 858, column: 37, scope: !313)
!336 = !DILocation(line: 858, column: 44, scope: !313)
!337 = !DILocation(line: 858, column: 40, scope: !313)
!338 = !DILocation(line: 858, column: 48, scope: !313)
!339 = !DILocation(line: 859, column: 10, scope: !313)
!340 = !DILocation(line: 859, column: 14, scope: !313)
!341 = !DILocation(line: 860, column: 15, scope: !313)
!342 = !DILocation(line: 860, column: 18, scope: !313)
!343 = !DILocation(line: 861, column: 5, scope: !313)
!344 = !DILocation(line: 862, column: 11, scope: !345)
!345 = distinct !DILexicalBlock(scope: !313, file: !3, line: 861, column: 8)
!346 = !DILocation(line: 863, column: 19, scope: !345)
!347 = !DILocation(line: 864, column: 25, scope: !345)
!348 = !DILocation(line: 864, column: 29, scope: !345)
!349 = !DILocation(line: 864, column: 42, scope: !345)
!350 = !DILocation(line: 864, column: 36, scope: !345)
!351 = !DILocation(line: 864, column: 19, scope: !345)
!352 = !DILocation(line: 865, column: 21, scope: !345)
!353 = !DILocation(line: 0, scope: !216, inlinedAt: !354)
!354 = distinct !DILocation(line: 866, column: 9, scope: !345)
!355 = !DILocation(line: 789, column: 21, scope: !220, inlinedAt: !354)
!356 = !DILocation(line: 789, column: 9, scope: !216, inlinedAt: !354)
!357 = !DILocation(line: 791, column: 44, scope: !219, inlinedAt: !354)
!358 = !DILocation(line: 791, column: 29, scope: !219, inlinedAt: !354)
!359 = !DILocation(line: 0, scope: !219, inlinedAt: !354)
!360 = !DILocation(line: 792, column: 28, scope: !219, inlinedAt: !354)
!361 = !DILocation(line: 792, column: 42, scope: !219, inlinedAt: !354)
!362 = !DILocation(line: 792, column: 19, scope: !219, inlinedAt: !354)
!363 = !DILocation(line: 793, column: 21, scope: !219, inlinedAt: !354)
!364 = !DILocation(line: 795, column: 18, scope: !223, inlinedAt: !354)
!365 = !DILocation(line: 795, column: 26, scope: !223, inlinedAt: !354)
!366 = !DILocation(line: 795, column: 13, scope: !219, inlinedAt: !354)
!367 = !DILocation(line: 796, column: 36, scope: !223, inlinedAt: !354)
!368 = !DILocation(line: 796, column: 13, scope: !223, inlinedAt: !354)
!369 = !DILocation(line: 799, column: 29, scope: !222, inlinedAt: !354)
!370 = !DILocation(line: 0, scope: !222, inlinedAt: !354)
!371 = !DILocation(line: 800, column: 41, scope: !222, inlinedAt: !354)
!372 = !DILocation(line: 807, column: 17, scope: !222, inlinedAt: !354)
!373 = !DILocation(line: 807, column: 13, scope: !222, inlinedAt: !354)
!374 = !DILocation(line: 807, column: 23, scope: !222, inlinedAt: !354)
!375 = !DILocation(line: 808, column: 38, scope: !222, inlinedAt: !354)
!376 = !DILocation(line: 808, column: 13, scope: !222, inlinedAt: !354)
!377 = !DILocation(line: 810, column: 24, scope: !251, inlinedAt: !354)
!378 = !DILocation(line: 810, column: 28, scope: !251, inlinedAt: !354)
!379 = !DILocation(line: 811, column: 34, scope: !251, inlinedAt: !354)
!380 = distinct !{!380, !255}
!381 = distinct !{!381, !376, !382}
!382 = !DILocation(line: 812, column: 13, scope: !222, inlinedAt: !354)
!383 = !DILocation(line: 813, column: 26, scope: !222, inlinedAt: !354)
!384 = !DILocation(line: 813, column: 20, scope: !222, inlinedAt: !354)
!385 = !DILocation(line: 813, column: 24, scope: !222, inlinedAt: !354)
!386 = !DILocation(line: 0, scope: !223, inlinedAt: !354)
!387 = !DILocation(line: 868, column: 16, scope: !313)
!388 = !DILocation(line: 868, column: 5, scope: !345)
!389 = distinct !{!389, !343, !390}
!390 = !DILocation(line: 868, column: 20, scope: !313)
!391 = !DILocation(line: 869, column: 1, scope: !313)
!392 = distinct !DISubprogram(name: "x264_cabac_encode_terminal_c", scope: !3, file: !3, line: 871, type: !149, scopeLine: 872, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !393)
!393 = !{!394}
!394 = !DILocalVariable(name: "cb", arg: 1, scope: !392, file: !3, line: 871, type: !71)
!395 = !DILocation(line: 0, scope: !392)
!396 = !DILocation(line: 873, column: 9, scope: !392)
!397 = !DILocation(line: 873, column: 17, scope: !392)
!398 = !DILocation(line: 0, scope: !203, inlinedAt: !399)
!399 = distinct !DILocation(line: 874, column: 5, scope: !392)
!400 = !DILocation(line: 821, column: 52, scope: !203, inlinedAt: !399)
!401 = !DILocation(line: 821, column: 17, scope: !203, inlinedAt: !399)
!402 = !DILocation(line: 822, column: 17, scope: !203, inlinedAt: !399)
!403 = !DILocation(line: 823, column: 17, scope: !203, inlinedAt: !399)
!404 = !DILocation(line: 824, column: 9, scope: !203, inlinedAt: !399)
!405 = !DILocation(line: 824, column: 18, scope: !203, inlinedAt: !399)
!406 = !DILocation(line: 0, scope: !216, inlinedAt: !407)
!407 = distinct !DILocation(line: 825, column: 5, scope: !203, inlinedAt: !399)
!408 = !DILocation(line: 789, column: 21, scope: !220, inlinedAt: !407)
!409 = !DILocation(line: 789, column: 9, scope: !216, inlinedAt: !407)
!410 = !DILocation(line: 791, column: 44, scope: !219, inlinedAt: !407)
!411 = !DILocation(line: 791, column: 29, scope: !219, inlinedAt: !407)
!412 = !DILocation(line: 0, scope: !219, inlinedAt: !407)
!413 = !DILocation(line: 792, column: 28, scope: !219, inlinedAt: !407)
!414 = !DILocation(line: 792, column: 42, scope: !219, inlinedAt: !407)
!415 = !DILocation(line: 792, column: 19, scope: !219, inlinedAt: !407)
!416 = !DILocation(line: 793, column: 21, scope: !219, inlinedAt: !407)
!417 = !DILocation(line: 795, column: 18, scope: !223, inlinedAt: !407)
!418 = !DILocation(line: 795, column: 26, scope: !223, inlinedAt: !407)
!419 = !DILocation(line: 795, column: 13, scope: !219, inlinedAt: !407)
!420 = !DILocation(line: 796, column: 17, scope: !223, inlinedAt: !407)
!421 = !DILocation(line: 796, column: 36, scope: !223, inlinedAt: !407)
!422 = !DILocation(line: 796, column: 13, scope: !223, inlinedAt: !407)
!423 = !DILocation(line: 799, column: 29, scope: !222, inlinedAt: !407)
!424 = !DILocation(line: 0, scope: !222, inlinedAt: !407)
!425 = !DILocation(line: 800, column: 41, scope: !222, inlinedAt: !407)
!426 = !DILocation(line: 807, column: 17, scope: !222, inlinedAt: !407)
!427 = !DILocation(line: 807, column: 13, scope: !222, inlinedAt: !407)
!428 = !DILocation(line: 807, column: 23, scope: !222, inlinedAt: !407)
!429 = !DILocation(line: 808, column: 38, scope: !222, inlinedAt: !407)
!430 = !DILocation(line: 808, column: 13, scope: !222, inlinedAt: !407)
!431 = !DILocation(line: 810, column: 24, scope: !251, inlinedAt: !407)
!432 = !DILocation(line: 810, column: 28, scope: !251, inlinedAt: !407)
!433 = !DILocation(line: 811, column: 34, scope: !251, inlinedAt: !407)
!434 = distinct !{!434, !255}
!435 = distinct !{!435, !430, !436}
!436 = !DILocation(line: 812, column: 13, scope: !222, inlinedAt: !407)
!437 = !DILocation(line: 813, column: 26, scope: !222, inlinedAt: !407)
!438 = !DILocation(line: 813, column: 20, scope: !222, inlinedAt: !407)
!439 = !DILocation(line: 813, column: 24, scope: !222, inlinedAt: !407)
!440 = !DILocation(line: 814, column: 37, scope: !222, inlinedAt: !407)
!441 = !DILocation(line: 875, column: 1, scope: !392)
!442 = distinct !DISubprogram(name: "x264_cabac_encode_flush", scope: !3, file: !3, line: 877, type: !443, scopeLine: 878, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1721)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !445, !71}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !447, line: 46, baseType: !448)
!447 = !DIFile(filename: "x264_src/x264.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !6, line: 381, size: 266752, elements: !449)
!449 = !{!450, !617, !621, !622, !623, !624, !625, !626, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !761, !763, !790, !792, !793, !794, !799, !803, !804, !805, !809, !813, !814, !815, !820, !823, !824, !901, !902, !1063, !1064, !1065, !1066, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1091, !1285, !1289, !1350, !1353, !1355, !1357, !1358, !1361, !1366, !1375, !1376, !1384, !1386, !1391, !1467, !1553, !1597, !1619, !1668, !1697}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !448, file: !6, line: 384, baseType: !451, size: 5632)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !447, line: 376, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !447, line: 176, size: 5632, elements: !453)
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !497, !501, !502, !503, !504, !506, !507, !521, !522, !523, !524, !525, !555, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !452, file: !447, line: 179, baseType: !7, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !452, file: !447, line: 180, baseType: !15, size: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !452, file: !447, line: 181, baseType: !15, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !452, file: !447, line: 182, baseType: !15, size: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !452, file: !447, line: 183, baseType: !15, size: 32, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !452, file: !447, line: 186, baseType: !15, size: 32, offset: 160)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !452, file: !447, line: 187, baseType: !15, size: 32, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !452, file: !447, line: 188, baseType: !15, size: 32, offset: 224)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !452, file: !447, line: 189, baseType: !15, size: 32, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !452, file: !447, line: 190, baseType: !15, size: 32, offset: 288)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !452, file: !447, line: 198, baseType: !15, size: 32, offset: 320)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !452, file: !447, line: 215, baseType: !466, size: 288, offset: 352)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !452, file: !447, line: 200, size: 288, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !466, file: !447, line: 203, baseType: !15, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !466, file: !447, line: 204, baseType: !15, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !466, file: !447, line: 206, baseType: !15, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !466, file: !447, line: 209, baseType: !15, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !466, file: !447, line: 210, baseType: !15, size: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !466, file: !447, line: 211, baseType: !15, size: 32, offset: 160)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !466, file: !447, line: 212, baseType: !15, size: 32, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !466, file: !447, line: 213, baseType: !15, size: 32, offset: 224)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !466, file: !447, line: 214, baseType: !15, size: 32, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !452, file: !447, line: 218, baseType: !15, size: 32, offset: 640)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !452, file: !447, line: 219, baseType: !15, size: 32, offset: 672)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !452, file: !447, line: 220, baseType: !15, size: 32, offset: 704)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !452, file: !447, line: 221, baseType: !15, size: 32, offset: 736)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !452, file: !447, line: 222, baseType: !15, size: 32, offset: 768)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !452, file: !447, line: 224, baseType: !15, size: 32, offset: 800)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !452, file: !447, line: 225, baseType: !15, size: 32, offset: 832)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !452, file: !447, line: 226, baseType: !15, size: 32, offset: 864)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !452, file: !447, line: 227, baseType: !15, size: 32, offset: 896)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !452, file: !447, line: 229, baseType: !15, size: 32, offset: 928)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !452, file: !447, line: 230, baseType: !15, size: 32, offset: 960)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !452, file: !447, line: 231, baseType: !15, size: 32, offset: 992)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !452, file: !447, line: 233, baseType: !15, size: 32, offset: 1024)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !452, file: !447, line: 234, baseType: !15, size: 32, offset: 1056)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !452, file: !447, line: 236, baseType: !15, size: 32, offset: 1088)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !452, file: !447, line: 237, baseType: !15, size: 32, offset: 1120)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !452, file: !447, line: 239, baseType: !15, size: 32, offset: 1152)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !452, file: !447, line: 240, baseType: !495, size: 64, offset: 1216)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !452, file: !447, line: 241, baseType: !498, size: 128, offset: 1280)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 128, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 16)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !452, file: !447, line: 242, baseType: !498, size: 128, offset: 1408)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !452, file: !447, line: 243, baseType: !498, size: 128, offset: 1536)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !452, file: !447, line: 244, baseType: !498, size: 128, offset: 1664)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !452, file: !447, line: 245, baseType: !505, size: 512, offset: 1792)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 512, elements: !32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !452, file: !447, line: 246, baseType: !505, size: 512, offset: 2304)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !452, file: !447, line: 249, baseType: !508, size: 64, offset: 2816)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !511, !15, !512, !514}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !496)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !516)
!516 = !{!517, !518, !519, !520}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !515, file: !3, line: 875, baseType: !7, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !515, file: !3, line: 875, baseType: !7, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !515, file: !3, line: 875, baseType: !511, size: 64, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !515, file: !3, line: 875, baseType: !511, size: 64, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !452, file: !447, line: 250, baseType: !511, size: 64, offset: 2880)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !452, file: !447, line: 251, baseType: !15, size: 32, offset: 2944)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !452, file: !447, line: 252, baseType: !15, size: 32, offset: 2976)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !452, file: !447, line: 253, baseType: !495, size: 64, offset: 3008)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !452, file: !447, line: 287, baseType: !526, size: 800, offset: 3072)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !452, file: !447, line: 256, size: 800, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !548, !549, !550, !553, !554}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !526, file: !447, line: 258, baseType: !7, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !526, file: !447, line: 259, baseType: !7, size: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !526, file: !447, line: 261, baseType: !15, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !526, file: !447, line: 262, baseType: !15, size: 32, offset: 96)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !526, file: !447, line: 263, baseType: !15, size: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !526, file: !447, line: 264, baseType: !15, size: 32, offset: 160)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !526, file: !447, line: 265, baseType: !15, size: 32, offset: 192)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !526, file: !447, line: 267, baseType: !15, size: 32, offset: 224)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !526, file: !447, line: 268, baseType: !15, size: 32, offset: 256)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !526, file: !447, line: 269, baseType: !15, size: 32, offset: 288)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !526, file: !447, line: 270, baseType: !15, size: 32, offset: 320)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !526, file: !447, line: 271, baseType: !15, size: 32, offset: 352)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !526, file: !447, line: 272, baseType: !15, size: 32, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !526, file: !447, line: 273, baseType: !15, size: 32, offset: 416)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !526, file: !447, line: 274, baseType: !15, size: 32, offset: 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !526, file: !447, line: 275, baseType: !15, size: 32, offset: 480)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !526, file: !447, line: 276, baseType: !15, size: 32, offset: 512)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !526, file: !447, line: 277, baseType: !15, size: 32, offset: 544)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !526, file: !447, line: 278, baseType: !547, size: 32, offset: 576)
!547 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !526, file: !447, line: 279, baseType: !547, size: 32, offset: 608)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !526, file: !447, line: 280, baseType: !15, size: 32, offset: 640)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !526, file: !447, line: 283, baseType: !551, size: 64, offset: 672)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, elements: !552)
!552 = !{!28}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !526, file: !447, line: 285, baseType: !15, size: 32, offset: 736)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !526, file: !447, line: 286, baseType: !15, size: 32, offset: 768)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !452, file: !447, line: 327, baseType: !556, size: 1152, offset: 3904)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !452, file: !447, line: 290, size: 1152, elements: !557)
!557 = !{!558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !595, !596}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !556, file: !447, line: 292, baseType: !15, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !556, file: !447, line: 294, baseType: !15, size: 32, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !556, file: !447, line: 295, baseType: !15, size: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !556, file: !447, line: 296, baseType: !15, size: 32, offset: 96)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !556, file: !447, line: 297, baseType: !15, size: 32, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !556, file: !447, line: 299, baseType: !15, size: 32, offset: 160)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !556, file: !447, line: 300, baseType: !547, size: 32, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !556, file: !447, line: 301, baseType: !547, size: 32, offset: 224)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !556, file: !447, line: 302, baseType: !547, size: 32, offset: 256)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !556, file: !447, line: 303, baseType: !15, size: 32, offset: 288)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !556, file: !447, line: 304, baseType: !15, size: 32, offset: 320)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !556, file: !447, line: 305, baseType: !547, size: 32, offset: 352)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !556, file: !447, line: 306, baseType: !547, size: 32, offset: 384)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !556, file: !447, line: 307, baseType: !547, size: 32, offset: 416)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !556, file: !447, line: 309, baseType: !15, size: 32, offset: 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !556, file: !447, line: 310, baseType: !547, size: 32, offset: 480)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !556, file: !447, line: 311, baseType: !15, size: 32, offset: 512)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !556, file: !447, line: 312, baseType: !15, size: 32, offset: 544)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !556, file: !447, line: 315, baseType: !15, size: 32, offset: 576)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !556, file: !447, line: 316, baseType: !495, size: 64, offset: 640)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !556, file: !447, line: 317, baseType: !15, size: 32, offset: 704)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !556, file: !447, line: 318, baseType: !495, size: 64, offset: 768)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !556, file: !447, line: 321, baseType: !547, size: 32, offset: 832)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !556, file: !447, line: 322, baseType: !547, size: 32, offset: 864)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !556, file: !447, line: 323, baseType: !547, size: 32, offset: 896)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !556, file: !447, line: 324, baseType: !584, size: 64, offset: 960)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !447, line: 174, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !447, line: 167, size: 256, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !586, file: !447, line: 169, baseType: !15, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !586, file: !447, line: 169, baseType: !15, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !586, file: !447, line: 170, baseType: !15, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !586, file: !447, line: 171, baseType: !15, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !586, file: !447, line: 172, baseType: !547, size: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !586, file: !447, line: 173, baseType: !594, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !556, file: !447, line: 325, baseType: !15, size: 32, offset: 1024)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !556, file: !447, line: 326, baseType: !495, size: 64, offset: 1088)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !452, file: !447, line: 330, baseType: !15, size: 32, offset: 5056)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !452, file: !447, line: 331, baseType: !15, size: 32, offset: 5088)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !452, file: !447, line: 332, baseType: !15, size: 32, offset: 5120)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !452, file: !447, line: 334, baseType: !15, size: 32, offset: 5152)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !452, file: !447, line: 335, baseType: !15, size: 32, offset: 5184)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !452, file: !447, line: 336, baseType: !321, size: 32, offset: 5216)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !452, file: !447, line: 337, baseType: !321, size: 32, offset: 5248)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !452, file: !447, line: 338, baseType: !321, size: 32, offset: 5280)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !452, file: !447, line: 339, baseType: !321, size: 32, offset: 5312)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !452, file: !447, line: 340, baseType: !15, size: 32, offset: 5344)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !452, file: !447, line: 344, baseType: !15, size: 32, offset: 5376)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !452, file: !447, line: 356, baseType: !15, size: 32, offset: 5408)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !452, file: !447, line: 364, baseType: !15, size: 32, offset: 5440)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !452, file: !447, line: 367, baseType: !15, size: 32, offset: 5472)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !452, file: !447, line: 368, baseType: !15, size: 32, offset: 5504)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !452, file: !447, line: 369, baseType: !15, size: 32, offset: 5536)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !452, file: !447, line: 375, baseType: !614, size: 64, offset: 5568)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{null, !511}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !448, file: !6, line: 386, baseType: !618, size: 8256, offset: 5632)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 8256, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 129)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !448, file: !6, line: 387, baseType: !15, size: 32, offset: 13888)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !448, file: !6, line: 388, baseType: !15, size: 32, offset: 13920)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !448, file: !6, line: 389, baseType: !15, size: 32, offset: 13952)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !448, file: !6, line: 390, baseType: !15, size: 32, offset: 13984)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !448, file: !6, line: 391, baseType: !15, size: 32, offset: 14016)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !448, file: !6, line: 402, baseType: !627, size: 576, offset: 14080)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !448, file: !6, line: 394, size: 576, elements: !628)
!628 = !{!629, !630, !631, !640, !641, !642}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !627, file: !6, line: 396, baseType: !15, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !627, file: !6, line: 397, baseType: !15, size: 32, offset: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !627, file: !6, line: 398, baseType: !632, size: 64, offset: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !447, line: 604, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !447, line: 593, size: 192, elements: !635)
!635 = !{!636, !637, !638, !639}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !634, file: !447, line: 595, baseType: !15, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !634, file: !447, line: 596, baseType: !15, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !634, file: !447, line: 599, baseType: !15, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !634, file: !447, line: 603, baseType: !81, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !627, file: !6, line: 399, baseType: !15, size: 32, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !627, file: !6, line: 400, baseType: !81, size: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !627, file: !6, line: 401, baseType: !643, size: 320, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !644, line: 56, baseType: !645)
!644 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !644, line: 47, size: 320, elements: !646)
!646 = !{!647, !648, !649, !650, !654, !655}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !645, file: !644, line: 49, baseType: !81, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !645, file: !644, line: 50, baseType: !81, size: 64, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !645, file: !644, line: 51, baseType: !81, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !645, file: !644, line: 53, baseType: !651, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !652, line: 87, baseType: !653)
!652 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!653 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !645, file: !644, line: 54, baseType: !15, size: 32, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !645, file: !644, line: 55, baseType: !15, size: 32, offset: 288)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !448, file: !6, line: 404, baseType: !81, size: 64, offset: 14656)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !448, file: !6, line: 405, baseType: !15, size: 32, offset: 14720)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !448, file: !6, line: 410, baseType: !15, size: 32, offset: 14752)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !448, file: !6, line: 411, baseType: !15, size: 32, offset: 14784)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !448, file: !6, line: 413, baseType: !15, size: 32, offset: 14816)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !448, file: !6, line: 415, baseType: !15, size: 32, offset: 14848)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !448, file: !6, line: 416, baseType: !15, size: 32, offset: 14880)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !448, file: !6, line: 418, baseType: !15, size: 32, offset: 14912)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !448, file: !6, line: 419, baseType: !15, size: 32, offset: 14944)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !448, file: !6, line: 420, baseType: !15, size: 32, offset: 14976)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !448, file: !6, line: 421, baseType: !15, size: 32, offset: 15008)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !448, file: !6, line: 422, baseType: !15, size: 32, offset: 15040)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !448, file: !6, line: 424, baseType: !15, size: 32, offset: 15072)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !448, file: !6, line: 425, baseType: !15, size: 32, offset: 15104)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !448, file: !6, line: 427, baseType: !15, size: 32, offset: 15136)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !448, file: !6, line: 430, baseType: !672, size: 10400, offset: 15168)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 10400, elements: !759)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !674, line: 154, baseType: !675)
!674 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !674, line: 52, size: 10400, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !694, !695, !696, !697, !698, !699, !700, !701, !702, !709, !710, !758}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !675, file: !674, line: 54, baseType: !15, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !675, file: !674, line: 56, baseType: !15, size: 32, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !675, file: !674, line: 57, baseType: !15, size: 32, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !675, file: !674, line: 59, baseType: !15, size: 32, offset: 96)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !675, file: !674, line: 60, baseType: !15, size: 32, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !675, file: !674, line: 61, baseType: !15, size: 32, offset: 160)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !675, file: !674, line: 63, baseType: !15, size: 32, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !675, file: !674, line: 65, baseType: !15, size: 32, offset: 224)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !675, file: !674, line: 67, baseType: !15, size: 32, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !675, file: !674, line: 69, baseType: !15, size: 32, offset: 288)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !675, file: !674, line: 70, baseType: !15, size: 32, offset: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !675, file: !674, line: 71, baseType: !15, size: 32, offset: 352)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !675, file: !674, line: 72, baseType: !15, size: 32, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !675, file: !674, line: 73, baseType: !691, size: 8192, offset: 416)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8192, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !675, file: !674, line: 75, baseType: !15, size: 32, offset: 8608)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !675, file: !674, line: 76, baseType: !15, size: 32, offset: 8640)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !675, file: !674, line: 77, baseType: !15, size: 32, offset: 8672)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !675, file: !674, line: 78, baseType: !15, size: 32, offset: 8704)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !675, file: !674, line: 79, baseType: !15, size: 32, offset: 8736)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !675, file: !674, line: 80, baseType: !15, size: 32, offset: 8768)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !675, file: !674, line: 81, baseType: !15, size: 32, offset: 8800)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !675, file: !674, line: 83, baseType: !15, size: 32, offset: 8832)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !675, file: !674, line: 90, baseType: !703, size: 128, offset: 8864)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !675, file: !674, line: 84, size: 128, elements: !704)
!704 = !{!705, !706, !707, !708}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !703, file: !674, line: 86, baseType: !15, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !703, file: !674, line: 87, baseType: !15, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !703, file: !674, line: 88, baseType: !15, size: 32, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !703, file: !674, line: 89, baseType: !15, size: 32, offset: 96)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !675, file: !674, line: 92, baseType: !15, size: 32, offset: 8992)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !675, file: !674, line: 150, baseType: !711, size: 1344, offset: 9024)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !675, file: !674, line: 93, size: 1344, elements: !712)
!712 = !{!713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !749, !750, !751, !752, !753, !754, !755, !756, !757}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !711, file: !674, line: 95, baseType: !15, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !711, file: !674, line: 96, baseType: !15, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !711, file: !674, line: 97, baseType: !15, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !711, file: !674, line: 99, baseType: !15, size: 32, offset: 96)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !711, file: !674, line: 100, baseType: !15, size: 32, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !711, file: !674, line: 102, baseType: !15, size: 32, offset: 160)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !711, file: !674, line: 103, baseType: !15, size: 32, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !711, file: !674, line: 104, baseType: !15, size: 32, offset: 224)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !711, file: !674, line: 105, baseType: !15, size: 32, offset: 256)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !711, file: !674, line: 106, baseType: !15, size: 32, offset: 288)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !711, file: !674, line: 107, baseType: !15, size: 32, offset: 320)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !711, file: !674, line: 108, baseType: !15, size: 32, offset: 352)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !711, file: !674, line: 110, baseType: !15, size: 32, offset: 384)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !711, file: !674, line: 111, baseType: !15, size: 32, offset: 416)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !711, file: !674, line: 112, baseType: !15, size: 32, offset: 448)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !711, file: !674, line: 114, baseType: !15, size: 32, offset: 480)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !711, file: !674, line: 115, baseType: !321, size: 32, offset: 512)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !711, file: !674, line: 116, baseType: !321, size: 32, offset: 544)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !711, file: !674, line: 117, baseType: !15, size: 32, offset: 576)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !711, file: !674, line: 119, baseType: !15, size: 32, offset: 608)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !711, file: !674, line: 120, baseType: !15, size: 32, offset: 640)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !711, file: !674, line: 137, baseType: !735, size: 384, offset: 672)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !711, file: !674, line: 122, size: 384, elements: !736)
!736 = !{!737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !735, file: !674, line: 124, baseType: !15, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !735, file: !674, line: 125, baseType: !15, size: 32, offset: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !735, file: !674, line: 126, baseType: !15, size: 32, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !735, file: !674, line: 127, baseType: !15, size: 32, offset: 96)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !735, file: !674, line: 128, baseType: !15, size: 32, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !735, file: !674, line: 129, baseType: !15, size: 32, offset: 160)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !735, file: !674, line: 130, baseType: !15, size: 32, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !735, file: !674, line: 131, baseType: !15, size: 32, offset: 224)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !735, file: !674, line: 133, baseType: !15, size: 32, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !735, file: !674, line: 134, baseType: !15, size: 32, offset: 288)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !735, file: !674, line: 135, baseType: !15, size: 32, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !735, file: !674, line: 136, baseType: !15, size: 32, offset: 352)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !711, file: !674, line: 139, baseType: !15, size: 32, offset: 1056)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !711, file: !674, line: 140, baseType: !15, size: 32, offset: 1088)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !711, file: !674, line: 141, baseType: !15, size: 32, offset: 1120)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !711, file: !674, line: 142, baseType: !15, size: 32, offset: 1152)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !711, file: !674, line: 143, baseType: !15, size: 32, offset: 1184)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !711, file: !674, line: 144, baseType: !15, size: 32, offset: 1216)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !711, file: !674, line: 145, baseType: !15, size: 32, offset: 1248)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !711, file: !674, line: 146, baseType: !15, size: 32, offset: 1280)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !711, file: !674, line: 147, baseType: !15, size: 32, offset: 1312)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !675, file: !674, line: 152, baseType: !15, size: 32, offset: 10368)
!759 = !{!760}
!760 = !DISubrange(count: 1)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !448, file: !6, line: 431, baseType: !762, size: 64, offset: 25600)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !448, file: !6, line: 432, baseType: !764, size: 960, offset: 25664)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 960, elements: !759)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !674, line: 186, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !674, line: 156, size: 960, elements: !767)
!767 = !{!768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !766, file: !674, line: 158, baseType: !15, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !766, file: !674, line: 159, baseType: !15, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !766, file: !674, line: 161, baseType: !15, size: 32, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !766, file: !674, line: 163, baseType: !15, size: 32, offset: 96)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !766, file: !674, line: 164, baseType: !15, size: 32, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !766, file: !674, line: 166, baseType: !15, size: 32, offset: 160)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !766, file: !674, line: 167, baseType: !15, size: 32, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !766, file: !674, line: 169, baseType: !15, size: 32, offset: 224)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !766, file: !674, line: 170, baseType: !15, size: 32, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !766, file: !674, line: 172, baseType: !15, size: 32, offset: 288)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !766, file: !674, line: 173, baseType: !15, size: 32, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !766, file: !674, line: 175, baseType: !15, size: 32, offset: 352)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !766, file: !674, line: 177, baseType: !15, size: 32, offset: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !766, file: !674, line: 178, baseType: !15, size: 32, offset: 416)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !766, file: !674, line: 179, baseType: !15, size: 32, offset: 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !766, file: !674, line: 181, baseType: !15, size: 32, offset: 480)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !766, file: !674, line: 183, baseType: !15, size: 32, offset: 512)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !766, file: !674, line: 184, baseType: !786, size: 384, offset: 576)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 384, elements: !788)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!788 = !{!789}
!789 = !DISubrange(count: 6)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !448, file: !6, line: 433, baseType: !791, size: 64, offset: 26624)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !448, file: !6, line: 434, baseType: !15, size: 32, offset: 26688)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !448, file: !6, line: 437, baseType: !15, size: 32, offset: 26720)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !448, file: !6, line: 440, baseType: !795, size: 256, offset: 26752)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 256, elements: !798)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 512, elements: !499)
!798 = !{!59}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !448, file: !6, line: 441, baseType: !800, size: 128, offset: 27008)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 128, elements: !552)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 2048, elements: !32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !448, file: !6, line: 443, baseType: !795, size: 256, offset: 27136)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !448, file: !6, line: 444, baseType: !800, size: 128, offset: 27392)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !448, file: !6, line: 446, baseType: !806, size: 256, offset: 27520)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 256, elements: !798)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 256, elements: !499)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !448, file: !6, line: 447, baseType: !810, size: 128, offset: 27776)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 128, elements: !552)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 1024, elements: !32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !448, file: !6, line: 448, baseType: !806, size: 256, offset: 27904)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !448, file: !6, line: 449, baseType: !810, size: 128, offset: 28160)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !448, file: !6, line: 454, baseType: !816, size: 5888, offset: 28288)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 5888, elements: !818)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!818 = !{!819}
!819 = !DISubrange(count: 92)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !448, file: !6, line: 455, baseType: !821, size: 23552, offset: 34176)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 23552, elements: !822)
!822 = !{!819, !59}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !448, file: !6, line: 457, baseType: !787, size: 64, offset: 57728)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !448, file: !6, line: 460, baseType: !825, size: 53376, offset: 57856)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !6, line: 364, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 302, size: 53376, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !856, !885, !886, !887, !893, !894, !895, !896, !897, !898, !899, !900}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !826, file: !6, line: 304, baseType: !762, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !826, file: !6, line: 305, baseType: !791, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !826, file: !6, line: 307, baseType: !15, size: 32, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !826, file: !6, line: 308, baseType: !15, size: 32, offset: 160)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !826, file: !6, line: 309, baseType: !15, size: 32, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !826, file: !6, line: 311, baseType: !15, size: 32, offset: 224)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !826, file: !6, line: 313, baseType: !15, size: 32, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !826, file: !6, line: 315, baseType: !15, size: 32, offset: 288)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !826, file: !6, line: 316, baseType: !15, size: 32, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !826, file: !6, line: 317, baseType: !15, size: 32, offset: 352)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !826, file: !6, line: 319, baseType: !15, size: 32, offset: 384)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !826, file: !6, line: 321, baseType: !15, size: 32, offset: 416)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !826, file: !6, line: 322, baseType: !15, size: 32, offset: 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !826, file: !6, line: 324, baseType: !551, size: 64, offset: 480)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !826, file: !6, line: 325, baseType: !15, size: 32, offset: 544)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !826, file: !6, line: 327, baseType: !15, size: 32, offset: 576)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !826, file: !6, line: 329, baseType: !15, size: 32, offset: 608)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !826, file: !6, line: 330, baseType: !15, size: 32, offset: 640)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !826, file: !6, line: 331, baseType: !15, size: 32, offset: 672)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !826, file: !6, line: 333, baseType: !15, size: 32, offset: 704)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !826, file: !6, line: 334, baseType: !15, size: 32, offset: 736)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !826, file: !6, line: 339, baseType: !850, size: 2048, offset: 768)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 2048, elements: !855)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !826, file: !6, line: 335, size: 64, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !851, file: !6, line: 337, baseType: !15, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !851, file: !6, line: 338, baseType: !15, size: 32, offset: 32)
!855 = !{!28, !500}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !826, file: !6, line: 342, baseType: !857, size: 49152, align: 128, offset: 2816)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !858, size: 49152, align: 128, elements: !883)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !859, line: 36, baseType: !860, align: 128)
!859 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !859, line: 26, size: 512, elements: !861)
!861 = !{!862, !869, !870, !873, !874, !875}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !860, file: !859, line: 30, baseType: !863, size: 128, align: 128)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !864, size: 128, elements: !867)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !47, line: 25, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !24, line: 39, baseType: !866)
!866 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!867 = !{!868}
!868 = !DISubrange(count: 8)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !860, file: !859, line: 31, baseType: !863, size: 128, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !860, file: !859, line: 32, baseType: !871, size: 32, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !47, line: 26, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !24, line: 41, baseType: !15)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !860, file: !859, line: 33, baseType: !871, size: 32, offset: 288)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !860, file: !859, line: 34, baseType: !871, size: 32, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !860, file: !859, line: 35, baseType: !876, size: 64, offset: 384)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !859, line: 25, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DISubroutineType(types: !880)
!880 = !{null, !81, !15, !81, !15, !881, !15}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !860)
!883 = !{!884, !56}
!884 = !DISubrange(count: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !826, file: !6, line: 344, baseType: !15, size: 32, offset: 51968)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !826, file: !6, line: 345, baseType: !15, size: 32, offset: 52000)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !826, file: !6, line: 350, baseType: !888, size: 1024, offset: 52032)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !889, size: 1024, elements: !499)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !826, file: !6, line: 346, size: 64, elements: !890)
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !889, file: !6, line: 348, baseType: !15, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !889, file: !6, line: 349, baseType: !15, size: 32, offset: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !826, file: !6, line: 352, baseType: !15, size: 32, offset: 53056)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !826, file: !6, line: 354, baseType: !15, size: 32, offset: 53088)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !826, file: !6, line: 355, baseType: !15, size: 32, offset: 53120)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !826, file: !6, line: 356, baseType: !15, size: 32, offset: 53152)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !826, file: !6, line: 357, baseType: !15, size: 32, offset: 53184)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !826, file: !6, line: 360, baseType: !15, size: 32, offset: 53216)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !826, file: !6, line: 361, baseType: !15, size: 32, offset: 53248)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !826, file: !6, line: 362, baseType: !15, size: 32, offset: 53280)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !448, file: !6, line: 463, baseType: !72, size: 4096, offset: 111232)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !448, file: !6, line: 494, baseType: !903, size: 2112, offset: 115328)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !448, file: !6, line: 465, size: 2112, elements: !904)
!904 = !{!905, !1043, !1045, !1046, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1059, !1060, !1061, !1062}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !903, file: !6, line: 468, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !909, line: 146, baseType: !910)
!909 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !909, line: 31, size: 125056, elements: !911)
!911 = !{!912, !913, !914, !915, !918, !919, !920, !921, !922, !923, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !942, !943, !944, !945, !946, !947, !949, !951, !952, !953, !954, !955, !958, !960, !961, !963, !965, !966, !970, !971, !975, !979, !982, !984, !985, !987, !988, !990, !991, !992, !995, !997, !998, !999, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1010, !1011, !1015, !1024, !1028, !1030, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !910, file: !909, line: 34, baseType: !15, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !910, file: !909, line: 35, baseType: !15, size: 32, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !910, file: !909, line: 36, baseType: !15, size: 32, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !910, file: !909, line: 37, baseType: !916, size: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !47, line: 27, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !24, line: 44, baseType: !653)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !910, file: !909, line: 38, baseType: !916, size: 64, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !910, file: !909, line: 39, baseType: !15, size: 32, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !910, file: !909, line: 40, baseType: !15, size: 32, offset: 288)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !910, file: !909, line: 41, baseType: !15, size: 32, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !910, file: !909, line: 42, baseType: !15, size: 32, offset: 352)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !910, file: !909, line: 43, baseType: !924, size: 64, offset: 384)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !910, file: !909, line: 45, baseType: !15, size: 32, offset: 448)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !910, file: !909, line: 46, baseType: !15, size: 32, offset: 480)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !910, file: !909, line: 47, baseType: !15, size: 32, offset: 512)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !910, file: !909, line: 48, baseType: !15, size: 32, offset: 544)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !910, file: !909, line: 49, baseType: !15, size: 32, offset: 576)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !910, file: !909, line: 50, baseType: !15, size: 32, offset: 608)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !910, file: !909, line: 51, baseType: !15, size: 32, offset: 640)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !910, file: !909, line: 52, baseType: !21, size: 8, offset: 672)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !910, file: !909, line: 53, baseType: !21, size: 8, offset: 680)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !910, file: !909, line: 54, baseType: !21, size: 8, offset: 688)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !910, file: !909, line: 55, baseType: !547, size: 32, offset: 704)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !910, file: !909, line: 56, baseType: !547, size: 32, offset: 736)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !910, file: !909, line: 57, baseType: !15, size: 32, offset: 768)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !910, file: !909, line: 60, baseType: !15, size: 32, offset: 800)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !910, file: !909, line: 61, baseType: !940, size: 96, offset: 832)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 96, elements: !941)
!941 = !{!56}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !910, file: !909, line: 62, baseType: !940, size: 96, offset: 928)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !910, file: !909, line: 63, baseType: !940, size: 96, offset: 1024)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !910, file: !909, line: 64, baseType: !15, size: 32, offset: 1120)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !910, file: !909, line: 65, baseType: !15, size: 32, offset: 1152)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !910, file: !909, line: 66, baseType: !15, size: 32, offset: 1184)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !910, file: !909, line: 67, baseType: !948, size: 192, offset: 1216)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 192, elements: !941)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !910, file: !909, line: 68, baseType: !950, size: 256, offset: 1408)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 256, elements: !798)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !910, file: !909, line: 69, baseType: !950, size: 256, offset: 1664)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !910, file: !909, line: 70, baseType: !817, size: 64, offset: 1920)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !910, file: !909, line: 74, baseType: !950, size: 256, offset: 1984)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !910, file: !909, line: 75, baseType: !950, size: 256, offset: 2240)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !910, file: !909, line: 77, baseType: !956, size: 24576, align: 128, offset: 2560)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !858, size: 24576, align: 128, elements: !957)
!957 = !{!500, !56}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !910, file: !909, line: 78, baseType: !959, size: 1024, offset: 27136)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 1024, elements: !499)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !910, file: !909, line: 79, baseType: !15, size: 32, offset: 28160)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !910, file: !909, line: 80, baseType: !962, size: 64, offset: 28224)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !910, file: !909, line: 83, baseType: !964, size: 64, offset: 28288)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !910, file: !909, line: 84, baseType: !81, size: 64, offset: 28352)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !910, file: !909, line: 85, baseType: !967, size: 128, offset: 28416)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 128, elements: !552)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !864, size: 32, elements: !552)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !910, file: !909, line: 86, baseType: !968, size: 64, offset: 28544)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !910, file: !909, line: 87, baseType: !972, size: 2176, offset: 28608)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 2176, elements: !973)
!973 = !{!28, !974}
!974 = !DISubrange(count: 17)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !910, file: !909, line: 92, baseType: !976, size: 20736, offset: 30784)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 20736, elements: !977)
!977 = !{!978, !978}
!978 = !DISubrange(count: 18)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !910, file: !909, line: 96, baseType: !980, size: 2176, offset: 51520)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 2176, elements: !973)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !910, file: !909, line: 97, baseType: !983, size: 128, offset: 53696)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 128, elements: !552)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !910, file: !909, line: 98, baseType: !551, size: 64, offset: 53824)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !910, file: !909, line: 99, baseType: !986, size: 1024, offset: 53888)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 1024, elements: !855)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !910, file: !909, line: 100, baseType: !969, size: 32, offset: 54912)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !910, file: !909, line: 105, baseType: !989, size: 10368, offset: 54944)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 10368, elements: !977)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !910, file: !909, line: 106, baseType: !989, size: 10368, offset: 65312)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !910, file: !909, line: 107, baseType: !15, size: 32, offset: 75680)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !910, file: !909, line: 108, baseType: !993, size: 576, offset: 75712)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 576, elements: !994)
!994 = !{!978}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !910, file: !909, line: 109, baseType: !996, size: 20736, offset: 76288)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 20736, elements: !977)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !910, file: !909, line: 110, baseType: !981, size: 64, offset: 97024)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !910, file: !909, line: 111, baseType: !981, size: 64, offset: 97088)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !910, file: !909, line: 112, baseType: !1000, size: 64, offset: 97152)
