; ModuleID = 'x264_src/common/common.c'
source_filename = "x264_src/common/common.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_cpu_name_t = type { [16 x i8], i32 }
%struct.__va_list_tag = type { i32, i32, ptr, ptr }

@.str = private unnamed_addr constant [15 x i8] c"x264_2pass.log\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [9 x i8] c"baseline\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [46 x i8] c"baseline profile doesn't support interlacing\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [51 x i8] c"baseline profile doesn't support fake interlacing\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [5 x i8] c"main\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [5 x i8] c"high\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [21 x i8] c"invalid profile: %s\0A\00", align 1, !dbg !29
@.str.7 = private unnamed_addr constant [37 x i8] c"%s profile doesn't support lossless\0A\00", align 1, !dbg !34
@.str.8 = private unnamed_addr constant [5 x i8] c"true\00", align 1, !dbg !39
@.str.11 = private unnamed_addr constant [6 x i8] c"false\00", align 1, !dbg !41
@.str.12 = private unnamed_addr constant [4 x i8] c"asm\00", align 1, !dbg !46
@.str.13 = private unnamed_addr constant [5 x i8] c"auto\00", align 1, !dbg !51

!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(scope: null, file: !113, line: 113, type: !24, isLocal: true, isDefinition: true)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "x264_motion_est_names", scope: !94, file: !113, line: 113, type: !694, isLocal: true, isDefinition: true)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 384, elements: !44)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(scope: null, file: !113, line: 121, type: !48, isLocal: true, isDefinition: true)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "x264_nal_hrd_names", scope: !94, file: !113, line: 121, type: !674, isLocal: true, isDefinition: true)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(scope: null, file: !2, line: 993, type: !43, isLocal: true, isDefinition: true)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(scope: null, file: !2, line: 996, type: !60, isLocal: true, isDefinition: true)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(scope: null, file: !2, line: 999, type: !24, isLocal: true, isDefinition: true)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1002, type: !43, isLocal: true, isDefinition: true)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1005, type: !60, isLocal: true, isDefinition: true)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1008, type: !143, isLocal: true, isDefinition: true)
!711 = !{i32 7, !"Dwarf Version", i32 5}
!712 = !{i32 2, !"Debug Info Version", i32 3}
!713 = !{i32 1, !"wchar_size", i32 4}
!714 = !{i32 8, !"PIC Level", i32 2}
!715 = !{i32 7, !"PIE Level", i32 2}
!716 = !{i32 7, !"uwtable", i32 2}
!717 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!718 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!719 = distinct !DISubprogram(name: "spec_strdup", scope: !2, file: !2, line: 35, type: !720, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !722)
!720 = !DISubroutineType(types: !721)
!721 = !{!124, !624}
!722 = !{!723, !724, !725, !726}
!723 = !DILocalVariable(name: "str", arg: 1, scope: !719, file: !2, line: 35, type: !624)
!724 = !DILocalVariable(name: "len", scope: !719, file: !2, line: 36, type: !126)
!725 = !DILocalVariable(name: "newstr", scope: !719, file: !2, line: 37, type: !124)
!726 = !DILocalVariable(name: "i", scope: !727, file: !2, line: 38, type: !126)
!727 = distinct !DILexicalBlock(scope: !719, file: !2, line: 38, column: 5)
!728 = !DILocation(line: 0, scope: !719)
!729 = !DILocation(line: 36, column: 13, scope: !719)
!730 = !DILocation(line: 37, column: 36, scope: !719)
!731 = !DILocation(line: 37, column: 29, scope: !719)
!732 = !DILocation(line: 0, scope: !727)
!733 = !DILocation(line: 38, column: 23, scope: !734)
!734 = distinct !DILexicalBlock(scope: !727, file: !2, line: 38, column: 5)
!735 = !DILocation(line: 38, column: 5, scope: !727)
!736 = !DILocation(line: 39, column: 15, scope: !737)
!737 = distinct !DILexicalBlock(scope: !734, file: !2, line: 38, column: 35)
!738 = !DILocation(line: 41, column: 5, scope: !719)
!739 = !DILocation(line: 41, column: 16, scope: !719)
!740 = !DILocation(line: 42, column: 5, scope: !719)
!741 = !DISubprogram(name: "strlen", scope: !742, file: !742, line: 407, type: !743, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!742 = !DIFile(filename: "/usr/include/string.h", directory: "", checksumkind: CSK_MD5, checksum: "f443da8025a0b7c1498fb6c554ec788d")
!743 = !DISubroutineType(types: !744)
!744 = !{!745, !624}
!745 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!746 = !DISubprogram(name: "malloc", scope: !747, file: !747, line: 540, type: !748, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!747 = !DIFile(filename: "/usr/include/stdlib.h", directory: "", checksumkind: CSK_MD5, checksum: "02258fad21adf111bb9df9825e61954a")
!748 = !DISubroutineType(types: !749)
!749 = !{!125, !750}
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !751, line: 18, baseType: !745)
!751 = !DIFile(filename: "GPUISel-llvm/build/lib/clang/19/include/__stddef_size_t.h", directory: "/home/yjs/workspace", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!752 = distinct !DISubprogram(name: "x264_param_default", scope: !2, file: !2, line: 51, type: !753, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !923)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !755}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !113, line: 376, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !113, line: 176, size: 5632, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !807, !808, !809, !810, !814, !815, !826, !827, !828, !829, !830, !859, !901, !902, !903, !904, !905, !906, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !757, file: !113, line: 179, baseType: !98, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !757, file: !113, line: 180, baseType: !126, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !757, file: !113, line: 181, baseType: !126, size: 32, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !757, file: !113, line: 182, baseType: !126, size: 32, offset: 96)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !757, file: !113, line: 183, baseType: !126, size: 32, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !757, file: !113, line: 186, baseType: !126, size: 32, offset: 160)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !757, file: !113, line: 187, baseType: !126, size: 32, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !757, file: !113, line: 188, baseType: !126, size: 32, offset: 224)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !757, file: !113, line: 189, baseType: !126, size: 32, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !757, file: !113, line: 190, baseType: !126, size: 32, offset: 288)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !757, file: !113, line: 198, baseType: !126, size: 32, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !757, file: !113, line: 215, baseType: !771, size: 288, offset: 352)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !757, file: !113, line: 200, size: 288, elements: !772)
!772 = !{!773, !774, !775, !776, !777, !778, !779, !780, !781}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !771, file: !113, line: 203, baseType: !126, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !771, file: !113, line: 204, baseType: !126, size: 32, offset: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !771, file: !113, line: 206, baseType: !126, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !771, file: !113, line: 209, baseType: !126, size: 32, offset: 96)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !771, file: !113, line: 210, baseType: !126, size: 32, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !771, file: !113, line: 211, baseType: !126, size: 32, offset: 160)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !771, file: !113, line: 212, baseType: !126, size: 32, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !771, file: !113, line: 213, baseType: !126, size: 32, offset: 224)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !771, file: !113, line: 214, baseType: !126, size: 32, offset: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !757, file: !113, line: 218, baseType: !126, size: 32, offset: 640)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !757, file: !113, line: 219, baseType: !126, size: 32, offset: 672)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !757, file: !113, line: 220, baseType: !126, size: 32, offset: 704)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !757, file: !113, line: 221, baseType: !126, size: 32, offset: 736)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !757, file: !113, line: 222, baseType: !126, size: 32, offset: 768)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !757, file: !113, line: 224, baseType: !126, size: 32, offset: 800)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !757, file: !113, line: 225, baseType: !126, size: 32, offset: 832)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !757, file: !113, line: 226, baseType: !126, size: 32, offset: 864)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !757, file: !113, line: 227, baseType: !126, size: 32, offset: 896)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !757, file: !113, line: 229, baseType: !126, size: 32, offset: 928)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !757, file: !113, line: 230, baseType: !126, size: 32, offset: 960)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !757, file: !113, line: 231, baseType: !126, size: 32, offset: 992)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !757, file: !113, line: 233, baseType: !126, size: 32, offset: 1024)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !757, file: !113, line: 234, baseType: !126, size: 32, offset: 1056)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !757, file: !113, line: 236, baseType: !126, size: 32, offset: 1088)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !757, file: !113, line: 237, baseType: !126, size: 32, offset: 1120)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !757, file: !113, line: 239, baseType: !126, size: 32, offset: 1152)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !757, file: !113, line: 240, baseType: !124, size: 64, offset: 1216)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !757, file: !113, line: 241, baseType: !801, size: 128, offset: 1280)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 128, elements: !75)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !803, line: 24, baseType: !804)
!803 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !805, line: 38, baseType: !806)
!805 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!806 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !757, file: !113, line: 242, baseType: !801, size: 128, offset: 1408)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !757, file: !113, line: 243, baseType: !801, size: 128, offset: 1536)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !757, file: !113, line: 244, baseType: !801, size: 128, offset: 1664)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !757, file: !113, line: 245, baseType: !811, size: 512, offset: 1792)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 512, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !757, file: !113, line: 246, baseType: !811, size: 512, offset: 2304)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !757, file: !113, line: 249, baseType: !816, size: 64, offset: 2816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !125, !126, !624, !819}
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !821)
!821 = !{!822, !823, !824, !825}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !820, file: !2, line: 43, baseType: !98, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !820, file: !2, line: 43, baseType: !98, size: 32, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !820, file: !2, line: 43, baseType: !125, size: 64, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !820, file: !2, line: 43, baseType: !125, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !757, file: !113, line: 250, baseType: !125, size: 64, offset: 2880)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !757, file: !113, line: 251, baseType: !126, size: 32, offset: 2944)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !757, file: !113, line: 252, baseType: !126, size: 32, offset: 2976)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !757, file: !113, line: 253, baseType: !124, size: 64, offset: 3008)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !757, file: !113, line: 287, baseType: !831, size: 800, offset: 3072)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !757, file: !113, line: 256, size: 800, elements: !832)
!832 = !{!833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !853, !854, !855, !857, !858}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !831, file: !113, line: 258, baseType: !98, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !831, file: !113, line: 259, baseType: !98, size: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !831, file: !113, line: 261, baseType: !126, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !831, file: !113, line: 262, baseType: !126, size: 32, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !831, file: !113, line: 263, baseType: !126, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !831, file: !113, line: 264, baseType: !126, size: 32, offset: 160)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !831, file: !113, line: 265, baseType: !126, size: 32, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !831, file: !113, line: 267, baseType: !126, size: 32, offset: 224)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !831, file: !113, line: 268, baseType: !126, size: 32, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !831, file: !113, line: 269, baseType: !126, size: 32, offset: 288)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !831, file: !113, line: 270, baseType: !126, size: 32, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !831, file: !113, line: 271, baseType: !126, size: 32, offset: 352)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !831, file: !113, line: 272, baseType: !126, size: 32, offset: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !831, file: !113, line: 273, baseType: !126, size: 32, offset: 416)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !831, file: !113, line: 274, baseType: !126, size: 32, offset: 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !831, file: !113, line: 275, baseType: !126, size: 32, offset: 480)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !831, file: !113, line: 276, baseType: !126, size: 32, offset: 512)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !831, file: !113, line: 277, baseType: !126, size: 32, offset: 544)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !831, file: !113, line: 278, baseType: !852, size: 32, offset: 576)
!852 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !831, file: !113, line: 279, baseType: !852, size: 32, offset: 608)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !831, file: !113, line: 280, baseType: !126, size: 32, offset: 640)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !831, file: !113, line: 283, baseType: !856, size: 64, offset: 672)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, elements: !56)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !831, file: !113, line: 285, baseType: !126, size: 32, offset: 736)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !831, file: !113, line: 286, baseType: !126, size: 32, offset: 768)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !757, file: !113, line: 327, baseType: !860, size: 1152, offset: 3904)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !757, file: !113, line: 290, size: 1152, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !899, !900}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !860, file: !113, line: 292, baseType: !126, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !860, file: !113, line: 294, baseType: !126, size: 32, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !860, file: !113, line: 295, baseType: !126, size: 32, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !860, file: !113, line: 296, baseType: !126, size: 32, offset: 96)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !860, file: !113, line: 297, baseType: !126, size: 32, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !860, file: !113, line: 299, baseType: !126, size: 32, offset: 160)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !860, file: !113, line: 300, baseType: !852, size: 32, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !860, file: !113, line: 301, baseType: !852, size: 32, offset: 224)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !860, file: !113, line: 302, baseType: !852, size: 32, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !860, file: !113, line: 303, baseType: !126, size: 32, offset: 288)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !860, file: !113, line: 304, baseType: !126, size: 32, offset: 320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !860, file: !113, line: 305, baseType: !852, size: 32, offset: 352)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !860, file: !113, line: 306, baseType: !852, size: 32, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !860, file: !113, line: 307, baseType: !852, size: 32, offset: 416)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !860, file: !113, line: 309, baseType: !126, size: 32, offset: 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !860, file: !113, line: 310, baseType: !852, size: 32, offset: 480)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !860, file: !113, line: 311, baseType: !126, size: 32, offset: 512)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !860, file: !113, line: 312, baseType: !126, size: 32, offset: 544)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !860, file: !113, line: 315, baseType: !126, size: 32, offset: 576)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !860, file: !113, line: 316, baseType: !124, size: 64, offset: 640)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !860, file: !113, line: 317, baseType: !126, size: 32, offset: 704)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !860, file: !113, line: 318, baseType: !124, size: 64, offset: 768)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !860, file: !113, line: 321, baseType: !852, size: 32, offset: 832)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !860, file: !113, line: 322, baseType: !852, size: 32, offset: 864)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !860, file: !113, line: 323, baseType: !852, size: 32, offset: 896)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !860, file: !113, line: 324, baseType: !888, size: 64, offset: 960)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !113, line: 174, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 167, size: 256, elements: !891)
!891 = !{!892, !893, !894, !895, !896, !897}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !890, file: !113, line: 169, baseType: !126, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !890, file: !113, line: 169, baseType: !126, size: 32, offset: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !890, file: !113, line: 170, baseType: !126, size: 32, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !890, file: !113, line: 171, baseType: !126, size: 32, offset: 96)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !890, file: !113, line: 172, baseType: !852, size: 32, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !890, file: !113, line: 173, baseType: !898, size: 64, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !860, file: !113, line: 325, baseType: !126, size: 32, offset: 1024)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !860, file: !113, line: 326, baseType: !124, size: 64, offset: 1088)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !757, file: !113, line: 330, baseType: !126, size: 32, offset: 5056)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !757, file: !113, line: 331, baseType: !126, size: 32, offset: 5088)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !757, file: !113, line: 332, baseType: !126, size: 32, offset: 5120)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !757, file: !113, line: 334, baseType: !126, size: 32, offset: 5152)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !757, file: !113, line: 335, baseType: !126, size: 32, offset: 5184)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !757, file: !113, line: 336, baseType: !907, size: 32, offset: 5216)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !803, line: 26, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !805, line: 42, baseType: !98)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !757, file: !113, line: 337, baseType: !907, size: 32, offset: 5248)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !757, file: !113, line: 338, baseType: !907, size: 32, offset: 5280)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !757, file: !113, line: 339, baseType: !907, size: 32, offset: 5312)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !757, file: !113, line: 340, baseType: !126, size: 32, offset: 5344)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !757, file: !113, line: 344, baseType: !126, size: 32, offset: 5376)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !757, file: !113, line: 356, baseType: !126, size: 32, offset: 5408)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !757, file: !113, line: 364, baseType: !126, size: 32, offset: 5440)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !757, file: !113, line: 367, baseType: !126, size: 32, offset: 5472)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !757, file: !113, line: 368, baseType: !126, size: 32, offset: 5504)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !757, file: !113, line: 369, baseType: !126, size: 32, offset: 5536)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !757, file: !113, line: 375, baseType: !920, size: 64, offset: 5568)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !125}
!923 = !{!924}
!924 = !DILocalVariable(name: "param", arg: 1, scope: !752, file: !2, line: 51, type: !755)
!925 = !DILocation(line: 0, scope: !752)
!926 = !DILocation(line: 54, column: 5, scope: !752)
!927 = !DILocation(line: 57, column: 18, scope: !752)
!928 = !DILocation(line: 57, column: 16, scope: !752)
!929 = !DILocation(line: 58, column: 12, scope: !752)
!930 = !DILocation(line: 58, column: 22, scope: !752)
!931 = !DILocation(line: 59, column: 12, scope: !752)
!932 = !DILocation(line: 63, column: 12, scope: !752)
!933 = !DILocation(line: 63, column: 28, scope: !752)
!934 = !DILocation(line: 59, column: 28, scope: !752)
!935 = !DILocation(line: 69, column: 16, scope: !752)
!936 = !DILocation(line: 69, column: 28, scope: !752)
!937 = !DILocation(line: 73, column: 16, scope: !752)
!938 = !DILocation(line: 75, column: 12, scope: !752)
!939 = !DILocation(line: 75, column: 28, scope: !752)
!940 = !DILocation(line: 76, column: 12, scope: !752)
!941 = !DILocation(line: 76, column: 28, scope: !752)
!942 = !DILocation(line: 77, column: 12, scope: !752)
!943 = !DILocation(line: 77, column: 28, scope: !752)
!944 = !DILocation(line: 78, column: 12, scope: !752)
!945 = !DILocation(line: 78, column: 29, scope: !752)
!946 = !DILocation(line: 79, column: 12, scope: !752)
!947 = !DILocation(line: 79, column: 28, scope: !752)
!948 = !DILocation(line: 80, column: 12, scope: !752)
!949 = !DILocation(line: 80, column: 26, scope: !752)
!950 = !DILocation(line: 73, column: 28, scope: !752)
!951 = !DILocation(line: 85, column: 12, scope: !752)
!952 = !DILocation(line: 85, column: 25, scope: !752)
!953 = !DILocation(line: 86, column: 12, scope: !752)
!954 = !DILocation(line: 87, column: 12, scope: !752)
!955 = !DILocation(line: 87, column: 33, scope: !752)
!956 = !DILocation(line: 86, column: 21, scope: !752)
!957 = !DILocation(line: 94, column: 12, scope: !752)
!958 = !DILocation(line: 94, column: 32, scope: !752)
!959 = !DILocation(line: 99, column: 12, scope: !752)
!960 = !DILocation(line: 101, column: 12, scope: !752)
!961 = !DILocation(line: 102, column: 15, scope: !752)
!962 = !DILocation(line: 102, column: 25, scope: !752)
!963 = !DILocation(line: 103, column: 15, scope: !752)
!964 = !DILocation(line: 103, column: 32, scope: !752)
!965 = !DILocation(line: 104, column: 15, scope: !752)
!966 = !DILocation(line: 104, column: 33, scope: !752)
!967 = !DILocation(line: 105, column: 15, scope: !752)
!968 = !DILocation(line: 105, column: 33, scope: !752)
!969 = !DILocation(line: 106, column: 15, scope: !752)
!970 = !DILocation(line: 108, column: 15, scope: !752)
!971 = !DILocation(line: 108, column: 29, scope: !752)
!972 = !DILocation(line: 101, column: 27, scope: !752)
!973 = !DILocation(line: 111, column: 15, scope: !752)
!974 = !DILocation(line: 111, column: 25, scope: !752)
!975 = !DILocation(line: 106, column: 33, scope: !752)
!976 = !DILocation(line: 113, column: 15, scope: !752)
!977 = !DILocation(line: 113, column: 27, scope: !752)
!978 = !DILocation(line: 114, column: 15, scope: !752)
!979 = !DILocation(line: 114, column: 25, scope: !752)
!980 = !DILocation(line: 115, column: 15, scope: !752)
!981 = !DILocation(line: 115, column: 29, scope: !752)
!982 = !DILocation(line: 116, column: 15, scope: !752)
!983 = !DILocation(line: 116, column: 27, scope: !752)
!984 = !DILocation(line: 118, column: 15, scope: !752)
!985 = !DILocation(line: 118, column: 28, scope: !752)
!986 = !DILocation(line: 119, column: 15, scope: !752)
!987 = !DILocation(line: 119, column: 28, scope: !752)
!988 = !DILocation(line: 120, column: 15, scope: !752)
!989 = !DILocation(line: 120, column: 27, scope: !752)
!990 = !DILocation(line: 121, column: 15, scope: !752)
!991 = !DILocation(line: 121, column: 27, scope: !752)
!992 = !DILocation(line: 122, column: 15, scope: !752)
!993 = !DILocation(line: 122, column: 27, scope: !752)
!994 = !DILocation(line: 124, column: 15, scope: !752)
!995 = !DILocation(line: 124, column: 33, scope: !752)
!996 = !DILocation(line: 125, column: 15, scope: !752)
!997 = !DILocation(line: 125, column: 23, scope: !752)
!998 = !DILocation(line: 126, column: 15, scope: !752)
!999 = !DILocation(line: 126, column: 25, scope: !752)
!1000 = !DILocation(line: 129, column: 12, scope: !752)
!1001 = !DILocation(line: 129, column: 19, scope: !752)
!1002 = !DILocation(line: 130, column: 12, scope: !752)
!1003 = !DILocation(line: 130, column: 26, scope: !752)
!1004 = !DILocation(line: 131, column: 12, scope: !752)
!1005 = !DILocation(line: 131, column: 24, scope: !752)
!1006 = !DILocation(line: 134, column: 12, scope: !752)
!1007 = !DILocation(line: 139, column: 20, scope: !752)
!1008 = !DILocation(line: 140, column: 20, scope: !752)
!1009 = !DILocation(line: 139, column: 29, scope: !752)
!1010 = !DILocation(line: 142, column: 20, scope: !752)
!1011 = !DILocation(line: 145, column: 20, scope: !752)
!1012 = !DILocation(line: 142, column: 31, scope: !752)
!1013 = !DILocation(line: 150, column: 20, scope: !752)
!1014 = !DILocation(line: 150, column: 38, scope: !752)
!1015 = !DILocation(line: 152, column: 20, scope: !752)
!1016 = !DILocation(line: 152, column: 35, scope: !752)
!1017 = !DILocation(line: 134, column: 26, scope: !752)
!1018 = !DILocation(line: 145, column: 32, scope: !752)
!1019 = !DILocation(line: 140, column: 26, scope: !752)
!1020 = !DILocation(line: 158, column: 20, scope: !752)
!1021 = !DILocation(line: 158, column: 27, scope: !752)
!1022 = !DILocation(line: 99, column: 29, scope: !752)
!1023 = !DILocation(line: 161, column: 20, scope: !752)
!1024 = !DILocation(line: 168, column: 12, scope: !752)
!1025 = !DILocation(line: 162, column: 5, scope: !752)
!1026 = !DILocation(line: 168, column: 29, scope: !752)
!1027 = !DILocation(line: 169, column: 12, scope: !752)
!1028 = !DILocation(line: 169, column: 21, scope: !752)
!1029 = !DILocation(line: 170, column: 12, scope: !752)
!1030 = !DILocation(line: 170, column: 18, scope: !752)
!1031 = !DILocation(line: 171, column: 12, scope: !752)
!1032 = !DILocation(line: 171, column: 24, scope: !752)
!1033 = !DILocation(line: 172, column: 12, scope: !752)
!1034 = !DILocation(line: 173, column: 12, scope: !752)
!1035 = !DILocation(line: 173, column: 22, scope: !752)
!1036 = !DILocation(line: 172, column: 27, scope: !752)
!1037 = !DILocation(line: 177, column: 1, scope: !752)
!1038 = !DISubprogram(name: "x264_cpu_detect", scope: !1039, file: !1039, line: 24, type: !1040, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1039 = !DIFile(filename: "x264_src/common/cpu.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0beb41363cc0e5253fa85a15dbb3a435")
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!907}
!1042 = distinct !DISubprogram(name: "x264_log_default", scope: !2, file: !2, line: 987, type: !817, scopeLine: 988, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048}
!1044 = !DILocalVariable(name: "p_unused", arg: 1, scope: !1042, file: !2, line: 987, type: !125)
!1045 = !DILocalVariable(name: "i_level", arg: 2, scope: !1042, file: !2, line: 987, type: !126)
!1046 = !DILocalVariable(name: "psz_fmt", arg: 3, scope: !1042, file: !2, line: 987, type: !624)
!1047 = !DILocalVariable(name: "arg", arg: 4, scope: !1042, file: !2, line: 987, type: !819)
!1048 = !DILocalVariable(name: "psz_prefix", scope: !1042, file: !2, line: 989, type: !124)
!1049 = !DILocation(line: 0, scope: !1042)
!1050 = !DILocation(line: 990, column: 5, scope: !1042)
!1051 = !DILocation(line: 0, scope: !1052)
!1052 = distinct !DILexicalBlock(scope: !1042, file: !2, line: 991, column: 5)
!1053 = !DILocation(line: 1008, column: 14, scope: !1042)
!1054 = !DILocation(line: 1008, column: 5, scope: !1042)
!1055 = !DILocation(line: 1009, column: 15, scope: !1042)
!1056 = !DILocation(line: 1009, column: 5, scope: !1042)
!1057 = !DILocation(line: 1010, column: 1, scope: !1042)
!1058 = distinct !DISubprogram(name: "x264_param_default_preset", scope: !2, file: !2, line: 399, type: !1059, scopeLine: 400, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !1061)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!126, !755, !624, !624}
!1061 = !{!1062, !1063, !1064}
!1062 = !DILocalVariable(name: "param", arg: 1, scope: !1058, file: !2, line: 399, type: !755)
!1063 = !DILocalVariable(name: "preset", arg: 2, scope: !1058, file: !2, line: 399, type: !624)
!1064 = !DILocalVariable(name: "tune", arg: 3, scope: !1058, file: !2, line: 399, type: !624)
!1065 = !DILocation(line: 0, scope: !1058)
!1066 = !DILocation(line: 401, column: 5, scope: !1058)
!1067 = !DILocation(line: 403, column: 9, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1058, file: !2, line: 403, column: 9)
!1069 = !DILocation(line: 403, column: 16, scope: !1068)
!1070 = !DILocalVariable(name: "param", arg: 1, scope: !1071, file: !2, line: 179, type: !755)
!1071 = distinct !DISubprogram(name: "x264_param_apply_preset", scope: !2, file: !2, line: 179, type: !1072, scopeLine: 180, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !1074)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!126, !755, !624}
!1074 = !{!1070, !1075}
!1075 = !DILocalVariable(name: "preset", arg: 2, scope: !1071, file: !2, line: 179, type: !624)
!1076 = !DILocation(line: 0, scope: !1071, inlinedAt: !1077)
!1077 = distinct !DILocation(line: 403, column: 19, scope: !1068)
!1078 = !DILocation(line: 181, column: 10, scope: !1079, inlinedAt: !1077)
!1079 = distinct !DILexicalBlock(scope: !1071, file: !2, line: 181, column: 9)
!1080 = !DILocation(line: 181, column: 9, scope: !1071, inlinedAt: !1077)
!1081 = !DILocation(line: 183, column: 16, scope: !1082, inlinedAt: !1077)
!1082 = distinct !DILexicalBlock(scope: !1079, file: !2, line: 182, column: 5)
!1083 = !DILocation(line: 183, column: 34, scope: !1082, inlinedAt: !1077)
!1084 = !DILocation(line: 184, column: 16, scope: !1082, inlinedAt: !1077)
!1085 = !DILocation(line: 184, column: 37, scope: !1082, inlinedAt: !1077)
!1086 = !DILocation(line: 185, column: 16, scope: !1082, inlinedAt: !1077)
!1087 = !DILocation(line: 185, column: 36, scope: !1082, inlinedAt: !1077)
!1088 = !DILocation(line: 186, column: 16, scope: !1082, inlinedAt: !1077)
!1089 = !DILocation(line: 186, column: 24, scope: !1082, inlinedAt: !1077)
!1090 = !DILocation(line: 187, column: 16, scope: !1082, inlinedAt: !1077)
!1091 = !DILocation(line: 187, column: 25, scope: !1082, inlinedAt: !1077)
!1092 = !DILocation(line: 188, column: 16, scope: !1082, inlinedAt: !1077)
!1093 = !DILocation(line: 191, column: 24, scope: !1082, inlinedAt: !1077)
!1094 = !DILocation(line: 191, column: 36, scope: !1082, inlinedAt: !1077)
!1095 = !DILocation(line: 192, column: 24, scope: !1082, inlinedAt: !1077)
!1096 = !DILocation(line: 192, column: 40, scope: !1082, inlinedAt: !1077)
!1097 = !DILocation(line: 193, column: 19, scope: !1082, inlinedAt: !1077)
!1098 = !DILocation(line: 193, column: 29, scope: !1082, inlinedAt: !1077)
!1099 = !DILocation(line: 194, column: 24, scope: !1082, inlinedAt: !1077)
!1100 = !DILocation(line: 194, column: 43, scope: !1082, inlinedAt: !1077)
!1101 = !DILocation(line: 195, column: 24, scope: !1082, inlinedAt: !1077)
!1102 = !DILocation(line: 195, column: 34, scope: !1082, inlinedAt: !1077)
!1103 = !DILocation(line: 196, column: 16, scope: !1082, inlinedAt: !1077)
!1104 = !DILocation(line: 196, column: 34, scope: !1082, inlinedAt: !1077)
!1105 = !DILocation(line: 197, column: 19, scope: !1082, inlinedAt: !1077)
!1106 = !DILocation(line: 197, column: 29, scope: !1082, inlinedAt: !1077)
!1107 = !DILocation(line: 188, column: 30, scope: !1082, inlinedAt: !1077)
!1108 = !DILocation(line: 199, column: 5, scope: !1082, inlinedAt: !1077)
!1109 = !DILocation(line: 200, column: 15, scope: !1110, inlinedAt: !1077)
!1110 = distinct !DILexicalBlock(scope: !1079, file: !2, line: 200, column: 14)
!1111 = !DILocation(line: 200, column: 14, scope: !1079, inlinedAt: !1077)
!1112 = !DILocation(line: 202, column: 24, scope: !1113, inlinedAt: !1077)
!1113 = distinct !DILexicalBlock(scope: !1110, file: !2, line: 201, column: 5)
!1114 = !DILocation(line: 202, column: 30, scope: !1113, inlinedAt: !1077)
!1115 = !DILocation(line: 203, column: 24, scope: !1113, inlinedAt: !1077)
!1116 = !DILocation(line: 203, column: 36, scope: !1113, inlinedAt: !1077)
!1117 = !DILocation(line: 204, column: 24, scope: !1113, inlinedAt: !1077)
!1118 = !DILocation(line: 204, column: 40, scope: !1113, inlinedAt: !1077)
!1119 = !DILocation(line: 205, column: 16, scope: !1113, inlinedAt: !1077)
!1120 = !DILocation(line: 205, column: 34, scope: !1113, inlinedAt: !1077)
!1121 = !DILocation(line: 206, column: 24, scope: !1113, inlinedAt: !1077)
!1122 = !DILocation(line: 206, column: 43, scope: !1113, inlinedAt: !1077)
!1123 = !DILocation(line: 207, column: 24, scope: !1113, inlinedAt: !1077)
!1124 = !DILocation(line: 207, column: 34, scope: !1113, inlinedAt: !1077)
!1125 = !DILocation(line: 208, column: 19, scope: !1113, inlinedAt: !1077)
!1126 = !DILocation(line: 208, column: 29, scope: !1113, inlinedAt: !1077)
!1127 = !DILocation(line: 209, column: 24, scope: !1113, inlinedAt: !1077)
!1128 = !DILocation(line: 209, column: 40, scope: !1113, inlinedAt: !1077)
!1129 = !DILocation(line: 210, column: 5, scope: !1113, inlinedAt: !1077)
!1130 = !DILocation(line: 211, column: 15, scope: !1131, inlinedAt: !1077)
!1131 = distinct !DILexicalBlock(scope: !1110, file: !2, line: 211, column: 14)
!1132 = !DILocation(line: 211, column: 14, scope: !1110, inlinedAt: !1077)
!1133 = !DILocation(line: 213, column: 24, scope: !1134, inlinedAt: !1077)
!1134 = distinct !DILexicalBlock(scope: !1131, file: !2, line: 212, column: 5)
!1135 = !DILocation(line: 213, column: 36, scope: !1134, inlinedAt: !1077)
!1136 = !DILocation(line: 214, column: 24, scope: !1134, inlinedAt: !1077)
!1137 = !DILocation(line: 214, column: 40, scope: !1134, inlinedAt: !1077)
!1138 = !DILocation(line: 215, column: 16, scope: !1134, inlinedAt: !1077)
!1139 = !DILocation(line: 215, column: 34, scope: !1134, inlinedAt: !1077)
!1140 = !DILocation(line: 216, column: 24, scope: !1134, inlinedAt: !1077)
!1141 = !DILocation(line: 216, column: 43, scope: !1134, inlinedAt: !1077)
!1142 = !DILocation(line: 217, column: 24, scope: !1134, inlinedAt: !1077)
!1143 = !DILocation(line: 217, column: 34, scope: !1134, inlinedAt: !1077)
!1144 = !DILocation(line: 218, column: 19, scope: !1134, inlinedAt: !1077)
!1145 = !DILocation(line: 218, column: 29, scope: !1134, inlinedAt: !1077)
!1146 = !DILocation(line: 219, column: 24, scope: !1134, inlinedAt: !1077)
!1147 = !DILocation(line: 219, column: 40, scope: !1134, inlinedAt: !1077)
!1148 = !DILocation(line: 220, column: 5, scope: !1134, inlinedAt: !1077)
!1149 = !DILocation(line: 221, column: 15, scope: !1150, inlinedAt: !1077)
!1150 = distinct !DILexicalBlock(scope: !1131, file: !2, line: 221, column: 14)
!1151 = !DILocation(line: 221, column: 14, scope: !1131, inlinedAt: !1077)
!1152 = !DILocation(line: 223, column: 24, scope: !1153, inlinedAt: !1077)
!1153 = distinct !DILexicalBlock(scope: !1150, file: !2, line: 222, column: 5)
!1154 = !DILocation(line: 223, column: 43, scope: !1153, inlinedAt: !1077)
!1155 = !DILocation(line: 224, column: 16, scope: !1153, inlinedAt: !1077)
!1156 = !DILocation(line: 224, column: 34, scope: !1153, inlinedAt: !1077)
!1157 = !DILocation(line: 225, column: 24, scope: !1153, inlinedAt: !1077)
!1158 = !DILocation(line: 225, column: 40, scope: !1153, inlinedAt: !1077)
!1159 = !DILocation(line: 226, column: 24, scope: !1153, inlinedAt: !1077)
!1160 = !DILocation(line: 226, column: 40, scope: !1153, inlinedAt: !1077)
!1161 = !DILocation(line: 227, column: 19, scope: !1153, inlinedAt: !1077)
!1162 = !DILocation(line: 227, column: 31, scope: !1153, inlinedAt: !1077)
!1163 = !DILocation(line: 228, column: 5, scope: !1153, inlinedAt: !1077)
!1164 = !DILocation(line: 229, column: 15, scope: !1165, inlinedAt: !1077)
!1165 = distinct !DILexicalBlock(scope: !1150, file: !2, line: 229, column: 14)
!1166 = !DILocation(line: 229, column: 14, scope: !1150, inlinedAt: !1077)
!1167 = !DILocation(line: 231, column: 16, scope: !1168, inlinedAt: !1077)
!1168 = distinct !DILexicalBlock(scope: !1165, file: !2, line: 230, column: 5)
!1169 = !DILocation(line: 231, column: 34, scope: !1168, inlinedAt: !1077)
!1170 = !DILocation(line: 232, column: 24, scope: !1168, inlinedAt: !1077)
!1171 = !DILocation(line: 232, column: 40, scope: !1168, inlinedAt: !1077)
!1172 = !DILocation(line: 233, column: 19, scope: !1168, inlinedAt: !1077)
!1173 = !DILocation(line: 233, column: 31, scope: !1168, inlinedAt: !1077)
!1174 = !DILocation(line: 234, column: 5, scope: !1168, inlinedAt: !1077)
!1175 = !DILocation(line: 235, column: 15, scope: !1176, inlinedAt: !1077)
!1176 = distinct !DILexicalBlock(scope: !1165, file: !2, line: 235, column: 14)
!1177 = !DILocation(line: 235, column: 14, scope: !1165, inlinedAt: !1077)
!1178 = !DILocation(line: 239, column: 15, scope: !1179, inlinedAt: !1077)
!1179 = distinct !DILexicalBlock(scope: !1176, file: !2, line: 239, column: 14)
!1180 = !DILocation(line: 239, column: 14, scope: !1176, inlinedAt: !1077)
!1181 = !DILocation(line: 241, column: 24, scope: !1182, inlinedAt: !1077)
!1182 = distinct !DILexicalBlock(scope: !1179, file: !2, line: 240, column: 5)
!1183 = !DILocation(line: 241, column: 36, scope: !1182, inlinedAt: !1077)
!1184 = !DILocation(line: 242, column: 24, scope: !1182, inlinedAt: !1077)
!1185 = !DILocation(line: 242, column: 40, scope: !1182, inlinedAt: !1077)
!1186 = !DILocation(line: 243, column: 16, scope: !1182, inlinedAt: !1077)
!1187 = !DILocation(line: 243, column: 34, scope: !1182, inlinedAt: !1077)
!1188 = !DILocation(line: 244, column: 16, scope: !1182, inlinedAt: !1077)
!1189 = !DILocation(line: 244, column: 34, scope: !1182, inlinedAt: !1077)
!1190 = !DILocation(line: 245, column: 24, scope: !1182, inlinedAt: !1077)
!1191 = !DILocation(line: 245, column: 41, scope: !1182, inlinedAt: !1077)
!1192 = !DILocation(line: 246, column: 19, scope: !1182, inlinedAt: !1077)
!1193 = !DILocation(line: 246, column: 31, scope: !1182, inlinedAt: !1077)
!1194 = !DILocation(line: 247, column: 5, scope: !1182, inlinedAt: !1077)
!1195 = !DILocation(line: 248, column: 15, scope: !1196, inlinedAt: !1077)
!1196 = distinct !DILexicalBlock(scope: !1179, file: !2, line: 248, column: 14)
!1197 = !DILocation(line: 248, column: 14, scope: !1179, inlinedAt: !1077)
!1198 = !DILocation(line: 250, column: 24, scope: !1199, inlinedAt: !1077)
!1199 = distinct !DILexicalBlock(scope: !1196, file: !2, line: 249, column: 5)
!1200 = !DILocation(line: 250, column: 36, scope: !1199, inlinedAt: !1077)
!1201 = !DILocation(line: 251, column: 24, scope: !1199, inlinedAt: !1077)
!1202 = !DILocation(line: 251, column: 40, scope: !1199, inlinedAt: !1077)
!1203 = !DILocation(line: 252, column: 16, scope: !1199, inlinedAt: !1077)
!1204 = !DILocation(line: 252, column: 34, scope: !1199, inlinedAt: !1077)
!1205 = !DILocation(line: 253, column: 16, scope: !1199, inlinedAt: !1077)
!1206 = !DILocation(line: 253, column: 34, scope: !1199, inlinedAt: !1077)
!1207 = !DILocation(line: 254, column: 24, scope: !1199, inlinedAt: !1077)
!1208 = !DILocation(line: 254, column: 41, scope: !1199, inlinedAt: !1077)
!1209 = !DILocation(line: 255, column: 24, scope: !1199, inlinedAt: !1077)
!1210 = !DILocation(line: 255, column: 30, scope: !1199, inlinedAt: !1077)
!1211 = !DILocation(line: 256, column: 24, scope: !1199, inlinedAt: !1077)
!1212 = !DILocation(line: 256, column: 34, scope: !1199, inlinedAt: !1077)
!1213 = !DILocation(line: 257, column: 19, scope: !1199, inlinedAt: !1077)
!1214 = !DILocation(line: 257, column: 31, scope: !1199, inlinedAt: !1077)
!1215 = !DILocation(line: 258, column: 5, scope: !1199, inlinedAt: !1077)
!1216 = !DILocation(line: 259, column: 15, scope: !1217, inlinedAt: !1077)
!1217 = distinct !DILexicalBlock(scope: !1196, file: !2, line: 259, column: 14)
!1218 = !DILocation(line: 259, column: 14, scope: !1196, inlinedAt: !1077)
!1219 = !DILocation(line: 261, column: 24, scope: !1220, inlinedAt: !1077)
!1220 = distinct !DILexicalBlock(scope: !1217, file: !2, line: 260, column: 5)
!1221 = !DILocation(line: 261, column: 36, scope: !1220, inlinedAt: !1077)
!1222 = !DILocation(line: 262, column: 24, scope: !1220, inlinedAt: !1077)
!1223 = !DILocation(line: 262, column: 40, scope: !1220, inlinedAt: !1077)
!1224 = !DILocation(line: 263, column: 24, scope: !1220, inlinedAt: !1077)
!1225 = !DILocation(line: 263, column: 35, scope: !1220, inlinedAt: !1077)
!1226 = !DILocation(line: 264, column: 16, scope: !1220, inlinedAt: !1077)
!1227 = !DILocation(line: 264, column: 34, scope: !1220, inlinedAt: !1077)
!1228 = !DILocation(line: 265, column: 16, scope: !1220, inlinedAt: !1077)
!1229 = !DILocation(line: 265, column: 34, scope: !1220, inlinedAt: !1077)
!1230 = !DILocation(line: 266, column: 24, scope: !1220, inlinedAt: !1077)
!1231 = !DILocation(line: 266, column: 41, scope: !1220, inlinedAt: !1077)
!1232 = !DILocation(line: 267, column: 24, scope: !1220, inlinedAt: !1077)
!1233 = !DILocation(line: 267, column: 30, scope: !1220, inlinedAt: !1077)
!1234 = !DILocation(line: 268, column: 24, scope: !1220, inlinedAt: !1077)
!1235 = !DILocation(line: 268, column: 34, scope: !1220, inlinedAt: !1077)
!1236 = !DILocation(line: 269, column: 16, scope: !1220, inlinedAt: !1077)
!1237 = !DILocation(line: 269, column: 25, scope: !1220, inlinedAt: !1077)
!1238 = !DILocation(line: 270, column: 19, scope: !1220, inlinedAt: !1077)
!1239 = !DILocation(line: 270, column: 31, scope: !1220, inlinedAt: !1077)
!1240 = !DILocation(line: 271, column: 5, scope: !1220, inlinedAt: !1077)
!1241 = !DILocation(line: 272, column: 15, scope: !1242, inlinedAt: !1077)
!1242 = distinct !DILexicalBlock(scope: !1217, file: !2, line: 272, column: 14)
!1243 = !DILocation(line: 272, column: 14, scope: !1217, inlinedAt: !1077)
!1244 = !DILocation(line: 274, column: 24, scope: !1245, inlinedAt: !1077)
!1245 = distinct !DILexicalBlock(scope: !1242, file: !2, line: 273, column: 5)
!1246 = !DILocation(line: 274, column: 36, scope: !1245, inlinedAt: !1077)
!1247 = !DILocation(line: 275, column: 24, scope: !1245, inlinedAt: !1077)
!1248 = !DILocation(line: 275, column: 40, scope: !1245, inlinedAt: !1077)
!1249 = !DILocation(line: 276, column: 24, scope: !1245, inlinedAt: !1077)
!1250 = !DILocation(line: 276, column: 35, scope: !1245, inlinedAt: !1077)
!1251 = !DILocation(line: 277, column: 16, scope: !1245, inlinedAt: !1077)
!1252 = !DILocation(line: 277, column: 34, scope: !1245, inlinedAt: !1077)
!1253 = !DILocation(line: 278, column: 16, scope: !1245, inlinedAt: !1077)
!1254 = !DILocation(line: 278, column: 34, scope: !1245, inlinedAt: !1077)
!1255 = !DILocation(line: 279, column: 24, scope: !1245, inlinedAt: !1077)
!1256 = !DILocation(line: 279, column: 41, scope: !1245, inlinedAt: !1077)
!1257 = !DILocation(line: 280, column: 24, scope: !1245, inlinedAt: !1077)
!1258 = !DILocation(line: 280, column: 30, scope: !1245, inlinedAt: !1077)
!1259 = !DILocation(line: 281, column: 24, scope: !1245, inlinedAt: !1077)
!1260 = !DILocation(line: 281, column: 37, scope: !1245, inlinedAt: !1077)
!1261 = !DILocation(line: 282, column: 24, scope: !1245, inlinedAt: !1077)
!1262 = !DILocation(line: 282, column: 34, scope: !1245, inlinedAt: !1077)
!1263 = !DILocation(line: 283, column: 16, scope: !1245, inlinedAt: !1077)
!1264 = !DILocation(line: 283, column: 25, scope: !1245, inlinedAt: !1077)
!1265 = !DILocation(line: 284, column: 19, scope: !1245, inlinedAt: !1077)
!1266 = !DILocation(line: 284, column: 31, scope: !1245, inlinedAt: !1077)
!1267 = !DILocation(line: 288, column: 9, scope: !1268, inlinedAt: !1077)
!1268 = distinct !DILexicalBlock(scope: !1242, file: !2, line: 287, column: 5)
!1269 = !DILocation(line: 403, column: 9, scope: !1058)
!1270 = !DILocation(line: 405, column: 9, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1058, file: !2, line: 405, column: 9)
!1272 = !DILocation(line: 405, column: 14, scope: !1271)
!1273 = !DILocalVariable(name: "param", arg: 1, scope: !1274, file: !2, line: 294, type: !755)
!1274 = distinct !DISubprogram(name: "x264_param_apply_tune", scope: !2, file: !2, line: 294, type: !1072, scopeLine: 295, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !1275)
!1275 = !{!1273, !1276, !1277, !1278, !1279, !1280}
!1276 = !DILocalVariable(name: "tune", arg: 2, scope: !1274, file: !2, line: 294, type: !624)
!1277 = !DILocalVariable(name: "tmp", scope: !1274, file: !2, line: 296, type: !124)
!1278 = !DILocalVariable(name: "s", scope: !1274, file: !2, line: 300, type: !124)
!1279 = !DILocalVariable(name: "psy_tuning_used", scope: !1274, file: !2, line: 301, type: !126)
!1280 = !DILabel(scope: !1281, name: "psy_failure", file: !2, line: 390)
!1281 = distinct !DILexicalBlock(scope: !1282, file: !2, line: 389, column: 9)
!1282 = distinct !DILexicalBlock(scope: !1283, file: !2, line: 388, column: 13)
!1283 = distinct !DILexicalBlock(scope: !1274, file: !2, line: 303, column: 5)
!1284 = !DILocation(line: 0, scope: !1274, inlinedAt: !1285)
!1285 = distinct !DILocation(line: 405, column: 17, scope: !1271)
!1286 = !DILocation(line: 296, column: 30, scope: !1274, inlinedAt: !1285)
!1287 = !DILocalVariable(name: "i_size", arg: 1, scope: !1288, file: !2, line: 1102, type: !126)
!1288 = distinct !DISubprogram(name: "x264_malloc", scope: !2, file: !2, line: 1102, type: !1289, scopeLine: 1103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !1291)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{!125, !126}
!1291 = !{!1287, !1292, !1294}
!1292 = !DILocalVariable(name: "align_buf", scope: !1288, file: !2, line: 1104, type: !1293)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!1294 = !DILocalVariable(name: "buf", scope: !1288, file: !2, line: 1111, type: !1293)
!1295 = !DILocation(line: 0, scope: !1288, inlinedAt: !1296)
!1296 = distinct !DILocation(line: 296, column: 17, scope: !1274, inlinedAt: !1285)
!1297 = !DILocation(line: 1111, column: 40, scope: !1288, inlinedAt: !1296)
!1298 = !DILocation(line: 1111, column: 58, scope: !1288, inlinedAt: !1296)
!1299 = !DILocation(line: 1111, column: 20, scope: !1288, inlinedAt: !1296)
!1300 = !DILocation(line: 1112, column: 9, scope: !1301, inlinedAt: !1296)
!1301 = distinct !DILexicalBlock(scope: !1288, file: !2, line: 1112, column: 9)
!1302 = !DILocation(line: 1112, column: 9, scope: !1288, inlinedAt: !1296)
!1303 = !DILocation(line: 1121, column: 9, scope: !1304, inlinedAt: !1296)
!1304 = distinct !DILexicalBlock(scope: !1288, file: !2, line: 1120, column: 9)
!1305 = !DILocation(line: 297, column: 9, scope: !1274, inlinedAt: !1285)
!1306 = !DILocation(line: 1114, column: 48, scope: !1307, inlinedAt: !1296)
!1307 = distinct !DILexicalBlock(scope: !1301, file: !2, line: 1113, column: 5)
!1308 = !DILocation(line: 1115, column: 22, scope: !1307, inlinedAt: !1296)
!1309 = !DILocation(line: 1115, column: 43, scope: !1307, inlinedAt: !1296)
!1310 = !DILocation(line: 1115, column: 19, scope: !1307, inlinedAt: !1296)
!1311 = !DILocation(line: 1116, column: 34, scope: !1307, inlinedAt: !1296)
!1312 = !DILocation(line: 1116, column: 56, scope: !1307, inlinedAt: !1296)
!1313 = !DILocation(line: 1117, column: 50, scope: !1307, inlinedAt: !1296)
!1314 = !DILocation(line: 1117, column: 68, scope: !1307, inlinedAt: !1296)
!1315 = !DILocation(line: 299, column: 11, scope: !1274, inlinedAt: !1285)
!1316 = !DILocation(line: 300, column: 15, scope: !1274, inlinedAt: !1285)
!1317 = !DILocation(line: 302, column: 5, scope: !1274, inlinedAt: !1285)
!1318 = !DILocation(line: 304, column: 14, scope: !1319, inlinedAt: !1285)
!1319 = distinct !DILexicalBlock(scope: !1283, file: !2, line: 304, column: 13)
!1320 = !DILocation(line: 304, column: 13, scope: !1283, inlinedAt: !1285)
!1321 = !DILocation(line: 306, column: 32, scope: !1322, inlinedAt: !1285)
!1322 = distinct !DILexicalBlock(scope: !1323, file: !2, line: 306, column: 17)
!1323 = distinct !DILexicalBlock(scope: !1319, file: !2, line: 305, column: 9)
!1324 = !DILocation(line: 306, column: 17, scope: !1323, inlinedAt: !1285)
!1325 = !DILocation(line: 307, column: 48, scope: !1323, inlinedAt: !1285)
!1326 = !DILocation(line: 308, column: 45, scope: !1323, inlinedAt: !1285)
!1327 = !DILocation(line: 309, column: 42, scope: !1323, inlinedAt: !1285)
!1328 = !DILocation(line: 310, column: 9, scope: !1323, inlinedAt: !1285)
!1329 = !DILocation(line: 311, column: 19, scope: !1330, inlinedAt: !1285)
!1330 = distinct !DILexicalBlock(scope: !1319, file: !2, line: 311, column: 18)
!1331 = !DILocation(line: 311, column: 18, scope: !1319, inlinedAt: !1285)
!1332 = !DILocation(line: 313, column: 32, scope: !1333, inlinedAt: !1285)
!1333 = distinct !DILexicalBlock(scope: !1334, file: !2, line: 313, column: 17)
!1334 = distinct !DILexicalBlock(scope: !1330, file: !2, line: 312, column: 9)
!1335 = !DILocation(line: 313, column: 17, scope: !1334, inlinedAt: !1285)
!1336 = !DILocation(line: 314, column: 47, scope: !1334, inlinedAt: !1285)
!1337 = !DILocation(line: 314, column: 65, scope: !1334, inlinedAt: !1285)
!1338 = !DILocation(line: 314, column: 40, scope: !1334, inlinedAt: !1285)
!1339 = !DILocation(line: 314, column: 38, scope: !1334, inlinedAt: !1285)
!1340 = !DILocation(line: 315, column: 48, scope: !1334, inlinedAt: !1285)
!1341 = !DILocation(line: 316, column: 45, scope: !1334, inlinedAt: !1285)
!1342 = !DILocation(line: 317, column: 37, scope: !1334, inlinedAt: !1285)
!1343 = !DILocation(line: 318, column: 37, scope: !1334, inlinedAt: !1285)
!1344 = !DILocation(line: 319, column: 29, scope: !1334, inlinedAt: !1285)
!1345 = !DILocation(line: 320, column: 9, scope: !1334, inlinedAt: !1285)
!1346 = !DILocation(line: 321, column: 19, scope: !1347, inlinedAt: !1285)
!1347 = distinct !DILexicalBlock(scope: !1330, file: !2, line: 321, column: 18)
!1348 = !DILocation(line: 321, column: 18, scope: !1330, inlinedAt: !1285)
!1349 = !DILocation(line: 323, column: 32, scope: !1350, inlinedAt: !1285)
!1350 = distinct !DILexicalBlock(scope: !1351, file: !2, line: 323, column: 17)
!1351 = distinct !DILexicalBlock(scope: !1347, file: !2, line: 322, column: 9)
!1352 = !DILocation(line: 323, column: 17, scope: !1351, inlinedAt: !1285)
!1353 = !DILocation(line: 324, column: 48, scope: !1351, inlinedAt: !1285)
!1354 = !DILocation(line: 325, column: 45, scope: !1351, inlinedAt: !1285)
!1355 = !DILocation(line: 326, column: 42, scope: !1351, inlinedAt: !1285)
!1356 = !DILocation(line: 327, column: 43, scope: !1351, inlinedAt: !1285)
!1357 = !DILocation(line: 329, column: 35, scope: !1351, inlinedAt: !1285)
!1358 = !DILocation(line: 330, column: 37, scope: !1351, inlinedAt: !1285)
!1359 = !DILocation(line: 331, column: 47, scope: !1351, inlinedAt: !1285)
!1360 = !DILocation(line: 332, column: 47, scope: !1351, inlinedAt: !1285)
!1361 = !DILocation(line: 333, column: 35, scope: !1351, inlinedAt: !1285)
!1362 = !DILocation(line: 334, column: 9, scope: !1351, inlinedAt: !1285)
!1363 = !DILocation(line: 335, column: 19, scope: !1364, inlinedAt: !1285)
!1364 = distinct !DILexicalBlock(scope: !1347, file: !2, line: 335, column: 18)
!1365 = !DILocation(line: 335, column: 18, scope: !1347, inlinedAt: !1285)
!1366 = !DILocation(line: 337, column: 32, scope: !1367, inlinedAt: !1285)
!1367 = distinct !DILexicalBlock(scope: !1368, file: !2, line: 337, column: 17)
!1368 = distinct !DILexicalBlock(scope: !1364, file: !2, line: 336, column: 9)
!1369 = !DILocation(line: 337, column: 17, scope: !1368, inlinedAt: !1285)
!1370 = !DILocation(line: 338, column: 48, scope: !1368, inlinedAt: !1285)
!1371 = !DILocation(line: 339, column: 45, scope: !1368, inlinedAt: !1285)
!1372 = !DILocation(line: 340, column: 37, scope: !1368, inlinedAt: !1285)
!1373 = !DILocation(line: 342, column: 37, scope: !1368, inlinedAt: !1285)
!1374 = !DILocation(line: 343, column: 9, scope: !1368, inlinedAt: !1285)
!1375 = !DILocation(line: 344, column: 19, scope: !1376, inlinedAt: !1285)
!1376 = distinct !DILexicalBlock(scope: !1364, file: !2, line: 344, column: 18)
!1377 = !DILocation(line: 344, column: 18, scope: !1364, inlinedAt: !1285)
!1378 = !DILocation(line: 346, column: 32, scope: !1379, inlinedAt: !1285)
!1379 = distinct !DILexicalBlock(scope: !1380, file: !2, line: 346, column: 17)
!1380 = distinct !DILexicalBlock(scope: !1376, file: !2, line: 345, column: 9)
!1381 = !DILocation(line: 346, column: 17, scope: !1380, inlinedAt: !1285)
!1382 = !DILocation(line: 347, column: 33, scope: !1380, inlinedAt: !1285)
!1383 = !DILocation(line: 348, column: 34, scope: !1380, inlinedAt: !1285)
!1384 = !DILocation(line: 349, column: 9, scope: !1380, inlinedAt: !1285)
!1385 = !DILocation(line: 350, column: 19, scope: !1386, inlinedAt: !1285)
!1386 = distinct !DILexicalBlock(scope: !1376, file: !2, line: 350, column: 18)
!1387 = !DILocation(line: 350, column: 18, scope: !1376, inlinedAt: !1285)
!1388 = !DILocation(line: 352, column: 32, scope: !1389, inlinedAt: !1285)
!1389 = distinct !DILexicalBlock(scope: !1390, file: !2, line: 352, column: 17)
!1390 = distinct !DILexicalBlock(scope: !1386, file: !2, line: 351, column: 9)
!1391 = !DILocation(line: 352, column: 17, scope: !1390, inlinedAt: !1285)
!1392 = !DILocation(line: 353, column: 33, scope: !1390, inlinedAt: !1285)
!1393 = !DILocation(line: 354, column: 34, scope: !1390, inlinedAt: !1285)
!1394 = !DILocation(line: 355, column: 9, scope: !1390, inlinedAt: !1285)
!1395 = !DILocation(line: 356, column: 19, scope: !1396, inlinedAt: !1285)
!1396 = distinct !DILexicalBlock(scope: !1386, file: !2, line: 356, column: 18)
!1397 = !DILocation(line: 356, column: 18, scope: !1386, inlinedAt: !1285)
!1398 = !DILocation(line: 358, column: 40, scope: !1399, inlinedAt: !1285)
!1399 = distinct !DILexicalBlock(scope: !1396, file: !2, line: 357, column: 9)
!1400 = !DILocation(line: 359, column: 28, scope: !1399, inlinedAt: !1285)
!1401 = !DILocation(line: 360, column: 46, scope: !1399, inlinedAt: !1285)
!1402 = !DILocation(line: 361, column: 44, scope: !1399, inlinedAt: !1285)
!1403 = !DILocation(line: 362, column: 9, scope: !1399, inlinedAt: !1285)
!1404 = !DILocation(line: 363, column: 19, scope: !1405, inlinedAt: !1285)
!1405 = distinct !DILexicalBlock(scope: !1396, file: !2, line: 363, column: 18)
!1406 = !DILocation(line: 363, column: 18, scope: !1396, inlinedAt: !1285)
!1407 = !DILocation(line: 365, column: 35, scope: !1408, inlinedAt: !1285)
!1408 = distinct !DILexicalBlock(scope: !1405, file: !2, line: 364, column: 9)
!1409 = !DILocation(line: 366, column: 37, scope: !1408, inlinedAt: !1285)
!1410 = !DILocation(line: 367, column: 29, scope: !1408, inlinedAt: !1285)
!1411 = !DILocation(line: 368, column: 37, scope: !1408, inlinedAt: !1285)
!1412 = !DILocation(line: 369, column: 32, scope: !1408, inlinedAt: !1285)
!1413 = !DILocation(line: 370, column: 9, scope: !1408, inlinedAt: !1285)
!1414 = !DILocation(line: 371, column: 19, scope: !1415, inlinedAt: !1285)
!1415 = distinct !DILexicalBlock(scope: !1405, file: !2, line: 371, column: 18)
!1416 = !DILocation(line: 371, column: 18, scope: !1405, inlinedAt: !1285)
!1417 = !DILocation(line: 373, column: 32, scope: !1418, inlinedAt: !1285)
!1418 = distinct !DILexicalBlock(scope: !1419, file: !2, line: 373, column: 17)
!1419 = distinct !DILexicalBlock(scope: !1415, file: !2, line: 372, column: 9)
!1420 = !DILocation(line: 373, column: 17, scope: !1419, inlinedAt: !1285)
!1421 = !DILocation(line: 374, column: 47, scope: !1419, inlinedAt: !1285)
!1422 = !DILocation(line: 374, column: 65, scope: !1419, inlinedAt: !1285)
!1423 = !DILocation(line: 374, column: 40, scope: !1419, inlinedAt: !1285)
!1424 = !DILocation(line: 374, column: 38, scope: !1419, inlinedAt: !1285)
!1425 = !DILocation(line: 375, column: 48, scope: !1419, inlinedAt: !1285)
!1426 = !DILocation(line: 376, column: 45, scope: !1419, inlinedAt: !1285)
!1427 = !DILocation(line: 377, column: 42, scope: !1419, inlinedAt: !1285)
!1428 = !DILocation(line: 378, column: 37, scope: !1419, inlinedAt: !1285)
!1429 = !DILocation(line: 379, column: 32, scope: !1430, inlinedAt: !1285)
!1430 = distinct !DILexicalBlock(scope: !1419, file: !2, line: 379, column: 17)
!1431 = !DILocation(line: 379, column: 38, scope: !1430, inlinedAt: !1285)
!1432 = !DILocation(line: 379, column: 17, scope: !1419, inlinedAt: !1285)
!1433 = !DILocation(line: 380, column: 38, scope: !1430, inlinedAt: !1285)
!1434 = !DILocation(line: 380, column: 17, scope: !1430, inlinedAt: !1285)
!1435 = !DILocation(line: 384, column: 13, scope: !1436, inlinedAt: !1285)
!1436 = distinct !DILexicalBlock(scope: !1415, file: !2, line: 383, column: 9)
!1437 = !DILocalVariable(name: "p", arg: 1, scope: !1438, file: !2, line: 1128, type: !125)
!1438 = distinct !DISubprogram(name: "x264_free", scope: !2, file: !2, line: 1128, type: !921, scopeLine: 1129, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !1439)
!1439 = !{!1437}
!1440 = !DILocation(line: 0, scope: !1438, inlinedAt: !1441)
!1441 = distinct !DILocation(line: 385, column: 13, scope: !1436, inlinedAt: !1285)
!1442 = !DILocation(line: 1135, column: 15, scope: !1443, inlinedAt: !1441)
!1443 = distinct !DILexicalBlock(scope: !1444, file: !2, line: 1131, column: 5)
!1444 = distinct !DILexicalBlock(scope: !1438, file: !2, line: 1130, column: 9)
!1445 = !DILocation(line: 1135, column: 9, scope: !1443, inlinedAt: !1441)
!1446 = !DILocation(line: 386, column: 13, scope: !1436, inlinedAt: !1285)
!1447 = !DILocation(line: 0, scope: !1319, inlinedAt: !1285)
!1448 = !DILocation(line: 390, column: 5, scope: !1281, inlinedAt: !1285)
!1449 = !DILocation(line: 391, column: 13, scope: !1281, inlinedAt: !1285)
!1450 = !DILocation(line: 392, column: 9, scope: !1281, inlinedAt: !1285)
!1451 = !DILocation(line: 393, column: 13, scope: !1283, inlinedAt: !1285)
!1452 = distinct !{!1452, !1317, !1453}
!1453 = !DILocation(line: 394, column: 5, scope: !1274, inlinedAt: !1285)
!1454 = !DILocation(line: 0, scope: !1438, inlinedAt: !1455)
!1455 = distinct !DILocation(line: 395, column: 5, scope: !1274, inlinedAt: !1285)
!1456 = !DILocation(line: 1135, column: 15, scope: !1443, inlinedAt: !1455)
!1457 = !DILocation(line: 1135, column: 9, scope: !1443, inlinedAt: !1455)
!1458 = !DILocation(line: 405, column: 9, scope: !1058)
!1459 = !DILocation(line: 408, column: 1, scope: !1058)
!1460 = distinct !DISubprogram(name: "x264_param_apply_fastfirstpass", scope: !2, file: !2, line: 410, type: !753, scopeLine: 411, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !1461)
!1461 = !{!1462}
!1462 = !DILocalVariable(name: "param", arg: 1, scope: !1460, file: !2, line: 410, type: !755)
!1463 = !DILocation(line: 0, scope: !1460)
!1464 = !DILocation(line: 413, column: 19, scope: !1465)
!1465 = distinct !DILexicalBlock(scope: !1460, file: !2, line: 413, column: 9)
!1466 = !DILocation(line: 413, column: 9, scope: !1465)
!1467 = !DILocation(line: 413, column: 32, scope: !1465)
!1468 = !DILocation(line: 413, column: 46, scope: !1465)
!1469 = !DILocation(line: 413, column: 36, scope: !1465)
!1470 = !DILocation(line: 413, column: 9, scope: !1460)
!1471 = !DILocation(line: 415, column: 16, scope: !1472)
!1472 = distinct !DILexicalBlock(scope: !1465, file: !2, line: 414, column: 5)
!1473 = !DILocation(line: 415, column: 34, scope: !1472)
!1474 = !DILocation(line: 416, column: 24, scope: !1472)
!1475 = !DILocation(line: 416, column: 40, scope: !1472)
!1476 = !DILocation(line: 417, column: 24, scope: !1472)
!1477 = !DILocation(line: 417, column: 30, scope: !1472)
!1478 = !DILocation(line: 418, column: 24, scope: !1472)
!1479 = !DILocation(line: 418, column: 36, scope: !1472)
!1480 = !DILocation(line: 419, column: 42, scope: !1472)
!1481 = !DILocation(line: 419, column: 40, scope: !1472)
!1482 = !DILocation(line: 420, column: 24, scope: !1472)
!1483 = !DILocation(line: 420, column: 34, scope: !1472)
!1484 = !DILocation(line: 421, column: 24, scope: !1472)
!1485 = !DILocation(line: 421, column: 37, scope: !1472)
!1486 = !DILocation(line: 422, column: 5, scope: !1472)
!1487 = !DILocation(line: 423, column: 1, scope: !1460)
!1488 = distinct !DISubprogram(name: "x264_param_apply_profile", scope: !2, file: !2, line: 425, type: !1072, scopeLine: 426, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !1489)
!1489 = !{!1490, !1491}
!1490 = !DILocalVariable(name: "param", arg: 1, scope: !1488, file: !2, line: 425, type: !755)
!1491 = !DILocalVariable(name: "profile", arg: 2, scope: !1488, file: !2, line: 425, type: !624)
!1492 = !DILocation(line: 0, scope: !1488)
!1493 = !DILocation(line: 427, column: 10, scope: !1494)
!1494 = distinct !DILexicalBlock(scope: !1488, file: !2, line: 427, column: 9)
!1495 = !DILocation(line: 427, column: 9, scope: !1488)
!1496 = !DILocation(line: 430, column: 10, scope: !1497)
!1497 = distinct !DILexicalBlock(scope: !1488, file: !2, line: 430, column: 9)
!1498 = !DILocation(line: 430, column: 9, scope: !1488)
!1499 = !DILocation(line: 432, column: 24, scope: !1500)
!1500 = distinct !DILexicalBlock(scope: !1497, file: !2, line: 431, column: 5)
!1501 = !DILocation(line: 432, column: 40, scope: !1500)
!1502 = !DILocation(line: 433, column: 16, scope: !1500)
!1503 = !DILocation(line: 433, column: 24, scope: !1500)
!1504 = !DILocation(line: 434, column: 16, scope: !1500)
!1505 = !DILocation(line: 434, column: 29, scope: !1500)
!1506 = !DILocation(line: 435, column: 16, scope: !1500)
!1507 = !DILocation(line: 435, column: 25, scope: !1500)
!1508 = !DILocation(line: 436, column: 24, scope: !1500)
!1509 = !DILocation(line: 436, column: 40, scope: !1500)
!1510 = !DILocation(line: 437, column: 20, scope: !1511)
!1511 = distinct !DILexicalBlock(scope: !1500, file: !2, line: 437, column: 13)
!1512 = !DILocation(line: 437, column: 13, scope: !1511)
!1513 = !DILocation(line: 437, column: 13, scope: !1500)
!1514 = !DILocation(line: 439, column: 13, scope: !1515)
!1515 = distinct !DILexicalBlock(scope: !1511, file: !2, line: 438, column: 9)
!1516 = !DILocation(line: 440, column: 13, scope: !1515)
!1517 = !DILocation(line: 442, column: 20, scope: !1518)
!1518 = distinct !DILexicalBlock(scope: !1500, file: !2, line: 442, column: 13)
!1519 = !DILocation(line: 442, column: 13, scope: !1518)
!1520 = !DILocation(line: 442, column: 13, scope: !1500)
!1521 = !DILocation(line: 443, column: 13, scope: !1518)
!1522 = !DILocation(line: 445, column: 15, scope: !1523)
!1523 = distinct !DILexicalBlock(scope: !1497, file: !2, line: 445, column: 14)
!1524 = !DILocation(line: 445, column: 14, scope: !1497)
!1525 = !DILocation(line: 447, column: 24, scope: !1526)
!1526 = distinct !DILexicalBlock(scope: !1523, file: !2, line: 446, column: 5)
!1527 = !DILocation(line: 447, column: 40, scope: !1526)
!1528 = !DILocation(line: 448, column: 16, scope: !1526)
!1529 = !DILocation(line: 448, column: 29, scope: !1526)
!1530 = !DILocation(line: 449, column: 5, scope: !1526)
!1531 = !DILocation(line: 450, column: 15, scope: !1532)
!1532 = distinct !DILexicalBlock(scope: !1523, file: !2, line: 450, column: 14)
!1533 = !DILocation(line: 450, column: 14, scope: !1523)
!1534 = !DILocation(line: 456, column: 9, scope: !1535)
!1535 = distinct !DILexicalBlock(scope: !1532, file: !2, line: 455, column: 5)
!1536 = !DILocation(line: 457, column: 9, scope: !1535)
!1537 = !DILocation(line: 459, column: 17, scope: !1538)
!1538 = distinct !DILexicalBlock(scope: !1488, file: !2, line: 459, column: 9)
!1539 = !DILocation(line: 459, column: 20, scope: !1538)
!1540 = !DILocation(line: 459, column: 47, scope: !1538)
!1541 = !DILocation(line: 459, column: 60, scope: !1538)
!1542 = !DILocation(line: 459, column: 74, scope: !1538)
!1543 = !DILocation(line: 459, column: 80, scope: !1538)
!1544 = !DILocation(line: 460, column: 60, scope: !1538)
!1545 = !DILocation(line: 460, column: 74, scope: !1538)
!1546 = !DILocation(line: 459, column: 9, scope: !1488)
!1547 = !DILocation(line: 462, column: 9, scope: !1548)
!1548 = distinct !DILexicalBlock(scope: !1538, file: !2, line: 461, column: 5)
!1549 = !DILocation(line: 463, column: 9, scope: !1548)
!1550 = !DILocation(line: 466, column: 1, scope: !1488)
!1551 = !DISubprogram(name: "strcmp", scope: !742, file: !742, line: 156, type: !1552, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1552 = !DISubroutineType(types: !1553)
!1553 = !{!126, !624, !624}
!1554 = distinct !DISubprogram(name: "x264_log", scope: !2, file: !2, line: 973, type: !1555, scopeLine: 974, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !94, retainedNodes: !2654)
!1555 = !DISubroutineType(types: !1556)
!1556 = !{null, !1557, !126, !624, null}
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64)
!1558 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !113, line: 46, baseType: !1559)
!1559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !1560, line: 381, size: 266752, elements: !1561)
!1560 = !DIFile(filename: "x264_src/common/common.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5afac7bf2f5673f1628c455d7d320ad7")
!1561 = !{!1562, !1563, !1567, !1568, !1569, !1570, !1571, !1572, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1702, !1704, !1730, !1732, !1733, !1734, !1738, !1742, !1743, !1744, !1750, !1754, !1755, !1756, !1761, !1764, !1765, !1841, !1858, !2015, !2016, !2017, !2018, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2041, !2230, !2234, !2291, !2294, !2296, !2298, !2299, !2302, !2307, !2314, !2315, !2321, !2323, !2328, !2404, !2486, !2530, !2552, !2601, !2630}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1559, file: !1560, line: 384, baseType: !756, size: 5632)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !1559, file: !1560, line: 386, baseType: !1564, size: 8256, offset: 5632)
!1564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1557, size: 8256, elements: !1565)
!1565 = !{!1566}
!1566 = !DISubrange(count: 129)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !1559, file: !1560, line: 387, baseType: !126, size: 32, offset: 13888)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !1559, file: !1560, line: 388, baseType: !126, size: 32, offset: 13920)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !1559, file: !1560, line: 389, baseType: !126, size: 32, offset: 13952)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !1559, file: !1560, line: 390, baseType: !126, size: 32, offset: 13984)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !1559, file: !1560, line: 391, baseType: !126, size: 32, offset: 14016)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !1559, file: !1560, line: 402, baseType: !1573, size: 576, offset: 14080)
!1573 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1559, file: !1560, line: 394, size: 576, elements: !1574)
!1574 = !{!1575, !1576, !1577, !1586, !1587, !1588}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !1573, file: !1560, line: 396, baseType: !126, size: 32)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !1573, file: !1560, line: 397, baseType: !126, size: 32, offset: 32)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !1573, file: !1560, line: 398, baseType: !1578, size: 64, offset: 64)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64)
!1579 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !113, line: 604, baseType: !1580)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 593, size: 192, elements: !1581)
!1581 = !{!1582, !1583, !1584, !1585}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !1580, file: !113, line: 595, baseType: !126, size: 32)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !1580, file: !113, line: 596, baseType: !126, size: 32, offset: 32)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !1580, file: !113, line: 599, baseType: !126, size: 32, offset: 64)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !1580, file: !113, line: 603, baseType: !1293, size: 64, offset: 128)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !1573, file: !1560, line: 399, baseType: !126, size: 32, offset: 128)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !1573, file: !1560, line: 400, baseType: !1293, size: 64, offset: 192)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !1573, file: !1560, line: 401, baseType: !1589, size: 320, offset: 256)
!1589 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !1590, line: 56, baseType: !1591)
!1590 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!1591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !1590, line: 47, size: 320, elements: !1592)
!1592 = !{!1593, !1594, !1595, !1596, !1597, !1598}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !1591, file: !1590, line: 49, baseType: !1293, size: 64)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1591, file: !1590, line: 50, baseType: !1293, size: 64, offset: 64)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !1591, file: !1590, line: 51, baseType: !1293, size: 64, offset: 128)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !1591, file: !1590, line: 53, baseType: !128, size: 64, offset: 192)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !1591, file: !1590, line: 54, baseType: !126, size: 32, offset: 256)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !1591, file: !1590, line: 55, baseType: !126, size: 32, offset: 288)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !1559, file: !1560, line: 404, baseType: !1293, size: 64, offset: 14656)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !1559, file: !1560, line: 405, baseType: !126, size: 32, offset: 14720)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !1559, file: !1560, line: 410, baseType: !126, size: 32, offset: 14752)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !1559, file: !1560, line: 411, baseType: !126, size: 32, offset: 14784)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !1559, file: !1560, line: 413, baseType: !126, size: 32, offset: 14816)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !1559, file: !1560, line: 415, baseType: !126, size: 32, offset: 14848)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !1559, file: !1560, line: 416, baseType: !126, size: 32, offset: 14880)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !1559, file: !1560, line: 418, baseType: !126, size: 32, offset: 14912)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !1559, file: !1560, line: 419, baseType: !126, size: 32, offset: 14944)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !1559, file: !1560, line: 420, baseType: !126, size: 32, offset: 14976)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !1559, file: !1560, line: 421, baseType: !126, size: 32, offset: 15008)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !1559, file: !1560, line: 422, baseType: !126, size: 32, offset: 15040)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !1559, file: !1560, line: 424, baseType: !126, size: 32, offset: 15072)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !1559, file: !1560, line: 425, baseType: !126, size: 32, offset: 15104)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !1559, file: !1560, line: 427, baseType: !126, size: 32, offset: 15136)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !1559, file: !1560, line: 430, baseType: !1615, size: 10400, offset: 15168)
!1615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1616, size: 10400, elements: !636)
!1616 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !1617, line: 154, baseType: !1618)
!1617 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!1618 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1617, line: 52, size: 10400, elements: !1619)
!1619 = !{!1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1652, !1653, !1701}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !1618, file: !1617, line: 54, baseType: !126, size: 32)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !1618, file: !1617, line: 56, baseType: !126, size: 32, offset: 32)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !1618, file: !1617, line: 57, baseType: !126, size: 32, offset: 64)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !1618, file: !1617, line: 59, baseType: !126, size: 32, offset: 96)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !1618, file: !1617, line: 60, baseType: !126, size: 32, offset: 128)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !1618, file: !1617, line: 61, baseType: !126, size: 32, offset: 160)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !1618, file: !1617, line: 63, baseType: !126, size: 32, offset: 192)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !1618, file: !1617, line: 65, baseType: !126, size: 32, offset: 224)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !1618, file: !1617, line: 67, baseType: !126, size: 32, offset: 256)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !1618, file: !1617, line: 69, baseType: !126, size: 32, offset: 288)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !1618, file: !1617, line: 70, baseType: !126, size: 32, offset: 320)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !1618, file: !1617, line: 71, baseType: !126, size: 32, offset: 352)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !1618, file: !1617, line: 72, baseType: !126, size: 32, offset: 384)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !1618, file: !1617, line: 73, baseType: !1634, size: 8192, offset: 416)
!1634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 8192, elements: !1635)
!1635 = !{!1636}
!1636 = !DISubrange(count: 256)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !1618, file: !1617, line: 75, baseType: !126, size: 32, offset: 8608)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !1618, file: !1617, line: 76, baseType: !126, size: 32, offset: 8640)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !1618, file: !1617, line: 77, baseType: !126, size: 32, offset: 8672)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !1618, file: !1617, line: 78, baseType: !126, size: 32, offset: 8704)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !1618, file: !1617, line: 79, baseType: !126, size: 32, offset: 8736)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !1618, file: !1617, line: 80, baseType: !126, size: 32, offset: 8768)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !1618, file: !1617, line: 81, baseType: !126, size: 32, offset: 8800)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !1618, file: !1617, line: 83, baseType: !126, size: 32, offset: 8832)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1618, file: !1617, line: 90, baseType: !1646, size: 128, offset: 8864)
!1646 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1618, file: !1617, line: 84, size: 128, elements: !1647)
!1647 = !{!1648, !1649, !1650, !1651}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !1646, file: !1617, line: 86, baseType: !126, size: 32)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !1646, file: !1617, line: 87, baseType: !126, size: 32, offset: 32)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !1646, file: !1617, line: 88, baseType: !126, size: 32, offset: 64)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !1646, file: !1617, line: 89, baseType: !126, size: 32, offset: 96)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !1618, file: !1617, line: 92, baseType: !126, size: 32, offset: 8992)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !1618, file: !1617, line: 150, baseType: !1654, size: 1344, offset: 9024)
!1654 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1618, file: !1617, line: 93, size: 1344, elements: !1655)
!1655 = !{!1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700}
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !1654, file: !1617, line: 95, baseType: !126, size: 32)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !1654, file: !1617, line: 96, baseType: !126, size: 32, offset: 32)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !1654, file: !1617, line: 97, baseType: !126, size: 32, offset: 64)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !1654, file: !1617, line: 99, baseType: !126, size: 32, offset: 96)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !1654, file: !1617, line: 100, baseType: !126, size: 32, offset: 128)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !1654, file: !1617, line: 102, baseType: !126, size: 32, offset: 160)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !1654, file: !1617, line: 103, baseType: !126, size: 32, offset: 192)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !1654, file: !1617, line: 104, baseType: !126, size: 32, offset: 224)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !1654, file: !1617, line: 105, baseType: !126, size: 32, offset: 256)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !1654, file: !1617, line: 106, baseType: !126, size: 32, offset: 288)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !1654, file: !1617, line: 107, baseType: !126, size: 32, offset: 320)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !1654, file: !1617, line: 108, baseType: !126, size: 32, offset: 352)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !1654, file: !1617, line: 110, baseType: !126, size: 32, offset: 384)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !1654, file: !1617, line: 111, baseType: !126, size: 32, offset: 416)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !1654, file: !1617, line: 112, baseType: !126, size: 32, offset: 448)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !1654, file: !1617, line: 114, baseType: !126, size: 32, offset: 480)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !1654, file: !1617, line: 115, baseType: !907, size: 32, offset: 512)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !1654, file: !1617, line: 116, baseType: !907, size: 32, offset: 544)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !1654, file: !1617, line: 117, baseType: !126, size: 32, offset: 576)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !1654, file: !1617, line: 119, baseType: !126, size: 32, offset: 608)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !1654, file: !1617, line: 120, baseType: !126, size: 32, offset: 640)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !1654, file: !1617, line: 137, baseType: !1678, size: 384, offset: 672)
!1678 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1654, file: !1617, line: 122, size: 384, elements: !1679)
!1679 = !{!1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !1678, file: !1617, line: 124, baseType: !126, size: 32)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !1678, file: !1617, line: 125, baseType: !126, size: 32, offset: 32)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !1678, file: !1617, line: 126, baseType: !126, size: 32, offset: 64)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !1678, file: !1617, line: 127, baseType: !126, size: 32, offset: 96)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !1678, file: !1617, line: 128, baseType: !126, size: 32, offset: 128)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !1678, file: !1617, line: 129, baseType: !126, size: 32, offset: 160)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !1678, file: !1617, line: 130, baseType: !126, size: 32, offset: 192)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !1678, file: !1617, line: 131, baseType: !126, size: 32, offset: 224)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !1678, file: !1617, line: 133, baseType: !126, size: 32, offset: 256)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !1678, file: !1617, line: 134, baseType: !126, size: 32, offset: 288)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !1678, file: !1617, line: 135, baseType: !126, size: 32, offset: 320)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !1678, file: !1617, line: 136, baseType: !126, size: 32, offset: 352)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !1654, file: !1617, line: 139, baseType: !126, size: 32, offset: 1056)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !1654, file: !1617, line: 140, baseType: !126, size: 32, offset: 1088)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !1654, file: !1617, line: 141, baseType: !126, size: 32, offset: 1120)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !1654, file: !1617, line: 142, baseType: !126, size: 32, offset: 1152)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !1654, file: !1617, line: 143, baseType: !126, size: 32, offset: 1184)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !1654, file: !1617, line: 144, baseType: !126, size: 32, offset: 1216)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !1654, file: !1617, line: 145, baseType: !126, size: 32, offset: 1248)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !1654, file: !1617, line: 146, baseType: !126, size: 32, offset: 1280)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !1654, file: !1617, line: 147, baseType: !126, size: 32, offset: 1312)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !1618, file: !1617, line: 152, baseType: !126, size: 32, offset: 10368)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !1559, file: !1560, line: 431, baseType: !1703, size: 64, offset: 25600)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !1559, file: !1560, line: 432, baseType: !1705, size: 960, offset: 25664)
!1705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1706, size: 960, elements: !636)
!1706 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !1617, line: 186, baseType: !1707)
!1707 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1617, line: 156, size: 960, elements: !1708)
!1708 = !{!1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726}
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !1707, file: !1617, line: 158, baseType: !126, size: 32)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !1707, file: !1617, line: 159, baseType: !126, size: 32, offset: 32)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !1707, file: !1617, line: 161, baseType: !126, size: 32, offset: 64)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !1707, file: !1617, line: 163, baseType: !126, size: 32, offset: 96)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !1707, file: !1617, line: 164, baseType: !126, size: 32, offset: 128)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !1707, file: !1617, line: 166, baseType: !126, size: 32, offset: 160)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !1707, file: !1617, line: 167, baseType: !126, size: 32, offset: 192)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !1707, file: !1617, line: 169, baseType: !126, size: 32, offset: 224)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !1707, file: !1617, line: 170, baseType: !126, size: 32, offset: 256)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !1707, file: !1617, line: 172, baseType: !126, size: 32, offset: 288)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !1707, file: !1617, line: 173, baseType: !126, size: 32, offset: 320)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !1707, file: !1617, line: 175, baseType: !126, size: 32, offset: 352)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !1707, file: !1617, line: 177, baseType: !126, size: 32, offset: 384)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !1707, file: !1617, line: 178, baseType: !126, size: 32, offset: 416)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !1707, file: !1617, line: 179, baseType: !126, size: 32, offset: 448)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !1707, file: !1617, line: 181, baseType: !126, size: 32, offset: 480)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !1707, file: !1617, line: 183, baseType: !126, size: 32, offset: 512)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !1707, file: !1617, line: 184, baseType: !1727, size: 384, offset: 576)
!1727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1728, size: 384, elements: !44)
!1728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1729, size: 64)
!1729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !802)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !1559, file: !1560, line: 433, baseType: !1731, size: 64, offset: 26624)
!1731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !1559, file: !1560, line: 434, baseType: !126, size: 32, offset: 26688)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !1559, file: !1560, line: 437, baseType: !126, size: 32, offset: 26720)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !1559, file: !1560, line: 440, baseType: !1735, size: 256, offset: 26752)
!1735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1736, size: 256, elements: !49)
!1736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1737, size: 64)
!1737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 512, elements: !75)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !1559, file: !1560, line: 441, baseType: !1739, size: 128, offset: 27008)
!1739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1740, size: 128, elements: !56)
!1740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1741, size: 64)
!1741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 2048, elements: !812)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !1559, file: !1560, line: 443, baseType: !1735, size: 256, offset: 27136)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !1559, file: !1560, line: 444, baseType: !1739, size: 128, offset: 27392)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !1559, file: !1560, line: 446, baseType: !1745, size: 256, offset: 27520)
!1745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1746, size: 256, elements: !49)
!1746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1747, size: 64)
!1747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1748, size: 256, elements: !75)
!1748 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !803, line: 25, baseType: !1749)
!1749 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !805, line: 40, baseType: !127)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !1559, file: !1560, line: 447, baseType: !1751, size: 128, offset: 27776)
!1751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1752, size: 128, elements: !56)
!1752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1753, size: 64)
!1753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1748, size: 1024, elements: !812)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !1559, file: !1560, line: 448, baseType: !1745, size: 256, offset: 27904)
