; ModuleID = 'x264_src/common/deblock.c'
source_filename = "x264_src/common/deblock.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@i_alpha_table = internal unnamed_addr constant [76 x i8] c"\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\04\04\05\06\07\08\09\0A\0C\0D\0F\11\14\16\19\1C $(-28?GPZeq\7F\90\A2\B6\CB\E2\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF", align 16, !dbg !0
@i_beta_table = internal unnamed_addr constant [76 x i8] c"\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\02\02\02\03\03\03\03\04\04\04\06\06\07\07\08\08\09\09\0A\0A\0B\0B\0C\0C\0D\0D\0E\0E\0F\0F\10\10\11\11\12\12\12\12\12\12\12\12\12\12\12\12\12\12", align 16, !dbg !67

!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 192, elements: !44)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !41, line: 26, baseType: !42)
!41 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !43, line: 42, baseType: !7)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!44 = !{!45}
!45 = !DISubrange(count: 6)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !41, line: 25, baseType: !47)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !43, line: 40, baseType: !48)
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union32_t", file: !51, line: 89, baseType: !52)
!51 = !DIFile(filename: "x264_src/common/common.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5afac7bf2f5673f1628c455d7d320ad7")
!52 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !51, line: 89, size: 32, elements: !53)
!53 = !{!54, !55, !59}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !52, file: !51, line: 89, baseType: !40, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !52, file: !51, line: 89, baseType: !56, size: 32)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 32, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 2)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !52, file: !51, line: 89, baseType: !60, size: 32)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !41, line: 24, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !43, line: 38, baseType: !63)
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !{!65}
!65 = !DISubrange(count: 4)
!66 = !{!0, !67, !73}
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "i_beta_table", scope: !2, file: !3, line: 79, type: !69, isLocal: true, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 608, elements: !71)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!71 = !{!72}
!72 = !DISubrange(count: 76)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "i_tc0_table", scope: !2, file: !3, line: 90, type: !75, isLocal: true, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 2432, elements: !81)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !78, line: 24, baseType: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !43, line: 37, baseType: !80)
!80 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!81 = !{!72, !65}
!82 = !{i32 7, !"Dwarf Version", i32 5}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = !{i32 1, !"wchar_size", i32 4}
!85 = !{i32 8, !"PIC Level", i32 2}
!86 = !{i32 7, !"PIE Level", i32 2}
!87 = !{i32 7, !"uwtable", i32 2}
!88 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!89 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!90 = distinct !DISubprogram(name: "x264_frame_deblock_row", scope: !3, file: !3, line: 339, type: !91, scopeLine: 340, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1385)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !93, !104}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !95, line: 46, baseType: !96)
!95 = !DIFile(filename: "x264_src/x264.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !51, line: 381, size: 266752, elements: !97)
!97 = !{!98, !267, !271, !272, !273, !274, !275, !276, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !412, !414, !439, !441, !442, !443, !447, !451, !452, !453, !457, !461, !462, !463, !468, !471, !472, !550, !567, !728, !729, !730, !731, !735, !736, !737, !738, !739, !740, !741, !756, !949, !953, !1014, !1017, !1019, !1021, !1022, !1025, !1030, !1039, !1040, !1048, !1050, !1055, !1131, !1217, !1261, !1283, !1332, !1361}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !96, file: !51, line: 384, baseType: !99, size: 5632)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !95, line: 376, baseType: !100)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !95, line: 176, size: 5632, elements: !101)
!101 = !{!102, !103, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !146, !150, !151, !152, !153, !157, !158, !172, !173, !174, !175, !176, !205, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !100, file: !95, line: 179, baseType: !7, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !100, file: !95, line: 180, baseType: !104, size: 32, offset: 32)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !100, file: !95, line: 181, baseType: !104, size: 32, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !100, file: !95, line: 182, baseType: !104, size: 32, offset: 96)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !100, file: !95, line: 183, baseType: !104, size: 32, offset: 128)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !100, file: !95, line: 186, baseType: !104, size: 32, offset: 160)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !100, file: !95, line: 187, baseType: !104, size: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !100, file: !95, line: 188, baseType: !104, size: 32, offset: 224)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !100, file: !95, line: 189, baseType: !104, size: 32, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !100, file: !95, line: 190, baseType: !104, size: 32, offset: 288)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !100, file: !95, line: 198, baseType: !104, size: 32, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !100, file: !95, line: 215, baseType: !115, size: 288, offset: 352)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !100, file: !95, line: 200, size: 288, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !115, file: !95, line: 203, baseType: !104, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !115, file: !95, line: 204, baseType: !104, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !115, file: !95, line: 206, baseType: !104, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !115, file: !95, line: 209, baseType: !104, size: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !115, file: !95, line: 210, baseType: !104, size: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !115, file: !95, line: 211, baseType: !104, size: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !115, file: !95, line: 212, baseType: !104, size: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !115, file: !95, line: 213, baseType: !104, size: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !115, file: !95, line: 214, baseType: !104, size: 32, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !100, file: !95, line: 218, baseType: !104, size: 32, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !100, file: !95, line: 219, baseType: !104, size: 32, offset: 672)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !100, file: !95, line: 220, baseType: !104, size: 32, offset: 704)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !100, file: !95, line: 221, baseType: !104, size: 32, offset: 736)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !100, file: !95, line: 222, baseType: !104, size: 32, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !100, file: !95, line: 224, baseType: !104, size: 32, offset: 800)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !100, file: !95, line: 225, baseType: !104, size: 32, offset: 832)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !100, file: !95, line: 226, baseType: !104, size: 32, offset: 864)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !100, file: !95, line: 227, baseType: !104, size: 32, offset: 896)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !100, file: !95, line: 229, baseType: !104, size: 32, offset: 928)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !100, file: !95, line: 230, baseType: !104, size: 32, offset: 960)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !100, file: !95, line: 231, baseType: !104, size: 32, offset: 992)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !100, file: !95, line: 233, baseType: !104, size: 32, offset: 1024)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !100, file: !95, line: 234, baseType: !104, size: 32, offset: 1056)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !100, file: !95, line: 236, baseType: !104, size: 32, offset: 1088)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !100, file: !95, line: 237, baseType: !104, size: 32, offset: 1120)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !100, file: !95, line: 239, baseType: !104, size: 32, offset: 1152)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !100, file: !95, line: 240, baseType: !144, size: 64, offset: 1216)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !100, file: !95, line: 241, baseType: !147, size: 128, offset: 1280)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 128, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 16)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !100, file: !95, line: 242, baseType: !147, size: 128, offset: 1408)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !100, file: !95, line: 243, baseType: !147, size: 128, offset: 1536)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !100, file: !95, line: 244, baseType: !147, size: 128, offset: 1664)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !100, file: !95, line: 245, baseType: !154, size: 512, offset: 1792)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 512, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !100, file: !95, line: 246, baseType: !154, size: 512, offset: 2304)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !100, file: !95, line: 249, baseType: !159, size: 64, offset: 2816)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DISubroutineType(types: !161)
!161 = !{null, !162, !104, !163, !165}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !167)
!167 = !{!168, !169, !170, !171}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !166, file: !3, baseType: !7, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !166, file: !3, baseType: !7, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !166, file: !3, baseType: !162, size: 64, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !166, file: !3, baseType: !162, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !100, file: !95, line: 250, baseType: !162, size: 64, offset: 2880)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !100, file: !95, line: 251, baseType: !104, size: 32, offset: 2944)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !100, file: !95, line: 252, baseType: !104, size: 32, offset: 2976)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !100, file: !95, line: 253, baseType: !144, size: 64, offset: 3008)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !100, file: !95, line: 287, baseType: !177, size: 800, offset: 3072)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !100, file: !95, line: 256, size: 800, elements: !178)
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !199, !200, !201, !203, !204}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !177, file: !95, line: 258, baseType: !7, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !177, file: !95, line: 259, baseType: !7, size: 32, offset: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !177, file: !95, line: 261, baseType: !104, size: 32, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !177, file: !95, line: 262, baseType: !104, size: 32, offset: 96)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !177, file: !95, line: 263, baseType: !104, size: 32, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !177, file: !95, line: 264, baseType: !104, size: 32, offset: 160)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !177, file: !95, line: 265, baseType: !104, size: 32, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !177, file: !95, line: 267, baseType: !104, size: 32, offset: 224)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !177, file: !95, line: 268, baseType: !104, size: 32, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !177, file: !95, line: 269, baseType: !104, size: 32, offset: 288)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !177, file: !95, line: 270, baseType: !104, size: 32, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !177, file: !95, line: 271, baseType: !104, size: 32, offset: 352)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !177, file: !95, line: 272, baseType: !104, size: 32, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !177, file: !95, line: 273, baseType: !104, size: 32, offset: 416)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !177, file: !95, line: 274, baseType: !104, size: 32, offset: 448)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !177, file: !95, line: 275, baseType: !104, size: 32, offset: 480)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !177, file: !95, line: 276, baseType: !104, size: 32, offset: 512)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !177, file: !95, line: 277, baseType: !104, size: 32, offset: 544)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !177, file: !95, line: 278, baseType: !198, size: 32, offset: 576)
!198 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !177, file: !95, line: 279, baseType: !198, size: 32, offset: 608)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !177, file: !95, line: 280, baseType: !104, size: 32, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !177, file: !95, line: 283, baseType: !202, size: 64, offset: 672)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 64, elements: !57)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !177, file: !95, line: 285, baseType: !104, size: 32, offset: 736)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !177, file: !95, line: 286, baseType: !104, size: 32, offset: 768)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !100, file: !95, line: 327, baseType: !206, size: 1152, offset: 3904)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !100, file: !95, line: 290, size: 1152, elements: !207)
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !245, !246}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !206, file: !95, line: 292, baseType: !104, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !206, file: !95, line: 294, baseType: !104, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !206, file: !95, line: 295, baseType: !104, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !206, file: !95, line: 296, baseType: !104, size: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !206, file: !95, line: 297, baseType: !104, size: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !206, file: !95, line: 299, baseType: !104, size: 32, offset: 160)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !206, file: !95, line: 300, baseType: !198, size: 32, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !206, file: !95, line: 301, baseType: !198, size: 32, offset: 224)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !206, file: !95, line: 302, baseType: !198, size: 32, offset: 256)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !206, file: !95, line: 303, baseType: !104, size: 32, offset: 288)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !206, file: !95, line: 304, baseType: !104, size: 32, offset: 320)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !206, file: !95, line: 305, baseType: !198, size: 32, offset: 352)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !206, file: !95, line: 306, baseType: !198, size: 32, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !206, file: !95, line: 307, baseType: !198, size: 32, offset: 416)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !206, file: !95, line: 309, baseType: !104, size: 32, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !206, file: !95, line: 310, baseType: !198, size: 32, offset: 480)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !206, file: !95, line: 311, baseType: !104, size: 32, offset: 512)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !206, file: !95, line: 312, baseType: !104, size: 32, offset: 544)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !206, file: !95, line: 315, baseType: !104, size: 32, offset: 576)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !206, file: !95, line: 316, baseType: !144, size: 64, offset: 640)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !206, file: !95, line: 317, baseType: !104, size: 32, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !206, file: !95, line: 318, baseType: !144, size: 64, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !206, file: !95, line: 321, baseType: !198, size: 32, offset: 832)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !206, file: !95, line: 322, baseType: !198, size: 32, offset: 864)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !206, file: !95, line: 323, baseType: !198, size: 32, offset: 896)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !206, file: !95, line: 324, baseType: !234, size: 64, offset: 960)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !95, line: 174, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 167, size: 256, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !243}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !236, file: !95, line: 169, baseType: !104, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !236, file: !95, line: 169, baseType: !104, size: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !236, file: !95, line: 170, baseType: !104, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !236, file: !95, line: 171, baseType: !104, size: 32, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !236, file: !95, line: 172, baseType: !198, size: 32, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !236, file: !95, line: 173, baseType: !244, size: 64, offset: 192)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !206, file: !95, line: 325, baseType: !104, size: 32, offset: 1024)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !206, file: !95, line: 326, baseType: !144, size: 64, offset: 1088)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !100, file: !95, line: 330, baseType: !104, size: 32, offset: 5056)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !100, file: !95, line: 331, baseType: !104, size: 32, offset: 5088)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !100, file: !95, line: 332, baseType: !104, size: 32, offset: 5120)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !100, file: !95, line: 334, baseType: !104, size: 32, offset: 5152)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !100, file: !95, line: 335, baseType: !104, size: 32, offset: 5184)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !100, file: !95, line: 336, baseType: !40, size: 32, offset: 5216)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !100, file: !95, line: 337, baseType: !40, size: 32, offset: 5248)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !100, file: !95, line: 338, baseType: !40, size: 32, offset: 5280)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !100, file: !95, line: 339, baseType: !40, size: 32, offset: 5312)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !100, file: !95, line: 340, baseType: !104, size: 32, offset: 5344)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !100, file: !95, line: 344, baseType: !104, size: 32, offset: 5376)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !100, file: !95, line: 356, baseType: !104, size: 32, offset: 5408)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !100, file: !95, line: 364, baseType: !104, size: 32, offset: 5440)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !100, file: !95, line: 367, baseType: !104, size: 32, offset: 5472)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !100, file: !95, line: 368, baseType: !104, size: 32, offset: 5504)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !100, file: !95, line: 369, baseType: !104, size: 32, offset: 5536)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !100, file: !95, line: 375, baseType: !264, size: 64, offset: 5568)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !162}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !96, file: !51, line: 386, baseType: !268, size: 8256, offset: 5632)
!268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 8256, elements: !269)
!269 = !{!270}
!270 = !DISubrange(count: 129)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !96, file: !51, line: 387, baseType: !104, size: 32, offset: 13888)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !96, file: !51, line: 388, baseType: !104, size: 32, offset: 13920)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !96, file: !51, line: 389, baseType: !104, size: 32, offset: 13952)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !96, file: !51, line: 390, baseType: !104, size: 32, offset: 13984)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !96, file: !51, line: 391, baseType: !104, size: 32, offset: 14016)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !96, file: !51, line: 402, baseType: !277, size: 576, offset: 14080)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !51, line: 394, size: 576, elements: !278)
!278 = !{!279, !280, !281, !291, !292, !293}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !277, file: !51, line: 396, baseType: !104, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !277, file: !51, line: 397, baseType: !104, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !277, file: !51, line: 398, baseType: !282, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !95, line: 604, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 593, size: 192, elements: !285)
!285 = !{!286, !287, !288, !289}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !284, file: !95, line: 595, baseType: !104, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !284, file: !95, line: 596, baseType: !104, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !284, file: !95, line: 599, baseType: !104, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !284, file: !95, line: 603, baseType: !290, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !277, file: !51, line: 399, baseType: !104, size: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !277, file: !51, line: 400, baseType: !290, size: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !277, file: !51, line: 401, baseType: !294, size: 320, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !295, line: 56, baseType: !296)
!295 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !295, line: 47, size: 320, elements: !297)
!297 = !{!298, !299, !300, !301, !305, !306}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !296, file: !295, line: 49, baseType: !290, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !296, file: !295, line: 50, baseType: !290, size: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !296, file: !295, line: 51, baseType: !290, size: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !296, file: !295, line: 53, baseType: !302, size: 64, offset: 192)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !303, line: 87, baseType: !304)
!303 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!304 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !296, file: !295, line: 54, baseType: !104, size: 32, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !296, file: !295, line: 55, baseType: !104, size: 32, offset: 288)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !96, file: !51, line: 404, baseType: !290, size: 64, offset: 14656)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !96, file: !51, line: 405, baseType: !104, size: 32, offset: 14720)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !96, file: !51, line: 410, baseType: !104, size: 32, offset: 14752)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !96, file: !51, line: 411, baseType: !104, size: 32, offset: 14784)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !96, file: !51, line: 413, baseType: !104, size: 32, offset: 14816)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !96, file: !51, line: 415, baseType: !104, size: 32, offset: 14848)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !96, file: !51, line: 416, baseType: !104, size: 32, offset: 14880)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !96, file: !51, line: 418, baseType: !104, size: 32, offset: 14912)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !96, file: !51, line: 419, baseType: !104, size: 32, offset: 14944)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !96, file: !51, line: 420, baseType: !104, size: 32, offset: 14976)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !96, file: !51, line: 421, baseType: !104, size: 32, offset: 15008)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !96, file: !51, line: 422, baseType: !104, size: 32, offset: 15040)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !96, file: !51, line: 424, baseType: !104, size: 32, offset: 15072)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !96, file: !51, line: 425, baseType: !104, size: 32, offset: 15104)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !96, file: !51, line: 427, baseType: !104, size: 32, offset: 15136)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !96, file: !51, line: 430, baseType: !323, size: 10400, offset: 15168)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 10400, elements: !410)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !325, line: 154, baseType: !326)
!325 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !325, line: 52, size: 10400, elements: !327)
!327 = !{!328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !345, !346, !347, !348, !349, !350, !351, !352, !353, !360, !361, !409}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !326, file: !325, line: 54, baseType: !104, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !326, file: !325, line: 56, baseType: !104, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !326, file: !325, line: 57, baseType: !104, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !326, file: !325, line: 59, baseType: !104, size: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !326, file: !325, line: 60, baseType: !104, size: 32, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !326, file: !325, line: 61, baseType: !104, size: 32, offset: 160)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !326, file: !325, line: 63, baseType: !104, size: 32, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !326, file: !325, line: 65, baseType: !104, size: 32, offset: 224)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !326, file: !325, line: 67, baseType: !104, size: 32, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !326, file: !325, line: 69, baseType: !104, size: 32, offset: 288)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !326, file: !325, line: 70, baseType: !104, size: 32, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !326, file: !325, line: 71, baseType: !104, size: 32, offset: 352)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !326, file: !325, line: 72, baseType: !104, size: 32, offset: 384)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !326, file: !325, line: 73, baseType: !342, size: 8192, offset: 416)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 8192, elements: !343)
!343 = !{!344}
!344 = !DISubrange(count: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !326, file: !325, line: 75, baseType: !104, size: 32, offset: 8608)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !326, file: !325, line: 76, baseType: !104, size: 32, offset: 8640)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !326, file: !325, line: 77, baseType: !104, size: 32, offset: 8672)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !326, file: !325, line: 78, baseType: !104, size: 32, offset: 8704)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !326, file: !325, line: 79, baseType: !104, size: 32, offset: 8736)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !326, file: !325, line: 80, baseType: !104, size: 32, offset: 8768)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !326, file: !325, line: 81, baseType: !104, size: 32, offset: 8800)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !326, file: !325, line: 83, baseType: !104, size: 32, offset: 8832)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !326, file: !325, line: 90, baseType: !354, size: 128, offset: 8864)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !326, file: !325, line: 84, size: 128, elements: !355)
!355 = !{!356, !357, !358, !359}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !354, file: !325, line: 86, baseType: !104, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !354, file: !325, line: 87, baseType: !104, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !354, file: !325, line: 88, baseType: !104, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !354, file: !325, line: 89, baseType: !104, size: 32, offset: 96)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !326, file: !325, line: 92, baseType: !104, size: 32, offset: 8992)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !326, file: !325, line: 150, baseType: !362, size: 1344, offset: 9024)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !326, file: !325, line: 93, size: 1344, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !362, file: !325, line: 95, baseType: !104, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !362, file: !325, line: 96, baseType: !104, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !362, file: !325, line: 97, baseType: !104, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !362, file: !325, line: 99, baseType: !104, size: 32, offset: 96)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !362, file: !325, line: 100, baseType: !104, size: 32, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !362, file: !325, line: 102, baseType: !104, size: 32, offset: 160)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !362, file: !325, line: 103, baseType: !104, size: 32, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !362, file: !325, line: 104, baseType: !104, size: 32, offset: 224)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !362, file: !325, line: 105, baseType: !104, size: 32, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !362, file: !325, line: 106, baseType: !104, size: 32, offset: 288)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !362, file: !325, line: 107, baseType: !104, size: 32, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !362, file: !325, line: 108, baseType: !104, size: 32, offset: 352)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !362, file: !325, line: 110, baseType: !104, size: 32, offset: 384)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !362, file: !325, line: 111, baseType: !104, size: 32, offset: 416)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !362, file: !325, line: 112, baseType: !104, size: 32, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !362, file: !325, line: 114, baseType: !104, size: 32, offset: 480)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !362, file: !325, line: 115, baseType: !40, size: 32, offset: 512)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !362, file: !325, line: 116, baseType: !40, size: 32, offset: 544)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !362, file: !325, line: 117, baseType: !104, size: 32, offset: 576)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !362, file: !325, line: 119, baseType: !104, size: 32, offset: 608)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !362, file: !325, line: 120, baseType: !104, size: 32, offset: 640)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !362, file: !325, line: 137, baseType: !386, size: 384, offset: 672)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !362, file: !325, line: 122, size: 384, elements: !387)
!387 = !{!388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !386, file: !325, line: 124, baseType: !104, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !386, file: !325, line: 125, baseType: !104, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !386, file: !325, line: 126, baseType: !104, size: 32, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !386, file: !325, line: 127, baseType: !104, size: 32, offset: 96)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !386, file: !325, line: 128, baseType: !104, size: 32, offset: 128)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !386, file: !325, line: 129, baseType: !104, size: 32, offset: 160)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !386, file: !325, line: 130, baseType: !104, size: 32, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !386, file: !325, line: 131, baseType: !104, size: 32, offset: 224)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !386, file: !325, line: 133, baseType: !104, size: 32, offset: 256)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !386, file: !325, line: 134, baseType: !104, size: 32, offset: 288)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !386, file: !325, line: 135, baseType: !104, size: 32, offset: 320)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !386, file: !325, line: 136, baseType: !104, size: 32, offset: 352)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !362, file: !325, line: 139, baseType: !104, size: 32, offset: 1056)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !362, file: !325, line: 140, baseType: !104, size: 32, offset: 1088)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !362, file: !325, line: 141, baseType: !104, size: 32, offset: 1120)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !362, file: !325, line: 142, baseType: !104, size: 32, offset: 1152)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !362, file: !325, line: 143, baseType: !104, size: 32, offset: 1184)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !362, file: !325, line: 144, baseType: !104, size: 32, offset: 1216)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !362, file: !325, line: 145, baseType: !104, size: 32, offset: 1248)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !362, file: !325, line: 146, baseType: !104, size: 32, offset: 1280)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !362, file: !325, line: 147, baseType: !104, size: 32, offset: 1312)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !326, file: !325, line: 152, baseType: !104, size: 32, offset: 10368)
!410 = !{!411}
!411 = !DISubrange(count: 1)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !96, file: !51, line: 431, baseType: !413, size: 64, offset: 25600)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !96, file: !51, line: 432, baseType: !415, size: 960, offset: 25664)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 960, elements: !410)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !325, line: 186, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !325, line: 156, size: 960, elements: !418)
!418 = !{!419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !417, file: !325, line: 158, baseType: !104, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !417, file: !325, line: 159, baseType: !104, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !417, file: !325, line: 161, baseType: !104, size: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !417, file: !325, line: 163, baseType: !104, size: 32, offset: 96)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !417, file: !325, line: 164, baseType: !104, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !417, file: !325, line: 166, baseType: !104, size: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !417, file: !325, line: 167, baseType: !104, size: 32, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !417, file: !325, line: 169, baseType: !104, size: 32, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !417, file: !325, line: 170, baseType: !104, size: 32, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !417, file: !325, line: 172, baseType: !104, size: 32, offset: 288)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !417, file: !325, line: 173, baseType: !104, size: 32, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !417, file: !325, line: 175, baseType: !104, size: 32, offset: 352)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !417, file: !325, line: 177, baseType: !104, size: 32, offset: 384)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !417, file: !325, line: 178, baseType: !104, size: 32, offset: 416)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !417, file: !325, line: 179, baseType: !104, size: 32, offset: 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !417, file: !325, line: 181, baseType: !104, size: 32, offset: 480)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !417, file: !325, line: 183, baseType: !104, size: 32, offset: 512)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !417, file: !325, line: 184, baseType: !437, size: 384, offset: 576)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 384, elements: !44)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !96, file: !51, line: 433, baseType: !440, size: 64, offset: 26624)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !96, file: !51, line: 434, baseType: !104, size: 32, offset: 26688)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !96, file: !51, line: 437, baseType: !104, size: 32, offset: 26720)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !96, file: !51, line: 440, baseType: !444, size: 256, offset: 26752)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 256, elements: !64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 512, elements: !148)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !96, file: !51, line: 441, baseType: !448, size: 128, offset: 27008)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 128, elements: !57)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 2048, elements: !155)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !96, file: !51, line: 443, baseType: !444, size: 256, offset: 27136)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !96, file: !51, line: 444, baseType: !448, size: 128, offset: 27392)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !96, file: !51, line: 446, baseType: !454, size: 256, offset: 27520)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 256, elements: !64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 256, elements: !148)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !96, file: !51, line: 447, baseType: !458, size: 128, offset: 27776)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 128, elements: !57)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 1024, elements: !155)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !96, file: !51, line: 448, baseType: !454, size: 256, offset: 27904)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !96, file: !51, line: 449, baseType: !458, size: 128, offset: 28160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !96, file: !51, line: 454, baseType: !464, size: 5888, offset: 28288)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 5888, elements: !466)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!466 = !{!467}
!467 = !DISubrange(count: 92)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !96, file: !51, line: 455, baseType: !469, size: 23552, offset: 34176)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 23552, elements: !470)
!470 = !{!467, !65}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !96, file: !51, line: 457, baseType: !438, size: 64, offset: 57728)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !96, file: !51, line: 460, baseType: !473, size: 53376, offset: 57856)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !51, line: 364, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !51, line: 302, size: 53376, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !504, !534, !535, !536, !542, !543, !544, !545, !546, !547, !548, !549}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !474, file: !51, line: 304, baseType: !413, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !474, file: !51, line: 305, baseType: !440, size: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !474, file: !51, line: 307, baseType: !104, size: 32, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !474, file: !51, line: 308, baseType: !104, size: 32, offset: 160)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !474, file: !51, line: 309, baseType: !104, size: 32, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !474, file: !51, line: 311, baseType: !104, size: 32, offset: 224)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !474, file: !51, line: 313, baseType: !104, size: 32, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !474, file: !51, line: 315, baseType: !104, size: 32, offset: 288)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !474, file: !51, line: 316, baseType: !104, size: 32, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !474, file: !51, line: 317, baseType: !104, size: 32, offset: 352)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !474, file: !51, line: 319, baseType: !104, size: 32, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !474, file: !51, line: 321, baseType: !104, size: 32, offset: 416)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !474, file: !51, line: 322, baseType: !104, size: 32, offset: 448)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !474, file: !51, line: 324, baseType: !202, size: 64, offset: 480)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !474, file: !51, line: 325, baseType: !104, size: 32, offset: 544)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !474, file: !51, line: 327, baseType: !104, size: 32, offset: 576)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !474, file: !51, line: 329, baseType: !104, size: 32, offset: 608)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !474, file: !51, line: 330, baseType: !104, size: 32, offset: 640)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !474, file: !51, line: 331, baseType: !104, size: 32, offset: 672)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !474, file: !51, line: 333, baseType: !104, size: 32, offset: 704)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !474, file: !51, line: 334, baseType: !104, size: 32, offset: 736)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !474, file: !51, line: 339, baseType: !498, size: 2048, offset: 768)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 2048, elements: !503)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !474, file: !51, line: 335, size: 64, elements: !500)
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !499, file: !51, line: 337, baseType: !104, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !499, file: !51, line: 338, baseType: !104, size: 32, offset: 32)
!503 = !{!58, !149}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !474, file: !51, line: 342, baseType: !505, size: 49152, align: 128, offset: 2816)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 49152, align: 128, elements: !531)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !507, line: 36, baseType: !508, align: 128)
!507 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !507, line: 26, size: 512, elements: !509)
!509 = !{!510, !517, !518, !521, !522, !523}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !508, file: !507, line: 30, baseType: !511, size: 128, align: 128)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 128, elements: !515)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !78, line: 25, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !43, line: 39, baseType: !514)
!514 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!515 = !{!516}
!516 = !DISubrange(count: 8)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !508, file: !507, line: 31, baseType: !511, size: 128, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !508, file: !507, line: 32, baseType: !519, size: 32, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !78, line: 26, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !43, line: 41, baseType: !104)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !508, file: !507, line: 33, baseType: !519, size: 32, offset: 288)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !508, file: !507, line: 34, baseType: !519, size: 32, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !508, file: !507, line: 35, baseType: !524, size: 64, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !507, line: 25, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !290, !104, !290, !104, !529, !104}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!531 = !{!532, !533}
!532 = !DISubrange(count: 32)
!533 = !DISubrange(count: 3)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !474, file: !51, line: 344, baseType: !104, size: 32, offset: 51968)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !474, file: !51, line: 345, baseType: !104, size: 32, offset: 52000)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !474, file: !51, line: 350, baseType: !537, size: 1024, offset: 52032)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 1024, elements: !148)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !474, file: !51, line: 346, size: 64, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !538, file: !51, line: 348, baseType: !104, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !538, file: !51, line: 349, baseType: !104, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !474, file: !51, line: 352, baseType: !104, size: 32, offset: 53056)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !474, file: !51, line: 354, baseType: !104, size: 32, offset: 53088)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !474, file: !51, line: 355, baseType: !104, size: 32, offset: 53120)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !474, file: !51, line: 356, baseType: !104, size: 32, offset: 53152)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !474, file: !51, line: 357, baseType: !104, size: 32, offset: 53184)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !474, file: !51, line: 360, baseType: !104, size: 32, offset: 53216)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !474, file: !51, line: 361, baseType: !104, size: 32, offset: 53248)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !474, file: !51, line: 362, baseType: !104, size: 32, offset: 53280)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !96, file: !51, line: 463, baseType: !551, size: 4096, offset: 111232)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !552, line: 46, baseType: !553)
!552 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !552, line: 27, size: 4096, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562, !563}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !553, file: !552, line: 30, baseType: !104, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !553, file: !552, line: 31, baseType: !104, size: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !553, file: !552, line: 34, baseType: !104, size: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !553, file: !552, line: 35, baseType: !104, size: 32, offset: 96)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !553, file: !552, line: 37, baseType: !290, size: 64, offset: 128)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !553, file: !552, line: 38, baseType: !290, size: 64, offset: 192)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !553, file: !552, line: 39, baseType: !290, size: 64, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !553, file: !552, line: 42, baseType: !104, size: 32, align: 128, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !553, file: !552, line: 45, baseType: !564, size: 3680, offset: 416)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 3680, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 460)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !96, file: !51, line: 494, baseType: !568, size: 2112, offset: 115328)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !51, line: 465, size: 2112, elements: !569)
!569 = !{!570, !708, !710, !711, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !724, !725, !726, !727}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !568, file: !51, line: 468, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !574, line: 146, baseType: !575)
!574 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !574, line: 31, size: 125056, elements: !576)
!576 = !{!577, !578, !579, !580, !583, !584, !585, !586, !587, !588, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !607, !608, !609, !610, !611, !612, !614, !616, !617, !618, !619, !620, !623, !625, !626, !628, !630, !631, !635, !636, !640, !644, !647, !649, !650, !652, !653, !655, !656, !657, !660, !662, !663, !664, !666, !667, !668, !669, !670, !671, !672, !673, !675, !676, !680, !689, !693, !695, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !575, file: !574, line: 34, baseType: !104, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !575, file: !574, line: 35, baseType: !104, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !575, file: !574, line: 36, baseType: !104, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !575, file: !574, line: 37, baseType: !581, size: 64, offset: 128)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !78, line: 27, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !43, line: 44, baseType: !304)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !575, file: !574, line: 38, baseType: !581, size: 64, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !575, file: !574, line: 39, baseType: !104, size: 32, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !575, file: !574, line: 40, baseType: !104, size: 32, offset: 288)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !575, file: !574, line: 41, baseType: !104, size: 32, offset: 320)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !575, file: !574, line: 42, baseType: !104, size: 32, offset: 352)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !575, file: !574, line: 43, baseType: !589, size: 64, offset: 384)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !575, file: !574, line: 45, baseType: !104, size: 32, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !575, file: !574, line: 46, baseType: !104, size: 32, offset: 480)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !575, file: !574, line: 47, baseType: !104, size: 32, offset: 512)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !575, file: !574, line: 48, baseType: !104, size: 32, offset: 544)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !575, file: !574, line: 49, baseType: !104, size: 32, offset: 576)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !575, file: !574, line: 50, baseType: !104, size: 32, offset: 608)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !575, file: !574, line: 51, baseType: !104, size: 32, offset: 640)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !575, file: !574, line: 52, baseType: !61, size: 8, offset: 672)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !575, file: !574, line: 53, baseType: !61, size: 8, offset: 680)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !575, file: !574, line: 54, baseType: !61, size: 8, offset: 688)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !575, file: !574, line: 55, baseType: !198, size: 32, offset: 704)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !575, file: !574, line: 56, baseType: !198, size: 32, offset: 736)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !575, file: !574, line: 57, baseType: !104, size: 32, offset: 768)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !575, file: !574, line: 60, baseType: !104, size: 32, offset: 800)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !575, file: !574, line: 61, baseType: !605, size: 96, offset: 832)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 96, elements: !606)
!606 = !{!533}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !575, file: !574, line: 62, baseType: !605, size: 96, offset: 928)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !575, file: !574, line: 63, baseType: !605, size: 96, offset: 1024)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !575, file: !574, line: 64, baseType: !104, size: 32, offset: 1120)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !575, file: !574, line: 65, baseType: !104, size: 32, offset: 1152)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !575, file: !574, line: 66, baseType: !104, size: 32, offset: 1184)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !575, file: !574, line: 67, baseType: !613, size: 192, offset: 1216)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 192, elements: !606)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !575, file: !574, line: 68, baseType: !615, size: 256, offset: 1408)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 256, elements: !64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !575, file: !574, line: 69, baseType: !615, size: 256, offset: 1664)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !575, file: !574, line: 70, baseType: !465, size: 64, offset: 1920)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !575, file: !574, line: 74, baseType: !615, size: 256, offset: 1984)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !575, file: !574, line: 75, baseType: !615, size: 256, offset: 2240)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !575, file: !574, line: 77, baseType: !621, size: 24576, align: 128, offset: 2560)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 24576, align: 128, elements: !622)
!622 = !{!149, !533}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !575, file: !574, line: 78, baseType: !624, size: 1024, offset: 27136)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 1024, elements: !148)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !575, file: !574, line: 79, baseType: !104, size: 32, offset: 28160)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !575, file: !574, line: 80, baseType: !627, size: 64, offset: 28224)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !575, file: !574, line: 83, baseType: !629, size: 64, offset: 28288)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !575, file: !574, line: 84, baseType: !290, size: 64, offset: 28352)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !575, file: !574, line: 85, baseType: !632, size: 128, offset: 28416)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 128, elements: !57)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 32, elements: !57)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !575, file: !574, line: 86, baseType: !633, size: 64, offset: 28544)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !575, file: !574, line: 87, baseType: !637, size: 2176, offset: 28608)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 2176, elements: !638)
!638 = !{!58, !639}
!639 = !DISubrange(count: 17)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !575, file: !574, line: 92, baseType: !641, size: 20736, offset: 30784)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 20736, elements: !642)
!642 = !{!643, !643}
!643 = !DISubrange(count: 18)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !575, file: !574, line: 96, baseType: !645, size: 2176, offset: 51520)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 2176, elements: !638)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !575, file: !574, line: 97, baseType: !648, size: 128, offset: 53696)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, size: 128, elements: !57)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !575, file: !574, line: 98, baseType: !202, size: 64, offset: 53824)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !575, file: !574, line: 99, baseType: !651, size: 1024, offset: 53888)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 1024, elements: !503)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !575, file: !574, line: 100, baseType: !634, size: 32, offset: 54912)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !575, file: !574, line: 105, baseType: !654, size: 10368, offset: 54944)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 10368, elements: !642)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !575, file: !574, line: 106, baseType: !654, size: 10368, offset: 65312)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !575, file: !574, line: 107, baseType: !104, size: 32, offset: 75680)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !575, file: !574, line: 108, baseType: !658, size: 576, offset: 75712)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 576, elements: !659)
!659 = !{!643}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !575, file: !574, line: 109, baseType: !661, size: 20736, offset: 76288)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 20736, elements: !642)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !575, file: !574, line: 110, baseType: !646, size: 64, offset: 97024)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !575, file: !574, line: 111, baseType: !646, size: 64, offset: 97088)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !575, file: !574, line: 112, baseType: !665, size: 64, offset: 97152)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !575, file: !574, line: 113, baseType: !665, size: 64, offset: 97216)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !575, file: !574, line: 114, baseType: !665, size: 64, offset: 97280)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !575, file: !574, line: 115, baseType: !104, size: 32, offset: 97344)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !575, file: !574, line: 116, baseType: !465, size: 64, offset: 97408)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !575, file: !574, line: 117, baseType: !465, size: 64, offset: 97472)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !575, file: !574, line: 118, baseType: !465, size: 64, offset: 97536)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !575, file: !574, line: 119, baseType: !104, size: 32, offset: 97600)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !575, file: !574, line: 120, baseType: !674, size: 576, offset: 97632)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 576, elements: !659)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !575, file: !574, line: 121, baseType: !40, size: 32, offset: 98208)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !575, file: !574, line: 122, baseType: !677, size: 64, offset: 98240)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !41, line: 27, baseType: !678)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !43, line: 45, baseType: !679)
!679 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !575, file: !574, line: 125, baseType: !681, size: 256, offset: 98304)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !95, line: 503, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 496, size: 256, elements: !683)
!683 = !{!684, !686, !687, !688}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !682, file: !95, line: 498, baseType: !685, size: 64)
!685 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !682, file: !95, line: 499, baseType: !685, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !682, file: !95, line: 500, baseType: !685, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !682, file: !95, line: 502, baseType: !685, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !575, file: !574, line: 128, baseType: !690, size: 2008, offset: 98560)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2008, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 251)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !575, file: !574, line: 129, baseType: !694, size: 8032, offset: 100576)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 8032, elements: !691)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !575, file: !574, line: 130, baseType: !696, size: 16064, offset: 108608)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 16064, elements: !691)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !575, file: !574, line: 131, baseType: !104, size: 32, offset: 124672)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !575, file: !574, line: 132, baseType: !104, size: 32, offset: 124704)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !575, file: !574, line: 135, baseType: !104, size: 32, offset: 124736)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !575, file: !574, line: 136, baseType: !104, size: 32, offset: 124768)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !575, file: !574, line: 137, baseType: !104, size: 32, offset: 124800)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !575, file: !574, line: 138, baseType: !104, size: 32, offset: 124832)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !575, file: !574, line: 139, baseType: !104, size: 32, offset: 124864)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !575, file: !574, line: 142, baseType: !198, size: 32, offset: 124896)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !575, file: !574, line: 143, baseType: !104, size: 32, offset: 124928)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !575, file: !574, line: 144, baseType: !104, size: 32, offset: 124960)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !575, file: !574, line: 145, baseType: !104, size: 32, offset: 124992)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !568, file: !51, line: 470, baseType: !709, size: 128, offset: 64)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 128, elements: !57)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !568, file: !51, line: 473, baseType: !571, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !568, file: !51, line: 476, baseType: !712, size: 1152, offset: 256)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 1152, elements: !659)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !568, file: !51, line: 478, baseType: !104, size: 32, offset: 1408)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !568, file: !51, line: 480, baseType: !104, size: 32, offset: 1440)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !568, file: !51, line: 482, baseType: !104, size: 32, offset: 1472)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !568, file: !51, line: 483, baseType: !104, size: 32, offset: 1504)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !568, file: !51, line: 484, baseType: !104, size: 32, offset: 1536)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !568, file: !51, line: 485, baseType: !104, size: 32, offset: 1568)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !568, file: !51, line: 486, baseType: !104, size: 32, offset: 1600)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !568, file: !51, line: 487, baseType: !581, size: 64, offset: 1664)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !568, file: !51, line: 488, baseType: !581, size: 64, offset: 1728)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !568, file: !51, line: 489, baseType: !723, size: 128, offset: 1792)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 128, elements: !57)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !568, file: !51, line: 490, baseType: !581, size: 64, offset: 1920)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !568, file: !51, line: 491, baseType: !581, size: 64, offset: 1984)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !568, file: !51, line: 492, baseType: !104, size: 32, offset: 2048)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !568, file: !51, line: 493, baseType: !104, size: 32, offset: 2080)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !96, file: !51, line: 497, baseType: !572, size: 64, offset: 117440)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !96, file: !51, line: 500, baseType: !572, size: 64, offset: 117504)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !96, file: !51, line: 503, baseType: !104, size: 32, offset: 117568)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !96, file: !51, line: 504, baseType: !732, size: 1216, offset: 117632)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 1216, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 19)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !96, file: !51, line: 505, baseType: !104, size: 32, offset: 118848)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !96, file: !51, line: 506, baseType: !732, size: 1216, offset: 118912)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !96, file: !51, line: 507, baseType: !202, size: 64, offset: 120128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !96, file: !51, line: 510, baseType: !104, size: 32, offset: 120192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !96, file: !51, line: 511, baseType: !104, size: 32, offset: 120224)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !96, file: !51, line: 512, baseType: !581, size: 64, offset: 120256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !96, file: !51, line: 522, baseType: !742, size: 10624, offset: 120320)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !51, line: 515, size: 10624, elements: !743)
!743 = !{!744, !746, !749, !752}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !742, file: !51, line: 517, baseType: !745, size: 256, align: 128)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 256, elements: !148)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !742, file: !51, line: 518, baseType: !747, size: 128, align: 128, offset: 256)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 128, elements: !748)
!748 = !{!58, !65}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !742, file: !51, line: 520, baseType: !750, size: 4096, align: 128, offset: 384)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 4096, elements: !751)
!751 = !{!65, !156}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !742, file: !51, line: 521, baseType: !753, size: 6144, align: 128, offset: 4480)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 6144, elements: !754)
!754 = !{!755, !149}
!755 = !DISubrange(count: 24)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !96, file: !51, line: 732, baseType: !757, size: 82688, offset: 130944)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !51, line: 525, size: 82688, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !786, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !804, !807, !811, !812, !813, !818, !819, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !887, !918, !919, !920, !921, !922, !923, !924, !925, !926, !929, !930, !931, !934, !937, !939, !942, !944, !945}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !757, file: !51, line: 527, baseType: !104, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !757, file: !51, line: 530, baseType: !104, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !757, file: !51, line: 531, baseType: !104, size: 32, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !757, file: !51, line: 532, baseType: !104, size: 32, offset: 96)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !757, file: !51, line: 535, baseType: !104, size: 32, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !757, file: !51, line: 536, baseType: !104, size: 32, offset: 160)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !757, file: !51, line: 537, baseType: !104, size: 32, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !757, file: !51, line: 538, baseType: !104, size: 32, offset: 224)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !757, file: !51, line: 539, baseType: !104, size: 32, offset: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !757, file: !51, line: 542, baseType: !104, size: 32, offset: 288)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !757, file: !51, line: 543, baseType: !104, size: 32, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !757, file: !51, line: 544, baseType: !104, size: 32, offset: 352)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !757, file: !51, line: 545, baseType: !104, size: 32, offset: 384)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !757, file: !51, line: 546, baseType: !104, size: 32, offset: 416)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !757, file: !51, line: 547, baseType: !104, size: 32, offset: 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !757, file: !51, line: 548, baseType: !104, size: 32, offset: 480)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !757, file: !51, line: 549, baseType: !104, size: 32, offset: 512)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !757, file: !51, line: 551, baseType: !104, size: 32, offset: 544)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !757, file: !51, line: 554, baseType: !202, size: 64, offset: 576)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !757, file: !51, line: 555, baseType: !202, size: 64, offset: 640)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !757, file: !51, line: 558, baseType: !202, size: 64, offset: 704)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !757, file: !51, line: 559, baseType: !202, size: 64, offset: 768)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !757, file: !51, line: 561, baseType: !202, size: 64, offset: 832)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !757, file: !51, line: 562, baseType: !202, size: 64, offset: 896)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !757, file: !51, line: 565, baseType: !7, size: 32, offset: 960)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !757, file: !51, line: 566, baseType: !785, size: 128, offset: 992)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !757, file: !51, line: 567, baseType: !787, size: 512, offset: 1120)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !148)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !757, file: !51, line: 568, baseType: !7, size: 32, offset: 1632)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !757, file: !51, line: 569, baseType: !7, size: 32, offset: 1664)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !757, file: !51, line: 570, baseType: !104, size: 32, offset: 1696)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !757, file: !51, line: 571, baseType: !104, size: 32, offset: 1728)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !757, file: !51, line: 572, baseType: !104, size: 32, offset: 1760)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !757, file: !51, line: 573, baseType: !104, size: 32, offset: 1792)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !757, file: !51, line: 574, baseType: !104, size: 32, offset: 1824)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !757, file: !51, line: 575, baseType: !104, size: 32, offset: 1856)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !757, file: !51, line: 576, baseType: !104, size: 32, offset: 1888)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !757, file: !51, line: 577, baseType: !104, size: 32, offset: 1920)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !757, file: !51, line: 578, baseType: !104, size: 32, offset: 1952)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !757, file: !51, line: 585, baseType: !629, size: 64, offset: 1984)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !757, file: !51, line: 586, baseType: !290, size: 64, offset: 2048)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !757, file: !51, line: 587, baseType: !629, size: 64, offset: 2112)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !757, file: !51, line: 588, baseType: !803, size: 64, offset: 2176)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !757, file: !51, line: 589, baseType: !805, size: 64, offset: 2240)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 64, elements: !515)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !757, file: !51, line: 591, baseType: !808, size: 64, offset: 2304)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 192, elements: !810)
!810 = !{!755}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !757, file: !51, line: 592, baseType: !629, size: 64, offset: 2368)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !757, file: !51, line: 593, baseType: !632, size: 128, offset: 2432)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !757, file: !51, line: 594, baseType: !814, size: 128, offset: 2560)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 128, elements: !57)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 128, elements: !817)
!817 = !{!516, !58}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !757, file: !51, line: 595, baseType: !648, size: 128, offset: 2688)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !757, file: !51, line: 596, baseType: !820, size: 4096, offset: 2816)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 4096, elements: !821)
!821 = !{!58, !532}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !757, file: !51, line: 597, baseType: !629, size: 64, offset: 6912)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !757, file: !51, line: 598, baseType: !629, size: 64, offset: 6976)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !757, file: !51, line: 599, baseType: !465, size: 64, offset: 7040)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !757, file: !51, line: 603, baseType: !624, size: 1024, offset: 7104)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !757, file: !51, line: 606, baseType: !104, size: 32, offset: 8128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !757, file: !51, line: 607, baseType: !104, size: 32, offset: 8160)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !757, file: !51, line: 608, baseType: !60, size: 32, align: 32, offset: 8192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !757, file: !51, line: 609, baseType: !104, size: 32, offset: 8224)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !757, file: !51, line: 611, baseType: !104, size: 32, offset: 8256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !757, file: !51, line: 612, baseType: !104, size: 32, offset: 8288)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !757, file: !51, line: 614, baseType: !104, size: 32, offset: 8320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !757, file: !51, line: 615, baseType: !104, size: 32, offset: 8352)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !757, file: !51, line: 621, baseType: !104, size: 32, offset: 8384)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !757, file: !51, line: 624, baseType: !104, size: 32, offset: 8416)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !757, file: !51, line: 626, baseType: !104, size: 32, offset: 8448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !757, file: !51, line: 627, baseType: !104, size: 32, offset: 8480)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !757, file: !51, line: 671, baseType: !839, size: 60672, offset: 8576)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !757, file: !51, line: 629, size: 60672, elements: !840)
!840 = !{!841, !845, !849, !851, !852, !855, !859, !861, !862, !863, !864, !865, !868, !872, !875, !876, !877, !878, !879, !882, !884, !886}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !839, file: !51, line: 634, baseType: !842, size: 3072, align: 128)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 3072, elements: !843)
!843 = !{!844}
!844 = !DISubrange(count: 384)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !839, file: !51, line: 635, baseType: !846, size: 6912, align: 128, offset: 3072)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 6912, elements: !847)
!847 = !{!848}
!848 = !DISubrange(count: 864)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !839, file: !51, line: 638, baseType: !850, size: 2048, align: 128, offset: 9984)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 2048, elements: !343)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !839, file: !51, line: 639, baseType: !850, size: 2048, align: 128, offset: 12032)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !839, file: !51, line: 640, baseType: !853, size: 3072, align: 128, offset: 14080)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 3072, elements: !854)
!854 = !{!533, !156}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !839, file: !51, line: 641, baseType: !856, size: 3840, align: 128, offset: 17152)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 3840, elements: !857)
!857 = !{!858, !149}
!858 = !DISubrange(count: 15)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !839, file: !51, line: 642, baseType: !860, size: 128, offset: 20992)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 128, elements: !64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !839, file: !51, line: 643, baseType: !860, size: 128, offset: 21120)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !839, file: !51, line: 644, baseType: !104, size: 32, offset: 21248)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !839, file: !51, line: 645, baseType: !104, size: 32, offset: 21280)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !839, file: !51, line: 648, baseType: !750, size: 4096, align: 128, offset: 21376)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !839, file: !51, line: 649, baseType: !866, size: 4096, align: 128, offset: 25472)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 4096, elements: !867)
!867 = !{!149, !149}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_hadamard_cache", scope: !839, file: !51, line: 652, baseType: !869, size: 576, align: 128, offset: 29568)
