; ModuleID = 'x264_src/common/frame.c'
source_filename = "x264_src/common/frame.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@.str = private unnamed_addr constant [26 x i8] c"Invalid input colorspace\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [44 x i8] c"Input picture width is greater than stride\0A\00", align 1, !dbg !7

; Function Attrs: nounwind uwtable
define dso_local ptr @x264_frame_new(ptr nocapture noundef readonly %h, i32 noundef %b_fdec) local_unnamed_addr #0 !dbg !42 {
entry:
    #dbg_value(ptr %h, !1353, !DIExpression(), !1394)
    #dbg_value(i32 %b_fdec, !1354, !DIExpression(), !1394)
  %mb = getelementptr inbounds i8, ptr %h, i64 16368, !dbg !1395
  %0 = load i32, ptr %mb, align 16, !dbg !1396
    #dbg_value(i32 %0, !1356, !DIExpression(), !1394)
  %b_interlaced = getelementptr inbounds i8, ptr %h, i64 136, !dbg !1397
  %1 = load i32, ptr %b_interlaced, align 8, !dbg !1397
  %shl = shl i32 32, %1, !dbg !1398
    #dbg_value(i32 %shl, !1360, !DIExpression(), !1394)
  %2 = load i32, ptr %h, align 16, !dbg !1399
    #dbg_value(i32 poison, !1363, !DIExpression(), !1394)
  %call = tail call ptr @x264_malloc(i32 noundef 15632) #11, !dbg !1400
    #dbg_value(ptr %call, !1355, !DIExpression(), !1394)
  %tobool9.not = icmp eq ptr %call, null, !dbg !1403
  br i1 %tobool9.not, label %fail, label %do.end, !dbg !1400


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 224, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "x264_src/common/frame.c", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "2de27f64079da1a9117f5fc2a58ed5b6")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 26)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 248, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 44)
!12 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !13, retainedTypes: !26, globals: !33, splitDebugInlining: false, nameTableKind: None)
!13 = !{!14}
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pic_struct_e", file: !15, line: 483, baseType: !16, size: 32, elements: !17)
!15 = !DIFile(filename: "x264_src/x264.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25}
!18 = !DIEnumerator(name: "PIC_STRUCT_AUTO", value: 0)
!19 = !DIEnumerator(name: "PIC_STRUCT_PROGRESSIVE", value: 1)
!20 = !DIEnumerator(name: "PIC_STRUCT_TOP_BOTTOM", value: 4)
!21 = !DIEnumerator(name: "PIC_STRUCT_BOTTOM_TOP", value: 5)
!22 = !DIEnumerator(name: "PIC_STRUCT_TOP_BOTTOM_TOP", value: 6)
!23 = !DIEnumerator(name: "PIC_STRUCT_BOTTOM_TOP_BOTTOM", value: 7)
!24 = !DIEnumerator(name: "PIC_STRUCT_DOUBLE", value: 8)
!25 = !DIEnumerator(name: "PIC_STRUCT_TRIPLE", value: 9)
!26 = !{!27}
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !29, line: 25, baseType: !30)
!29 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !31, line: 40, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!32 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!33 = !{!0, !7}
!34 = !{i32 7, !"Dwarf Version", i32 5}
!35 = !{i32 2, !"Debug Info Version", i32 3}
!36 = !{i32 1, !"wchar_size", i32 4}
!37 = !{i32 8, !"PIC Level", i32 2}
!38 = !{i32 7, !"PIE Level", i32 2}
!39 = !{i32 7, !"uwtable", i32 2}
!40 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!41 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!42 = distinct !DISubprogram(name: "x264_frame_new", scope: !2, file: !2, line: 29, type: !43, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !1352)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !390, !51}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !47, line: 146, baseType: !48)
!47 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !47, line: 31, size: 125056, elements: !49)
!49 = !{!50, !52, !53, !54, !59, !60, !61, !62, !63, !64, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !257, !258, !259, !260, !261, !262, !265, !269, !270, !271, !272, !273, !301, !303, !304, !306, !311, !312, !316, !317, !321, !325, !328, !330, !331, !334, !335, !337, !338, !339, !342, !344, !345, !346, !348, !349, !350, !351, !352, !353, !354, !355, !357, !358, !362, !371, !375, !377, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !48, file: !47, line: 34, baseType: !51, size: 32)
!51 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !48, file: !47, line: 35, baseType: !51, size: 32, offset: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !48, file: !47, line: 36, baseType: !51, size: 32, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !48, file: !47, line: 37, baseType: !55, size: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !56, line: 27, baseType: !57)
!56 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !31, line: 44, baseType: !58)
!58 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !48, file: !47, line: 38, baseType: !55, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !48, file: !47, line: 39, baseType: !51, size: 32, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !48, file: !47, line: 40, baseType: !51, size: 32, offset: 288)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !48, file: !47, line: 41, baseType: !51, size: 32, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !48, file: !47, line: 42, baseType: !51, size: 32, offset: 352)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !48, file: !47, line: 43, baseType: !65, size: 64, offset: 384)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !15, line: 376, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !15, line: 176, size: 5632, elements: !68)
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !111, !118, !119, !120, !121, !125, !126, !140, !141, !142, !143, !144, !175, !217, !218, !219, !220, !221, !222, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !67, file: !15, line: 179, baseType: !16, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !67, file: !15, line: 180, baseType: !51, size: 32, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !67, file: !15, line: 181, baseType: !51, size: 32, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !67, file: !15, line: 182, baseType: !51, size: 32, offset: 96)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !67, file: !15, line: 183, baseType: !51, size: 32, offset: 128)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !67, file: !15, line: 186, baseType: !51, size: 32, offset: 160)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !67, file: !15, line: 187, baseType: !51, size: 32, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !67, file: !15, line: 188, baseType: !51, size: 32, offset: 224)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !67, file: !15, line: 189, baseType: !51, size: 32, offset: 256)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !67, file: !15, line: 190, baseType: !51, size: 32, offset: 288)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !67, file: !15, line: 198, baseType: !51, size: 32, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !67, file: !15, line: 215, baseType: !81, size: 288, offset: 352)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !67, file: !15, line: 200, size: 288, elements: !82)
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !81, file: !15, line: 203, baseType: !51, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !81, file: !15, line: 204, baseType: !51, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !81, file: !15, line: 206, baseType: !51, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !81, file: !15, line: 209, baseType: !51, size: 32, offset: 96)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !81, file: !15, line: 210, baseType: !51, size: 32, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !81, file: !15, line: 211, baseType: !51, size: 32, offset: 160)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !81, file: !15, line: 212, baseType: !51, size: 32, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !81, file: !15, line: 213, baseType: !51, size: 32, offset: 224)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !81, file: !15, line: 214, baseType: !51, size: 32, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !67, file: !15, line: 218, baseType: !51, size: 32, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !67, file: !15, line: 219, baseType: !51, size: 32, offset: 672)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !67, file: !15, line: 220, baseType: !51, size: 32, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !67, file: !15, line: 221, baseType: !51, size: 32, offset: 736)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !67, file: !15, line: 222, baseType: !51, size: 32, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !67, file: !15, line: 224, baseType: !51, size: 32, offset: 800)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !67, file: !15, line: 225, baseType: !51, size: 32, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !67, file: !15, line: 226, baseType: !51, size: 32, offset: 864)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !67, file: !15, line: 227, baseType: !51, size: 32, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !67, file: !15, line: 229, baseType: !51, size: 32, offset: 928)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !67, file: !15, line: 230, baseType: !51, size: 32, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !67, file: !15, line: 231, baseType: !51, size: 32, offset: 992)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !67, file: !15, line: 233, baseType: !51, size: 32, offset: 1024)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !67, file: !15, line: 234, baseType: !51, size: 32, offset: 1056)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !67, file: !15, line: 236, baseType: !51, size: 32, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !67, file: !15, line: 237, baseType: !51, size: 32, offset: 1120)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !67, file: !15, line: 239, baseType: !51, size: 32, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !67, file: !15, line: 240, baseType: !110, size: 64, offset: 1216)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !67, file: !15, line: 241, baseType: !112, size: 128, offset: 1280)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 128, elements: !116)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !29, line: 24, baseType: !114)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !31, line: 38, baseType: !115)
!115 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !{!117}
!117 = !DISubrange(count: 16)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !67, file: !15, line: 242, baseType: !112, size: 128, offset: 1408)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !67, file: !15, line: 243, baseType: !112, size: 128, offset: 1536)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !67, file: !15, line: 244, baseType: !112, size: 128, offset: 1664)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !67, file: !15, line: 245, baseType: !122, size: 512, offset: 1792)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 512, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !67, file: !15, line: 246, baseType: !122, size: 512, offset: 2304)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !67, file: !15, line: 249, baseType: !127, size: 64, offset: 2816)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !130, !51, !131, !133}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !135)
!135 = !{!136, !137, !138, !139}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !134, file: !2, baseType: !16, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !134, file: !2, baseType: !16, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !134, file: !2, baseType: !130, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !134, file: !2, baseType: !130, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !67, file: !15, line: 250, baseType: !130, size: 64, offset: 2880)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !67, file: !15, line: 251, baseType: !51, size: 32, offset: 2944)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !67, file: !15, line: 252, baseType: !51, size: 32, offset: 2976)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !67, file: !15, line: 253, baseType: !110, size: 64, offset: 3008)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !67, file: !15, line: 287, baseType: !145, size: 800, offset: 3072)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !67, file: !15, line: 256, size: 800, elements: !146)
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !167, !168, !169, !173, !174}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !145, file: !15, line: 258, baseType: !16, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !145, file: !15, line: 259, baseType: !16, size: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !145, file: !15, line: 261, baseType: !51, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !145, file: !15, line: 262, baseType: !51, size: 32, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !145, file: !15, line: 263, baseType: !51, size: 32, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !145, file: !15, line: 264, baseType: !51, size: 32, offset: 160)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !145, file: !15, line: 265, baseType: !51, size: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !145, file: !15, line: 267, baseType: !51, size: 32, offset: 224)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !145, file: !15, line: 268, baseType: !51, size: 32, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !145, file: !15, line: 269, baseType: !51, size: 32, offset: 288)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !145, file: !15, line: 270, baseType: !51, size: 32, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !145, file: !15, line: 271, baseType: !51, size: 32, offset: 352)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !145, file: !15, line: 272, baseType: !51, size: 32, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !145, file: !15, line: 273, baseType: !51, size: 32, offset: 416)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !145, file: !15, line: 274, baseType: !51, size: 32, offset: 448)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !145, file: !15, line: 275, baseType: !51, size: 32, offset: 480)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !145, file: !15, line: 276, baseType: !51, size: 32, offset: 512)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !145, file: !15, line: 277, baseType: !51, size: 32, offset: 544)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !145, file: !15, line: 278, baseType: !166, size: 32, offset: 576)
!166 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !145, file: !15, line: 279, baseType: !166, size: 32, offset: 608)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !145, file: !15, line: 280, baseType: !51, size: 32, offset: 640)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !145, file: !15, line: 283, baseType: !170, size: 64, offset: 672)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 64, elements: !171)
!171 = !{!172}
!172 = !DISubrange(count: 2)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !145, file: !15, line: 285, baseType: !51, size: 32, offset: 736)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !145, file: !15, line: 286, baseType: !51, size: 32, offset: 768)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !67, file: !15, line: 327, baseType: !176, size: 1152, offset: 3904)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !67, file: !15, line: 290, size: 1152, elements: !177)
!177 = !{!178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !215, !216}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !176, file: !15, line: 292, baseType: !51, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !176, file: !15, line: 294, baseType: !51, size: 32, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !176, file: !15, line: 295, baseType: !51, size: 32, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !176, file: !15, line: 296, baseType: !51, size: 32, offset: 96)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !176, file: !15, line: 297, baseType: !51, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !176, file: !15, line: 299, baseType: !51, size: 32, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !176, file: !15, line: 300, baseType: !166, size: 32, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !176, file: !15, line: 301, baseType: !166, size: 32, offset: 224)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !176, file: !15, line: 302, baseType: !166, size: 32, offset: 256)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !176, file: !15, line: 303, baseType: !51, size: 32, offset: 288)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !176, file: !15, line: 304, baseType: !51, size: 32, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !176, file: !15, line: 305, baseType: !166, size: 32, offset: 352)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !176, file: !15, line: 306, baseType: !166, size: 32, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !176, file: !15, line: 307, baseType: !166, size: 32, offset: 416)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !176, file: !15, line: 309, baseType: !51, size: 32, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !176, file: !15, line: 310, baseType: !166, size: 32, offset: 480)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !176, file: !15, line: 311, baseType: !51, size: 32, offset: 512)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !176, file: !15, line: 312, baseType: !51, size: 32, offset: 544)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !176, file: !15, line: 315, baseType: !51, size: 32, offset: 576)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !176, file: !15, line: 316, baseType: !110, size: 64, offset: 640)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !176, file: !15, line: 317, baseType: !51, size: 32, offset: 704)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !176, file: !15, line: 318, baseType: !110, size: 64, offset: 768)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !176, file: !15, line: 321, baseType: !166, size: 32, offset: 832)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !176, file: !15, line: 322, baseType: !166, size: 32, offset: 864)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !176, file: !15, line: 323, baseType: !166, size: 32, offset: 896)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !176, file: !15, line: 324, baseType: !204, size: 64, offset: 960)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !15, line: 174, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 167, size: 256, elements: !207)
!207 = !{!208, !209, !210, !211, !212, !213}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !206, file: !15, line: 169, baseType: !51, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !206, file: !15, line: 169, baseType: !51, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !206, file: !15, line: 170, baseType: !51, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !206, file: !15, line: 171, baseType: !51, size: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !206, file: !15, line: 172, baseType: !166, size: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !206, file: !15, line: 173, baseType: !214, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !176, file: !15, line: 325, baseType: !51, size: 32, offset: 1024)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !176, file: !15, line: 326, baseType: !110, size: 64, offset: 1088)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !67, file: !15, line: 330, baseType: !51, size: 32, offset: 5056)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !67, file: !15, line: 331, baseType: !51, size: 32, offset: 5088)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !67, file: !15, line: 332, baseType: !51, size: 32, offset: 5120)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !67, file: !15, line: 334, baseType: !51, size: 32, offset: 5152)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !67, file: !15, line: 335, baseType: !51, size: 32, offset: 5184)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !67, file: !15, line: 336, baseType: !223, size: 32, offset: 5216)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !29, line: 26, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !31, line: 42, baseType: !16)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !67, file: !15, line: 337, baseType: !223, size: 32, offset: 5248)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !67, file: !15, line: 338, baseType: !223, size: 32, offset: 5280)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !67, file: !15, line: 339, baseType: !223, size: 32, offset: 5312)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !67, file: !15, line: 340, baseType: !51, size: 32, offset: 5344)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !67, file: !15, line: 344, baseType: !51, size: 32, offset: 5376)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !67, file: !15, line: 356, baseType: !51, size: 32, offset: 5408)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !67, file: !15, line: 364, baseType: !51, size: 32, offset: 5440)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !67, file: !15, line: 367, baseType: !51, size: 32, offset: 5472)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !67, file: !15, line: 368, baseType: !51, size: 32, offset: 5504)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !67, file: !15, line: 369, baseType: !51, size: 32, offset: 5536)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !67, file: !15, line: 375, baseType: !236, size: 64, offset: 5568)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !130}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !48, file: !47, line: 45, baseType: !51, size: 32, offset: 448)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !48, file: !47, line: 46, baseType: !51, size: 32, offset: 480)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !48, file: !47, line: 47, baseType: !51, size: 32, offset: 512)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !48, file: !47, line: 48, baseType: !51, size: 32, offset: 544)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !48, file: !47, line: 49, baseType: !51, size: 32, offset: 576)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !48, file: !47, line: 50, baseType: !51, size: 32, offset: 608)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !48, file: !47, line: 51, baseType: !51, size: 32, offset: 640)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !48, file: !47, line: 52, baseType: !113, size: 8, offset: 672)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !48, file: !47, line: 53, baseType: !113, size: 8, offset: 680)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !48, file: !47, line: 54, baseType: !113, size: 8, offset: 688)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !48, file: !47, line: 55, baseType: !166, size: 32, offset: 704)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !48, file: !47, line: 56, baseType: !166, size: 32, offset: 736)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !48, file: !47, line: 57, baseType: !51, size: 32, offset: 768)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !48, file: !47, line: 60, baseType: !51, size: 32, offset: 800)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !48, file: !47, line: 61, baseType: !254, size: 96, offset: 832)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 96, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 3)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !48, file: !47, line: 62, baseType: !254, size: 96, offset: 928)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !48, file: !47, line: 63, baseType: !254, size: 96, offset: 1024)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !48, file: !47, line: 64, baseType: !51, size: 32, offset: 1120)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !48, file: !47, line: 65, baseType: !51, size: 32, offset: 1152)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !48, file: !47, line: 66, baseType: !51, size: 32, offset: 1184)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !48, file: !47, line: 67, baseType: !263, size: 192, offset: 1216)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 192, elements: !255)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !48, file: !47, line: 68, baseType: !266, size: 256, offset: 1408)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 256, elements: !267)
!267 = !{!268}
!268 = !DISubrange(count: 4)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !48, file: !47, line: 69, baseType: !266, size: 256, offset: 1664)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !48, file: !47, line: 70, baseType: !27, size: 64, offset: 1920)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !48, file: !47, line: 74, baseType: !266, size: 256, offset: 1984)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !48, file: !47, line: 75, baseType: !266, size: 256, offset: 2240)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !48, file: !47, line: 77, baseType: !274, size: 24576, align: 128, offset: 2560)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 24576, align: 128, elements: !300)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !276, line: 36, baseType: !277, align: 128)
!276 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !276, line: 26, size: 512, elements: !278)
!278 = !{!279, !286, !287, !290, !291, !292}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !277, file: !276, line: 30, baseType: !280, size: 128, align: 128)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 128, elements: !284)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !56, line: 25, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !31, line: 39, baseType: !283)
!283 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!284 = !{!285}
!285 = !DISubrange(count: 8)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !277, file: !276, line: 31, baseType: !280, size: 128, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !277, file: !276, line: 32, baseType: !288, size: 32, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !56, line: 26, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !31, line: 41, baseType: !51)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !277, file: !276, line: 33, baseType: !288, size: 32, offset: 288)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !277, file: !276, line: 34, baseType: !288, size: 32, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !277, file: !276, line: 35, baseType: !293, size: 64, offset: 384)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !276, line: 25, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !264, !51, !264, !51, !298, !51}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !277)
!300 = !{!117, !256}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !48, file: !47, line: 78, baseType: !302, size: 1024, offset: 27136)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 1024, elements: !116)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !48, file: !47, line: 79, baseType: !51, size: 32, offset: 28160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !48, file: !47, line: 80, baseType: !305, size: 64, offset: 28224)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !48, file: !47, line: 83, baseType: !307, size: 64, offset: 28288)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !56, line: 24, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !31, line: 37, baseType: !310)
!310 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !48, file: !47, line: 84, baseType: !264, size: 64, offset: 28352)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !48, file: !47, line: 85, baseType: !313, size: 128, offset: 28416)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 128, elements: !171)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 32, elements: !171)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !48, file: !47, line: 86, baseType: !314, size: 64, offset: 28544)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !48, file: !47, line: 87, baseType: !318, size: 2176, offset: 28608)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 2176, elements: !319)
!319 = !{!172, !320}
!320 = !DISubrange(count: 17)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !48, file: !47, line: 92, baseType: !322, size: 20736, offset: 30784)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 20736, elements: !323)
!323 = !{!324, !324}
!324 = !DISubrange(count: 18)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !48, file: !47, line: 96, baseType: !326, size: 2176, offset: 51520)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 2176, elements: !319)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !48, file: !47, line: 97, baseType: !329, size: 128, offset: 53696)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, size: 128, elements: !171)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !48, file: !47, line: 98, baseType: !170, size: 64, offset: 53824)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !48, file: !47, line: 99, baseType: !332, size: 1024, offset: 53888)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 1024, elements: !333)
!333 = !{!172, !117}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !48, file: !47, line: 100, baseType: !315, size: 32, offset: 54912)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !48, file: !47, line: 105, baseType: !336, size: 10368, offset: 54944)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 10368, elements: !323)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !48, file: !47, line: 106, baseType: !336, size: 10368, offset: 65312)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !48, file: !47, line: 107, baseType: !51, size: 32, offset: 75680)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !48, file: !47, line: 108, baseType: !340, size: 576, offset: 75712)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 576, elements: !341)
!341 = !{!324}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !48, file: !47, line: 109, baseType: !343, size: 20736, offset: 76288)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 20736, elements: !323)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !48, file: !47, line: 110, baseType: !327, size: 64, offset: 97024)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !48, file: !47, line: 111, baseType: !327, size: 64, offset: 97088)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !48, file: !47, line: 112, baseType: !347, size: 64, offset: 97152)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !48, file: !47, line: 113, baseType: !347, size: 64, offset: 97216)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !48, file: !47, line: 114, baseType: !347, size: 64, offset: 97280)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !48, file: !47, line: 115, baseType: !51, size: 32, offset: 97344)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !48, file: !47, line: 116, baseType: !27, size: 64, offset: 97408)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !48, file: !47, line: 117, baseType: !27, size: 64, offset: 97472)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !48, file: !47, line: 118, baseType: !27, size: 64, offset: 97536)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !48, file: !47, line: 119, baseType: !51, size: 32, offset: 97600)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !48, file: !47, line: 120, baseType: !356, size: 576, offset: 97632)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 576, elements: !341)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !48, file: !47, line: 121, baseType: !223, size: 32, offset: 98208)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !48, file: !47, line: 122, baseType: !359, size: 64, offset: 98240)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !29, line: 27, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !31, line: 45, baseType: !361)
!361 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !48, file: !47, line: 125, baseType: !363, size: 256, offset: 98304)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !15, line: 503, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 496, size: 256, elements: !365)
!365 = !{!366, !368, !369, !370}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !364, file: !15, line: 498, baseType: !367, size: 64)
!367 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !364, file: !15, line: 499, baseType: !367, size: 64, offset: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !364, file: !15, line: 500, baseType: !367, size: 64, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !364, file: !15, line: 502, baseType: !367, size: 64, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !48, file: !47, line: 128, baseType: !372, size: 2008, offset: 98560)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 2008, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 251)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !48, file: !47, line: 129, baseType: !376, size: 8032, offset: 100576)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 8032, elements: !373)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !48, file: !47, line: 130, baseType: !378, size: 16064, offset: 108608)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 16064, elements: !373)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !48, file: !47, line: 131, baseType: !51, size: 32, offset: 124672)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !48, file: !47, line: 132, baseType: !51, size: 32, offset: 124704)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !48, file: !47, line: 135, baseType: !51, size: 32, offset: 124736)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !48, file: !47, line: 136, baseType: !51, size: 32, offset: 124768)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !48, file: !47, line: 137, baseType: !51, size: 32, offset: 124800)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !48, file: !47, line: 138, baseType: !51, size: 32, offset: 124832)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !48, file: !47, line: 139, baseType: !51, size: 32, offset: 124864)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !48, file: !47, line: 142, baseType: !166, size: 32, offset: 124896)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !48, file: !47, line: 143, baseType: !51, size: 32, offset: 124928)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !48, file: !47, line: 144, baseType: !51, size: 32, offset: 124960)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !48, file: !47, line: 145, baseType: !51, size: 32, offset: 124992)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !15, line: 46, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !393, line: 381, size: 266752, elements: !394)
!393 = !DIFile(filename: "x264_src/common/common.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5afac7bf2f5673f1628c455d7d320ad7")
!394 = !{!395, !396, !400, !401, !402, !403, !404, !405, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !539, !541, !569, !571, !572, !573, !577, !581, !582, !583, !587, !591, !592, !593, !597, !600, !601, !652, !669, !694, !695, !696, !697, !701, !702, !703, !704, !705, !706, !707, !722, !916, !920, !981, !984, !986, !988, !989, !992, !997, !1006, !1007, !1015, !1017, !1022, !1098, !1184, !1228, !1250, !1299, !1328}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !392, file: !393, line: 384, baseType: !66, size: 5632)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !392, file: !393, line: 386, baseType: !397, size: 8256, offset: 5632)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 8256, elements: !398)
!398 = !{!399}
!399 = !DISubrange(count: 129)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !392, file: !393, line: 387, baseType: !51, size: 32, offset: 13888)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !392, file: !393, line: 388, baseType: !51, size: 32, offset: 13920)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !392, file: !393, line: 389, baseType: !51, size: 32, offset: 13952)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !392, file: !393, line: 390, baseType: !51, size: 32, offset: 13984)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !392, file: !393, line: 391, baseType: !51, size: 32, offset: 14016)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !392, file: !393, line: 402, baseType: !406, size: 576, offset: 14080)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !393, line: 394, size: 576, elements: !407)
!407 = !{!408, !409, !410, !419, !420, !421}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !406, file: !393, line: 396, baseType: !51, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !406, file: !393, line: 397, baseType: !51, size: 32, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !406, file: !393, line: 398, baseType: !411, size: 64, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !15, line: 604, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !15, line: 593, size: 192, elements: !414)
!414 = !{!415, !416, !417, !418}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !413, file: !15, line: 595, baseType: !51, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !413, file: !15, line: 596, baseType: !51, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !413, file: !15, line: 599, baseType: !51, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !413, file: !15, line: 603, baseType: !264, size: 64, offset: 128)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !406, file: !393, line: 399, baseType: !51, size: 32, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !406, file: !393, line: 400, baseType: !264, size: 64, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !406, file: !393, line: 401, baseType: !422, size: 320, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !423, line: 56, baseType: !424)
!423 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !423, line: 47, size: 320, elements: !425)
!425 = !{!426, !427, !428, !429, !432, !433}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !424, file: !423, line: 49, baseType: !264, size: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !424, file: !423, line: 50, baseType: !264, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !424, file: !423, line: 51, baseType: !264, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !424, file: !423, line: 53, baseType: !430, size: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !431, line: 87, baseType: !58)
!431 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!432 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !424, file: !423, line: 54, baseType: !51, size: 32, offset: 256)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !424, file: !423, line: 55, baseType: !51, size: 32, offset: 288)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !392, file: !393, line: 404, baseType: !264, size: 64, offset: 14656)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !392, file: !393, line: 405, baseType: !51, size: 32, offset: 14720)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !392, file: !393, line: 410, baseType: !51, size: 32, offset: 14752)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !392, file: !393, line: 411, baseType: !51, size: 32, offset: 14784)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !392, file: !393, line: 413, baseType: !51, size: 32, offset: 14816)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !392, file: !393, line: 415, baseType: !51, size: 32, offset: 14848)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !392, file: !393, line: 416, baseType: !51, size: 32, offset: 14880)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !392, file: !393, line: 418, baseType: !51, size: 32, offset: 14912)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !392, file: !393, line: 419, baseType: !51, size: 32, offset: 14944)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !392, file: !393, line: 420, baseType: !51, size: 32, offset: 14976)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !392, file: !393, line: 421, baseType: !51, size: 32, offset: 15008)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !392, file: !393, line: 422, baseType: !51, size: 32, offset: 15040)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !392, file: !393, line: 424, baseType: !51, size: 32, offset: 15072)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !392, file: !393, line: 425, baseType: !51, size: 32, offset: 15104)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !392, file: !393, line: 427, baseType: !51, size: 32, offset: 15136)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !392, file: !393, line: 430, baseType: !450, size: 10400, offset: 15168)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 10400, elements: !537)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !452, line: 154, baseType: !453)
!452 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !452, line: 52, size: 10400, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !472, !473, !474, !475, !476, !477, !478, !479, !480, !487, !488, !536}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !453, file: !452, line: 54, baseType: !51, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !453, file: !452, line: 56, baseType: !51, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !453, file: !452, line: 57, baseType: !51, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !453, file: !452, line: 59, baseType: !51, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !453, file: !452, line: 60, baseType: !51, size: 32, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !453, file: !452, line: 61, baseType: !51, size: 32, offset: 160)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !453, file: !452, line: 63, baseType: !51, size: 32, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !453, file: !452, line: 65, baseType: !51, size: 32, offset: 224)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !453, file: !452, line: 67, baseType: !51, size: 32, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !453, file: !452, line: 69, baseType: !51, size: 32, offset: 288)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !453, file: !452, line: 70, baseType: !51, size: 32, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !453, file: !452, line: 71, baseType: !51, size: 32, offset: 352)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !453, file: !452, line: 72, baseType: !51, size: 32, offset: 384)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !453, file: !452, line: 73, baseType: !469, size: 8192, offset: 416)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 8192, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !453, file: !452, line: 75, baseType: !51, size: 32, offset: 8608)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !453, file: !452, line: 76, baseType: !51, size: 32, offset: 8640)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !453, file: !452, line: 77, baseType: !51, size: 32, offset: 8672)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !453, file: !452, line: 78, baseType: !51, size: 32, offset: 8704)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !453, file: !452, line: 79, baseType: !51, size: 32, offset: 8736)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !453, file: !452, line: 80, baseType: !51, size: 32, offset: 8768)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !453, file: !452, line: 81, baseType: !51, size: 32, offset: 8800)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !453, file: !452, line: 83, baseType: !51, size: 32, offset: 8832)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !453, file: !452, line: 90, baseType: !481, size: 128, offset: 8864)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !453, file: !452, line: 84, size: 128, elements: !482)
!482 = !{!483, !484, !485, !486}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !481, file: !452, line: 86, baseType: !51, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !481, file: !452, line: 87, baseType: !51, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !481, file: !452, line: 88, baseType: !51, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !481, file: !452, line: 89, baseType: !51, size: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !453, file: !452, line: 92, baseType: !51, size: 32, offset: 8992)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !453, file: !452, line: 150, baseType: !489, size: 1344, offset: 9024)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !453, file: !452, line: 93, size: 1344, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !527, !528, !529, !530, !531, !532, !533, !534, !535}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !489, file: !452, line: 95, baseType: !51, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !489, file: !452, line: 96, baseType: !51, size: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !489, file: !452, line: 97, baseType: !51, size: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !489, file: !452, line: 99, baseType: !51, size: 32, offset: 96)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !489, file: !452, line: 100, baseType: !51, size: 32, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !489, file: !452, line: 102, baseType: !51, size: 32, offset: 160)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !489, file: !452, line: 103, baseType: !51, size: 32, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !489, file: !452, line: 104, baseType: !51, size: 32, offset: 224)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !489, file: !452, line: 105, baseType: !51, size: 32, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !489, file: !452, line: 106, baseType: !51, size: 32, offset: 288)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !489, file: !452, line: 107, baseType: !51, size: 32, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !489, file: !452, line: 108, baseType: !51, size: 32, offset: 352)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !489, file: !452, line: 110, baseType: !51, size: 32, offset: 384)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !489, file: !452, line: 111, baseType: !51, size: 32, offset: 416)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !489, file: !452, line: 112, baseType: !51, size: 32, offset: 448)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !489, file: !452, line: 114, baseType: !51, size: 32, offset: 480)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !489, file: !452, line: 115, baseType: !223, size: 32, offset: 512)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !489, file: !452, line: 116, baseType: !223, size: 32, offset: 544)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !489, file: !452, line: 117, baseType: !51, size: 32, offset: 576)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !489, file: !452, line: 119, baseType: !51, size: 32, offset: 608)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !489, file: !452, line: 120, baseType: !51, size: 32, offset: 640)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !489, file: !452, line: 137, baseType: !513, size: 384, offset: 672)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !489, file: !452, line: 122, size: 384, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !513, file: !452, line: 124, baseType: !51, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !513, file: !452, line: 125, baseType: !51, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !513, file: !452, line: 126, baseType: !51, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !513, file: !452, line: 127, baseType: !51, size: 32, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !513, file: !452, line: 128, baseType: !51, size: 32, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !513, file: !452, line: 129, baseType: !51, size: 32, offset: 160)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !513, file: !452, line: 130, baseType: !51, size: 32, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !513, file: !452, line: 131, baseType: !51, size: 32, offset: 224)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !513, file: !452, line: 133, baseType: !51, size: 32, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !513, file: !452, line: 134, baseType: !51, size: 32, offset: 288)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !513, file: !452, line: 135, baseType: !51, size: 32, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !513, file: !452, line: 136, baseType: !51, size: 32, offset: 352)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !489, file: !452, line: 139, baseType: !51, size: 32, offset: 1056)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !489, file: !452, line: 140, baseType: !51, size: 32, offset: 1088)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !489, file: !452, line: 141, baseType: !51, size: 32, offset: 1120)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !489, file: !452, line: 142, baseType: !51, size: 32, offset: 1152)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !489, file: !452, line: 143, baseType: !51, size: 32, offset: 1184)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !489, file: !452, line: 144, baseType: !51, size: 32, offset: 1216)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !489, file: !452, line: 145, baseType: !51, size: 32, offset: 1248)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !489, file: !452, line: 146, baseType: !51, size: 32, offset: 1280)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !489, file: !452, line: 147, baseType: !51, size: 32, offset: 1312)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !453, file: !452, line: 152, baseType: !51, size: 32, offset: 10368)
!537 = !{!538}
!538 = !DISubrange(count: 1)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !392, file: !393, line: 431, baseType: !540, size: 64, offset: 25600)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !392, file: !393, line: 432, baseType: !542, size: 960, offset: 25664)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 960, elements: !537)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !452, line: 186, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !452, line: 156, size: 960, elements: !545)
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !544, file: !452, line: 158, baseType: !51, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !544, file: !452, line: 159, baseType: !51, size: 32, offset: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !544, file: !452, line: 161, baseType: !51, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !544, file: !452, line: 163, baseType: !51, size: 32, offset: 96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !544, file: !452, line: 164, baseType: !51, size: 32, offset: 128)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !544, file: !452, line: 166, baseType: !51, size: 32, offset: 160)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !544, file: !452, line: 167, baseType: !51, size: 32, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !544, file: !452, line: 169, baseType: !51, size: 32, offset: 224)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !544, file: !452, line: 170, baseType: !51, size: 32, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !544, file: !452, line: 172, baseType: !51, size: 32, offset: 288)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !544, file: !452, line: 173, baseType: !51, size: 32, offset: 320)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !544, file: !452, line: 175, baseType: !51, size: 32, offset: 352)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !544, file: !452, line: 177, baseType: !51, size: 32, offset: 384)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !544, file: !452, line: 178, baseType: !51, size: 32, offset: 416)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !544, file: !452, line: 179, baseType: !51, size: 32, offset: 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !544, file: !452, line: 181, baseType: !51, size: 32, offset: 480)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !544, file: !452, line: 183, baseType: !51, size: 32, offset: 512)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !544, file: !452, line: 184, baseType: !564, size: 384, offset: 576)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 384, elements: !567)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!567 = !{!568}
!568 = !DISubrange(count: 6)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !392, file: !393, line: 433, baseType: !570, size: 64, offset: 26624)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !392, file: !393, line: 434, baseType: !51, size: 32, offset: 26688)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !392, file: !393, line: 437, baseType: !51, size: 32, offset: 26720)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !392, file: !393, line: 440, baseType: !574, size: 256, offset: 26752)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 256, elements: !267)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 512, elements: !116)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !392, file: !393, line: 441, baseType: !578, size: 128, offset: 27008)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 128, elements: !171)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 2048, elements: !123)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !392, file: !393, line: 443, baseType: !574, size: 256, offset: 27136)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !392, file: !393, line: 444, baseType: !578, size: 128, offset: 27392)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !392, file: !393, line: 446, baseType: !584, size: 256, offset: 27520)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 256, elements: !267)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 256, elements: !116)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !392, file: !393, line: 447, baseType: !588, size: 128, offset: 27776)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 128, elements: !171)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 1024, elements: !123)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !392, file: !393, line: 448, baseType: !584, size: 256, offset: 27904)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !392, file: !393, line: 449, baseType: !588, size: 128, offset: 28160)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !392, file: !393, line: 454, baseType: !594, size: 5888, offset: 28288)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 5888, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 92)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !392, file: !393, line: 455, baseType: !598, size: 23552, offset: 34176)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 23552, elements: !599)
!599 = !{!596, !268}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !392, file: !393, line: 457, baseType: !565, size: 64, offset: 57728)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !392, file: !393, line: 460, baseType: !602, size: 53376, offset: 57856)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !393, line: 364, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !393, line: 302, size: 53376, elements: !604)
!604 = !{!605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !632, !636, !637, !638, !644, !645, !646, !647, !648, !649, !650, !651}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !603, file: !393, line: 304, baseType: !540, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !603, file: !393, line: 305, baseType: !570, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !603, file: !393, line: 307, baseType: !51, size: 32, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !603, file: !393, line: 308, baseType: !51, size: 32, offset: 160)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !603, file: !393, line: 309, baseType: !51, size: 32, offset: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !603, file: !393, line: 311, baseType: !51, size: 32, offset: 224)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !603, file: !393, line: 313, baseType: !51, size: 32, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !603, file: !393, line: 315, baseType: !51, size: 32, offset: 288)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !603, file: !393, line: 316, baseType: !51, size: 32, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !603, file: !393, line: 317, baseType: !51, size: 32, offset: 352)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !603, file: !393, line: 319, baseType: !51, size: 32, offset: 384)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !603, file: !393, line: 321, baseType: !51, size: 32, offset: 416)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !603, file: !393, line: 322, baseType: !51, size: 32, offset: 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !603, file: !393, line: 324, baseType: !170, size: 64, offset: 480)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !603, file: !393, line: 325, baseType: !51, size: 32, offset: 544)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !603, file: !393, line: 327, baseType: !51, size: 32, offset: 576)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !603, file: !393, line: 329, baseType: !51, size: 32, offset: 608)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !603, file: !393, line: 330, baseType: !51, size: 32, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !603, file: !393, line: 331, baseType: !51, size: 32, offset: 672)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !603, file: !393, line: 333, baseType: !51, size: 32, offset: 704)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !603, file: !393, line: 334, baseType: !51, size: 32, offset: 736)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !603, file: !393, line: 339, baseType: !627, size: 2048, offset: 768)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 2048, elements: !333)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !603, file: !393, line: 335, size: 64, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !628, file: !393, line: 337, baseType: !51, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !628, file: !393, line: 338, baseType: !51, size: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !603, file: !393, line: 342, baseType: !633, size: 49152, align: 128, offset: 2816)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !275, size: 49152, align: 128, elements: !634)
!634 = !{!635, !256}
!635 = !DISubrange(count: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !603, file: !393, line: 344, baseType: !51, size: 32, offset: 51968)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !603, file: !393, line: 345, baseType: !51, size: 32, offset: 52000)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !603, file: !393, line: 350, baseType: !639, size: 1024, offset: 52032)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 1024, elements: !116)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !603, file: !393, line: 346, size: 64, elements: !641)
!641 = !{!642, !643}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !640, file: !393, line: 348, baseType: !51, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !640, file: !393, line: 349, baseType: !51, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !603, file: !393, line: 352, baseType: !51, size: 32, offset: 53056)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !603, file: !393, line: 354, baseType: !51, size: 32, offset: 53088)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !603, file: !393, line: 355, baseType: !51, size: 32, offset: 53120)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !603, file: !393, line: 356, baseType: !51, size: 32, offset: 53152)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !603, file: !393, line: 357, baseType: !51, size: 32, offset: 53184)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !603, file: !393, line: 360, baseType: !51, size: 32, offset: 53216)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !603, file: !393, line: 361, baseType: !51, size: 32, offset: 53248)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !603, file: !393, line: 362, baseType: !51, size: 32, offset: 53280)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !392, file: !393, line: 463, baseType: !653, size: 4096, offset: 111232)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !654, line: 46, baseType: !655)
!654 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !654, line: 27, size: 4096, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662, !663, !664, !665}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !655, file: !654, line: 30, baseType: !51, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !655, file: !654, line: 31, baseType: !51, size: 32, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !655, file: !654, line: 34, baseType: !51, size: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !655, file: !654, line: 35, baseType: !51, size: 32, offset: 96)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !655, file: !654, line: 37, baseType: !264, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !655, file: !654, line: 38, baseType: !264, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !655, file: !654, line: 39, baseType: !264, size: 64, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !655, file: !654, line: 42, baseType: !51, size: 32, align: 128, offset: 384)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !655, file: !654, line: 45, baseType: !666, size: 3680, offset: 416)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 3680, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 460)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !392, file: !393, line: 494, baseType: !670, size: 2112, offset: 115328)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !393, line: 465, size: 2112, elements: !671)
!671 = !{!672, !674, !676, !677, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !690, !691, !692, !693}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !670, file: !393, line: 468, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !670, file: !393, line: 470, baseType: !675, size: 128, offset: 64)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 128, elements: !171)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !670, file: !393, line: 473, baseType: !673, size: 64, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !670, file: !393, line: 476, baseType: !678, size: 1152, offset: 256)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 1152, elements: !341)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !670, file: !393, line: 478, baseType: !51, size: 32, offset: 1408)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !670, file: !393, line: 480, baseType: !51, size: 32, offset: 1440)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !670, file: !393, line: 482, baseType: !51, size: 32, offset: 1472)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !670, file: !393, line: 483, baseType: !51, size: 32, offset: 1504)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !670, file: !393, line: 484, baseType: !51, size: 32, offset: 1536)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !670, file: !393, line: 485, baseType: !51, size: 32, offset: 1568)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !670, file: !393, line: 486, baseType: !51, size: 32, offset: 1600)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !670, file: !393, line: 487, baseType: !55, size: 64, offset: 1664)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !670, file: !393, line: 488, baseType: !55, size: 64, offset: 1728)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !670, file: !393, line: 489, baseType: !689, size: 128, offset: 1792)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 128, elements: !171)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !670, file: !393, line: 490, baseType: !55, size: 64, offset: 1920)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !670, file: !393, line: 491, baseType: !55, size: 64, offset: 1984)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !670, file: !393, line: 492, baseType: !51, size: 32, offset: 2048)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !670, file: !393, line: 493, baseType: !51, size: 32, offset: 2080)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !392, file: !393, line: 497, baseType: !45, size: 64, offset: 117440)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !392, file: !393, line: 500, baseType: !45, size: 64, offset: 117504)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !392, file: !393, line: 503, baseType: !51, size: 32, offset: 117568)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !392, file: !393, line: 504, baseType: !698, size: 1216, offset: 117632)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 1216, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 19)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !392, file: !393, line: 505, baseType: !51, size: 32, offset: 118848)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !392, file: !393, line: 506, baseType: !698, size: 1216, offset: 118912)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !392, file: !393, line: 507, baseType: !170, size: 64, offset: 120128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !392, file: !393, line: 510, baseType: !51, size: 32, offset: 120192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !392, file: !393, line: 511, baseType: !51, size: 32, offset: 120224)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !392, file: !393, line: 512, baseType: !55, size: 64, offset: 120256)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !392, file: !393, line: 522, baseType: !708, size: 10624, offset: 120320)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !393, line: 515, size: 10624, elements: !709)
!709 = !{!710, !712, !715, !718}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !708, file: !393, line: 517, baseType: !711, size: 256, align: 128)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 256, elements: !116)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !708, file: !393, line: 518, baseType: !713, size: 128, align: 128, offset: 256)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 128, elements: !714)
!714 = !{!172, !268}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !708, file: !393, line: 520, baseType: !716, size: 4096, align: 128, offset: 384)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 4096, elements: !717)
!717 = !{!268, !124}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !708, file: !393, line: 521, baseType: !719, size: 6144, align: 128, offset: 4480)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 6144, elements: !720)
!720 = !{!721, !117}
!721 = !DISubrange(count: 24)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !392, file: !393, line: 732, baseType: !723, size: 82688, offset: 130944)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !392, file: !393, line: 525, size: 82688, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !752, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !770, !773, !777, !778, !779, !784, !785, !788, !789, !790, !791, !792, !793, !794, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !854, !885, !886, !887, !888, !889, !890, !891, !892, !893, !896, !897, !898, !901, !904, !906, !909, !911, !912}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !723, file: !393, line: 527, baseType: !51, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !723, file: !393, line: 530, baseType: !51, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !723, file: !393, line: 531, baseType: !51, size: 32, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !723, file: !393, line: 532, baseType: !51, size: 32, offset: 96)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !723, file: !393, line: 535, baseType: !51, size: 32, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !723, file: !393, line: 536, baseType: !51, size: 32, offset: 160)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !723, file: !393, line: 537, baseType: !51, size: 32, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !723, file: !393, line: 538, baseType: !51, size: 32, offset: 224)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !723, file: !393, line: 539, baseType: !51, size: 32, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !723, file: !393, line: 542, baseType: !51, size: 32, offset: 288)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !723, file: !393, line: 543, baseType: !51, size: 32, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !723, file: !393, line: 544, baseType: !51, size: 32, offset: 352)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !723, file: !393, line: 545, baseType: !51, size: 32, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !723, file: !393, line: 546, baseType: !51, size: 32, offset: 416)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !723, file: !393, line: 547, baseType: !51, size: 32, offset: 448)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !723, file: !393, line: 548, baseType: !51, size: 32, offset: 480)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !723, file: !393, line: 549, baseType: !51, size: 32, offset: 512)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !723, file: !393, line: 551, baseType: !51, size: 32, offset: 544)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !723, file: !393, line: 554, baseType: !170, size: 64, offset: 576)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !723, file: !393, line: 555, baseType: !170, size: 64, offset: 640)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !723, file: !393, line: 558, baseType: !170, size: 64, offset: 704)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !723, file: !393, line: 559, baseType: !170, size: 64, offset: 768)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !723, file: !393, line: 561, baseType: !170, size: 64, offset: 832)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !723, file: !393, line: 562, baseType: !170, size: 64, offset: 896)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !723, file: !393, line: 565, baseType: !16, size: 32, offset: 960)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !723, file: !393, line: 566, baseType: !751, size: 128, offset: 992)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 128, elements: !267)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !723, file: !393, line: 567, baseType: !753, size: 512, offset: 1120)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, elements: !116)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !723, file: !393, line: 568, baseType: !16, size: 32, offset: 1632)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !723, file: !393, line: 569, baseType: !16, size: 32, offset: 1664)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !723, file: !393, line: 570, baseType: !51, size: 32, offset: 1696)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !723, file: !393, line: 571, baseType: !51, size: 32, offset: 1728)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !723, file: !393, line: 572, baseType: !51, size: 32, offset: 1760)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !723, file: !393, line: 573, baseType: !51, size: 32, offset: 1792)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !723, file: !393, line: 574, baseType: !51, size: 32, offset: 1824)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !723, file: !393, line: 575, baseType: !51, size: 32, offset: 1856)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !723, file: !393, line: 576, baseType: !51, size: 32, offset: 1888)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !723, file: !393, line: 577, baseType: !51, size: 32, offset: 1920)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !723, file: !393, line: 578, baseType: !51, size: 32, offset: 1952)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !723, file: !393, line: 585, baseType: !307, size: 64, offset: 1984)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !723, file: !393, line: 586, baseType: !264, size: 64, offset: 2048)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !723, file: !393, line: 587, baseType: !307, size: 64, offset: 2112)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !723, file: !393, line: 588, baseType: !769, size: 64, offset: 2176)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !723, file: !393, line: 589, baseType: !771, size: 64, offset: 2240)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 64, elements: !284)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !723, file: !393, line: 591, baseType: !774, size: 64, offset: 2304)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 192, elements: !776)
!776 = !{!721}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !723, file: !393, line: 592, baseType: !307, size: 64, offset: 2368)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !723, file: !393, line: 593, baseType: !313, size: 128, offset: 2432)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !723, file: !393, line: 594, baseType: !780, size: 128, offset: 2560)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !781, size: 128, elements: !171)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 128, elements: !783)
!783 = !{!285, !172}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !723, file: !393, line: 595, baseType: !329, size: 128, offset: 2688)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !723, file: !393, line: 596, baseType: !786, size: 4096, offset: 2816)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 4096, elements: !787)
!787 = !{!172, !635}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !723, file: !393, line: 597, baseType: !307, size: 64, offset: 6912)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !723, file: !393, line: 598, baseType: !307, size: 64, offset: 6976)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !723, file: !393, line: 599, baseType: !27, size: 64, offset: 7040)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !723, file: !393, line: 603, baseType: !302, size: 1024, offset: 7104)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !723, file: !393, line: 606, baseType: !51, size: 32, offset: 8128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !723, file: !393, line: 607, baseType: !51, size: 32, offset: 8160)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !723, file: !393, line: 608, baseType: !795, size: 32, align: 32, offset: 8192)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 32, elements: !267)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !723, file: !393, line: 609, baseType: !51, size: 32, offset: 8224)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !723, file: !393, line: 611, baseType: !51, size: 32, offset: 8256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !723, file: !393, line: 612, baseType: !51, size: 32, offset: 8288)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !723, file: !393, line: 614, baseType: !51, size: 32, offset: 8320)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !723, file: !393, line: 615, baseType: !51, size: 32, offset: 8352)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !723, file: !393, line: 621, baseType: !51, size: 32, offset: 8384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !723, file: !393, line: 624, baseType: !51, size: 32, offset: 8416)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !723, file: !393, line: 626, baseType: !51, size: 32, offset: 8448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !723, file: !393, line: 627, baseType: !51, size: 32, offset: 8480)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !723, file: !393, line: 671, baseType: !806, size: 60672, offset: 8576)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !723, file: !393, line: 629, size: 60672, elements: !807)
!807 = !{!808, !812, !816, !818, !819, !822, !826, !828, !829, !830, !831, !832, !835, !839, !842, !843, !844, !845, !846, !849, !851, !853}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !806, file: !393, line: 634, baseType: !809, size: 3072, align: 128)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 3072, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 384)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !806, file: !393, line: 635, baseType: !813, size: 6912, align: 128, offset: 3072)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 6912, elements: !814)
!814 = !{!815}
!815 = !DISubrange(count: 864)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !806, file: !393, line: 638, baseType: !817, size: 2048, align: 128, offset: 9984)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 2048, elements: !470)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !806, file: !393, line: 639, baseType: !817, size: 2048, align: 128, offset: 12032)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !806, file: !393, line: 640, baseType: !820, size: 3072, align: 128, offset: 14080)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 3072, elements: !821)
!821 = !{!256, !124}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !806, file: !393, line: 641, baseType: !823, size: 3840, align: 128, offset: 17152)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 3840, elements: !824)
!824 = !{!825, !117}
!825 = !DISubrange(count: 15)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !806, file: !393, line: 642, baseType: !827, size: 128, offset: 20992)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 128, elements: !267)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !806, file: !393, line: 643, baseType: !827, size: 128, offset: 21120)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !806, file: !393, line: 644, baseType: !51, size: 32, offset: 21248)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !806, file: !393, line: 645, baseType: !51, size: 32, offset: 21280)
