; ModuleID = 'x264_src/common/macroblock.c'
source_filename = "x264_src/common/macroblock.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_weight_t = type { [8 x i16], [8 x i16], i32, i32, i32, ptr, [8 x i8] }

@x264_mb_type_fix = internal unnamed_addr constant [19 x i8] c"\00\00\02\03\04\05\06\07\08\09\0A\0B\0C\0D\0E\0F\10\11\12", align 16, !dbg !0
@x264_mb_pred_mode8x8c_fix = internal unnamed_addr constant [7 x i8] c"\00\01\02\03\00\00\00", align 1, !dbg !182
@x264_size2pixel = internal unnamed_addr constant [5 x [5 x i8]] [[5 x i8] zeroinitializer, [5 x i8] c"\00\06\04\00\00", [5 x i8] c"\00\05\03\00\01", [5 x i8] zeroinitializer, [5 x i8] c"\00\00\02\00\00"], align 16, !dbg !176
@weight_none = external constant [3 x %struct.x264_weight_t], align 16

; Function Attrs: nounwind uwtable
define dso_local void @x264_mb_mc_8x8(ptr noundef %h, i32 noundef %i8) local_unnamed_addr #0 !dbg !198 {
entry:
    #dbg_value(ptr %h, !1482, !DIExpression(), !1489)
    #dbg_value(i32 %i8, !1483, !DIExpression(), !1489)
  %and = shl i32 %i8, 1, !dbg !1490
  %mul = and i32 %and, 2, !dbg !1490
    #dbg_value(i32 %mul, !1484, !DIExpression(), !1489)
  %mul1 = and i32 %i8, -2, !dbg !1491
    #dbg_value(i32 %i8, !1485, !DIExpression(DW_OP_constu, 18446744073709551614, DW_OP_and, DW_OP_stack_value), !1489)
  %i_type = getelementptr inbounds i8, ptr %h, i64 7248, !dbg !1492

!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !109, line: 27, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !111, line: 45, baseType: !145)
!145 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !135, file: !6, line: 92, baseType: !142, size: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !135, file: !6, line: 92, baseType: !148, size: 128)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 128, elements: !124)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !135, file: !6, line: 92, baseType: !150, size: 128)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 128, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 8)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !135, file: !6, line: 92, baseType: !154, size: 128)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 128, elements: !155)
!155 = !{!156}
!156 = !DISubrange(count: 16)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union64_t", file: !6, line: 90, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !6, line: 90, size: 64, elements: !160)
!160 = !{!161, !162, !164, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !159, file: !6, line: 90, baseType: !143, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !159, file: !6, line: 90, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 64, elements: !117)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !159, file: !6, line: 90, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 64, elements: !124)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !159, file: !6, line: 90, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !151)
!168 = !{!169, !176, !0, !182}
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "x264_scan8", scope: !2, file: !6, line: 125, type: !171, isLocal: true, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 864, elements: !174)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!174 = !{!175}
!175 = !DISubrange(count: 27)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "x264_size2pixel", scope: !2, file: !90, line: 55, type: !178, isLocal: true, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 200, elements: !180)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!180 = !{!181, !181}
!181 = !DISubrange(count: 5)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "x264_mb_pred_mode8x8c_fix", scope: !2, file: !66, line: 42, type: !184, isLocal: true, isDefinition: true)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 56, elements: !185)
!185 = !{!186}
!186 = !DISubrange(count: 7)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 152, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 19)
!190 = !{i32 7, !"Dwarf Version", i32 5}
!191 = !{i32 2, !"Debug Info Version", i32 3}
!192 = !{i32 1, !"wchar_size", i32 4}
!193 = !{i32 8, !"PIC Level", i32 2}
!194 = !{i32 7, !"PIE Level", i32 2}
!195 = !{i32 7, !"uwtable", i32 2}
!196 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!197 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!198 = distinct !DISubprogram(name: "x264_mb_mc_8x8", scope: !3, file: !3, line: 125, type: !199, scopeLine: 126, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1481)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !201, !173}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !203, line: 46, baseType: !204)
!203 = !DIFile(filename: "x264_src/x264.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !6, line: 381, size: 266752, elements: !205)
!205 = !{!206, !371, !375, !376, !377, !378, !379, !380, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !516, !518, !545, !547, !548, !549, !553, !557, !558, !559, !563, !567, !568, !569, !574, !577, !578, !655, !672, !833, !834, !835, !836, !838, !839, !840, !841, !842, !843, !844, !859, !1051, !1055, !1115, !1118, !1120, !1121, !1122, !1125, !1130, !1136, !1137, !1145, !1147, !1152, !1227, !1313, !1357, !1379, !1428, !1457}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !204, file: !6, line: 384, baseType: !207, size: 5632)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !203, line: 376, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !203, line: 176, size: 5632, elements: !209)
!209 = !{!210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !253, !254, !255, !256, !257, !261, !262, !276, !277, !278, !279, !280, !309, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !208, file: !203, line: 179, baseType: !7, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !208, file: !203, line: 180, baseType: !173, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !208, file: !203, line: 181, baseType: !173, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !208, file: !203, line: 182, baseType: !173, size: 32, offset: 96)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !208, file: !203, line: 183, baseType: !173, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !208, file: !203, line: 186, baseType: !173, size: 32, offset: 160)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !208, file: !203, line: 187, baseType: !173, size: 32, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !208, file: !203, line: 188, baseType: !173, size: 32, offset: 224)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !208, file: !203, line: 189, baseType: !173, size: 32, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !208, file: !203, line: 190, baseType: !173, size: 32, offset: 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !208, file: !203, line: 198, baseType: !173, size: 32, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !208, file: !203, line: 215, baseType: !222, size: 288, offset: 352)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 200, size: 288, elements: !223)
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !222, file: !203, line: 203, baseType: !173, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !222, file: !203, line: 204, baseType: !173, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !222, file: !203, line: 206, baseType: !173, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !222, file: !203, line: 209, baseType: !173, size: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !222, file: !203, line: 210, baseType: !173, size: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !222, file: !203, line: 211, baseType: !173, size: 32, offset: 160)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !222, file: !203, line: 212, baseType: !173, size: 32, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !222, file: !203, line: 213, baseType: !173, size: 32, offset: 224)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !222, file: !203, line: 214, baseType: !173, size: 32, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !208, file: !203, line: 218, baseType: !173, size: 32, offset: 640)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !208, file: !203, line: 219, baseType: !173, size: 32, offset: 672)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !208, file: !203, line: 220, baseType: !173, size: 32, offset: 704)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !208, file: !203, line: 221, baseType: !173, size: 32, offset: 736)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !208, file: !203, line: 222, baseType: !173, size: 32, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !208, file: !203, line: 224, baseType: !173, size: 32, offset: 800)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !208, file: !203, line: 225, baseType: !173, size: 32, offset: 832)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !208, file: !203, line: 226, baseType: !173, size: 32, offset: 864)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !208, file: !203, line: 227, baseType: !173, size: 32, offset: 896)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !208, file: !203, line: 229, baseType: !173, size: 32, offset: 928)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !208, file: !203, line: 230, baseType: !173, size: 32, offset: 960)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !208, file: !203, line: 231, baseType: !173, size: 32, offset: 992)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !208, file: !203, line: 233, baseType: !173, size: 32, offset: 1024)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !208, file: !203, line: 234, baseType: !173, size: 32, offset: 1056)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !208, file: !203, line: 236, baseType: !173, size: 32, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !208, file: !203, line: 237, baseType: !173, size: 32, offset: 1120)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !208, file: !203, line: 239, baseType: !173, size: 32, offset: 1152)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !208, file: !203, line: 240, baseType: !251, size: 64, offset: 1216)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !208, file: !203, line: 241, baseType: !154, size: 128, offset: 1280)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !208, file: !203, line: 242, baseType: !154, size: 128, offset: 1408)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !208, file: !203, line: 243, baseType: !154, size: 128, offset: 1536)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !208, file: !203, line: 244, baseType: !154, size: 128, offset: 1664)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !208, file: !203, line: 245, baseType: !258, size: 512, offset: 1792)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 512, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !208, file: !203, line: 246, baseType: !258, size: 512, offset: 2304)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !208, file: !203, line: 249, baseType: !263, size: 64, offset: 2816)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DISubroutineType(types: !265)
!265 = !{null, !266, !173, !267, !269}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !252)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !271)
!271 = !{!272, !273, !274, !275}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !270, file: !3, baseType: !7, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !270, file: !3, baseType: !7, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !270, file: !3, baseType: !266, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !270, file: !3, baseType: !266, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !208, file: !203, line: 250, baseType: !266, size: 64, offset: 2880)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !208, file: !203, line: 251, baseType: !173, size: 32, offset: 2944)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !208, file: !203, line: 252, baseType: !173, size: 32, offset: 2976)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !208, file: !203, line: 253, baseType: !251, size: 64, offset: 3008)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !208, file: !203, line: 287, baseType: !281, size: 800, offset: 3072)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 256, size: 800, elements: !282)
!282 = !{!283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !303, !304, !305, !307, !308}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !281, file: !203, line: 258, baseType: !7, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !281, file: !203, line: 259, baseType: !7, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !281, file: !203, line: 261, baseType: !173, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !281, file: !203, line: 262, baseType: !173, size: 32, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !281, file: !203, line: 263, baseType: !173, size: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !281, file: !203, line: 264, baseType: !173, size: 32, offset: 160)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !281, file: !203, line: 265, baseType: !173, size: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !281, file: !203, line: 267, baseType: !173, size: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !281, file: !203, line: 268, baseType: !173, size: 32, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !281, file: !203, line: 269, baseType: !173, size: 32, offset: 288)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !281, file: !203, line: 270, baseType: !173, size: 32, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !281, file: !203, line: 271, baseType: !173, size: 32, offset: 352)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !281, file: !203, line: 272, baseType: !173, size: 32, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !281, file: !203, line: 273, baseType: !173, size: 32, offset: 416)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !281, file: !203, line: 274, baseType: !173, size: 32, offset: 448)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !281, file: !203, line: 275, baseType: !173, size: 32, offset: 480)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !281, file: !203, line: 276, baseType: !173, size: 32, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !281, file: !203, line: 277, baseType: !173, size: 32, offset: 544)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !281, file: !203, line: 278, baseType: !302, size: 32, offset: 576)
!302 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !281, file: !203, line: 279, baseType: !302, size: 32, offset: 608)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !281, file: !203, line: 280, baseType: !173, size: 32, offset: 640)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !281, file: !203, line: 283, baseType: !306, size: 64, offset: 672)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 64, elements: !117)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !281, file: !203, line: 285, baseType: !173, size: 32, offset: 736)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !281, file: !203, line: 286, baseType: !173, size: 32, offset: 768)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !208, file: !203, line: 327, baseType: !310, size: 1152, offset: 3904)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !208, file: !203, line: 290, size: 1152, elements: !311)
!311 = !{!312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !349, !350}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !310, file: !203, line: 292, baseType: !173, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !310, file: !203, line: 294, baseType: !173, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !310, file: !203, line: 295, baseType: !173, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !310, file: !203, line: 296, baseType: !173, size: 32, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !310, file: !203, line: 297, baseType: !173, size: 32, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !310, file: !203, line: 299, baseType: !173, size: 32, offset: 160)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !310, file: !203, line: 300, baseType: !302, size: 32, offset: 192)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !310, file: !203, line: 301, baseType: !302, size: 32, offset: 224)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !310, file: !203, line: 302, baseType: !302, size: 32, offset: 256)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !310, file: !203, line: 303, baseType: !173, size: 32, offset: 288)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !310, file: !203, line: 304, baseType: !173, size: 32, offset: 320)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !310, file: !203, line: 305, baseType: !302, size: 32, offset: 352)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !310, file: !203, line: 306, baseType: !302, size: 32, offset: 384)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !310, file: !203, line: 307, baseType: !302, size: 32, offset: 416)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !310, file: !203, line: 309, baseType: !173, size: 32, offset: 448)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !310, file: !203, line: 310, baseType: !302, size: 32, offset: 480)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !310, file: !203, line: 311, baseType: !173, size: 32, offset: 512)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !310, file: !203, line: 312, baseType: !173, size: 32, offset: 544)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !310, file: !203, line: 315, baseType: !173, size: 32, offset: 576)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !310, file: !203, line: 316, baseType: !251, size: 64, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !310, file: !203, line: 317, baseType: !173, size: 32, offset: 704)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !310, file: !203, line: 318, baseType: !251, size: 64, offset: 768)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !310, file: !203, line: 321, baseType: !302, size: 32, offset: 832)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !310, file: !203, line: 322, baseType: !302, size: 32, offset: 864)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !310, file: !203, line: 323, baseType: !302, size: 32, offset: 896)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !310, file: !203, line: 324, baseType: !338, size: 64, offset: 960)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !203, line: 174, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 167, size: 256, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !340, file: !203, line: 169, baseType: !173, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !340, file: !203, line: 169, baseType: !173, size: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !340, file: !203, line: 170, baseType: !173, size: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !340, file: !203, line: 171, baseType: !173, size: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !340, file: !203, line: 172, baseType: !302, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !340, file: !203, line: 173, baseType: !348, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !310, file: !203, line: 325, baseType: !173, size: 32, offset: 1024)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !310, file: !203, line: 326, baseType: !251, size: 64, offset: 1088)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !208, file: !203, line: 330, baseType: !173, size: 32, offset: 5056)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !208, file: !203, line: 331, baseType: !173, size: 32, offset: 5088)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !208, file: !203, line: 332, baseType: !173, size: 32, offset: 5120)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !208, file: !203, line: 334, baseType: !173, size: 32, offset: 5152)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !208, file: !203, line: 335, baseType: !173, size: 32, offset: 5184)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !208, file: !203, line: 336, baseType: !108, size: 32, offset: 5216)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !208, file: !203, line: 337, baseType: !108, size: 32, offset: 5248)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !208, file: !203, line: 338, baseType: !108, size: 32, offset: 5280)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !208, file: !203, line: 339, baseType: !108, size: 32, offset: 5312)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !208, file: !203, line: 340, baseType: !173, size: 32, offset: 5344)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !208, file: !203, line: 344, baseType: !173, size: 32, offset: 5376)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !208, file: !203, line: 356, baseType: !173, size: 32, offset: 5408)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !208, file: !203, line: 364, baseType: !173, size: 32, offset: 5440)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !208, file: !203, line: 367, baseType: !173, size: 32, offset: 5472)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !208, file: !203, line: 368, baseType: !173, size: 32, offset: 5504)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !208, file: !203, line: 369, baseType: !173, size: 32, offset: 5536)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !208, file: !203, line: 375, baseType: !368, size: 64, offset: 5568)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !266}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !204, file: !6, line: 386, baseType: !372, size: 8256, offset: 5632)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 8256, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 129)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !204, file: !6, line: 387, baseType: !173, size: 32, offset: 13888)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !204, file: !6, line: 388, baseType: !173, size: 32, offset: 13920)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !204, file: !6, line: 389, baseType: !173, size: 32, offset: 13952)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !204, file: !6, line: 390, baseType: !173, size: 32, offset: 13984)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !204, file: !6, line: 391, baseType: !173, size: 32, offset: 14016)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !204, file: !6, line: 402, baseType: !381, size: 576, offset: 14080)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !204, file: !6, line: 394, size: 576, elements: !382)
!382 = !{!383, !384, !385, !395, !396, !397}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !381, file: !6, line: 396, baseType: !173, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !381, file: !6, line: 397, baseType: !173, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !381, file: !6, line: 398, baseType: !386, size: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !203, line: 604, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 593, size: 192, elements: !389)
!389 = !{!390, !391, !392, !393}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !388, file: !203, line: 595, baseType: !173, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !388, file: !203, line: 596, baseType: !173, size: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !388, file: !203, line: 599, baseType: !173, size: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !388, file: !203, line: 603, baseType: !394, size: 64, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !381, file: !6, line: 399, baseType: !173, size: 32, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !381, file: !6, line: 400, baseType: !394, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !381, file: !6, line: 401, baseType: !398, size: 320, offset: 256)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !399, line: 56, baseType: !400)
!399 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !399, line: 47, size: 320, elements: !401)
!401 = !{!402, !403, !404, !405, !409, !410}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !400, file: !399, line: 49, baseType: !394, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !400, file: !399, line: 50, baseType: !394, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !400, file: !399, line: 51, baseType: !394, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !400, file: !399, line: 53, baseType: !406, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !407, line: 87, baseType: !408)
!407 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!408 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !400, file: !399, line: 54, baseType: !173, size: 32, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !400, file: !399, line: 55, baseType: !173, size: 32, offset: 288)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !204, file: !6, line: 404, baseType: !394, size: 64, offset: 14656)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !204, file: !6, line: 405, baseType: !173, size: 32, offset: 14720)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !204, file: !6, line: 410, baseType: !173, size: 32, offset: 14752)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !204, file: !6, line: 411, baseType: !173, size: 32, offset: 14784)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !204, file: !6, line: 413, baseType: !173, size: 32, offset: 14816)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !204, file: !6, line: 415, baseType: !173, size: 32, offset: 14848)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !204, file: !6, line: 416, baseType: !173, size: 32, offset: 14880)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !204, file: !6, line: 418, baseType: !173, size: 32, offset: 14912)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !204, file: !6, line: 419, baseType: !173, size: 32, offset: 14944)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !204, file: !6, line: 420, baseType: !173, size: 32, offset: 14976)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !204, file: !6, line: 421, baseType: !173, size: 32, offset: 15008)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !204, file: !6, line: 422, baseType: !173, size: 32, offset: 15040)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !204, file: !6, line: 424, baseType: !173, size: 32, offset: 15072)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !204, file: !6, line: 425, baseType: !173, size: 32, offset: 15104)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !204, file: !6, line: 427, baseType: !173, size: 32, offset: 15136)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !204, file: !6, line: 430, baseType: !427, size: 10400, offset: 15168)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 10400, elements: !514)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !429, line: 154, baseType: !430)
!429 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !429, line: 52, size: 10400, elements: !431)
!431 = !{!432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !449, !450, !451, !452, !453, !454, !455, !456, !457, !464, !465, !513}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !430, file: !429, line: 54, baseType: !173, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !430, file: !429, line: 56, baseType: !173, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !430, file: !429, line: 57, baseType: !173, size: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !430, file: !429, line: 59, baseType: !173, size: 32, offset: 96)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !430, file: !429, line: 60, baseType: !173, size: 32, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !430, file: !429, line: 61, baseType: !173, size: 32, offset: 160)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !430, file: !429, line: 63, baseType: !173, size: 32, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !430, file: !429, line: 65, baseType: !173, size: 32, offset: 224)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !430, file: !429, line: 67, baseType: !173, size: 32, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !430, file: !429, line: 69, baseType: !173, size: 32, offset: 288)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !430, file: !429, line: 70, baseType: !173, size: 32, offset: 320)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !430, file: !429, line: 71, baseType: !173, size: 32, offset: 352)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !430, file: !429, line: 72, baseType: !173, size: 32, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !430, file: !429, line: 73, baseType: !446, size: 8192, offset: 416)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 8192, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 256)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !430, file: !429, line: 75, baseType: !173, size: 32, offset: 8608)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !430, file: !429, line: 76, baseType: !173, size: 32, offset: 8640)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !430, file: !429, line: 77, baseType: !173, size: 32, offset: 8672)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !430, file: !429, line: 78, baseType: !173, size: 32, offset: 8704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !430, file: !429, line: 79, baseType: !173, size: 32, offset: 8736)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !430, file: !429, line: 80, baseType: !173, size: 32, offset: 8768)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !430, file: !429, line: 81, baseType: !173, size: 32, offset: 8800)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !430, file: !429, line: 83, baseType: !173, size: 32, offset: 8832)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !430, file: !429, line: 90, baseType: !458, size: 128, offset: 8864)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !430, file: !429, line: 84, size: 128, elements: !459)
!459 = !{!460, !461, !462, !463}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !458, file: !429, line: 86, baseType: !173, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !458, file: !429, line: 87, baseType: !173, size: 32, offset: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !458, file: !429, line: 88, baseType: !173, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !458, file: !429, line: 89, baseType: !173, size: 32, offset: 96)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !430, file: !429, line: 92, baseType: !173, size: 32, offset: 8992)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !430, file: !429, line: 150, baseType: !466, size: 1344, offset: 9024)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !430, file: !429, line: 93, size: 1344, elements: !467)
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !466, file: !429, line: 95, baseType: !173, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !466, file: !429, line: 96, baseType: !173, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !466, file: !429, line: 97, baseType: !173, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !466, file: !429, line: 99, baseType: !173, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !466, file: !429, line: 100, baseType: !173, size: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !466, file: !429, line: 102, baseType: !173, size: 32, offset: 160)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !466, file: !429, line: 103, baseType: !173, size: 32, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !466, file: !429, line: 104, baseType: !173, size: 32, offset: 224)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !466, file: !429, line: 105, baseType: !173, size: 32, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !466, file: !429, line: 106, baseType: !173, size: 32, offset: 288)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !466, file: !429, line: 107, baseType: !173, size: 32, offset: 320)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !466, file: !429, line: 108, baseType: !173, size: 32, offset: 352)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !466, file: !429, line: 110, baseType: !173, size: 32, offset: 384)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !466, file: !429, line: 111, baseType: !173, size: 32, offset: 416)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !466, file: !429, line: 112, baseType: !173, size: 32, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !466, file: !429, line: 114, baseType: !173, size: 32, offset: 480)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !466, file: !429, line: 115, baseType: !108, size: 32, offset: 512)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !466, file: !429, line: 116, baseType: !108, size: 32, offset: 544)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !466, file: !429, line: 117, baseType: !173, size: 32, offset: 576)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !466, file: !429, line: 119, baseType: !173, size: 32, offset: 608)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !466, file: !429, line: 120, baseType: !173, size: 32, offset: 640)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !466, file: !429, line: 137, baseType: !490, size: 384, offset: 672)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !466, file: !429, line: 122, size: 384, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !490, file: !429, line: 124, baseType: !173, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !490, file: !429, line: 125, baseType: !173, size: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !490, file: !429, line: 126, baseType: !173, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !490, file: !429, line: 127, baseType: !173, size: 32, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !490, file: !429, line: 128, baseType: !173, size: 32, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !490, file: !429, line: 129, baseType: !173, size: 32, offset: 160)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !490, file: !429, line: 130, baseType: !173, size: 32, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !490, file: !429, line: 131, baseType: !173, size: 32, offset: 224)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !490, file: !429, line: 133, baseType: !173, size: 32, offset: 256)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !490, file: !429, line: 134, baseType: !173, size: 32, offset: 288)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !490, file: !429, line: 135, baseType: !173, size: 32, offset: 320)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !490, file: !429, line: 136, baseType: !173, size: 32, offset: 352)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !466, file: !429, line: 139, baseType: !173, size: 32, offset: 1056)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !466, file: !429, line: 140, baseType: !173, size: 32, offset: 1088)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !466, file: !429, line: 141, baseType: !173, size: 32, offset: 1120)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !466, file: !429, line: 142, baseType: !173, size: 32, offset: 1152)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !466, file: !429, line: 143, baseType: !173, size: 32, offset: 1184)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !466, file: !429, line: 144, baseType: !173, size: 32, offset: 1216)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !466, file: !429, line: 145, baseType: !173, size: 32, offset: 1248)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !466, file: !429, line: 146, baseType: !173, size: 32, offset: 1280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !466, file: !429, line: 147, baseType: !173, size: 32, offset: 1312)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !430, file: !429, line: 152, baseType: !173, size: 32, offset: 10368)
!514 = !{!515}
!515 = !DISubrange(count: 1)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !204, file: !6, line: 431, baseType: !517, size: 64, offset: 25600)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !204, file: !6, line: 432, baseType: !519, size: 960, offset: 25664)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 960, elements: !514)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !429, line: 186, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !429, line: 156, size: 960, elements: !522)
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !521, file: !429, line: 158, baseType: !173, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !521, file: !429, line: 159, baseType: !173, size: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !521, file: !429, line: 161, baseType: !173, size: 32, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !521, file: !429, line: 163, baseType: !173, size: 32, offset: 96)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !521, file: !429, line: 164, baseType: !173, size: 32, offset: 128)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !521, file: !429, line: 166, baseType: !173, size: 32, offset: 160)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !521, file: !429, line: 167, baseType: !173, size: 32, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !521, file: !429, line: 169, baseType: !173, size: 32, offset: 224)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !521, file: !429, line: 170, baseType: !173, size: 32, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !521, file: !429, line: 172, baseType: !173, size: 32, offset: 288)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !521, file: !429, line: 173, baseType: !173, size: 32, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !521, file: !429, line: 175, baseType: !173, size: 32, offset: 352)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !521, file: !429, line: 177, baseType: !173, size: 32, offset: 384)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !521, file: !429, line: 178, baseType: !173, size: 32, offset: 416)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !521, file: !429, line: 179, baseType: !173, size: 32, offset: 448)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !521, file: !429, line: 181, baseType: !173, size: 32, offset: 480)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !521, file: !429, line: 183, baseType: !173, size: 32, offset: 512)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !521, file: !429, line: 184, baseType: !541, size: 384, offset: 576)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !542, size: 384, elements: !543)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!543 = !{!544}
!544 = !DISubrange(count: 6)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !204, file: !6, line: 433, baseType: !546, size: 64, offset: 26624)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !204, file: !6, line: 434, baseType: !173, size: 32, offset: 26688)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !204, file: !6, line: 437, baseType: !173, size: 32, offset: 26720)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !204, file: !6, line: 440, baseType: !550, size: 256, offset: 26752)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 256, elements: !124)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 512, elements: !155)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !204, file: !6, line: 441, baseType: !554, size: 128, offset: 27008)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 128, elements: !117)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 2048, elements: !259)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !204, file: !6, line: 443, baseType: !550, size: 256, offset: 27136)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !204, file: !6, line: 444, baseType: !554, size: 128, offset: 27392)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !204, file: !6, line: 446, baseType: !560, size: 256, offset: 27520)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 256, elements: !124)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 256, elements: !155)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !204, file: !6, line: 447, baseType: !564, size: 128, offset: 27776)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 128, elements: !117)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 1024, elements: !259)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !204, file: !6, line: 448, baseType: !560, size: 256, offset: 27904)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !204, file: !6, line: 449, baseType: !564, size: 128, offset: 28160)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !204, file: !6, line: 454, baseType: !570, size: 5888, offset: 28288)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 5888, elements: !572)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!572 = !{!573}
!573 = !DISubrange(count: 92)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !204, file: !6, line: 455, baseType: !575, size: 23552, offset: 34176)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 23552, elements: !576)
!576 = !{!573, !125}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !204, file: !6, line: 457, baseType: !542, size: 64, offset: 57728)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !204, file: !6, line: 460, baseType: !579, size: 53376, offset: 57856)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !6, line: 364, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 302, size: 53376, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !610, !639, !640, !641, !647, !648, !649, !650, !651, !652, !653, !654}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !580, file: !6, line: 304, baseType: !517, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !580, file: !6, line: 305, baseType: !546, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !580, file: !6, line: 307, baseType: !173, size: 32, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !580, file: !6, line: 308, baseType: !173, size: 32, offset: 160)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !580, file: !6, line: 309, baseType: !173, size: 32, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !580, file: !6, line: 311, baseType: !173, size: 32, offset: 224)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !580, file: !6, line: 313, baseType: !173, size: 32, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !580, file: !6, line: 315, baseType: !173, size: 32, offset: 288)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !580, file: !6, line: 316, baseType: !173, size: 32, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !580, file: !6, line: 317, baseType: !173, size: 32, offset: 352)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !580, file: !6, line: 319, baseType: !173, size: 32, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !580, file: !6, line: 321, baseType: !173, size: 32, offset: 416)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !580, file: !6, line: 322, baseType: !173, size: 32, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !580, file: !6, line: 324, baseType: !306, size: 64, offset: 480)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !580, file: !6, line: 325, baseType: !173, size: 32, offset: 544)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !580, file: !6, line: 327, baseType: !173, size: 32, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !580, file: !6, line: 329, baseType: !173, size: 32, offset: 608)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !580, file: !6, line: 330, baseType: !173, size: 32, offset: 640)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !580, file: !6, line: 331, baseType: !173, size: 32, offset: 672)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !580, file: !6, line: 333, baseType: !173, size: 32, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !580, file: !6, line: 334, baseType: !173, size: 32, offset: 736)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !580, file: !6, line: 339, baseType: !604, size: 2048, offset: 768)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 2048, elements: !609)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !580, file: !6, line: 335, size: 64, elements: !606)
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !605, file: !6, line: 337, baseType: !173, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !605, file: !6, line: 338, baseType: !173, size: 32, offset: 32)
!609 = !{!118, !156}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !580, file: !6, line: 342, baseType: !611, size: 49152, align: 128, offset: 2816)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 49152, align: 128, elements: !636)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !613, line: 36, baseType: !614, align: 128)
!613 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !613, line: 26, size: 512, elements: !615)
!615 = !{!616, !622, !623, !626, !627, !628}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !614, file: !613, line: 30, baseType: !617, size: 128, align: 128)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 128, elements: !151)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !619, line: 25, baseType: !620)
!619 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !111, line: 39, baseType: !621)
!621 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !614, file: !613, line: 31, baseType: !617, size: 128, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !614, file: !613, line: 32, baseType: !624, size: 32, offset: 256)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !619, line: 26, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !111, line: 41, baseType: !173)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !614, file: !613, line: 33, baseType: !624, size: 32, offset: 288)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !614, file: !613, line: 34, baseType: !624, size: 32, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !614, file: !613, line: 35, baseType: !629, size: 64, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !613, line: 25, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !394, !173, !394, !173, !634, !173}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!636 = !{!637, !638}
!637 = !DISubrange(count: 32)
!638 = !DISubrange(count: 3)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !580, file: !6, line: 344, baseType: !173, size: 32, offset: 51968)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !580, file: !6, line: 345, baseType: !173, size: 32, offset: 52000)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !580, file: !6, line: 350, baseType: !642, size: 1024, offset: 52032)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 1024, elements: !155)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !580, file: !6, line: 346, size: 64, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !643, file: !6, line: 348, baseType: !173, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !643, file: !6, line: 349, baseType: !173, size: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !580, file: !6, line: 352, baseType: !173, size: 32, offset: 53056)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !580, file: !6, line: 354, baseType: !173, size: 32, offset: 53088)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !580, file: !6, line: 355, baseType: !173, size: 32, offset: 53120)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !580, file: !6, line: 356, baseType: !173, size: 32, offset: 53152)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !580, file: !6, line: 357, baseType: !173, size: 32, offset: 53184)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !580, file: !6, line: 360, baseType: !173, size: 32, offset: 53216)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !580, file: !6, line: 361, baseType: !173, size: 32, offset: 53248)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !580, file: !6, line: 362, baseType: !173, size: 32, offset: 53280)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !204, file: !6, line: 463, baseType: !656, size: 4096, offset: 111232)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !657, line: 46, baseType: !658)
!657 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !657, line: 27, size: 4096, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !658, file: !657, line: 30, baseType: !173, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !658, file: !657, line: 31, baseType: !173, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !658, file: !657, line: 34, baseType: !173, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !658, file: !657, line: 35, baseType: !173, size: 32, offset: 96)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !658, file: !657, line: 37, baseType: !394, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !658, file: !657, line: 38, baseType: !394, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !658, file: !657, line: 39, baseType: !394, size: 64, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !658, file: !657, line: 42, baseType: !173, size: 32, align: 128, offset: 384)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !658, file: !657, line: 45, baseType: !669, size: 3680, offset: 416)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 3680, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 460)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !204, file: !6, line: 494, baseType: !673, size: 2112, offset: 115328)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !204, file: !6, line: 465, size: 2112, elements: !674)
!674 = !{!675, !813, !815, !816, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !829, !830, !831, !832}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !673, file: !6, line: 468, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !679, line: 146, baseType: !680)
!679 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !679, line: 31, size: 125056, elements: !681)
!681 = !{!682, !683, !684, !685, !688, !689, !690, !691, !692, !693, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !712, !713, !714, !715, !716, !717, !719, !721, !722, !723, !724, !725, !728, !730, !731, !733, !738, !739, !743, !744, !748, !752, !755, !757, !758, !760, !761, !763, !764, !765, !768, !770, !771, !772, !774, !775, !776, !777, !778, !779, !780, !781, !783, !784, !785, !794, !798, !800, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !680, file: !679, line: 34, baseType: !173, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !680, file: !679, line: 35, baseType: !173, size: 32, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !680, file: !679, line: 36, baseType: !173, size: 32, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !680, file: !679, line: 37, baseType: !686, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !619, line: 27, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !111, line: 44, baseType: !408)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !680, file: !679, line: 38, baseType: !686, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !680, file: !679, line: 39, baseType: !173, size: 32, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !680, file: !679, line: 40, baseType: !173, size: 32, offset: 288)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !680, file: !679, line: 41, baseType: !173, size: 32, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !680, file: !679, line: 42, baseType: !173, size: 32, offset: 352)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !680, file: !679, line: 43, baseType: !694, size: 64, offset: 384)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !680, file: !679, line: 45, baseType: !173, size: 32, offset: 448)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !680, file: !679, line: 46, baseType: !173, size: 32, offset: 480)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !680, file: !679, line: 47, baseType: !173, size: 32, offset: 512)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !680, file: !679, line: 48, baseType: !173, size: 32, offset: 544)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !680, file: !679, line: 49, baseType: !173, size: 32, offset: 576)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !680, file: !679, line: 50, baseType: !173, size: 32, offset: 608)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !680, file: !679, line: 51, baseType: !173, size: 32, offset: 640)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !680, file: !679, line: 52, baseType: !121, size: 8, offset: 672)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !680, file: !679, line: 53, baseType: !121, size: 8, offset: 680)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !680, file: !679, line: 54, baseType: !121, size: 8, offset: 688)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !680, file: !679, line: 55, baseType: !302, size: 32, offset: 704)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !680, file: !679, line: 56, baseType: !302, size: 32, offset: 736)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !680, file: !679, line: 57, baseType: !173, size: 32, offset: 768)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !680, file: !679, line: 60, baseType: !173, size: 32, offset: 800)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !680, file: !679, line: 61, baseType: !710, size: 96, offset: 832)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 96, elements: !711)
!711 = !{!638}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !680, file: !679, line: 62, baseType: !710, size: 96, offset: 928)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !680, file: !679, line: 63, baseType: !710, size: 96, offset: 1024)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !680, file: !679, line: 64, baseType: !173, size: 32, offset: 1120)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !680, file: !679, line: 65, baseType: !173, size: 32, offset: 1152)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !680, file: !679, line: 66, baseType: !173, size: 32, offset: 1184)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !680, file: !679, line: 67, baseType: !718, size: 192, offset: 1216)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 192, elements: !711)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !680, file: !679, line: 68, baseType: !720, size: 256, offset: 1408)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 256, elements: !124)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !680, file: !679, line: 69, baseType: !720, size: 256, offset: 1664)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !680, file: !679, line: 70, baseType: !571, size: 64, offset: 1920)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !680, file: !679, line: 74, baseType: !720, size: 256, offset: 1984)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !680, file: !679, line: 75, baseType: !720, size: 256, offset: 2240)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !680, file: !679, line: 77, baseType: !726, size: 24576, align: 128, offset: 2560)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 24576, align: 128, elements: !727)
!727 = !{!156, !638}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !680, file: !679, line: 78, baseType: !729, size: 1024, offset: 27136)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 1024, elements: !155)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !680, file: !679, line: 79, baseType: !173, size: 32, offset: 28160)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !680, file: !679, line: 80, baseType: !732, size: 64, offset: 28224)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !680, file: !679, line: 83, baseType: !734, size: 64, offset: 28288)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !619, line: 24, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !111, line: 37, baseType: !737)
!737 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !680, file: !679, line: 84, baseType: !394, size: 64, offset: 28352)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !680, file: !679, line: 85, baseType: !740, size: 128, offset: 28416)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 128, elements: !117)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 32, elements: !117)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !680, file: !679, line: 86, baseType: !741, size: 64, offset: 28544)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !680, file: !679, line: 87, baseType: !745, size: 2176, offset: 28608)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 2176, elements: !746)
!746 = !{!118, !747}
!747 = !DISubrange(count: 17)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !680, file: !679, line: 92, baseType: !749, size: 20736, offset: 30784)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 20736, elements: !750)
!750 = !{!751, !751}
!751 = !DISubrange(count: 18)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !680, file: !679, line: 96, baseType: !753, size: 2176, offset: 51520)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !754, size: 2176, elements: !746)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !680, file: !679, line: 97, baseType: !756, size: 128, offset: 53696)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 128, elements: !117)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !680, file: !679, line: 98, baseType: !306, size: 64, offset: 53824)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !680, file: !679, line: 99, baseType: !759, size: 1024, offset: 53888)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 1024, elements: !609)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !680, file: !679, line: 100, baseType: !742, size: 32, offset: 54912)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !680, file: !679, line: 105, baseType: !762, size: 10368, offset: 54944)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 10368, elements: !750)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !680, file: !679, line: 106, baseType: !762, size: 10368, offset: 65312)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !680, file: !679, line: 107, baseType: !173, size: 32, offset: 75680)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !680, file: !679, line: 108, baseType: !766, size: 576, offset: 75712)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 576, elements: !767)
!767 = !{!751}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !680, file: !679, line: 109, baseType: !769, size: 20736, offset: 76288)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !754, size: 20736, elements: !750)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !680, file: !679, line: 110, baseType: !754, size: 64, offset: 97024)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !680, file: !679, line: 111, baseType: !754, size: 64, offset: 97088)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !680, file: !679, line: 112, baseType: !773, size: 64, offset: 97152)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !680, file: !679, line: 113, baseType: !773, size: 64, offset: 97216)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !680, file: !679, line: 114, baseType: !773, size: 64, offset: 97280)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !680, file: !679, line: 115, baseType: !173, size: 32, offset: 97344)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !680, file: !679, line: 116, baseType: !571, size: 64, offset: 97408)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !680, file: !679, line: 117, baseType: !571, size: 64, offset: 97472)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !680, file: !679, line: 118, baseType: !571, size: 64, offset: 97536)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !680, file: !679, line: 119, baseType: !173, size: 32, offset: 97600)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !680, file: !679, line: 120, baseType: !782, size: 576, offset: 97632)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !302, size: 576, elements: !767)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !680, file: !679, line: 121, baseType: !108, size: 32, offset: 98208)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !680, file: !679, line: 122, baseType: !143, size: 64, offset: 98240)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !680, file: !679, line: 125, baseType: !786, size: 256, offset: 98304)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !203, line: 503, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 496, size: 256, elements: !788)
!788 = !{!789, !791, !792, !793}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !787, file: !203, line: 498, baseType: !790, size: 64)
!790 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !787, file: !203, line: 499, baseType: !790, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !787, file: !203, line: 500, baseType: !790, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !787, file: !203, line: 502, baseType: !790, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !680, file: !679, line: 128, baseType: !795, size: 2008, offset: 98560)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 2008, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 251)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !680, file: !679, line: 129, baseType: !799, size: 8032, offset: 100576)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 8032, elements: !796)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !680, file: !679, line: 130, baseType: !801, size: 16064, offset: 108608)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !790, size: 16064, elements: !796)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !680, file: !679, line: 131, baseType: !173, size: 32, offset: 124672)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !680, file: !679, line: 132, baseType: !173, size: 32, offset: 124704)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !680, file: !679, line: 135, baseType: !173, size: 32, offset: 124736)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !680, file: !679, line: 136, baseType: !173, size: 32, offset: 124768)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !680, file: !679, line: 137, baseType: !173, size: 32, offset: 124800)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !680, file: !679, line: 138, baseType: !173, size: 32, offset: 124832)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !680, file: !679, line: 139, baseType: !173, size: 32, offset: 124864)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !680, file: !679, line: 142, baseType: !302, size: 32, offset: 124896)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !680, file: !679, line: 143, baseType: !173, size: 32, offset: 124928)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !680, file: !679, line: 144, baseType: !173, size: 32, offset: 124960)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !680, file: !679, line: 145, baseType: !173, size: 32, offset: 124992)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !673, file: !6, line: 470, baseType: !814, size: 128, offset: 64)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 128, elements: !117)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !673, file: !6, line: 473, baseType: !676, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !673, file: !6, line: 476, baseType: !817, size: 1152, offset: 256)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 1152, elements: !767)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !673, file: !6, line: 478, baseType: !173, size: 32, offset: 1408)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !673, file: !6, line: 480, baseType: !173, size: 32, offset: 1440)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !673, file: !6, line: 482, baseType: !173, size: 32, offset: 1472)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !673, file: !6, line: 483, baseType: !173, size: 32, offset: 1504)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !673, file: !6, line: 484, baseType: !173, size: 32, offset: 1536)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !673, file: !6, line: 485, baseType: !173, size: 32, offset: 1568)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !673, file: !6, line: 486, baseType: !173, size: 32, offset: 1600)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !673, file: !6, line: 487, baseType: !686, size: 64, offset: 1664)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !673, file: !6, line: 488, baseType: !686, size: 64, offset: 1728)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !673, file: !6, line: 489, baseType: !828, size: 128, offset: 1792)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 128, elements: !117)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !673, file: !6, line: 490, baseType: !686, size: 64, offset: 1920)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !673, file: !6, line: 491, baseType: !686, size: 64, offset: 1984)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !673, file: !6, line: 492, baseType: !173, size: 32, offset: 2048)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !673, file: !6, line: 493, baseType: !173, size: 32, offset: 2080)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !204, file: !6, line: 497, baseType: !677, size: 64, offset: 117440)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !204, file: !6, line: 500, baseType: !677, size: 64, offset: 117504)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !204, file: !6, line: 503, baseType: !173, size: 32, offset: 117568)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !204, file: !6, line: 504, baseType: !837, size: 1216, offset: 117632)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 1216, elements: !188)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !204, file: !6, line: 505, baseType: !173, size: 32, offset: 118848)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !204, file: !6, line: 506, baseType: !837, size: 1216, offset: 118912)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !204, file: !6, line: 507, baseType: !306, size: 64, offset: 120128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !204, file: !6, line: 510, baseType: !173, size: 32, offset: 120192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !204, file: !6, line: 511, baseType: !173, size: 32, offset: 120224)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !204, file: !6, line: 512, baseType: !686, size: 64, offset: 120256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !204, file: !6, line: 522, baseType: !845, size: 10624, offset: 120320)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !204, file: !6, line: 515, size: 10624, elements: !846)
!846 = !{!847, !849, !852, !855}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !845, file: !6, line: 517, baseType: !848, size: 256, align: 128)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 256, elements: !155)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !845, file: !6, line: 518, baseType: !850, size: 128, align: 128, offset: 256)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 128, elements: !851)
!851 = !{!118, !125}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !845, file: !6, line: 520, baseType: !853, size: 4096, align: 128, offset: 384)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 4096, elements: !854)
!854 = !{!125, !260}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !845, file: !6, line: 521, baseType: !856, size: 6144, align: 128, offset: 4480)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 6144, elements: !857)
!857 = !{!858, !156}
!858 = !DISubrange(count: 24)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !204, file: !6, line: 732, baseType: !860, size: 82688, offset: 130944)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !204, file: !6, line: 525, size: 82688, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !889, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !907, !910, !914, !915, !916, !921, !922, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !989, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1031, !1032, !1033, !1036, !1039, !1041, !1044, !1046, !1047}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !860, file: !6, line: 527, baseType: !173, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !860, file: !6, line: 530, baseType: !173, size: 32, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !860, file: !6, line: 531, baseType: !173, size: 32, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !860, file: !6, line: 532, baseType: !173, size: 32, offset: 96)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !860, file: !6, line: 535, baseType: !173, size: 32, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !860, file: !6, line: 536, baseType: !173, size: 32, offset: 160)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !860, file: !6, line: 537, baseType: !173, size: 32, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !860, file: !6, line: 538, baseType: !173, size: 32, offset: 224)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !860, file: !6, line: 539, baseType: !173, size: 32, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !860, file: !6, line: 542, baseType: !173, size: 32, offset: 288)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !860, file: !6, line: 543, baseType: !173, size: 32, offset: 320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !860, file: !6, line: 544, baseType: !173, size: 32, offset: 352)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !860, file: !6, line: 545, baseType: !173, size: 32, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !860, file: !6, line: 546, baseType: !173, size: 32, offset: 416)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !860, file: !6, line: 547, baseType: !173, size: 32, offset: 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !860, file: !6, line: 548, baseType: !173, size: 32, offset: 480)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !860, file: !6, line: 549, baseType: !173, size: 32, offset: 512)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !860, file: !6, line: 551, baseType: !173, size: 32, offset: 544)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !860, file: !6, line: 554, baseType: !306, size: 64, offset: 576)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !860, file: !6, line: 555, baseType: !306, size: 64, offset: 640)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !860, file: !6, line: 558, baseType: !306, size: 64, offset: 704)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !860, file: !6, line: 559, baseType: !306, size: 64, offset: 768)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !860, file: !6, line: 561, baseType: !306, size: 64, offset: 832)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !860, file: !6, line: 562, baseType: !306, size: 64, offset: 896)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !860, file: !6, line: 565, baseType: !7, size: 32, offset: 960)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !860, file: !6, line: 566, baseType: !888, size: 128, offset: 992)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !124)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !860, file: !6, line: 567, baseType: !890, size: 512, offset: 1120)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !155)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !860, file: !6, line: 568, baseType: !7, size: 32, offset: 1632)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !860, file: !6, line: 569, baseType: !7, size: 32, offset: 1664)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !860, file: !6, line: 570, baseType: !173, size: 32, offset: 1696)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !860, file: !6, line: 571, baseType: !173, size: 32, offset: 1728)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !860, file: !6, line: 572, baseType: !173, size: 32, offset: 1760)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !860, file: !6, line: 573, baseType: !173, size: 32, offset: 1792)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !860, file: !6, line: 574, baseType: !173, size: 32, offset: 1824)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !860, file: !6, line: 575, baseType: !173, size: 32, offset: 1856)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !860, file: !6, line: 576, baseType: !173, size: 32, offset: 1888)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !860, file: !6, line: 577, baseType: !173, size: 32, offset: 1920)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !860, file: !6, line: 578, baseType: !173, size: 32, offset: 1952)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !860, file: !6, line: 585, baseType: !734, size: 64, offset: 1984)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !860, file: !6, line: 586, baseType: !394, size: 64, offset: 2048)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !860, file: !6, line: 587, baseType: !734, size: 64, offset: 2112)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !860, file: !6, line: 588, baseType: !906, size: 64, offset: 2176)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !860, file: !6, line: 589, baseType: !908, size: 64, offset: 2240)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 64, elements: !151)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !860, file: !6, line: 591, baseType: !911, size: 64, offset: 2304)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 192, elements: !913)
!913 = !{!858}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !860, file: !6, line: 592, baseType: !734, size: 64, offset: 2368)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !860, file: !6, line: 593, baseType: !740, size: 128, offset: 2432)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !860, file: !6, line: 594, baseType: !917, size: 128, offset: 2560)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 128, elements: !117)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 128, elements: !920)
!920 = !{!152, !118}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !860, file: !6, line: 595, baseType: !756, size: 128, offset: 2688)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !860, file: !6, line: 596, baseType: !923, size: 4096, offset: 2816)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 4096, elements: !924)
!924 = !{!118, !637}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !860, file: !6, line: 597, baseType: !734, size: 64, offset: 6912)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !860, file: !6, line: 598, baseType: !734, size: 64, offset: 6976)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !860, file: !6, line: 599, baseType: !571, size: 64, offset: 7040)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !860, file: !6, line: 603, baseType: !729, size: 1024, offset: 7104)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !860, file: !6, line: 606, baseType: !173, size: 32, offset: 8128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !860, file: !6, line: 607, baseType: !173, size: 32, offset: 8160)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !860, file: !6, line: 608, baseType: !120, size: 32, align: 32, offset: 8192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !860, file: !6, line: 609, baseType: !173, size: 32, offset: 8224)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !860, file: !6, line: 611, baseType: !173, size: 32, offset: 8256)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !860, file: !6, line: 612, baseType: !173, size: 32, offset: 8288)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !860, file: !6, line: 614, baseType: !173, size: 32, offset: 8320)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !860, file: !6, line: 615, baseType: !173, size: 32, offset: 8352)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !860, file: !6, line: 621, baseType: !173, size: 32, offset: 8384)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !860, file: !6, line: 624, baseType: !173, size: 32, offset: 8416)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !860, file: !6, line: 626, baseType: !173, size: 32, offset: 8448)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !860, file: !6, line: 627, baseType: !173, size: 32, offset: 8480)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !860, file: !6, line: 671, baseType: !942, size: 60672, offset: 8576)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !860, file: !6, line: 629, size: 60672, elements: !943)
!943 = !{!944, !948, !952, !954, !955, !958, !962, !963, !964, !965, !966, !967, !970, !974, !977, !978, !979, !980, !981, !984, !986, !988}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !942, file: !6, line: 634, baseType: !945, size: 3072, align: 128)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 3072, elements: !946)
!946 = !{!947}
!947 = !DISubrange(count: 384)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !942, file: !6, line: 635, baseType: !949, size: 6912, align: 128, offset: 3072)
!949 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 6912, elements: !950)
!950 = !{!951}
!951 = !DISubrange(count: 864)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !942, file: !6, line: 638, baseType: !953, size: 2048, align: 128, offset: 9984)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 2048, elements: !447)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !942, file: !6, line: 639, baseType: !953, size: 2048, align: 128, offset: 12032)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !942, file: !6, line: 640, baseType: !956, size: 3072, align: 128, offset: 14080)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 3072, elements: !957)
!957 = !{!638, !260}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !942, file: !6, line: 641, baseType: !959, size: 3840, align: 128, offset: 17152)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 3840, elements: !960)
!960 = !{!961, !156}
!961 = !DISubrange(count: 15)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !942, file: !6, line: 642, baseType: !148, size: 128, offset: 20992)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !942, file: !6, line: 643, baseType: !148, size: 128, offset: 21120)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !942, file: !6, line: 644, baseType: !173, size: 32, offset: 21248)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !942, file: !6, line: 645, baseType: !173, size: 32, offset: 21280)
