; ModuleID = 'x264_src/common/mc.c'
source_filename = "x264_src/common/mc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.x264_weight_t = type { [8 x i16], [8 x i16], i32, i32, i32, ptr, [8 x i8] }

@weight_none = dso_local local_unnamed_addr constant [3 x %struct.x264_weight_t] [%struct.x264_weight_t { [8 x i16] zeroinitializer, [8 x i16] zeroinitializer, i32 0, i32 0, i32 0, ptr null, [8 x i8] undef }, %struct.x264_weight_t zeroinitializer, %struct.x264_weight_t zeroinitializer], align 16, !dbg !0
@x264_mc_weight_wtab = internal global [6 x ptr] [ptr @mc_weight_w2, ptr @mc_weight_w4, ptr @mc_weight_w8, ptr @mc_weight_w12, ptr @mc_weight_w16, ptr @mc_weight_w20], align 16, !dbg !38
@hpel_ref0 = internal unnamed_addr constant [16 x i8] c"\00\01\01\01\00\01\01\01\02\03\03\03\00\01\01\01", align 16, !dbg !26
@hpel_ref1 = internal unnamed_addr constant [16 x i8] c"\00\00\00\00\02\02\03\02\02\02\03\02\02\02\03\02", align 16, !dbg !36

; Function Attrs: nofree norecurse nosync nounwind memory(readwrite, inaccessiblemem: none) uwtable
define dso_local void @x264_plane_copy_c(ptr nocapture noundef writeonly %dst, i32 noundef %i_dst, ptr nocapture noundef readonly %src, i32 noundef %i_src, i32 noundef %w, i32 noundef %h) #0 !dbg !82 {
entry:
    #dbg_value(ptr %dst, !86, !DIExpression(), !92)
    #dbg_value(i32 %i_dst, !87, !DIExpression(), !92)

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "weight_none", scope: !2, file: !3, line: 171, type: !69, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !19, globals: !25, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "x264_src/common/mc.c", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5b5840f7c133c196a2452d152d36293d")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 30, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "x264_src/common/pixel.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e9056d80edbb4dc2514d271d596c298e")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "PIXEL_16x16", value: 0)
!10 = !DIEnumerator(name: "PIXEL_16x8", value: 1)
!11 = !DIEnumerator(name: "PIXEL_8x16", value: 2)
!12 = !DIEnumerator(name: "PIXEL_8x8", value: 3)
!13 = !DIEnumerator(name: "PIXEL_8x4", value: 4)
!14 = !DIEnumerator(name: "PIXEL_4x8", value: 5)
!15 = !DIEnumerator(name: "PIXEL_4x4", value: 6)
!16 = !DIEnumerator(name: "PIXEL_4x2", value: 7)
!17 = !DIEnumerator(name: "PIXEL_2x4", value: 8)
!18 = !DIEnumerator(name: "PIXEL_2x2", value: 9)
!19 = !{!20}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !21, line: 27, baseType: !22)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !23, line: 44, baseType: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!24 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!25 = !{!0, !26, !36, !38}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "hpel_ref0", scope: !2, file: !3, line: 206, type: !28, isLocal: true, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 128, elements: !34)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !31, line: 24, baseType: !32)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !23, line: 38, baseType: !33)
!33 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!34 = !{!35}
!35 = !DISubrange(count: 16)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "hpel_ref1", scope: !2, file: !3, line: 207, type: !28, isLocal: true, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "x264_mc_weight_wtab", scope: !2, file: !3, line: 162, type: !40, isLocal: true, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 384, elements: !67)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !42, line: 25, baseType: !43)
!42 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !46, !47, !46, !47, !48, !47}
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!47 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !42, line: 26, size: 512, elements: !51)
!51 = !{!52, !59, !60, !63, !64, !65}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !50, file: !42, line: 30, baseType: !53, size: 128, align: 128)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 128, elements: !57)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !21, line: 25, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !23, line: 39, baseType: !56)
!56 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!57 = !{!58}
!58 = !DISubrange(count: 8)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !50, file: !42, line: 31, baseType: !53, size: 128, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !50, file: !42, line: 32, baseType: !61, size: 32, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !21, line: 26, baseType: !62)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !23, line: 41, baseType: !47)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !50, file: !42, line: 33, baseType: !61, size: 32, offset: 288)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !50, file: !42, line: 34, baseType: !61, size: 32, offset: 320)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !50, file: !42, line: 35, baseType: !66, size: 64, offset: 384)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!67 = !{!68}
!68 = !DISubrange(count: 6)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 1536, align: 128, elements: !72)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !42, line: 36, baseType: !50, align: 128)
!72 = !{!73}
!73 = !DISubrange(count: 3)
!74 = !{i32 7, !"Dwarf Version", i32 5}
!75 = !{i32 2, !"Debug Info Version", i32 3}
!76 = !{i32 1, !"wchar_size", i32 4}
!77 = !{i32 8, !"PIC Level", i32 2}
!78 = !{i32 7, !"PIE Level", i32 2}
!79 = !{i32 7, !"uwtable", i32 2}
!80 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!81 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!82 = distinct !DISubprogram(name: "x264_plane_copy_c", scope: !3, file: !3, line: 299, type: !83, scopeLine: 301, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !85)
!83 = !DISubroutineType(types: !84)
!84 = !{null, !46, !47, !46, !47, !47, !47}
!85 = !{!86, !87, !88, !89, !90, !91}
!86 = !DILocalVariable(name: "dst", arg: 1, scope: !82, file: !3, line: 299, type: !46)
!87 = !DILocalVariable(name: "i_dst", arg: 2, scope: !82, file: !3, line: 299, type: !47)
!88 = !DILocalVariable(name: "src", arg: 3, scope: !82, file: !3, line: 300, type: !46)
!89 = !DILocalVariable(name: "i_src", arg: 4, scope: !82, file: !3, line: 300, type: !47)
!90 = !DILocalVariable(name: "w", arg: 5, scope: !82, file: !3, line: 300, type: !47)
!91 = !DILocalVariable(name: "h", arg: 6, scope: !82, file: !3, line: 300, type: !47)
!92 = !DILocation(line: 0, scope: !82)
!93 = !DILocation(line: 302, column: 5, scope: !82)
!94 = !DILocation(line: 302, column: 13, scope: !82)
!95 = !DILocation(line: 304, column: 9, scope: !96)
!96 = distinct !DILexicalBlock(scope: !82, file: !3, line: 303, column: 5)
!97 = !DILocation(line: 305, column: 13, scope: !96)
!98 = !DILocation(line: 306, column: 13, scope: !96)
!99 = distinct !{!99, !100}
!100 = !{!"llvm.loop.unroll.disable"}
!101 = distinct !{!101, !93, !102}
!102 = !DILocation(line: 307, column: 5, scope: !82)
!103 = !DILocation(line: 308, column: 1, scope: !82)
!104 = distinct !DISubprogram(name: "x264_frame_init_lowres", scope: !3, file: !3, line: 356, type: !105, scopeLine: 357, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1375)
!105 = !DISubroutineType(types: !106)
!106 = !{null, !107, !565}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !109, line: 46, baseType: !110)
!109 = !DIFile(filename: "x264_src/x264.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !111, line: 381, size: 266752, elements: !112)
!111 = !DIFile(filename: "x264_src/common/common.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5afac7bf2f5673f1628c455d7d320ad7")
!112 = !{!113, !283, !287, !288, !289, !290, !291, !292, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !426, !428, !453, !455, !456, !457, !463, !467, !468, !469, !476, !480, !481, !482, !487, !490, !491, !543, !560, !721, !722, !723, !724, !728, !729, !730, !731, !732, !733, !734, !749, !943, !947, !1008, !1011, !1013, !1015, !1016, !1019, !1024, !1033, !1034, !1042, !1044, !1049, !1124, !1207, !1251, !1273, !1322, !1351}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !110, file: !111, line: 384, baseType: !114, size: 5632)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !109, line: 376, baseType: !115)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !109, line: 176, size: 5632, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !160, !162, !163, !164, !165, !169, !170, !184, !185, !186, !187, !188, !219, !261, !262, !263, !264, !265, !266, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !115, file: !109, line: 179, baseType: !7, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !115, file: !109, line: 180, baseType: !47, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !115, file: !109, line: 181, baseType: !47, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !115, file: !109, line: 182, baseType: !47, size: 32, offset: 96)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !115, file: !109, line: 183, baseType: !47, size: 32, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !115, file: !109, line: 186, baseType: !47, size: 32, offset: 160)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !115, file: !109, line: 187, baseType: !47, size: 32, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !115, file: !109, line: 188, baseType: !47, size: 32, offset: 224)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !115, file: !109, line: 189, baseType: !47, size: 32, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !115, file: !109, line: 190, baseType: !47, size: 32, offset: 288)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !115, file: !109, line: 198, baseType: !47, size: 32, offset: 320)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !115, file: !109, line: 215, baseType: !129, size: 288, offset: 352)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !115, file: !109, line: 200, size: 288, elements: !130)
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138, !139}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !129, file: !109, line: 203, baseType: !47, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !129, file: !109, line: 204, baseType: !47, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !129, file: !109, line: 206, baseType: !47, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !129, file: !109, line: 209, baseType: !47, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !129, file: !109, line: 210, baseType: !47, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !129, file: !109, line: 211, baseType: !47, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !129, file: !109, line: 212, baseType: !47, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !129, file: !109, line: 213, baseType: !47, size: 32, offset: 224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !129, file: !109, line: 214, baseType: !47, size: 32, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !115, file: !109, line: 218, baseType: !47, size: 32, offset: 640)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !115, file: !109, line: 219, baseType: !47, size: 32, offset: 672)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !115, file: !109, line: 220, baseType: !47, size: 32, offset: 704)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !115, file: !109, line: 221, baseType: !47, size: 32, offset: 736)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !115, file: !109, line: 222, baseType: !47, size: 32, offset: 768)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !115, file: !109, line: 224, baseType: !47, size: 32, offset: 800)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !115, file: !109, line: 225, baseType: !47, size: 32, offset: 832)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !115, file: !109, line: 226, baseType: !47, size: 32, offset: 864)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !115, file: !109, line: 227, baseType: !47, size: 32, offset: 896)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !115, file: !109, line: 229, baseType: !47, size: 32, offset: 928)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !115, file: !109, line: 230, baseType: !47, size: 32, offset: 960)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !115, file: !109, line: 231, baseType: !47, size: 32, offset: 992)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !115, file: !109, line: 233, baseType: !47, size: 32, offset: 1024)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !115, file: !109, line: 234, baseType: !47, size: 32, offset: 1056)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !115, file: !109, line: 236, baseType: !47, size: 32, offset: 1088)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !115, file: !109, line: 237, baseType: !47, size: 32, offset: 1120)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !115, file: !109, line: 239, baseType: !47, size: 32, offset: 1152)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !115, file: !109, line: 240, baseType: !158, size: 64, offset: 1216)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !115, file: !109, line: 241, baseType: !161, size: 128, offset: 1280)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !34)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !115, file: !109, line: 242, baseType: !161, size: 128, offset: 1408)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !115, file: !109, line: 243, baseType: !161, size: 128, offset: 1536)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !115, file: !109, line: 244, baseType: !161, size: 128, offset: 1664)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !115, file: !109, line: 245, baseType: !166, size: 512, offset: 1792)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 512, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !115, file: !109, line: 246, baseType: !166, size: 512, offset: 2304)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !115, file: !109, line: 249, baseType: !171, size: 64, offset: 2816)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !174, !47, !175, !177}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !179)
!179 = !{!180, !181, !182, !183}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !178, file: !3, line: 308, baseType: !7, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !178, file: !3, line: 308, baseType: !7, size: 32, offset: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !178, file: !3, line: 308, baseType: !174, size: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !178, file: !3, line: 308, baseType: !174, size: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !115, file: !109, line: 250, baseType: !174, size: 64, offset: 2880)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !115, file: !109, line: 251, baseType: !47, size: 32, offset: 2944)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !115, file: !109, line: 252, baseType: !47, size: 32, offset: 2976)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !115, file: !109, line: 253, baseType: !158, size: 64, offset: 3008)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !115, file: !109, line: 287, baseType: !189, size: 800, offset: 3072)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !115, file: !109, line: 256, size: 800, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !211, !212, !213, !217, !218}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !189, file: !109, line: 258, baseType: !7, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !189, file: !109, line: 259, baseType: !7, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !189, file: !109, line: 261, baseType: !47, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !189, file: !109, line: 262, baseType: !47, size: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !189, file: !109, line: 263, baseType: !47, size: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !189, file: !109, line: 264, baseType: !47, size: 32, offset: 160)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !189, file: !109, line: 265, baseType: !47, size: 32, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !189, file: !109, line: 267, baseType: !47, size: 32, offset: 224)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !189, file: !109, line: 268, baseType: !47, size: 32, offset: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !189, file: !109, line: 269, baseType: !47, size: 32, offset: 288)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !189, file: !109, line: 270, baseType: !47, size: 32, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !189, file: !109, line: 271, baseType: !47, size: 32, offset: 352)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !189, file: !109, line: 272, baseType: !47, size: 32, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !189, file: !109, line: 273, baseType: !47, size: 32, offset: 416)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !189, file: !109, line: 274, baseType: !47, size: 32, offset: 448)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !189, file: !109, line: 275, baseType: !47, size: 32, offset: 480)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !189, file: !109, line: 276, baseType: !47, size: 32, offset: 512)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !189, file: !109, line: 277, baseType: !47, size: 32, offset: 544)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !189, file: !109, line: 278, baseType: !210, size: 32, offset: 576)
!210 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !189, file: !109, line: 279, baseType: !210, size: 32, offset: 608)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !189, file: !109, line: 280, baseType: !47, size: 32, offset: 640)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !189, file: !109, line: 283, baseType: !214, size: 64, offset: 672)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 64, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 2)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !189, file: !109, line: 285, baseType: !47, size: 32, offset: 736)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !189, file: !109, line: 286, baseType: !47, size: 32, offset: 768)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !115, file: !109, line: 327, baseType: !220, size: 1152, offset: 3904)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !115, file: !109, line: 290, size: 1152, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !259, !260}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !220, file: !109, line: 292, baseType: !47, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !220, file: !109, line: 294, baseType: !47, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !220, file: !109, line: 295, baseType: !47, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !220, file: !109, line: 296, baseType: !47, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !220, file: !109, line: 297, baseType: !47, size: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !220, file: !109, line: 299, baseType: !47, size: 32, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !220, file: !109, line: 300, baseType: !210, size: 32, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !220, file: !109, line: 301, baseType: !210, size: 32, offset: 224)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !220, file: !109, line: 302, baseType: !210, size: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !220, file: !109, line: 303, baseType: !47, size: 32, offset: 288)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !220, file: !109, line: 304, baseType: !47, size: 32, offset: 320)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !220, file: !109, line: 305, baseType: !210, size: 32, offset: 352)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !220, file: !109, line: 306, baseType: !210, size: 32, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !220, file: !109, line: 307, baseType: !210, size: 32, offset: 416)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !220, file: !109, line: 309, baseType: !47, size: 32, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !220, file: !109, line: 310, baseType: !210, size: 32, offset: 480)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !220, file: !109, line: 311, baseType: !47, size: 32, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !220, file: !109, line: 312, baseType: !47, size: 32, offset: 544)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !220, file: !109, line: 315, baseType: !47, size: 32, offset: 576)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !220, file: !109, line: 316, baseType: !158, size: 64, offset: 640)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !220, file: !109, line: 317, baseType: !47, size: 32, offset: 704)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !220, file: !109, line: 318, baseType: !158, size: 64, offset: 768)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !220, file: !109, line: 321, baseType: !210, size: 32, offset: 832)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !220, file: !109, line: 322, baseType: !210, size: 32, offset: 864)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !220, file: !109, line: 323, baseType: !210, size: 32, offset: 896)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !220, file: !109, line: 324, baseType: !248, size: 64, offset: 960)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !109, line: 174, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !109, line: 167, size: 256, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !250, file: !109, line: 169, baseType: !47, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !250, file: !109, line: 169, baseType: !47, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !250, file: !109, line: 170, baseType: !47, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !250, file: !109, line: 171, baseType: !47, size: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !250, file: !109, line: 172, baseType: !210, size: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !250, file: !109, line: 173, baseType: !258, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !220, file: !109, line: 325, baseType: !47, size: 32, offset: 1024)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !220, file: !109, line: 326, baseType: !158, size: 64, offset: 1088)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !115, file: !109, line: 330, baseType: !47, size: 32, offset: 5056)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !115, file: !109, line: 331, baseType: !47, size: 32, offset: 5088)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !115, file: !109, line: 332, baseType: !47, size: 32, offset: 5120)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !115, file: !109, line: 334, baseType: !47, size: 32, offset: 5152)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !115, file: !109, line: 335, baseType: !47, size: 32, offset: 5184)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !115, file: !109, line: 336, baseType: !267, size: 32, offset: 5216)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !31, line: 26, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !23, line: 42, baseType: !7)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !115, file: !109, line: 337, baseType: !267, size: 32, offset: 5248)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !115, file: !109, line: 338, baseType: !267, size: 32, offset: 5280)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !115, file: !109, line: 339, baseType: !267, size: 32, offset: 5312)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !115, file: !109, line: 340, baseType: !47, size: 32, offset: 5344)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !115, file: !109, line: 344, baseType: !47, size: 32, offset: 5376)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !115, file: !109, line: 356, baseType: !47, size: 32, offset: 5408)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !115, file: !109, line: 364, baseType: !47, size: 32, offset: 5440)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !115, file: !109, line: 367, baseType: !47, size: 32, offset: 5472)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !115, file: !109, line: 368, baseType: !47, size: 32, offset: 5504)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !115, file: !109, line: 369, baseType: !47, size: 32, offset: 5536)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !115, file: !109, line: 375, baseType: !280, size: 64, offset: 5568)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !174}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !110, file: !111, line: 386, baseType: !284, size: 8256, offset: 5632)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 8256, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 129)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !110, file: !111, line: 387, baseType: !47, size: 32, offset: 13888)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !110, file: !111, line: 388, baseType: !47, size: 32, offset: 13920)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !110, file: !111, line: 389, baseType: !47, size: 32, offset: 13952)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !110, file: !111, line: 390, baseType: !47, size: 32, offset: 13984)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !110, file: !111, line: 391, baseType: !47, size: 32, offset: 14016)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !110, file: !111, line: 402, baseType: !293, size: 576, offset: 14080)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !110, file: !111, line: 394, size: 576, elements: !294)
!294 = !{!295, !296, !297, !306, !307, !308}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !293, file: !111, line: 396, baseType: !47, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !293, file: !111, line: 397, baseType: !47, size: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !293, file: !111, line: 398, baseType: !298, size: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !109, line: 604, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !109, line: 593, size: 192, elements: !301)
!301 = !{!302, !303, !304, !305}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !300, file: !109, line: 595, baseType: !47, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !300, file: !109, line: 596, baseType: !47, size: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !300, file: !109, line: 599, baseType: !47, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !300, file: !109, line: 603, baseType: !46, size: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !293, file: !111, line: 399, baseType: !47, size: 32, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !293, file: !111, line: 400, baseType: !46, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !293, file: !111, line: 401, baseType: !309, size: 320, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !310, line: 56, baseType: !311)
!310 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !310, line: 47, size: 320, elements: !312)
!312 = !{!313, !314, !315, !316, !319, !320}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !311, file: !310, line: 49, baseType: !46, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !311, file: !310, line: 50, baseType: !46, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !311, file: !310, line: 51, baseType: !46, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !311, file: !310, line: 53, baseType: !317, size: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !318, line: 87, baseType: !24)
!318 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !311, file: !310, line: 54, baseType: !47, size: 32, offset: 256)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !311, file: !310, line: 55, baseType: !47, size: 32, offset: 288)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !110, file: !111, line: 404, baseType: !46, size: 64, offset: 14656)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !110, file: !111, line: 405, baseType: !47, size: 32, offset: 14720)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !110, file: !111, line: 410, baseType: !47, size: 32, offset: 14752)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !110, file: !111, line: 411, baseType: !47, size: 32, offset: 14784)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !110, file: !111, line: 413, baseType: !47, size: 32, offset: 14816)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !110, file: !111, line: 415, baseType: !47, size: 32, offset: 14848)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !110, file: !111, line: 416, baseType: !47, size: 32, offset: 14880)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !110, file: !111, line: 418, baseType: !47, size: 32, offset: 14912)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !110, file: !111, line: 419, baseType: !47, size: 32, offset: 14944)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !110, file: !111, line: 420, baseType: !47, size: 32, offset: 14976)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !110, file: !111, line: 421, baseType: !47, size: 32, offset: 15008)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !110, file: !111, line: 422, baseType: !47, size: 32, offset: 15040)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !110, file: !111, line: 424, baseType: !47, size: 32, offset: 15072)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !110, file: !111, line: 425, baseType: !47, size: 32, offset: 15104)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !110, file: !111, line: 427, baseType: !47, size: 32, offset: 15136)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !110, file: !111, line: 430, baseType: !337, size: 10400, offset: 15168)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 10400, elements: !424)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !339, line: 154, baseType: !340)
!339 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 52, size: 10400, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !359, !360, !361, !362, !363, !364, !365, !366, !367, !374, !375, !423}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !340, file: !339, line: 54, baseType: !47, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !340, file: !339, line: 56, baseType: !47, size: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !340, file: !339, line: 57, baseType: !47, size: 32, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !340, file: !339, line: 59, baseType: !47, size: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !340, file: !339, line: 60, baseType: !47, size: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !340, file: !339, line: 61, baseType: !47, size: 32, offset: 160)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !340, file: !339, line: 63, baseType: !47, size: 32, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !340, file: !339, line: 65, baseType: !47, size: 32, offset: 224)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !340, file: !339, line: 67, baseType: !47, size: 32, offset: 256)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !340, file: !339, line: 69, baseType: !47, size: 32, offset: 288)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !340, file: !339, line: 70, baseType: !47, size: 32, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !340, file: !339, line: 71, baseType: !47, size: 32, offset: 352)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !340, file: !339, line: 72, baseType: !47, size: 32, offset: 384)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !340, file: !339, line: 73, baseType: !356, size: 8192, offset: 416)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8192, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !340, file: !339, line: 75, baseType: !47, size: 32, offset: 8608)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !340, file: !339, line: 76, baseType: !47, size: 32, offset: 8640)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !340, file: !339, line: 77, baseType: !47, size: 32, offset: 8672)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !340, file: !339, line: 78, baseType: !47, size: 32, offset: 8704)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !340, file: !339, line: 79, baseType: !47, size: 32, offset: 8736)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !340, file: !339, line: 80, baseType: !47, size: 32, offset: 8768)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !340, file: !339, line: 81, baseType: !47, size: 32, offset: 8800)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !340, file: !339, line: 83, baseType: !47, size: 32, offset: 8832)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !340, file: !339, line: 90, baseType: !368, size: 128, offset: 8864)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !340, file: !339, line: 84, size: 128, elements: !369)
!369 = !{!370, !371, !372, !373}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !368, file: !339, line: 86, baseType: !47, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !368, file: !339, line: 87, baseType: !47, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !368, file: !339, line: 88, baseType: !47, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !368, file: !339, line: 89, baseType: !47, size: 32, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !340, file: !339, line: 92, baseType: !47, size: 32, offset: 8992)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !340, file: !339, line: 150, baseType: !376, size: 1344, offset: 9024)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !340, file: !339, line: 93, size: 1344, elements: !377)
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !414, !415, !416, !417, !418, !419, !420, !421, !422}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !376, file: !339, line: 95, baseType: !47, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !376, file: !339, line: 96, baseType: !47, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !376, file: !339, line: 97, baseType: !47, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !376, file: !339, line: 99, baseType: !47, size: 32, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !376, file: !339, line: 100, baseType: !47, size: 32, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !376, file: !339, line: 102, baseType: !47, size: 32, offset: 160)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !376, file: !339, line: 103, baseType: !47, size: 32, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !376, file: !339, line: 104, baseType: !47, size: 32, offset: 224)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !376, file: !339, line: 105, baseType: !47, size: 32, offset: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !376, file: !339, line: 106, baseType: !47, size: 32, offset: 288)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !376, file: !339, line: 107, baseType: !47, size: 32, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !376, file: !339, line: 108, baseType: !47, size: 32, offset: 352)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !376, file: !339, line: 110, baseType: !47, size: 32, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !376, file: !339, line: 111, baseType: !47, size: 32, offset: 416)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !376, file: !339, line: 112, baseType: !47, size: 32, offset: 448)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !376, file: !339, line: 114, baseType: !47, size: 32, offset: 480)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !376, file: !339, line: 115, baseType: !267, size: 32, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !376, file: !339, line: 116, baseType: !267, size: 32, offset: 544)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !376, file: !339, line: 117, baseType: !47, size: 32, offset: 576)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !376, file: !339, line: 119, baseType: !47, size: 32, offset: 608)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !376, file: !339, line: 120, baseType: !47, size: 32, offset: 640)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !376, file: !339, line: 137, baseType: !400, size: 384, offset: 672)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !376, file: !339, line: 122, size: 384, elements: !401)
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !400, file: !339, line: 124, baseType: !47, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !400, file: !339, line: 125, baseType: !47, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !400, file: !339, line: 126, baseType: !47, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !400, file: !339, line: 127, baseType: !47, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !400, file: !339, line: 128, baseType: !47, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !400, file: !339, line: 129, baseType: !47, size: 32, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !400, file: !339, line: 130, baseType: !47, size: 32, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !400, file: !339, line: 131, baseType: !47, size: 32, offset: 224)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !400, file: !339, line: 133, baseType: !47, size: 32, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !400, file: !339, line: 134, baseType: !47, size: 32, offset: 288)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !400, file: !339, line: 135, baseType: !47, size: 32, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !400, file: !339, line: 136, baseType: !47, size: 32, offset: 352)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !376, file: !339, line: 139, baseType: !47, size: 32, offset: 1056)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !376, file: !339, line: 140, baseType: !47, size: 32, offset: 1088)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !376, file: !339, line: 141, baseType: !47, size: 32, offset: 1120)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !376, file: !339, line: 142, baseType: !47, size: 32, offset: 1152)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !376, file: !339, line: 143, baseType: !47, size: 32, offset: 1184)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !376, file: !339, line: 144, baseType: !47, size: 32, offset: 1216)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !376, file: !339, line: 145, baseType: !47, size: 32, offset: 1248)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !376, file: !339, line: 146, baseType: !47, size: 32, offset: 1280)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !376, file: !339, line: 147, baseType: !47, size: 32, offset: 1312)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !340, file: !339, line: 152, baseType: !47, size: 32, offset: 10368)
!424 = !{!425}
!425 = !DISubrange(count: 1)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !110, file: !111, line: 431, baseType: !427, size: 64, offset: 25600)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !110, file: !111, line: 432, baseType: !429, size: 960, offset: 25664)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 960, elements: !424)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !339, line: 186, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 156, size: 960, elements: !432)
!432 = !{!433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !431, file: !339, line: 158, baseType: !47, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !431, file: !339, line: 159, baseType: !47, size: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !431, file: !339, line: 161, baseType: !47, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !431, file: !339, line: 163, baseType: !47, size: 32, offset: 96)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !431, file: !339, line: 164, baseType: !47, size: 32, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !431, file: !339, line: 166, baseType: !47, size: 32, offset: 160)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !431, file: !339, line: 167, baseType: !47, size: 32, offset: 192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !431, file: !339, line: 169, baseType: !47, size: 32, offset: 224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !431, file: !339, line: 170, baseType: !47, size: 32, offset: 256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !431, file: !339, line: 172, baseType: !47, size: 32, offset: 288)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !431, file: !339, line: 173, baseType: !47, size: 32, offset: 320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !431, file: !339, line: 175, baseType: !47, size: 32, offset: 352)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !431, file: !339, line: 177, baseType: !47, size: 32, offset: 384)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !431, file: !339, line: 178, baseType: !47, size: 32, offset: 416)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !431, file: !339, line: 179, baseType: !47, size: 32, offset: 448)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !431, file: !339, line: 181, baseType: !47, size: 32, offset: 480)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !431, file: !339, line: 183, baseType: !47, size: 32, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !431, file: !339, line: 184, baseType: !451, size: 384, offset: 576)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 384, elements: !67)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !110, file: !111, line: 433, baseType: !454, size: 64, offset: 26624)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !110, file: !111, line: 434, baseType: !47, size: 32, offset: 26688)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !110, file: !111, line: 437, baseType: !47, size: 32, offset: 26720)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !110, file: !111, line: 440, baseType: !458, size: 256, offset: 26752)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 256, elements: !461)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 512, elements: !34)
!461 = !{!462}
!462 = !DISubrange(count: 4)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !110, file: !111, line: 441, baseType: !464, size: 128, offset: 27008)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 128, elements: !215)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 2048, elements: !167)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !110, file: !111, line: 443, baseType: !458, size: 256, offset: 27136)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !110, file: !111, line: 444, baseType: !464, size: 128, offset: 27392)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !110, file: !111, line: 446, baseType: !470, size: 256, offset: 27520)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 256, elements: !461)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 256, elements: !34)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !31, line: 25, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !23, line: 40, baseType: !475)
!475 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !110, file: !111, line: 447, baseType: !477, size: 128, offset: 27776)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 128, elements: !215)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 1024, elements: !167)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !110, file: !111, line: 448, baseType: !470, size: 256, offset: 27904)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !110, file: !111, line: 449, baseType: !477, size: 128, offset: 28160)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !110, file: !111, line: 454, baseType: !483, size: 5888, offset: 28288)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 5888, elements: !485)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!485 = !{!486}
!486 = !DISubrange(count: 92)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !110, file: !111, line: 455, baseType: !488, size: 23552, offset: 34176)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 23552, elements: !489)
!489 = !{!486, !462}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !110, file: !111, line: 457, baseType: !452, size: 64, offset: 57728)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !110, file: !111, line: 460, baseType: !492, size: 53376, offset: 57856)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !111, line: 364, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 302, size: 53376, elements: !494)
!494 = !{!495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !523, !527, !528, !529, !535, !536, !537, !538, !539, !540, !541, !542}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !493, file: !111, line: 304, baseType: !427, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !493, file: !111, line: 305, baseType: !454, size: 64, offset: 64)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !493, file: !111, line: 307, baseType: !47, size: 32, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !493, file: !111, line: 308, baseType: !47, size: 32, offset: 160)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !493, file: !111, line: 309, baseType: !47, size: 32, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !493, file: !111, line: 311, baseType: !47, size: 32, offset: 224)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !493, file: !111, line: 313, baseType: !47, size: 32, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !493, file: !111, line: 315, baseType: !47, size: 32, offset: 288)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !493, file: !111, line: 316, baseType: !47, size: 32, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !493, file: !111, line: 317, baseType: !47, size: 32, offset: 352)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !493, file: !111, line: 319, baseType: !47, size: 32, offset: 384)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !493, file: !111, line: 321, baseType: !47, size: 32, offset: 416)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !493, file: !111, line: 322, baseType: !47, size: 32, offset: 448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !493, file: !111, line: 324, baseType: !214, size: 64, offset: 480)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !493, file: !111, line: 325, baseType: !47, size: 32, offset: 544)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !493, file: !111, line: 327, baseType: !47, size: 32, offset: 576)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !493, file: !111, line: 329, baseType: !47, size: 32, offset: 608)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !493, file: !111, line: 330, baseType: !47, size: 32, offset: 640)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !493, file: !111, line: 331, baseType: !47, size: 32, offset: 672)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !493, file: !111, line: 333, baseType: !47, size: 32, offset: 704)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !493, file: !111, line: 334, baseType: !47, size: 32, offset: 736)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !493, file: !111, line: 339, baseType: !517, size: 2048, offset: 768)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 2048, elements: !522)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !493, file: !111, line: 335, size: 64, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !518, file: !111, line: 337, baseType: !47, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !518, file: !111, line: 338, baseType: !47, size: 32, offset: 32)
!522 = !{!216, !35}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !493, file: !111, line: 342, baseType: !524, size: 49152, align: 128, offset: 2816)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 49152, align: 128, elements: !525)
!525 = !{!526, !73}
!526 = !DISubrange(count: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !493, file: !111, line: 344, baseType: !47, size: 32, offset: 51968)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !493, file: !111, line: 345, baseType: !47, size: 32, offset: 52000)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !493, file: !111, line: 350, baseType: !530, size: 1024, offset: 52032)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 1024, elements: !34)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !493, file: !111, line: 346, size: 64, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !531, file: !111, line: 348, baseType: !47, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !531, file: !111, line: 349, baseType: !47, size: 32, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !493, file: !111, line: 352, baseType: !47, size: 32, offset: 53056)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !493, file: !111, line: 354, baseType: !47, size: 32, offset: 53088)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !493, file: !111, line: 355, baseType: !47, size: 32, offset: 53120)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !493, file: !111, line: 356, baseType: !47, size: 32, offset: 53152)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !493, file: !111, line: 357, baseType: !47, size: 32, offset: 53184)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !493, file: !111, line: 360, baseType: !47, size: 32, offset: 53216)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !493, file: !111, line: 361, baseType: !47, size: 32, offset: 53248)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !493, file: !111, line: 362, baseType: !47, size: 32, offset: 53280)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !110, file: !111, line: 463, baseType: !544, size: 4096, offset: 111232)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !545, line: 46, baseType: !546)
!545 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !545, line: 27, size: 4096, elements: !547)
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555, !556}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !546, file: !545, line: 30, baseType: !47, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !546, file: !545, line: 31, baseType: !47, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !546, file: !545, line: 34, baseType: !47, size: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !546, file: !545, line: 35, baseType: !47, size: 32, offset: 96)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !546, file: !545, line: 37, baseType: !46, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !546, file: !545, line: 38, baseType: !46, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !546, file: !545, line: 39, baseType: !46, size: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !546, file: !545, line: 42, baseType: !47, size: 32, align: 128, offset: 384)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !546, file: !545, line: 45, baseType: !557, size: 3680, offset: 416)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 3680, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 460)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !110, file: !111, line: 494, baseType: !561, size: 2112, offset: 115328)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !110, file: !111, line: 465, size: 2112, elements: !562)
!562 = !{!563, !701, !703, !704, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !717, !718, !719, !720}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !561, file: !111, line: 468, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !567, line: 146, baseType: !568)
!567 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !567, line: 31, size: 125056, elements: !569)
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !597, !598, !599, !600, !601, !602, !604, !606, !607, !608, !609, !610, !613, !615, !616, !618, !623, !624, !628, !629, !633, !637, !640, !642, !643, !645, !646, !648, !649, !650, !653, !655, !656, !657, !659, !660, !661, !662, !663, !664, !665, !666, !668, !669, !673, !682, !686, !688, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !568, file: !567, line: 34, baseType: !47, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !568, file: !567, line: 35, baseType: !47, size: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !568, file: !567, line: 36, baseType: !47, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !568, file: !567, line: 37, baseType: !20, size: 64, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !568, file: !567, line: 38, baseType: !20, size: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !568, file: !567, line: 39, baseType: !47, size: 32, offset: 256)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !568, file: !567, line: 40, baseType: !47, size: 32, offset: 288)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !568, file: !567, line: 41, baseType: !47, size: 32, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !568, file: !567, line: 42, baseType: !47, size: 32, offset: 352)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !568, file: !567, line: 43, baseType: !580, size: 64, offset: 384)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !568, file: !567, line: 45, baseType: !47, size: 32, offset: 448)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !568, file: !567, line: 46, baseType: !47, size: 32, offset: 480)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !568, file: !567, line: 47, baseType: !47, size: 32, offset: 512)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !568, file: !567, line: 48, baseType: !47, size: 32, offset: 544)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !568, file: !567, line: 49, baseType: !47, size: 32, offset: 576)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !568, file: !567, line: 50, baseType: !47, size: 32, offset: 608)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !568, file: !567, line: 51, baseType: !47, size: 32, offset: 640)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !568, file: !567, line: 52, baseType: !30, size: 8, offset: 672)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !568, file: !567, line: 53, baseType: !30, size: 8, offset: 680)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !568, file: !567, line: 54, baseType: !30, size: 8, offset: 688)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !568, file: !567, line: 55, baseType: !210, size: 32, offset: 704)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !568, file: !567, line: 56, baseType: !210, size: 32, offset: 736)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !568, file: !567, line: 57, baseType: !47, size: 32, offset: 768)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !568, file: !567, line: 60, baseType: !47, size: 32, offset: 800)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !568, file: !567, line: 61, baseType: !596, size: 96, offset: 832)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 96, elements: !72)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !568, file: !567, line: 62, baseType: !596, size: 96, offset: 928)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !568, file: !567, line: 63, baseType: !596, size: 96, offset: 1024)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !568, file: !567, line: 64, baseType: !47, size: 32, offset: 1120)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !568, file: !567, line: 65, baseType: !47, size: 32, offset: 1152)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !568, file: !567, line: 66, baseType: !47, size: 32, offset: 1184)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !568, file: !567, line: 67, baseType: !603, size: 192, offset: 1216)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 192, elements: !72)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !568, file: !567, line: 68, baseType: !605, size: 256, offset: 1408)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 256, elements: !461)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !568, file: !567, line: 69, baseType: !605, size: 256, offset: 1664)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !568, file: !567, line: 70, baseType: !484, size: 64, offset: 1920)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !568, file: !567, line: 74, baseType: !605, size: 256, offset: 1984)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !568, file: !567, line: 75, baseType: !605, size: 256, offset: 2240)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !568, file: !567, line: 77, baseType: !611, size: 24576, align: 128, offset: 2560)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 24576, align: 128, elements: !612)
!612 = !{!35, !73}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !568, file: !567, line: 78, baseType: !614, size: 1024, offset: 27136)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 1024, elements: !34)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !568, file: !567, line: 79, baseType: !47, size: 32, offset: 28160)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !568, file: !567, line: 80, baseType: !617, size: 64, offset: 28224)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !568, file: !567, line: 83, baseType: !619, size: 64, offset: 28288)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !21, line: 24, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !23, line: 37, baseType: !622)
!622 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !568, file: !567, line: 84, baseType: !46, size: 64, offset: 28352)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !568, file: !567, line: 85, baseType: !625, size: 128, offset: 28416)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 128, elements: !215)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 32, elements: !215)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !568, file: !567, line: 86, baseType: !626, size: 64, offset: 28544)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !568, file: !567, line: 87, baseType: !630, size: 2176, offset: 28608)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 2176, elements: !631)
!631 = !{!216, !632}
!632 = !DISubrange(count: 17)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !568, file: !567, line: 92, baseType: !634, size: 20736, offset: 30784)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 20736, elements: !635)
!635 = !{!636, !636}
!636 = !DISubrange(count: 18)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !568, file: !567, line: 96, baseType: !638, size: 2176, offset: 51520)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 2176, elements: !631)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !568, file: !567, line: 97, baseType: !641, size: 128, offset: 53696)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 128, elements: !215)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !568, file: !567, line: 98, baseType: !214, size: 64, offset: 53824)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !568, file: !567, line: 99, baseType: !644, size: 1024, offset: 53888)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 1024, elements: !522)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !568, file: !567, line: 100, baseType: !627, size: 32, offset: 54912)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !568, file: !567, line: 105, baseType: !647, size: 10368, offset: 54944)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 10368, elements: !635)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !568, file: !567, line: 106, baseType: !647, size: 10368, offset: 65312)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !568, file: !567, line: 107, baseType: !47, size: 32, offset: 75680)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !568, file: !567, line: 108, baseType: !651, size: 576, offset: 75712)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 576, elements: !652)
!652 = !{!636}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !568, file: !567, line: 109, baseType: !654, size: 20736, offset: 76288)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 20736, elements: !635)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !568, file: !567, line: 110, baseType: !639, size: 64, offset: 97024)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !568, file: !567, line: 111, baseType: !639, size: 64, offset: 97088)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !568, file: !567, line: 112, baseType: !658, size: 64, offset: 97152)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !568, file: !567, line: 113, baseType: !658, size: 64, offset: 97216)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !568, file: !567, line: 114, baseType: !658, size: 64, offset: 97280)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !568, file: !567, line: 115, baseType: !47, size: 32, offset: 97344)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !568, file: !567, line: 116, baseType: !484, size: 64, offset: 97408)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !568, file: !567, line: 117, baseType: !484, size: 64, offset: 97472)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !568, file: !567, line: 118, baseType: !484, size: 64, offset: 97536)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !568, file: !567, line: 119, baseType: !47, size: 32, offset: 97600)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !568, file: !567, line: 120, baseType: !667, size: 576, offset: 97632)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 576, elements: !652)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !568, file: !567, line: 121, baseType: !267, size: 32, offset: 98208)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !568, file: !567, line: 122, baseType: !670, size: 64, offset: 98240)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !31, line: 27, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !23, line: 45, baseType: !672)
!672 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !568, file: !567, line: 125, baseType: !674, size: 256, offset: 98304)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !109, line: 503, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !109, line: 496, size: 256, elements: !676)
!676 = !{!677, !679, !680, !681}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !675, file: !109, line: 498, baseType: !678, size: 64)
!678 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !675, file: !109, line: 499, baseType: !678, size: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !675, file: !109, line: 500, baseType: !678, size: 64, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !675, file: !109, line: 502, baseType: !678, size: 64, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !568, file: !567, line: 128, baseType: !683, size: 2008, offset: 98560)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 2008, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 251)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !568, file: !567, line: 129, baseType: !687, size: 8032, offset: 100576)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8032, elements: !684)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !568, file: !567, line: 130, baseType: !689, size: 16064, offset: 108608)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 16064, elements: !684)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !568, file: !567, line: 131, baseType: !47, size: 32, offset: 124672)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !568, file: !567, line: 132, baseType: !47, size: 32, offset: 124704)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !568, file: !567, line: 135, baseType: !47, size: 32, offset: 124736)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !568, file: !567, line: 136, baseType: !47, size: 32, offset: 124768)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !568, file: !567, line: 137, baseType: !47, size: 32, offset: 124800)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !568, file: !567, line: 138, baseType: !47, size: 32, offset: 124832)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !568, file: !567, line: 139, baseType: !47, size: 32, offset: 124864)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !568, file: !567, line: 142, baseType: !210, size: 32, offset: 124896)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !568, file: !567, line: 143, baseType: !47, size: 32, offset: 124928)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !568, file: !567, line: 144, baseType: !47, size: 32, offset: 124960)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !568, file: !567, line: 145, baseType: !47, size: 32, offset: 124992)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !561, file: !111, line: 470, baseType: !702, size: 128, offset: 64)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 128, elements: !215)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !561, file: !111, line: 473, baseType: !564, size: 64, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !561, file: !111, line: 476, baseType: !705, size: 1152, offset: 256)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 1152, elements: !652)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !561, file: !111, line: 478, baseType: !47, size: 32, offset: 1408)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !561, file: !111, line: 480, baseType: !47, size: 32, offset: 1440)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !561, file: !111, line: 482, baseType: !47, size: 32, offset: 1472)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !561, file: !111, line: 483, baseType: !47, size: 32, offset: 1504)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !561, file: !111, line: 484, baseType: !47, size: 32, offset: 1536)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !561, file: !111, line: 485, baseType: !47, size: 32, offset: 1568)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !561, file: !111, line: 486, baseType: !47, size: 32, offset: 1600)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !561, file: !111, line: 487, baseType: !20, size: 64, offset: 1664)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !561, file: !111, line: 488, baseType: !20, size: 64, offset: 1728)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !561, file: !111, line: 489, baseType: !716, size: 128, offset: 1792)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !215)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !561, file: !111, line: 490, baseType: !20, size: 64, offset: 1920)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !561, file: !111, line: 491, baseType: !20, size: 64, offset: 1984)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !561, file: !111, line: 492, baseType: !47, size: 32, offset: 2048)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !561, file: !111, line: 493, baseType: !47, size: 32, offset: 2080)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !110, file: !111, line: 497, baseType: !565, size: 64, offset: 117440)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !110, file: !111, line: 500, baseType: !565, size: 64, offset: 117504)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !110, file: !111, line: 503, baseType: !47, size: 32, offset: 117568)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !110, file: !111, line: 504, baseType: !725, size: 1216, offset: 117632)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 1216, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 19)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !110, file: !111, line: 505, baseType: !47, size: 32, offset: 118848)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !110, file: !111, line: 506, baseType: !725, size: 1216, offset: 118912)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !110, file: !111, line: 507, baseType: !214, size: 64, offset: 120128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !110, file: !111, line: 510, baseType: !47, size: 32, offset: 120192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !110, file: !111, line: 511, baseType: !47, size: 32, offset: 120224)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !110, file: !111, line: 512, baseType: !20, size: 64, offset: 120256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !110, file: !111, line: 522, baseType: !735, size: 10624, offset: 120320)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !110, file: !111, line: 515, size: 10624, elements: !736)
!736 = !{!737, !739, !742, !745}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !735, file: !111, line: 517, baseType: !738, size: 256, align: 128)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 256, elements: !34)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !735, file: !111, line: 518, baseType: !740, size: 128, align: 128, offset: 256)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 128, elements: !741)
!741 = !{!216, !462}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !735, file: !111, line: 520, baseType: !743, size: 4096, align: 128, offset: 384)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 4096, elements: !744)
!744 = !{!462, !168}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !735, file: !111, line: 521, baseType: !746, size: 6144, align: 128, offset: 4480)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 6144, elements: !747)
!747 = !{!748, !35}
!748 = !DISubrange(count: 24)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !110, file: !111, line: 732, baseType: !750, size: 82688, offset: 130944)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !110, file: !111, line: 525, size: 82688, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !779, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !797, !800, !804, !805, !806, !811, !812, !815, !816, !817, !818, !819, !820, !821, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !881, !912, !913, !914, !915, !916, !917, !918, !919, !920, !923, !924, !925, !928, !931, !933, !936, !938, !939}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !750, file: !111, line: 527, baseType: !47, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !750, file: !111, line: 530, baseType: !47, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !750, file: !111, line: 531, baseType: !47, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !750, file: !111, line: 532, baseType: !47, size: 32, offset: 96)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !750, file: !111, line: 535, baseType: !47, size: 32, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !750, file: !111, line: 536, baseType: !47, size: 32, offset: 160)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !750, file: !111, line: 537, baseType: !47, size: 32, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !750, file: !111, line: 538, baseType: !47, size: 32, offset: 224)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !750, file: !111, line: 539, baseType: !47, size: 32, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !750, file: !111, line: 542, baseType: !47, size: 32, offset: 288)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !750, file: !111, line: 543, baseType: !47, size: 32, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !750, file: !111, line: 544, baseType: !47, size: 32, offset: 352)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !750, file: !111, line: 545, baseType: !47, size: 32, offset: 384)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !750, file: !111, line: 546, baseType: !47, size: 32, offset: 416)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !750, file: !111, line: 547, baseType: !47, size: 32, offset: 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !750, file: !111, line: 548, baseType: !47, size: 32, offset: 480)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !750, file: !111, line: 549, baseType: !47, size: 32, offset: 512)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !750, file: !111, line: 551, baseType: !47, size: 32, offset: 544)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !750, file: !111, line: 554, baseType: !214, size: 64, offset: 576)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !750, file: !111, line: 555, baseType: !214, size: 64, offset: 640)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !750, file: !111, line: 558, baseType: !214, size: 64, offset: 704)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !750, file: !111, line: 559, baseType: !214, size: 64, offset: 768)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !750, file: !111, line: 561, baseType: !214, size: 64, offset: 832)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !750, file: !111, line: 562, baseType: !214, size: 64, offset: 896)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !750, file: !111, line: 565, baseType: !7, size: 32, offset: 960)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !750, file: !111, line: 566, baseType: !778, size: 128, offset: 992)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !461)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !750, file: !111, line: 567, baseType: !780, size: 512, offset: 1120)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !34)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !750, file: !111, line: 568, baseType: !7, size: 32, offset: 1632)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !750, file: !111, line: 569, baseType: !7, size: 32, offset: 1664)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !750, file: !111, line: 570, baseType: !47, size: 32, offset: 1696)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !750, file: !111, line: 571, baseType: !47, size: 32, offset: 1728)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !750, file: !111, line: 572, baseType: !47, size: 32, offset: 1760)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !750, file: !111, line: 573, baseType: !47, size: 32, offset: 1792)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !750, file: !111, line: 574, baseType: !47, size: 32, offset: 1824)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !750, file: !111, line: 575, baseType: !47, size: 32, offset: 1856)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !750, file: !111, line: 576, baseType: !47, size: 32, offset: 1888)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !750, file: !111, line: 577, baseType: !47, size: 32, offset: 1920)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !750, file: !111, line: 578, baseType: !47, size: 32, offset: 1952)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !750, file: !111, line: 585, baseType: !619, size: 64, offset: 1984)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !750, file: !111, line: 586, baseType: !46, size: 64, offset: 2048)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !750, file: !111, line: 587, baseType: !619, size: 64, offset: 2112)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !750, file: !111, line: 588, baseType: !796, size: 64, offset: 2176)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !750, file: !111, line: 589, baseType: !798, size: 64, offset: 2240)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !620, size: 64, elements: !57)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !750, file: !111, line: 591, baseType: !801, size: 64, offset: 2304)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 192, elements: !803)
!803 = !{!748}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !750, file: !111, line: 592, baseType: !619, size: 64, offset: 2368)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !750, file: !111, line: 593, baseType: !625, size: 128, offset: 2432)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !750, file: !111, line: 594, baseType: !807, size: 128, offset: 2560)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, size: 128, elements: !215)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 128, elements: !810)
!810 = !{!58, !216}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !750, file: !111, line: 595, baseType: !641, size: 128, offset: 2688)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !750, file: !111, line: 596, baseType: !813, size: 4096, offset: 2816)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 4096, elements: !814)
!814 = !{!216, !526}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !750, file: !111, line: 597, baseType: !619, size: 64, offset: 6912)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !750, file: !111, line: 598, baseType: !619, size: 64, offset: 6976)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !750, file: !111, line: 599, baseType: !484, size: 64, offset: 7040)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !750, file: !111, line: 603, baseType: !614, size: 1024, offset: 7104)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !750, file: !111, line: 606, baseType: !47, size: 32, offset: 8128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !750, file: !111, line: 607, baseType: !47, size: 32, offset: 8160)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !750, file: !111, line: 608, baseType: !822, size: 32, align: 32, offset: 8192)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 32, elements: !461)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !750, file: !111, line: 609, baseType: !47, size: 32, offset: 8224)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !750, file: !111, line: 611, baseType: !47, size: 32, offset: 8256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !750, file: !111, line: 612, baseType: !47, size: 32, offset: 8288)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !750, file: !111, line: 614, baseType: !47, size: 32, offset: 8320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !750, file: !111, line: 615, baseType: !47, size: 32, offset: 8352)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !750, file: !111, line: 621, baseType: !47, size: 32, offset: 8384)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !750, file: !111, line: 624, baseType: !47, size: 32, offset: 8416)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !750, file: !111, line: 626, baseType: !47, size: 32, offset: 8448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !750, file: !111, line: 627, baseType: !47, size: 32, offset: 8480)
