; ModuleID = 'x264_src/common/mvpred.c'
source_filename = "x264_src/common/mvpred.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@x264_scan8 = internal unnamed_addr constant [27 x i32] [i32 12, i32 13, i32 20, i32 21, i32 14, i32 15, i32 22, i32 23, i32 28, i32 29, i32 36, i32 37, i32 30, i32 31, i32 38, i32 39, i32 9, i32 10, i32 17, i32 18, i32 33, i32 34, i32 41, i32 42, i32 44, i32 46, i32 47], align 16, !dbg !0

; Function Attrs: mustprogress nofree norecurse nosync nounwind willreturn memory(argmem: readwrite) uwtable
define dso_local void @x264_mb_predict_mv(ptr nocapture noundef readonly %h, i32 noundef %i_list, i32 noundef %idx, i32 noundef %i_width, ptr nocapture noundef writeonly %mvp) local_unnamed_addr #0 !dbg !134 {
entry:
    #dbg_value(ptr %h, !1425, !DIExpression(), !1442)
    #dbg_value(i32 %i_list, !1426, !DIExpression(), !1442)
    #dbg_value(i32 %idx, !1427, !DIExpression(), !1442)
    #dbg_value(i32 %i_width, !1428, !DIExpression(), !1442)
    #dbg_value(ptr %mvp, !1429, !DIExpression(), !1442)
  %idxprom = sext i32 %idx to i64, !dbg !1443
  %arrayidx = getelementptr inbounds [27 x i32], ptr @x264_scan8, i64 0, i64 %idxprom, !dbg !1443
  %0 = load i32, ptr %arrayidx, align 4, !dbg !1443
    #dbg_value(i32 %0, !1430, !DIExpression(), !1442)
  %ref = getelementptr inbounds i8, ptr %h, i64 25120, !dbg !1444
  %idxprom1 = sext i32 %i_list to i64, !dbg !1445

!82 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !68, file: !28, line: 89, baseType: !83, size: 32)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 32, elements: !87)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !72, line: 24, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !74, line: 38, baseType: !86)
!86 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!87 = !{!88}
!88 = !DISubrange(count: 4)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 32, elements: !80)
!92 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !94, line: 25, baseType: !95)
!94 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !74, line: 39, baseType: !96)
!96 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union16_t", file: !28, line: 88, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !28, line: 88, size: 16, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !99, file: !28, line: 88, baseType: !77, size: 16)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !99, file: !28, line: 88, baseType: !103, size: 16)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 16, elements: !80)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union64_t", file: !28, line: 90, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !28, line: 90, size: 64, elements: !107)
!107 = !{!108, !112, !114, !116}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !106, file: !28, line: 90, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !72, line: 27, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !74, line: 45, baseType: !111)
!111 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !106, file: !28, line: 90, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 64, elements: !80)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !106, file: !28, line: 90, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 64, elements: !87)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !106, file: !28, line: 90, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 64, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 8)
!120 = !{!0}
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !122, size: 864, elements: !124)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !{!125}
!125 = !DISubrange(count: 27)
!126 = !{i32 7, !"Dwarf Version", i32 5}
!127 = !{i32 2, !"Debug Info Version", i32 3}
!128 = !{i32 1, !"wchar_size", i32 4}
!129 = !{i32 8, !"PIC Level", i32 2}
!130 = !{i32 7, !"PIE Level", i32 2}
!131 = !{i32 7, !"uwtable", i32 2}
!132 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!133 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!134 = distinct !DISubprogram(name: "x264_mb_predict_mv", scope: !3, file: !3, line: 27, type: !135, scopeLine: 28, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1424)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !137, !123, !123, !123, !843}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !139, line: 46, baseType: !140)
!139 = !DIFile(filename: "x264_src/x264.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !28, line: 381, size: 266752, elements: !141)
!141 = !{!142, !309, !313, !314, !315, !316, !317, !318, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !454, !456, !484, !486, !487, !488, !492, !496, !497, !498, !502, !506, !507, !508, !513, !516, !517, !590, !607, !768, !769, !770, !771, !775, !776, !777, !778, !779, !780, !781, !796, !989, !993, !1054, !1057, !1059, !1060, !1061, !1064, !1069, !1078, !1079, !1087, !1089, !1094, !1170, !1256, !1300, !1322, !1371, !1400}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !140, file: !28, line: 384, baseType: !143, size: 5632)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !139, line: 376, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !139, line: 176, size: 5632, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !189, !193, !194, !195, !196, !200, !201, !214, !215, !216, !217, !218, !247, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !144, file: !139, line: 179, baseType: !7, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !144, file: !139, line: 180, baseType: !123, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !144, file: !139, line: 181, baseType: !123, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !144, file: !139, line: 182, baseType: !123, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !144, file: !139, line: 183, baseType: !123, size: 32, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !144, file: !139, line: 186, baseType: !123, size: 32, offset: 160)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !144, file: !139, line: 187, baseType: !123, size: 32, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !144, file: !139, line: 188, baseType: !123, size: 32, offset: 224)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !144, file: !139, line: 189, baseType: !123, size: 32, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !144, file: !139, line: 190, baseType: !123, size: 32, offset: 288)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !144, file: !139, line: 198, baseType: !123, size: 32, offset: 320)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !144, file: !139, line: 215, baseType: !158, size: 288, offset: 352)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !144, file: !139, line: 200, size: 288, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !158, file: !139, line: 203, baseType: !123, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !158, file: !139, line: 204, baseType: !123, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !158, file: !139, line: 206, baseType: !123, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !158, file: !139, line: 209, baseType: !123, size: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !158, file: !139, line: 210, baseType: !123, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !158, file: !139, line: 211, baseType: !123, size: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !158, file: !139, line: 212, baseType: !123, size: 32, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !158, file: !139, line: 213, baseType: !123, size: 32, offset: 224)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !158, file: !139, line: 214, baseType: !123, size: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !144, file: !139, line: 218, baseType: !123, size: 32, offset: 640)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !144, file: !139, line: 219, baseType: !123, size: 32, offset: 672)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !144, file: !139, line: 220, baseType: !123, size: 32, offset: 704)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !144, file: !139, line: 221, baseType: !123, size: 32, offset: 736)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !144, file: !139, line: 222, baseType: !123, size: 32, offset: 768)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !144, file: !139, line: 224, baseType: !123, size: 32, offset: 800)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !144, file: !139, line: 225, baseType: !123, size: 32, offset: 832)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !144, file: !139, line: 226, baseType: !123, size: 32, offset: 864)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !144, file: !139, line: 227, baseType: !123, size: 32, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !144, file: !139, line: 229, baseType: !123, size: 32, offset: 928)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !144, file: !139, line: 230, baseType: !123, size: 32, offset: 960)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !144, file: !139, line: 231, baseType: !123, size: 32, offset: 992)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !144, file: !139, line: 233, baseType: !123, size: 32, offset: 1024)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !144, file: !139, line: 234, baseType: !123, size: 32, offset: 1056)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !144, file: !139, line: 236, baseType: !123, size: 32, offset: 1088)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !144, file: !139, line: 237, baseType: !123, size: 32, offset: 1120)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !144, file: !139, line: 239, baseType: !123, size: 32, offset: 1152)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !144, file: !139, line: 240, baseType: !187, size: 64, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !144, file: !139, line: 241, baseType: !190, size: 128, offset: 1280)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 16)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !144, file: !139, line: 242, baseType: !190, size: 128, offset: 1408)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !144, file: !139, line: 243, baseType: !190, size: 128, offset: 1536)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !144, file: !139, line: 244, baseType: !190, size: 128, offset: 1664)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !144, file: !139, line: 245, baseType: !197, size: 512, offset: 1792)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 512, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !144, file: !139, line: 246, baseType: !197, size: 512, offset: 2304)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !144, file: !139, line: 249, baseType: !202, size: 64, offset: 2816)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !89, !123, !205, !207}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !209)
!209 = !{!210, !211, !212, !213}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !208, file: !3, baseType: !7, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !208, file: !3, baseType: !7, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !208, file: !3, baseType: !89, size: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !208, file: !3, baseType: !89, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !144, file: !139, line: 250, baseType: !89, size: 64, offset: 2880)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !144, file: !139, line: 251, baseType: !123, size: 32, offset: 2944)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !144, file: !139, line: 252, baseType: !123, size: 32, offset: 2976)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !144, file: !139, line: 253, baseType: !187, size: 64, offset: 3008)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !144, file: !139, line: 287, baseType: !219, size: 800, offset: 3072)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !144, file: !139, line: 256, size: 800, elements: !220)
!220 = !{!221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !241, !242, !243, !245, !246}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !219, file: !139, line: 258, baseType: !7, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !219, file: !139, line: 259, baseType: !7, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !219, file: !139, line: 261, baseType: !123, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !219, file: !139, line: 262, baseType: !123, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !219, file: !139, line: 263, baseType: !123, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !219, file: !139, line: 264, baseType: !123, size: 32, offset: 160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !219, file: !139, line: 265, baseType: !123, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !219, file: !139, line: 267, baseType: !123, size: 32, offset: 224)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !219, file: !139, line: 268, baseType: !123, size: 32, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !219, file: !139, line: 269, baseType: !123, size: 32, offset: 288)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !219, file: !139, line: 270, baseType: !123, size: 32, offset: 320)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !219, file: !139, line: 271, baseType: !123, size: 32, offset: 352)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !219, file: !139, line: 272, baseType: !123, size: 32, offset: 384)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !219, file: !139, line: 273, baseType: !123, size: 32, offset: 416)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !219, file: !139, line: 274, baseType: !123, size: 32, offset: 448)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !219, file: !139, line: 275, baseType: !123, size: 32, offset: 480)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !219, file: !139, line: 276, baseType: !123, size: 32, offset: 512)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !219, file: !139, line: 277, baseType: !123, size: 32, offset: 544)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !219, file: !139, line: 278, baseType: !240, size: 32, offset: 576)
!240 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !219, file: !139, line: 279, baseType: !240, size: 32, offset: 608)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !219, file: !139, line: 280, baseType: !123, size: 32, offset: 640)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !219, file: !139, line: 283, baseType: !244, size: 64, offset: 672)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 64, elements: !80)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !219, file: !139, line: 285, baseType: !123, size: 32, offset: 736)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !219, file: !139, line: 286, baseType: !123, size: 32, offset: 768)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !144, file: !139, line: 327, baseType: !248, size: 1152, offset: 3904)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !144, file: !139, line: 290, size: 1152, elements: !249)
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !287, !288}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !248, file: !139, line: 292, baseType: !123, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !248, file: !139, line: 294, baseType: !123, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !248, file: !139, line: 295, baseType: !123, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !248, file: !139, line: 296, baseType: !123, size: 32, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !248, file: !139, line: 297, baseType: !123, size: 32, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !248, file: !139, line: 299, baseType: !123, size: 32, offset: 160)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !248, file: !139, line: 300, baseType: !240, size: 32, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !248, file: !139, line: 301, baseType: !240, size: 32, offset: 224)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !248, file: !139, line: 302, baseType: !240, size: 32, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !248, file: !139, line: 303, baseType: !123, size: 32, offset: 288)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !248, file: !139, line: 304, baseType: !123, size: 32, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !248, file: !139, line: 305, baseType: !240, size: 32, offset: 352)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !248, file: !139, line: 306, baseType: !240, size: 32, offset: 384)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !248, file: !139, line: 307, baseType: !240, size: 32, offset: 416)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !248, file: !139, line: 309, baseType: !123, size: 32, offset: 448)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !248, file: !139, line: 310, baseType: !240, size: 32, offset: 480)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !248, file: !139, line: 311, baseType: !123, size: 32, offset: 512)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !248, file: !139, line: 312, baseType: !123, size: 32, offset: 544)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !248, file: !139, line: 315, baseType: !123, size: 32, offset: 576)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !248, file: !139, line: 316, baseType: !187, size: 64, offset: 640)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !248, file: !139, line: 317, baseType: !123, size: 32, offset: 704)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !248, file: !139, line: 318, baseType: !187, size: 64, offset: 768)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !248, file: !139, line: 321, baseType: !240, size: 32, offset: 832)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !248, file: !139, line: 322, baseType: !240, size: 32, offset: 864)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !248, file: !139, line: 323, baseType: !240, size: 32, offset: 896)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !248, file: !139, line: 324, baseType: !276, size: 64, offset: 960)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !139, line: 174, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 167, size: 256, elements: !279)
!279 = !{!280, !281, !282, !283, !284, !285}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !278, file: !139, line: 169, baseType: !123, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !278, file: !139, line: 169, baseType: !123, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !278, file: !139, line: 170, baseType: !123, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !278, file: !139, line: 171, baseType: !123, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !278, file: !139, line: 172, baseType: !240, size: 32, offset: 128)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !278, file: !139, line: 173, baseType: !286, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !248, file: !139, line: 325, baseType: !123, size: 32, offset: 1024)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !248, file: !139, line: 326, baseType: !187, size: 64, offset: 1088)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !144, file: !139, line: 330, baseType: !123, size: 32, offset: 5056)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !144, file: !139, line: 331, baseType: !123, size: 32, offset: 5088)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !144, file: !139, line: 332, baseType: !123, size: 32, offset: 5120)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !144, file: !139, line: 334, baseType: !123, size: 32, offset: 5152)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !144, file: !139, line: 335, baseType: !123, size: 32, offset: 5184)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !144, file: !139, line: 336, baseType: !71, size: 32, offset: 5216)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !144, file: !139, line: 337, baseType: !71, size: 32, offset: 5248)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !144, file: !139, line: 338, baseType: !71, size: 32, offset: 5280)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !144, file: !139, line: 339, baseType: !71, size: 32, offset: 5312)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !144, file: !139, line: 340, baseType: !123, size: 32, offset: 5344)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !144, file: !139, line: 344, baseType: !123, size: 32, offset: 5376)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !144, file: !139, line: 356, baseType: !123, size: 32, offset: 5408)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !144, file: !139, line: 364, baseType: !123, size: 32, offset: 5440)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !144, file: !139, line: 367, baseType: !123, size: 32, offset: 5472)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !144, file: !139, line: 368, baseType: !123, size: 32, offset: 5504)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !144, file: !139, line: 369, baseType: !123, size: 32, offset: 5536)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !144, file: !139, line: 375, baseType: !306, size: 64, offset: 5568)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = !DISubroutineType(types: !308)
!308 = !{null, !89}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !140, file: !28, line: 386, baseType: !310, size: 8256, offset: 5632)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 8256, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 129)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !140, file: !28, line: 387, baseType: !123, size: 32, offset: 13888)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !140, file: !28, line: 388, baseType: !123, size: 32, offset: 13920)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !140, file: !28, line: 389, baseType: !123, size: 32, offset: 13952)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !140, file: !28, line: 390, baseType: !123, size: 32, offset: 13984)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !140, file: !28, line: 391, baseType: !123, size: 32, offset: 14016)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !140, file: !28, line: 402, baseType: !319, size: 576, offset: 14080)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !28, line: 394, size: 576, elements: !320)
!320 = !{!321, !322, !323, !333, !334, !335}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !319, file: !28, line: 396, baseType: !123, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !319, file: !28, line: 397, baseType: !123, size: 32, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !319, file: !28, line: 398, baseType: !324, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !139, line: 604, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 593, size: 192, elements: !327)
!327 = !{!328, !329, !330, !331}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !326, file: !139, line: 595, baseType: !123, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !326, file: !139, line: 596, baseType: !123, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !326, file: !139, line: 599, baseType: !123, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !326, file: !139, line: 603, baseType: !332, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !319, file: !28, line: 399, baseType: !123, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !319, file: !28, line: 400, baseType: !332, size: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !319, file: !28, line: 401, baseType: !336, size: 320, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !337, line: 56, baseType: !338)
!337 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !337, line: 47, size: 320, elements: !339)
!339 = !{!340, !341, !342, !343, !347, !348}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !338, file: !337, line: 49, baseType: !332, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !338, file: !337, line: 50, baseType: !332, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !338, file: !337, line: 51, baseType: !332, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !338, file: !337, line: 53, baseType: !344, size: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !345, line: 87, baseType: !346)
!345 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!346 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !338, file: !337, line: 54, baseType: !123, size: 32, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !338, file: !337, line: 55, baseType: !123, size: 32, offset: 288)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !140, file: !28, line: 404, baseType: !332, size: 64, offset: 14656)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !140, file: !28, line: 405, baseType: !123, size: 32, offset: 14720)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !140, file: !28, line: 410, baseType: !123, size: 32, offset: 14752)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !140, file: !28, line: 411, baseType: !123, size: 32, offset: 14784)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !140, file: !28, line: 413, baseType: !123, size: 32, offset: 14816)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !140, file: !28, line: 415, baseType: !123, size: 32, offset: 14848)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !140, file: !28, line: 416, baseType: !123, size: 32, offset: 14880)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !140, file: !28, line: 418, baseType: !123, size: 32, offset: 14912)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !140, file: !28, line: 419, baseType: !123, size: 32, offset: 14944)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !140, file: !28, line: 420, baseType: !123, size: 32, offset: 14976)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !140, file: !28, line: 421, baseType: !123, size: 32, offset: 15008)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !140, file: !28, line: 422, baseType: !123, size: 32, offset: 15040)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !140, file: !28, line: 424, baseType: !123, size: 32, offset: 15072)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !140, file: !28, line: 425, baseType: !123, size: 32, offset: 15104)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !140, file: !28, line: 427, baseType: !123, size: 32, offset: 15136)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !140, file: !28, line: 430, baseType: !365, size: 10400, offset: 15168)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, size: 10400, elements: !452)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !367, line: 154, baseType: !368)
!367 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 52, size: 10400, elements: !369)
!369 = !{!370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !387, !388, !389, !390, !391, !392, !393, !394, !395, !402, !403, !451}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !368, file: !367, line: 54, baseType: !123, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !368, file: !367, line: 56, baseType: !123, size: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !368, file: !367, line: 57, baseType: !123, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !368, file: !367, line: 59, baseType: !123, size: 32, offset: 96)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !368, file: !367, line: 60, baseType: !123, size: 32, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !368, file: !367, line: 61, baseType: !123, size: 32, offset: 160)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !368, file: !367, line: 63, baseType: !123, size: 32, offset: 192)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !368, file: !367, line: 65, baseType: !123, size: 32, offset: 224)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !368, file: !367, line: 67, baseType: !123, size: 32, offset: 256)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !368, file: !367, line: 69, baseType: !123, size: 32, offset: 288)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !368, file: !367, line: 70, baseType: !123, size: 32, offset: 320)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !368, file: !367, line: 71, baseType: !123, size: 32, offset: 352)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !368, file: !367, line: 72, baseType: !123, size: 32, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !368, file: !367, line: 73, baseType: !384, size: 8192, offset: 416)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 8192, elements: !385)
!385 = !{!386}
!386 = !DISubrange(count: 256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !368, file: !367, line: 75, baseType: !123, size: 32, offset: 8608)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !368, file: !367, line: 76, baseType: !123, size: 32, offset: 8640)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !368, file: !367, line: 77, baseType: !123, size: 32, offset: 8672)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !368, file: !367, line: 78, baseType: !123, size: 32, offset: 8704)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !368, file: !367, line: 79, baseType: !123, size: 32, offset: 8736)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !368, file: !367, line: 80, baseType: !123, size: 32, offset: 8768)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !368, file: !367, line: 81, baseType: !123, size: 32, offset: 8800)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !368, file: !367, line: 83, baseType: !123, size: 32, offset: 8832)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !368, file: !367, line: 90, baseType: !396, size: 128, offset: 8864)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !368, file: !367, line: 84, size: 128, elements: !397)
!397 = !{!398, !399, !400, !401}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !396, file: !367, line: 86, baseType: !123, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !396, file: !367, line: 87, baseType: !123, size: 32, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !396, file: !367, line: 88, baseType: !123, size: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !396, file: !367, line: 89, baseType: !123, size: 32, offset: 96)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !368, file: !367, line: 92, baseType: !123, size: 32, offset: 8992)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !368, file: !367, line: 150, baseType: !404, size: 1344, offset: 9024)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !368, file: !367, line: 93, size: 1344, elements: !405)
!405 = !{!406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !442, !443, !444, !445, !446, !447, !448, !449, !450}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !404, file: !367, line: 95, baseType: !123, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !404, file: !367, line: 96, baseType: !123, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !404, file: !367, line: 97, baseType: !123, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !404, file: !367, line: 99, baseType: !123, size: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !404, file: !367, line: 100, baseType: !123, size: 32, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !404, file: !367, line: 102, baseType: !123, size: 32, offset: 160)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !404, file: !367, line: 103, baseType: !123, size: 32, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !404, file: !367, line: 104, baseType: !123, size: 32, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !404, file: !367, line: 105, baseType: !123, size: 32, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !404, file: !367, line: 106, baseType: !123, size: 32, offset: 288)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !404, file: !367, line: 107, baseType: !123, size: 32, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !404, file: !367, line: 108, baseType: !123, size: 32, offset: 352)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !404, file: !367, line: 110, baseType: !123, size: 32, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !404, file: !367, line: 111, baseType: !123, size: 32, offset: 416)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !404, file: !367, line: 112, baseType: !123, size: 32, offset: 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !404, file: !367, line: 114, baseType: !123, size: 32, offset: 480)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !404, file: !367, line: 115, baseType: !71, size: 32, offset: 512)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !404, file: !367, line: 116, baseType: !71, size: 32, offset: 544)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !404, file: !367, line: 117, baseType: !123, size: 32, offset: 576)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !404, file: !367, line: 119, baseType: !123, size: 32, offset: 608)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !404, file: !367, line: 120, baseType: !123, size: 32, offset: 640)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !404, file: !367, line: 137, baseType: !428, size: 384, offset: 672)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !404, file: !367, line: 122, size: 384, elements: !429)
!429 = !{!430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !428, file: !367, line: 124, baseType: !123, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !428, file: !367, line: 125, baseType: !123, size: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !428, file: !367, line: 126, baseType: !123, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !428, file: !367, line: 127, baseType: !123, size: 32, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !428, file: !367, line: 128, baseType: !123, size: 32, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !428, file: !367, line: 129, baseType: !123, size: 32, offset: 160)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !428, file: !367, line: 130, baseType: !123, size: 32, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !428, file: !367, line: 131, baseType: !123, size: 32, offset: 224)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !428, file: !367, line: 133, baseType: !123, size: 32, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !428, file: !367, line: 134, baseType: !123, size: 32, offset: 288)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !428, file: !367, line: 135, baseType: !123, size: 32, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !428, file: !367, line: 136, baseType: !123, size: 32, offset: 352)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !404, file: !367, line: 139, baseType: !123, size: 32, offset: 1056)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !404, file: !367, line: 140, baseType: !123, size: 32, offset: 1088)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !404, file: !367, line: 141, baseType: !123, size: 32, offset: 1120)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !404, file: !367, line: 142, baseType: !123, size: 32, offset: 1152)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !404, file: !367, line: 143, baseType: !123, size: 32, offset: 1184)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !404, file: !367, line: 144, baseType: !123, size: 32, offset: 1216)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !404, file: !367, line: 145, baseType: !123, size: 32, offset: 1248)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !404, file: !367, line: 146, baseType: !123, size: 32, offset: 1280)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !404, file: !367, line: 147, baseType: !123, size: 32, offset: 1312)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !368, file: !367, line: 152, baseType: !123, size: 32, offset: 10368)
!452 = !{!453}
!453 = !DISubrange(count: 1)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !140, file: !28, line: 431, baseType: !455, size: 64, offset: 25600)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !140, file: !28, line: 432, baseType: !457, size: 960, offset: 25664)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 960, elements: !452)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !367, line: 186, baseType: !459)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 156, size: 960, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !459, file: !367, line: 158, baseType: !123, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !459, file: !367, line: 159, baseType: !123, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !459, file: !367, line: 161, baseType: !123, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !459, file: !367, line: 163, baseType: !123, size: 32, offset: 96)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !459, file: !367, line: 164, baseType: !123, size: 32, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !459, file: !367, line: 166, baseType: !123, size: 32, offset: 160)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !459, file: !367, line: 167, baseType: !123, size: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !459, file: !367, line: 169, baseType: !123, size: 32, offset: 224)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !459, file: !367, line: 170, baseType: !123, size: 32, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !459, file: !367, line: 172, baseType: !123, size: 32, offset: 288)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !459, file: !367, line: 173, baseType: !123, size: 32, offset: 320)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !459, file: !367, line: 175, baseType: !123, size: 32, offset: 352)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !459, file: !367, line: 177, baseType: !123, size: 32, offset: 384)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !459, file: !367, line: 178, baseType: !123, size: 32, offset: 416)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !459, file: !367, line: 179, baseType: !123, size: 32, offset: 448)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !459, file: !367, line: 181, baseType: !123, size: 32, offset: 480)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !459, file: !367, line: 183, baseType: !123, size: 32, offset: 512)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !459, file: !367, line: 184, baseType: !479, size: 384, offset: 576)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 384, elements: !482)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!482 = !{!483}
!483 = !DISubrange(count: 6)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !140, file: !28, line: 433, baseType: !485, size: 64, offset: 26624)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !140, file: !28, line: 434, baseType: !123, size: 32, offset: 26688)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !140, file: !28, line: 437, baseType: !123, size: 32, offset: 26720)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !140, file: !28, line: 440, baseType: !489, size: 256, offset: 26752)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 256, elements: !87)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 512, elements: !191)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !140, file: !28, line: 441, baseType: !493, size: 128, offset: 27008)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 128, elements: !80)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 2048, elements: !198)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !140, file: !28, line: 443, baseType: !489, size: 256, offset: 27136)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !140, file: !28, line: 444, baseType: !493, size: 128, offset: 27392)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !140, file: !28, line: 446, baseType: !499, size: 256, offset: 27520)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 256, elements: !87)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 256, elements: !191)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !140, file: !28, line: 447, baseType: !503, size: 128, offset: 27776)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 128, elements: !80)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 1024, elements: !198)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !140, file: !28, line: 448, baseType: !499, size: 256, offset: 27904)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !140, file: !28, line: 449, baseType: !503, size: 128, offset: 28160)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !140, file: !28, line: 454, baseType: !509, size: 5888, offset: 28288)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 5888, elements: !511)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!511 = !{!512}
!512 = !DISubrange(count: 92)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !140, file: !28, line: 455, baseType: !514, size: 23552, offset: 34176)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 23552, elements: !515)
!515 = !{!512, !88}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !140, file: !28, line: 457, baseType: !480, size: 64, offset: 57728)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !140, file: !28, line: 460, baseType: !518, size: 53376, offset: 57856)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !28, line: 364, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !28, line: 302, size: 53376, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !549, !574, !575, !576, !582, !583, !584, !585, !586, !587, !588, !589}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !519, file: !28, line: 304, baseType: !455, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !519, file: !28, line: 305, baseType: !485, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !519, file: !28, line: 307, baseType: !123, size: 32, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !519, file: !28, line: 308, baseType: !123, size: 32, offset: 160)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !519, file: !28, line: 309, baseType: !123, size: 32, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !519, file: !28, line: 311, baseType: !123, size: 32, offset: 224)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !519, file: !28, line: 313, baseType: !123, size: 32, offset: 256)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !519, file: !28, line: 315, baseType: !123, size: 32, offset: 288)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !519, file: !28, line: 316, baseType: !123, size: 32, offset: 320)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !519, file: !28, line: 317, baseType: !123, size: 32, offset: 352)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !519, file: !28, line: 319, baseType: !123, size: 32, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !519, file: !28, line: 321, baseType: !123, size: 32, offset: 416)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !519, file: !28, line: 322, baseType: !123, size: 32, offset: 448)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !519, file: !28, line: 324, baseType: !244, size: 64, offset: 480)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !519, file: !28, line: 325, baseType: !123, size: 32, offset: 544)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !519, file: !28, line: 327, baseType: !123, size: 32, offset: 576)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !519, file: !28, line: 329, baseType: !123, size: 32, offset: 608)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !519, file: !28, line: 330, baseType: !123, size: 32, offset: 640)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !519, file: !28, line: 331, baseType: !123, size: 32, offset: 672)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !519, file: !28, line: 333, baseType: !123, size: 32, offset: 704)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !519, file: !28, line: 334, baseType: !123, size: 32, offset: 736)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !519, file: !28, line: 339, baseType: !543, size: 2048, offset: 768)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 2048, elements: !548)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !519, file: !28, line: 335, size: 64, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !544, file: !28, line: 337, baseType: !123, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !544, file: !28, line: 338, baseType: !123, size: 32, offset: 32)
!548 = !{!81, !192}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !519, file: !28, line: 342, baseType: !550, size: 49152, align: 128, offset: 2816)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 49152, align: 128, elements: !571)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !552, line: 36, baseType: !553, align: 128)
!552 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !552, line: 26, size: 512, elements: !554)
!554 = !{!555, !557, !558, !561, !562, !563}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !553, file: !552, line: 30, baseType: !556, size: 128, align: 128)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 128, elements: !118)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !553, file: !552, line: 31, baseType: !556, size: 128, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !553, file: !552, line: 32, baseType: !559, size: 32, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !94, line: 26, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !74, line: 41, baseType: !123)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !553, file: !552, line: 33, baseType: !559, size: 32, offset: 288)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !553, file: !552, line: 34, baseType: !559, size: 32, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !553, file: !552, line: 35, baseType: !564, size: 64, offset: 384)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !552, line: 25, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !332, !123, !332, !123, !569, !123}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !553)
!571 = !{!572, !573}
!572 = !DISubrange(count: 32)
!573 = !DISubrange(count: 3)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !519, file: !28, line: 344, baseType: !123, size: 32, offset: 51968)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !519, file: !28, line: 345, baseType: !123, size: 32, offset: 52000)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !519, file: !28, line: 350, baseType: !577, size: 1024, offset: 52032)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 1024, elements: !191)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !519, file: !28, line: 346, size: 64, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !578, file: !28, line: 348, baseType: !123, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !578, file: !28, line: 349, baseType: !123, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !519, file: !28, line: 352, baseType: !123, size: 32, offset: 53056)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !519, file: !28, line: 354, baseType: !123, size: 32, offset: 53088)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !519, file: !28, line: 355, baseType: !123, size: 32, offset: 53120)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !519, file: !28, line: 356, baseType: !123, size: 32, offset: 53152)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !519, file: !28, line: 357, baseType: !123, size: 32, offset: 53184)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !519, file: !28, line: 360, baseType: !123, size: 32, offset: 53216)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !519, file: !28, line: 361, baseType: !123, size: 32, offset: 53248)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !519, file: !28, line: 362, baseType: !123, size: 32, offset: 53280)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !140, file: !28, line: 463, baseType: !591, size: 4096, offset: 111232)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !592, line: 46, baseType: !593)
!592 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !592, line: 27, size: 4096, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !593, file: !592, line: 30, baseType: !123, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !593, file: !592, line: 31, baseType: !123, size: 32, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !593, file: !592, line: 34, baseType: !123, size: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !593, file: !592, line: 35, baseType: !123, size: 32, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !593, file: !592, line: 37, baseType: !332, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !593, file: !592, line: 38, baseType: !332, size: 64, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !593, file: !592, line: 39, baseType: !332, size: 64, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !593, file: !592, line: 42, baseType: !123, size: 32, align: 128, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !593, file: !592, line: 45, baseType: !604, size: 3680, offset: 416)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 3680, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 460)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !140, file: !28, line: 494, baseType: !608, size: 2112, offset: 115328)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !28, line: 465, size: 2112, elements: !609)
!609 = !{!610, !748, !750, !751, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !764, !765, !766, !767}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !608, file: !28, line: 468, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !614, line: 146, baseType: !615)
!614 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !614, line: 31, size: 125056, elements: !616)
!616 = !{!617, !618, !619, !620, !623, !624, !625, !626, !627, !628, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !647, !648, !649, !650, !651, !652, !654, !656, !657, !658, !659, !660, !663, !665, !666, !668, !673, !674, !678, !679, !683, !687, !690, !692, !693, !695, !696, !698, !699, !700, !703, !705, !706, !707, !709, !710, !711, !712, !713, !714, !715, !716, !718, !719, !720, !729, !733, !735, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !615, file: !614, line: 34, baseType: !123, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !615, file: !614, line: 35, baseType: !123, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !615, file: !614, line: 36, baseType: !123, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !615, file: !614, line: 37, baseType: !621, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !94, line: 27, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !74, line: 44, baseType: !346)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !615, file: !614, line: 38, baseType: !621, size: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !615, file: !614, line: 39, baseType: !123, size: 32, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !615, file: !614, line: 40, baseType: !123, size: 32, offset: 288)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !615, file: !614, line: 41, baseType: !123, size: 32, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !615, file: !614, line: 42, baseType: !123, size: 32, offset: 352)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !615, file: !614, line: 43, baseType: !629, size: 64, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !615, file: !614, line: 45, baseType: !123, size: 32, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !615, file: !614, line: 46, baseType: !123, size: 32, offset: 480)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !615, file: !614, line: 47, baseType: !123, size: 32, offset: 512)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !615, file: !614, line: 48, baseType: !123, size: 32, offset: 544)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !615, file: !614, line: 49, baseType: !123, size: 32, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !615, file: !614, line: 50, baseType: !123, size: 32, offset: 608)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !615, file: !614, line: 51, baseType: !123, size: 32, offset: 640)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !615, file: !614, line: 52, baseType: !84, size: 8, offset: 672)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !615, file: !614, line: 53, baseType: !84, size: 8, offset: 680)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !615, file: !614, line: 54, baseType: !84, size: 8, offset: 688)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !615, file: !614, line: 55, baseType: !240, size: 32, offset: 704)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !615, file: !614, line: 56, baseType: !240, size: 32, offset: 736)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !615, file: !614, line: 57, baseType: !123, size: 32, offset: 768)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !615, file: !614, line: 60, baseType: !123, size: 32, offset: 800)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !615, file: !614, line: 61, baseType: !645, size: 96, offset: 832)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 96, elements: !646)
!646 = !{!573}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !615, file: !614, line: 62, baseType: !645, size: 96, offset: 928)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !615, file: !614, line: 63, baseType: !645, size: 96, offset: 1024)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !615, file: !614, line: 64, baseType: !123, size: 32, offset: 1120)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !615, file: !614, line: 65, baseType: !123, size: 32, offset: 1152)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !615, file: !614, line: 66, baseType: !123, size: 32, offset: 1184)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !615, file: !614, line: 67, baseType: !653, size: 192, offset: 1216)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 192, elements: !646)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !615, file: !614, line: 68, baseType: !655, size: 256, offset: 1408)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 256, elements: !87)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !615, file: !614, line: 69, baseType: !655, size: 256, offset: 1664)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !615, file: !614, line: 70, baseType: !510, size: 64, offset: 1920)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !615, file: !614, line: 74, baseType: !655, size: 256, offset: 1984)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !615, file: !614, line: 75, baseType: !655, size: 256, offset: 2240)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !615, file: !614, line: 77, baseType: !661, size: 24576, align: 128, offset: 2560)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 24576, align: 128, elements: !662)
!662 = !{!192, !573}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !615, file: !614, line: 78, baseType: !664, size: 1024, offset: 27136)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 1024, elements: !191)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !615, file: !614, line: 79, baseType: !123, size: 32, offset: 28160)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !615, file: !614, line: 80, baseType: !667, size: 64, offset: 28224)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !615, file: !614, line: 83, baseType: !669, size: 64, offset: 28288)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !94, line: 24, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !74, line: 37, baseType: !672)
!672 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !615, file: !614, line: 84, baseType: !332, size: 64, offset: 28352)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !615, file: !614, line: 85, baseType: !675, size: 128, offset: 28416)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 128, elements: !80)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 32, elements: !80)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !615, file: !614, line: 86, baseType: !676, size: 64, offset: 28544)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !615, file: !614, line: 87, baseType: !680, size: 2176, offset: 28608)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 2176, elements: !681)
!681 = !{!81, !682}
!682 = !DISubrange(count: 17)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !615, file: !614, line: 92, baseType: !684, size: 20736, offset: 30784)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 20736, elements: !685)
!685 = !{!686, !686}
!686 = !DISubrange(count: 18)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !615, file: !614, line: 96, baseType: !688, size: 2176, offset: 51520)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 2176, elements: !681)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !615, file: !614, line: 97, baseType: !691, size: 128, offset: 53696)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 128, elements: !80)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !615, file: !614, line: 98, baseType: !244, size: 64, offset: 53824)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !615, file: !614, line: 99, baseType: !694, size: 1024, offset: 53888)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 1024, elements: !548)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !615, file: !614, line: 100, baseType: !677, size: 32, offset: 54912)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !615, file: !614, line: 105, baseType: !697, size: 10368, offset: 54944)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 10368, elements: !685)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !615, file: !614, line: 106, baseType: !697, size: 10368, offset: 65312)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !615, file: !614, line: 107, baseType: !123, size: 32, offset: 75680)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !615, file: !614, line: 108, baseType: !701, size: 576, offset: 75712)
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 576, elements: !702)
!702 = !{!686}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !615, file: !614, line: 109, baseType: !704, size: 20736, offset: 76288)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 20736, elements: !685)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !615, file: !614, line: 110, baseType: !689, size: 64, offset: 97024)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !615, file: !614, line: 111, baseType: !689, size: 64, offset: 97088)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !615, file: !614, line: 112, baseType: !708, size: 64, offset: 97152)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !615, file: !614, line: 113, baseType: !708, size: 64, offset: 97216)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !615, file: !614, line: 114, baseType: !708, size: 64, offset: 97280)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !615, file: !614, line: 115, baseType: !123, size: 32, offset: 97344)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !615, file: !614, line: 116, baseType: !510, size: 64, offset: 97408)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !615, file: !614, line: 117, baseType: !510, size: 64, offset: 97472)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !615, file: !614, line: 118, baseType: !510, size: 64, offset: 97536)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !615, file: !614, line: 119, baseType: !123, size: 32, offset: 97600)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !615, file: !614, line: 120, baseType: !717, size: 576, offset: 97632)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, size: 576, elements: !702)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !615, file: !614, line: 121, baseType: !71, size: 32, offset: 98208)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !615, file: !614, line: 122, baseType: !109, size: 64, offset: 98240)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !615, file: !614, line: 125, baseType: !721, size: 256, offset: 98304)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !139, line: 503, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 496, size: 256, elements: !723)
!723 = !{!724, !726, !727, !728}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !722, file: !139, line: 498, baseType: !725, size: 64)
!725 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !722, file: !139, line: 499, baseType: !725, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !722, file: !139, line: 500, baseType: !725, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !722, file: !139, line: 502, baseType: !725, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !615, file: !614, line: 128, baseType: !730, size: 2008, offset: 98560)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 2008, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 251)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !615, file: !614, line: 129, baseType: !734, size: 8032, offset: 100576)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 8032, elements: !731)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !615, file: !614, line: 130, baseType: !736, size: 16064, offset: 108608)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 16064, elements: !731)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !615, file: !614, line: 131, baseType: !123, size: 32, offset: 124672)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !615, file: !614, line: 132, baseType: !123, size: 32, offset: 124704)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !615, file: !614, line: 135, baseType: !123, size: 32, offset: 124736)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !615, file: !614, line: 136, baseType: !123, size: 32, offset: 124768)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !615, file: !614, line: 137, baseType: !123, size: 32, offset: 124800)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !615, file: !614, line: 138, baseType: !123, size: 32, offset: 124832)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !615, file: !614, line: 139, baseType: !123, size: 32, offset: 124864)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !615, file: !614, line: 142, baseType: !240, size: 32, offset: 124896)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !615, file: !614, line: 143, baseType: !123, size: 32, offset: 124928)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !615, file: !614, line: 144, baseType: !123, size: 32, offset: 124960)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !615, file: !614, line: 145, baseType: !123, size: 32, offset: 124992)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !608, file: !28, line: 470, baseType: !749, size: 128, offset: 64)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 128, elements: !80)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !608, file: !28, line: 473, baseType: !611, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !608, file: !28, line: 476, baseType: !752, size: 1152, offset: 256)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 1152, elements: !702)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !608, file: !28, line: 478, baseType: !123, size: 32, offset: 1408)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !608, file: !28, line: 480, baseType: !123, size: 32, offset: 1440)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !608, file: !28, line: 482, baseType: !123, size: 32, offset: 1472)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !608, file: !28, line: 483, baseType: !123, size: 32, offset: 1504)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !608, file: !28, line: 484, baseType: !123, size: 32, offset: 1536)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !608, file: !28, line: 485, baseType: !123, size: 32, offset: 1568)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !608, file: !28, line: 486, baseType: !123, size: 32, offset: 1600)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !608, file: !28, line: 487, baseType: !621, size: 64, offset: 1664)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !608, file: !28, line: 488, baseType: !621, size: 64, offset: 1728)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !608, file: !28, line: 489, baseType: !763, size: 128, offset: 1792)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 128, elements: !80)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !608, file: !28, line: 490, baseType: !621, size: 64, offset: 1920)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !608, file: !28, line: 491, baseType: !621, size: 64, offset: 1984)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !608, file: !28, line: 492, baseType: !123, size: 32, offset: 2048)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !608, file: !28, line: 493, baseType: !123, size: 32, offset: 2080)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !140, file: !28, line: 497, baseType: !612, size: 64, offset: 117440)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !140, file: !28, line: 500, baseType: !612, size: 64, offset: 117504)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !140, file: !28, line: 503, baseType: !123, size: 32, offset: 117568)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !140, file: !28, line: 504, baseType: !772, size: 1216, offset: 117632)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 1216, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 19)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !140, file: !28, line: 505, baseType: !123, size: 32, offset: 118848)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !140, file: !28, line: 506, baseType: !772, size: 1216, offset: 118912)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !140, file: !28, line: 507, baseType: !244, size: 64, offset: 120128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !140, file: !28, line: 510, baseType: !123, size: 32, offset: 120192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !140, file: !28, line: 511, baseType: !123, size: 32, offset: 120224)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !140, file: !28, line: 512, baseType: !621, size: 64, offset: 120256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !140, file: !28, line: 522, baseType: !782, size: 10624, offset: 120320)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !28, line: 515, size: 10624, elements: !783)
!783 = !{!784, !786, !789, !792}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !782, file: !28, line: 517, baseType: !785, size: 256, align: 128)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 256, elements: !191)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !782, file: !28, line: 518, baseType: !787, size: 128, align: 128, offset: 256)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 128, elements: !788)
!788 = !{!81, !88}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !782, file: !28, line: 520, baseType: !790, size: 4096, align: 128, offset: 384)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 4096, elements: !791)
!791 = !{!88, !199}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !782, file: !28, line: 521, baseType: !793, size: 6144, align: 128, offset: 4480)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 6144, elements: !794)
!794 = !{!795, !192}
!795 = !DISubrange(count: 24)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !140, file: !28, line: 732, baseType: !797, size: 82688, offset: 130944)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !28, line: 525, size: 82688, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !826, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !844, !847, !851, !852, !853, !858, !859, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !927, !958, !959, !960, !961, !962, !963, !964, !965, !966, !969, !970, !971, !974, !977, !979, !982, !984, !985}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !797, file: !28, line: 527, baseType: !123, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !797, file: !28, line: 530, baseType: !123, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !797, file: !28, line: 531, baseType: !123, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !797, file: !28, line: 532, baseType: !123, size: 32, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !797, file: !28, line: 535, baseType: !123, size: 32, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !797, file: !28, line: 536, baseType: !123, size: 32, offset: 160)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !797, file: !28, line: 537, baseType: !123, size: 32, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !797, file: !28, line: 538, baseType: !123, size: 32, offset: 224)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !797, file: !28, line: 539, baseType: !123, size: 32, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !797, file: !28, line: 542, baseType: !123, size: 32, offset: 288)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !797, file: !28, line: 543, baseType: !123, size: 32, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !797, file: !28, line: 544, baseType: !123, size: 32, offset: 352)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !797, file: !28, line: 545, baseType: !123, size: 32, offset: 384)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !797, file: !28, line: 546, baseType: !123, size: 32, offset: 416)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !797, file: !28, line: 547, baseType: !123, size: 32, offset: 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !797, file: !28, line: 548, baseType: !123, size: 32, offset: 480)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !797, file: !28, line: 549, baseType: !123, size: 32, offset: 512)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !797, file: !28, line: 551, baseType: !123, size: 32, offset: 544)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !797, file: !28, line: 554, baseType: !244, size: 64, offset: 576)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !797, file: !28, line: 555, baseType: !244, size: 64, offset: 640)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !797, file: !28, line: 558, baseType: !244, size: 64, offset: 704)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !797, file: !28, line: 559, baseType: !244, size: 64, offset: 768)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !797, file: !28, line: 561, baseType: !244, size: 64, offset: 832)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !797, file: !28, line: 562, baseType: !244, size: 64, offset: 896)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !797, file: !28, line: 565, baseType: !7, size: 32, offset: 960)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !797, file: !28, line: 566, baseType: !825, size: 128, offset: 992)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !87)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !797, file: !28, line: 567, baseType: !827, size: 512, offset: 1120)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !191)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !797, file: !28, line: 568, baseType: !7, size: 32, offset: 1632)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !797, file: !28, line: 569, baseType: !7, size: 32, offset: 1664)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !797, file: !28, line: 570, baseType: !123, size: 32, offset: 1696)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !797, file: !28, line: 571, baseType: !123, size: 32, offset: 1728)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !797, file: !28, line: 572, baseType: !123, size: 32, offset: 1760)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !797, file: !28, line: 573, baseType: !123, size: 32, offset: 1792)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !797, file: !28, line: 574, baseType: !123, size: 32, offset: 1824)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !797, file: !28, line: 575, baseType: !123, size: 32, offset: 1856)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !797, file: !28, line: 576, baseType: !123, size: 32, offset: 1888)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !797, file: !28, line: 577, baseType: !123, size: 32, offset: 1920)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !797, file: !28, line: 578, baseType: !123, size: 32, offset: 1952)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !797, file: !28, line: 585, baseType: !669, size: 64, offset: 1984)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !797, file: !28, line: 586, baseType: !332, size: 64, offset: 2048)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !797, file: !28, line: 587, baseType: !669, size: 64, offset: 2112)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !797, file: !28, line: 588, baseType: !843, size: 64, offset: 2176)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !797, file: !28, line: 589, baseType: !845, size: 64, offset: 2240)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 64, elements: !118)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !797, file: !28, line: 591, baseType: !848, size: 64, offset: 2304)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 192, elements: !850)
!850 = !{!795}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !797, file: !28, line: 592, baseType: !669, size: 64, offset: 2368)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !797, file: !28, line: 593, baseType: !675, size: 128, offset: 2432)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !797, file: !28, line: 594, baseType: !854, size: 128, offset: 2560)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !855, size: 128, elements: !80)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, elements: !857)
!857 = !{!119, !81}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !797, file: !28, line: 595, baseType: !691, size: 128, offset: 2688)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !797, file: !28, line: 596, baseType: !860, size: 4096, offset: 2816)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 4096, elements: !861)
!861 = !{!81, !572}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !797, file: !28, line: 597, baseType: !669, size: 64, offset: 6912)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !797, file: !28, line: 598, baseType: !669, size: 64, offset: 6976)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !797, file: !28, line: 599, baseType: !510, size: 64, offset: 7040)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !797, file: !28, line: 603, baseType: !664, size: 1024, offset: 7104)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !797, file: !28, line: 606, baseType: !123, size: 32, offset: 8128)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !797, file: !28, line: 607, baseType: !123, size: 32, offset: 8160)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !797, file: !28, line: 608, baseType: !83, size: 32, align: 32, offset: 8192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !797, file: !28, line: 609, baseType: !123, size: 32, offset: 8224)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !797, file: !28, line: 611, baseType: !123, size: 32, offset: 8256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !797, file: !28, line: 612, baseType: !123, size: 32, offset: 8288)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !797, file: !28, line: 614, baseType: !123, size: 32, offset: 8320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !797, file: !28, line: 615, baseType: !123, size: 32, offset: 8352)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !797, file: !28, line: 621, baseType: !123, size: 32, offset: 8384)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !797, file: !28, line: 624, baseType: !123, size: 32, offset: 8416)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !797, file: !28, line: 626, baseType: !123, size: 32, offset: 8448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !797, file: !28, line: 627, baseType: !123, size: 32, offset: 8480)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !797, file: !28, line: 671, baseType: !879, size: 60672, offset: 8576)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !797, file: !28, line: 629, size: 60672, elements: !880)
!880 = !{!881, !885, !889, !891, !892, !895, !899, !901, !902, !903, !904, !905, !908, !912, !915, !916, !917, !918, !919, !922, !924, !926}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !879, file: !28, line: 634, baseType: !882, size: 3072, align: 128)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 3072, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 384)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !879, file: !28, line: 635, baseType: !886, size: 6912, align: 128, offset: 3072)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 6912, elements: !887)
!887 = !{!888}
!888 = !DISubrange(count: 864)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !879, file: !28, line: 638, baseType: !890, size: 2048, align: 128, offset: 9984)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 2048, elements: !385)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !879, file: !28, line: 639, baseType: !890, size: 2048, align: 128, offset: 12032)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !879, file: !28, line: 640, baseType: !893, size: 3072, align: 128, offset: 14080)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 3072, elements: !894)
!894 = !{!573, !199}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !879, file: !28, line: 641, baseType: !896, size: 3840, align: 128, offset: 17152)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 3840, elements: !897)
!897 = !{!898, !192}
!898 = !DISubrange(count: 15)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !879, file: !28, line: 642, baseType: !900, size: 128, offset: 20992)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, elements: !87)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !879, file: !28, line: 643, baseType: !900, size: 128, offset: 21120)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !879, file: !28, line: 644, baseType: !123, size: 32, offset: 21248)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !879, file: !28, line: 645, baseType: !123, size: 32, offset: 21280)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !879, file: !28, line: 648, baseType: !790, size: 4096, align: 128, offset: 21376)
