; ModuleID = 'x264_src/common/pixel.c'
source_filename = "x264_src/common/pixel.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

; Function Attrs: nounwind uwtable
define dso_local i64 @x264_pixel_ssd_wxh(ptr nocapture noundef readonly %pf, ptr noundef %pix1, i32 noundef %i_pix1, ptr noundef %pix2, i32 noundef %i_pix2, i32 noundef %i_width, i32 noundef %i_height) local_unnamed_addr #0 !dbg !57 {
entry:
    #dbg_value(ptr %pf, !155, !DIExpression(), !190)
    #dbg_value(ptr %pix1, !156, !DIExpression(), !190)
    #dbg_value(i32 %i_pix1, !157, !DIExpression(), !190)
    #dbg_value(ptr %pix2, !158, !DIExpression(), !190)
    #dbg_value(i32 %i_pix2, !159, !DIExpression(), !190)
    #dbg_value(i32 %i_width, !160, !DIExpression(), !190)
    #dbg_value(i32 %i_height, !161, !DIExpression(), !190)
    #dbg_value(i64 0, !162, !DIExpression(), !190)
    #dbg_value(!DIArgList(i32 %i_pix1, i32 %i_pix2, ptr %pix2, ptr %pix1), !164, !DIExpression(DW_OP_LLVM_arg, 0, DW_OP_LLVM_convert, 32, DW_ATE_unsigned, DW_OP_LLVM_convert, 64, DW_ATE_unsigned, DW_OP_LLVM_arg, 3, DW_OP_or, DW_OP_LLVM_arg, 2, DW_OP_or, DW_OP_LLVM_arg, 1, DW_OP_LLVM_convert, 32, DW_ATE_unsigned, DW_OP_LLVM_convert, 64, DW_ATE_unsigned, DW_OP_or, DW_OP_constu, 15, DW_OP_and, DW_OP_lit0, DW_OP_eq, DW_OP_LLVM_convert, 1, DW_ATE_unsigned, DW_OP_LLVM_convert, 32, DW_ATE_unsigned, DW_OP_stack_value), !190)

!4 = !DIFile(filename: "x264_src/common/pixel.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "e9056d80edbb4dc2514d271d596c298e")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16}
!7 = !DIEnumerator(name: "PIXEL_16x16", value: 0)
!8 = !DIEnumerator(name: "PIXEL_16x8", value: 1)
!9 = !DIEnumerator(name: "PIXEL_8x16", value: 2)
!10 = !DIEnumerator(name: "PIXEL_8x8", value: 3)
!11 = !DIEnumerator(name: "PIXEL_8x4", value: 4)
!12 = !DIEnumerator(name: "PIXEL_4x8", value: 5)
!13 = !DIEnumerator(name: "PIXEL_4x4", value: 6)
!14 = !DIEnumerator(name: "PIXEL_4x2", value: 7)
!15 = !DIEnumerator(name: "PIXEL_2x4", value: 8)
!16 = !DIEnumerator(name: "PIXEL_2x2", value: 9)
!17 = !{!18, !21, !26, !28, !31, !32}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !19, line: 87, baseType: !20)
!19 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!20 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !22, line: 25, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !24, line: 40, baseType: !25)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!25 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !22, line: 26, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !24, line: 42, baseType: !5)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !22, line: 27, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !24, line: 45, baseType: !30)
!30 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!33 = !{!34, !47}
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "ssim_c1", scope: !36, file: !1, line: 490, type: !46, isLocal: true, isDefinition: true)
!36 = distinct !DISubprogram(name: "ssim_end1", scope: !1, file: !1, line: 488, type: !37, scopeLine: 489, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !39)
!37 = !DISubroutineType(types: !38)
!38 = !{!32, !31, !31, !31, !31}
!39 = !{!40, !41, !42, !43, !44, !45}
!40 = !DILocalVariable(name: "s1", arg: 1, scope: !36, file: !1, line: 488, type: !31)
!41 = !DILocalVariable(name: "s2", arg: 2, scope: !36, file: !1, line: 488, type: !31)
!42 = !DILocalVariable(name: "ss", arg: 3, scope: !36, file: !1, line: 488, type: !31)
!43 = !DILocalVariable(name: "s12", arg: 4, scope: !36, file: !1, line: 488, type: !31)
!44 = !DILocalVariable(name: "vars", scope: !36, file: !1, line: 492, type: !31)
!45 = !DILocalVariable(name: "covar", scope: !36, file: !1, line: 493, type: !31)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "ssim_c2", scope: !36, file: !1, line: 491, type: !46, isLocal: true, isDefinition: true)
!49 = !{i32 7, !"Dwarf Version", i32 5}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = !{i32 8, !"PIC Level", i32 2}
!53 = !{i32 7, !"PIE Level", i32 2}
!54 = !{i32 7, !"uwtable", i32 2}
!55 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!56 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!57 = distinct !DISubprogram(name: "x264_pixel_ssd_wxh", scope: !1, file: !1, line: 99, type: !58, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !154)
!58 = !DISubroutineType(types: !59)
!59 = !{!60, !63, !73, !31, !73, !31, !31, !31}
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !61, line: 27, baseType: !62)
!61 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !24, line: 44, baseType: !20)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pixel_function_t", file: !4, line: 110, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 63, size: 8448, elements: !66)
!66 = !{!67, !79, !80, !81, !82, !86, !87, !88, !89, !96, !102, !103, !107, !112, !113, !121, !125, !126, !127, !128, !129, !139, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "sad", scope: !65, file: !4, line: 65, baseType: !68, size: 448)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 448, elements: !77)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pixel_cmp_t", file: !4, line: 26, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!31, !73, !31, !73, !31}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !22, line: 24, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !24, line: 38, baseType: !76)
!76 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!77 = !{!78}
!78 = !DISubrange(count: 7)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "ssd", scope: !65, file: !4, line: 66, baseType: !68, size: 448, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "satd", scope: !65, file: !4, line: 67, baseType: !68, size: 448, offset: 896)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "ssim", scope: !65, file: !4, line: 68, baseType: !68, size: 448, offset: 1344)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "sa8d", scope: !65, file: !4, line: 69, baseType: !83, size: 256, offset: 1792)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 256, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 4)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mbcmp", scope: !65, file: !4, line: 70, baseType: !68, size: 448, offset: 2048)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "mbcmp_unaligned", scope: !65, file: !4, line: 71, baseType: !68, size: 448, offset: 2496)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "fpelcmp", scope: !65, file: !4, line: 72, baseType: !68, size: 448, offset: 2944)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "fpelcmp_x3", scope: !65, file: !4, line: 73, baseType: !90, size: 448, offset: 3392)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 448, elements: !77)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pixel_cmp_x3_t", file: !4, line: 27, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !73, !73, !73, !73, !31, !95}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "fpelcmp_x4", scope: !65, file: !4, line: 74, baseType: !97, size: 448, offset: 3840)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 448, elements: !77)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pixel_cmp_x4_t", file: !4, line: 28, baseType: !99)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !73, !73, !73, !73, !73, !31, !95}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "sad_aligned", scope: !65, file: !4, line: 75, baseType: !68, size: 448, offset: 4288)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "var2_8x8", scope: !65, file: !4, line: 76, baseType: !104, size: 64, offset: 4736)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DISubroutineType(types: !106)
!106 = !{!31, !73, !31, !73, !31, !95}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !65, file: !4, line: 78, baseType: !108, size: 256, offset: 4800)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 256, elements: !84)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DISubroutineType(types: !111)
!111 = !{!28, !73, !31}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "hadamard_ac", scope: !65, file: !4, line: 79, baseType: !108, size: 256, offset: 5056)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ssim_4x4x2_core", scope: !65, file: !4, line: 81, baseType: !114, size: 64, offset: 5312)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !117, !31, !117, !31, !119}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 128, elements: !84)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ssim_end4", scope: !65, file: !4, line: 83, baseType: !122, size: 64, offset: 5376)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DISubroutineType(types: !124)
!124 = !{!32, !119, !119, !31}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sad_x3", scope: !65, file: !4, line: 86, baseType: !90, size: 448, offset: 5440)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "sad_x4", scope: !65, file: !4, line: 87, baseType: !97, size: 448, offset: 5888)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "satd_x3", scope: !65, file: !4, line: 88, baseType: !90, size: 448, offset: 6336)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "satd_x4", scope: !65, file: !4, line: 89, baseType: !97, size: 448, offset: 6784)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ads", scope: !65, file: !4, line: 93, baseType: !130, size: 448, offset: 7232)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 448, elements: !77)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!31, !95, !134, !31, !134, !135, !31, !31}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !61, line: 25, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !24, line: 39, baseType: !138)
!138 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "intra_mbcmp_x3_16x16", scope: !65, file: !4, line: 98, baseType: !140, size: 64, offset: 7680)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{null, !73, !73, !95}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "intra_satd_x3_16x16", scope: !65, file: !4, line: 99, baseType: !140, size: 64, offset: 7744)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "intra_sad_x3_16x16", scope: !65, file: !4, line: 100, baseType: !140, size: 64, offset: 7808)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "intra_mbcmp_x3_8x8c", scope: !65, file: !4, line: 101, baseType: !140, size: 64, offset: 7872)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "intra_satd_x3_8x8c", scope: !65, file: !4, line: 102, baseType: !140, size: 64, offset: 7936)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "intra_sad_x3_8x8c", scope: !65, file: !4, line: 103, baseType: !140, size: 64, offset: 8000)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "intra_mbcmp_x3_4x4", scope: !65, file: !4, line: 104, baseType: !140, size: 64, offset: 8064)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "intra_satd_x3_4x4", scope: !65, file: !4, line: 105, baseType: !140, size: 64, offset: 8128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "intra_sad_x3_4x4", scope: !65, file: !4, line: 106, baseType: !140, size: 64, offset: 8192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "intra_mbcmp_x3_8x8", scope: !65, file: !4, line: 107, baseType: !140, size: 64, offset: 8256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "intra_sa8d_x3_8x8", scope: !65, file: !4, line: 108, baseType: !140, size: 64, offset: 8320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "intra_sad_x3_8x8", scope: !65, file: !4, line: 109, baseType: !140, size: 64, offset: 8384)
!154 = !{!155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !169, !172, !178, !181, !187}
!155 = !DILocalVariable(name: "pf", arg: 1, scope: !57, file: !1, line: 99, type: !63)
!156 = !DILocalVariable(name: "pix1", arg: 2, scope: !57, file: !1, line: 99, type: !73)
!157 = !DILocalVariable(name: "i_pix1", arg: 3, scope: !57, file: !1, line: 99, type: !31)
!158 = !DILocalVariable(name: "pix2", arg: 4, scope: !57, file: !1, line: 99, type: !73)
!159 = !DILocalVariable(name: "i_pix2", arg: 5, scope: !57, file: !1, line: 99, type: !31)
!160 = !DILocalVariable(name: "i_width", arg: 6, scope: !57, file: !1, line: 99, type: !31)
!161 = !DILocalVariable(name: "i_height", arg: 7, scope: !57, file: !1, line: 99, type: !31)
!162 = !DILocalVariable(name: "i_ssd", scope: !57, file: !1, line: 101, type: !60)
!163 = !DILocalVariable(name: "y", scope: !57, file: !1, line: 102, type: !31)
!164 = !DILocalVariable(name: "align", scope: !57, file: !1, line: 103, type: !31)
!165 = !DILocalVariable(name: "x", scope: !166, file: !1, line: 109, type: !31)
!166 = distinct !DILexicalBlock(scope: !167, file: !1, line: 108, column: 5)
!167 = distinct !DILexicalBlock(scope: !168, file: !1, line: 107, column: 5)
!168 = distinct !DILexicalBlock(scope: !57, file: !1, line: 107, column: 5)
!169 = !DILocalVariable(name: "x", scope: !170, file: !1, line: 117, type: !31)
!170 = distinct !DILexicalBlock(scope: !171, file: !1, line: 117, column: 9)
!171 = distinct !DILexicalBlock(scope: !57, file: !1, line: 116, column: 9)
!172 = !DILocalVariable(name: "x", scope: !173, file: !1, line: 125, type: !31)
!173 = distinct !DILexicalBlock(scope: !174, file: !1, line: 125, column: 13)
!174 = distinct !DILexicalBlock(scope: !175, file: !1, line: 124, column: 9)
!175 = distinct !DILexicalBlock(scope: !176, file: !1, line: 124, column: 9)
!176 = distinct !DILexicalBlock(scope: !177, file: !1, line: 123, column: 5)
!177 = distinct !DILexicalBlock(scope: !57, file: !1, line: 122, column: 9)
!178 = !DILocalVariable(name: "d", scope: !179, file: !1, line: 126, type: !31)
!179 = distinct !DILexicalBlock(scope: !180, file: !1, line: 126, column: 17)
!180 = distinct !DILexicalBlock(scope: !173, file: !1, line: 125, column: 13)
!181 = !DILocalVariable(name: "x", scope: !182, file: !1, line: 131, type: !31)
!182 = distinct !DILexicalBlock(scope: !183, file: !1, line: 131, column: 13)
!183 = distinct !DILexicalBlock(scope: !184, file: !1, line: 130, column: 9)
!184 = distinct !DILexicalBlock(scope: !185, file: !1, line: 130, column: 9)
!185 = distinct !DILexicalBlock(scope: !186, file: !1, line: 129, column: 5)
!186 = distinct !DILexicalBlock(scope: !57, file: !1, line: 128, column: 9)
!187 = !DILocalVariable(name: "d", scope: !188, file: !1, line: 132, type: !31)
!188 = distinct !DILexicalBlock(scope: !189, file: !1, line: 132, column: 17)
!189 = distinct !DILexicalBlock(scope: !182, file: !1, line: 131, column: 13)
!190 = !DILocation(line: 0, scope: !57)
!191 = !DILocation(line: 107, column: 19, scope: !167)
!192 = !DILocation(line: 107, column: 5, scope: !168)
!193 = !DILocation(line: 103, column: 54, scope: !57)
!194 = !DILocation(line: 103, column: 20, scope: !57)
!195 = !DILocation(line: 103, column: 35, scope: !57)
!196 = !DILocation(line: 103, column: 37, scope: !57)
!197 = !DILocation(line: 103, column: 52, scope: !57)
!198 = !DILocation(line: 103, column: 63, scope: !57)
!199 = !DILocation(line: 103, column: 61, scope: !57)
!200 = !DILocation(line: 103, column: 71, scope: !57)
!201 = !DILocation(line: 103, column: 17, scope: !57)
!202 = !DILocation(line: 0, scope: !166)
!203 = !DILocation(line: 111, column: 13, scope: !204)
!204 = distinct !DILexicalBlock(scope: !205, file: !1, line: 111, column: 13)
!205 = distinct !DILexicalBlock(scope: !166, file: !1, line: 110, column: 13)
!206 = !DILocation(line: 107, column: 36, scope: !167)
