; ModuleID = 'x264_src/common/quant.c'
source_filename = "x264_src/common/quant.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@x264_decimate_table4 = dso_local local_unnamed_addr constant <{ i8, i8, i8, i8, i8, i8, [10 x i8] }> <{ i8 3, i8 2, i8 2, i8 1, i8 1, i8 1, [10 x i8] zeroinitializer }>, align 16, !dbg !0
@x264_decimate_table8 = dso_local local_unnamed_addr constant <{ [24 x i8], [40 x i8] }> <{ [24 x i8] c"\03\03\03\03\02\02\02\02\02\02\02\02\01\01\01\01\01\01\01\01\01\01\01\01", [40 x i8] zeroinitializer }>, align 16, !dbg !57

; Function Attrs: mustprogress nofree norecurse nosync nounwind willreturn memory(argmem: write) uwtable
define dso_local void @x264_quant_init(ptr nocapture noundef readnone %h, i32 noundef %cpu, ptr nocapture noundef writeonly %pf) local_unnamed_addr #0 !dbg !74 {
entry:
    #dbg_value(ptr %h, !1367, !DIExpression(), !1370)
    #dbg_value(i32 %cpu, !1368, !DIExpression(), !1370)
    #dbg_value(ptr %pf, !1369, !DIExpression(), !1370)
  store ptr @quant_8x8, ptr %pf, align 8, !dbg !1371
  %quant_4x4 = getelementptr inbounds i8, ptr %pf, i64 8, !dbg !1372
  store ptr @quant_4x4, ptr %quant_4x4, align 8, !dbg !1373
  %quant_4x4_dc = getelementptr inbounds i8, ptr %pf, i64 16, !dbg !1374
  store ptr @quant_4x4_dc, ptr %quant_4x4_dc, align 8, !dbg !1375
  %quant_2x2_dc = getelementptr inbounds i8, ptr %pf, i64 24, !dbg !1376

!20 = !{!21, !26, !33}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !19, file: !18, line: 89, baseType: !22, size: 32)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 26, baseType: !24)
!23 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !25, line: 42, baseType: !7)
!25 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!26 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !19, file: !18, line: 89, baseType: !27, size: 32)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 32, elements: !31)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 25, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !25, line: 40, baseType: !30)
!30 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!31 = !{!32}
!32 = !DISubrange(count: 2)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !19, file: !18, line: 89, baseType: !34, size: 32)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 32, elements: !38)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 24, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !25, line: 38, baseType: !37)
!37 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!38 = !{!39}
!39 = !DISubrange(count: 4)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_union64_t", file: !18, line: 90, baseType: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !18, line: 90, size: 64, elements: !43)
!43 = !{!44, !48, !50, !52}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !42, file: !18, line: 90, baseType: !45, size: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 27, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !25, line: 45, baseType: !47)
!47 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !42, file: !18, line: 90, baseType: !49, size: 64)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 64, elements: !31)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !42, file: !18, line: 90, baseType: !51, size: 64)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 64, elements: !38)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !42, file: !18, line: 90, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 64, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 8)
!56 = !{!0, !57}
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "x264_decimate_table8", scope: !2, file: !3, line: 166, type: !59, isLocal: false, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !61)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!61 = !{!62}
!62 = !DISubrange(count: 64)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 128, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 16)
!66 = !{i32 7, !"Dwarf Version", i32 5}
!67 = !{i32 2, !"Debug Info Version", i32 3}
!68 = !{i32 1, !"wchar_size", i32 4}
!69 = !{i32 8, !"PIC Level", i32 2}
!70 = !{i32 7, !"PIE Level", i32 2}
!71 = !{i32 7, !"uwtable", i32 2}
!72 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!73 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!74 = distinct !DISubprogram(name: "x264_quant_init", scope: !3, file: !3, line: 266, type: !75, scopeLine: 267, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1366)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !77, !88, !1365}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !79, line: 46, baseType: !80)
!79 = !DIFile(filename: "x264_src/x264.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !18, line: 381, size: 266752, elements: !81)
!81 = !{!82, !247, !251, !252, !253, !254, !255, !256, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !392, !394, !421, !423, !424, !425, !429, !433, !434, !435, !439, !443, !444, !445, !450, !453, !454, !531, !548, !709, !710, !711, !712, !716, !717, !718, !719, !720, !721, !722, !737, !930, !934, !995, !998, !1000, !1001, !1002, !1005, !1010, !1019, !1020, !1028, !1030, !1035, !1111, !1197, !1241, !1263, !1312, !1341}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !80, file: !18, line: 384, baseType: !83, size: 5632)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !79, line: 376, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !79, line: 176, size: 5632, elements: !85)
!85 = !{!86, !87, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !130, !132, !133, !134, !135, !137, !138, !152, !153, !154, !155, !156, !185, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !84, file: !79, line: 179, baseType: !7, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !84, file: !79, line: 180, baseType: !88, size: 32, offset: 32)
!88 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !84, file: !79, line: 181, baseType: !88, size: 32, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !84, file: !79, line: 182, baseType: !88, size: 32, offset: 96)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !84, file: !79, line: 183, baseType: !88, size: 32, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !84, file: !79, line: 186, baseType: !88, size: 32, offset: 160)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !84, file: !79, line: 187, baseType: !88, size: 32, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !84, file: !79, line: 188, baseType: !88, size: 32, offset: 224)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !84, file: !79, line: 189, baseType: !88, size: 32, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !84, file: !79, line: 190, baseType: !88, size: 32, offset: 288)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !84, file: !79, line: 198, baseType: !88, size: 32, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !84, file: !79, line: 215, baseType: !99, size: 288, offset: 352)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !79, line: 200, size: 288, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108, !109}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !99, file: !79, line: 203, baseType: !88, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !99, file: !79, line: 204, baseType: !88, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !99, file: !79, line: 206, baseType: !88, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !99, file: !79, line: 209, baseType: !88, size: 32, offset: 96)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !99, file: !79, line: 210, baseType: !88, size: 32, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !99, file: !79, line: 211, baseType: !88, size: 32, offset: 160)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !99, file: !79, line: 212, baseType: !88, size: 32, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !99, file: !79, line: 213, baseType: !88, size: 32, offset: 224)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !99, file: !79, line: 214, baseType: !88, size: 32, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !84, file: !79, line: 218, baseType: !88, size: 32, offset: 640)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !84, file: !79, line: 219, baseType: !88, size: 32, offset: 672)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !84, file: !79, line: 220, baseType: !88, size: 32, offset: 704)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !84, file: !79, line: 221, baseType: !88, size: 32, offset: 736)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !84, file: !79, line: 222, baseType: !88, size: 32, offset: 768)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !84, file: !79, line: 224, baseType: !88, size: 32, offset: 800)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !84, file: !79, line: 225, baseType: !88, size: 32, offset: 832)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !84, file: !79, line: 226, baseType: !88, size: 32, offset: 864)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !84, file: !79, line: 227, baseType: !88, size: 32, offset: 896)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !84, file: !79, line: 229, baseType: !88, size: 32, offset: 928)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !84, file: !79, line: 230, baseType: !88, size: 32, offset: 960)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !84, file: !79, line: 231, baseType: !88, size: 32, offset: 992)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !84, file: !79, line: 233, baseType: !88, size: 32, offset: 1024)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !84, file: !79, line: 234, baseType: !88, size: 32, offset: 1056)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !84, file: !79, line: 236, baseType: !88, size: 32, offset: 1088)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !84, file: !79, line: 237, baseType: !88, size: 32, offset: 1120)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !84, file: !79, line: 239, baseType: !88, size: 32, offset: 1152)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !84, file: !79, line: 240, baseType: !128, size: 64, offset: 1216)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !84, file: !79, line: 241, baseType: !131, size: 128, offset: 1280)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !84, file: !79, line: 242, baseType: !131, size: 128, offset: 1408)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !84, file: !79, line: 243, baseType: !131, size: 128, offset: 1536)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !84, file: !79, line: 244, baseType: !131, size: 128, offset: 1664)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !84, file: !79, line: 245, baseType: !136, size: 512, offset: 1792)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 512, elements: !61)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !84, file: !79, line: 246, baseType: !136, size: 512, offset: 2304)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !84, file: !79, line: 249, baseType: !139, size: 64, offset: 2816)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !142, !88, !143, !145}
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !147)
!147 = !{!148, !149, !150, !151}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !146, file: !3, line: 166, baseType: !7, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !146, file: !3, line: 166, baseType: !7, size: 32, offset: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !146, file: !3, line: 166, baseType: !142, size: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !146, file: !3, line: 166, baseType: !142, size: 64, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !84, file: !79, line: 250, baseType: !142, size: 64, offset: 2880)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !84, file: !79, line: 251, baseType: !88, size: 32, offset: 2944)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !84, file: !79, line: 252, baseType: !88, size: 32, offset: 2976)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !84, file: !79, line: 253, baseType: !128, size: 64, offset: 3008)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !84, file: !79, line: 287, baseType: !157, size: 800, offset: 3072)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !79, line: 256, size: 800, elements: !158)
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !179, !180, !181, !183, !184}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !157, file: !79, line: 258, baseType: !7, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !157, file: !79, line: 259, baseType: !7, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !157, file: !79, line: 261, baseType: !88, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !157, file: !79, line: 262, baseType: !88, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !157, file: !79, line: 263, baseType: !88, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !157, file: !79, line: 264, baseType: !88, size: 32, offset: 160)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !157, file: !79, line: 265, baseType: !88, size: 32, offset: 192)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !157, file: !79, line: 267, baseType: !88, size: 32, offset: 224)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !157, file: !79, line: 268, baseType: !88, size: 32, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !157, file: !79, line: 269, baseType: !88, size: 32, offset: 288)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !157, file: !79, line: 270, baseType: !88, size: 32, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !157, file: !79, line: 271, baseType: !88, size: 32, offset: 352)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !157, file: !79, line: 272, baseType: !88, size: 32, offset: 384)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !157, file: !79, line: 273, baseType: !88, size: 32, offset: 416)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !157, file: !79, line: 274, baseType: !88, size: 32, offset: 448)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !157, file: !79, line: 275, baseType: !88, size: 32, offset: 480)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !157, file: !79, line: 276, baseType: !88, size: 32, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !157, file: !79, line: 277, baseType: !88, size: 32, offset: 544)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !157, file: !79, line: 278, baseType: !178, size: 32, offset: 576)
!178 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !157, file: !79, line: 279, baseType: !178, size: 32, offset: 608)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !157, file: !79, line: 280, baseType: !88, size: 32, offset: 640)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !157, file: !79, line: 283, baseType: !182, size: 64, offset: 672)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 64, elements: !31)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !157, file: !79, line: 285, baseType: !88, size: 32, offset: 736)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !157, file: !79, line: 286, baseType: !88, size: 32, offset: 768)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !84, file: !79, line: 327, baseType: !186, size: 1152, offset: 3904)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !84, file: !79, line: 290, size: 1152, elements: !187)
!187 = !{!188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !225, !226}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !186, file: !79, line: 292, baseType: !88, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !186, file: !79, line: 294, baseType: !88, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !186, file: !79, line: 295, baseType: !88, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !186, file: !79, line: 296, baseType: !88, size: 32, offset: 96)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !186, file: !79, line: 297, baseType: !88, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !186, file: !79, line: 299, baseType: !88, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !186, file: !79, line: 300, baseType: !178, size: 32, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !186, file: !79, line: 301, baseType: !178, size: 32, offset: 224)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !186, file: !79, line: 302, baseType: !178, size: 32, offset: 256)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !186, file: !79, line: 303, baseType: !88, size: 32, offset: 288)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !186, file: !79, line: 304, baseType: !88, size: 32, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !186, file: !79, line: 305, baseType: !178, size: 32, offset: 352)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !186, file: !79, line: 306, baseType: !178, size: 32, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !186, file: !79, line: 307, baseType: !178, size: 32, offset: 416)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !186, file: !79, line: 309, baseType: !88, size: 32, offset: 448)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !186, file: !79, line: 310, baseType: !178, size: 32, offset: 480)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !186, file: !79, line: 311, baseType: !88, size: 32, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !186, file: !79, line: 312, baseType: !88, size: 32, offset: 544)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !186, file: !79, line: 315, baseType: !88, size: 32, offset: 576)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !186, file: !79, line: 316, baseType: !128, size: 64, offset: 640)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !186, file: !79, line: 317, baseType: !88, size: 32, offset: 704)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !186, file: !79, line: 318, baseType: !128, size: 64, offset: 768)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !186, file: !79, line: 321, baseType: !178, size: 32, offset: 832)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !186, file: !79, line: 322, baseType: !178, size: 32, offset: 864)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !186, file: !79, line: 323, baseType: !178, size: 32, offset: 896)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !186, file: !79, line: 324, baseType: !214, size: 64, offset: 960)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !79, line: 174, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 167, size: 256, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !216, file: !79, line: 169, baseType: !88, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !216, file: !79, line: 169, baseType: !88, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !216, file: !79, line: 170, baseType: !88, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !216, file: !79, line: 171, baseType: !88, size: 32, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !216, file: !79, line: 172, baseType: !178, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !216, file: !79, line: 173, baseType: !224, size: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !186, file: !79, line: 325, baseType: !88, size: 32, offset: 1024)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !186, file: !79, line: 326, baseType: !128, size: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !84, file: !79, line: 330, baseType: !88, size: 32, offset: 5056)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !84, file: !79, line: 331, baseType: !88, size: 32, offset: 5088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !84, file: !79, line: 332, baseType: !88, size: 32, offset: 5120)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !84, file: !79, line: 334, baseType: !88, size: 32, offset: 5152)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !84, file: !79, line: 335, baseType: !88, size: 32, offset: 5184)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !84, file: !79, line: 336, baseType: !22, size: 32, offset: 5216)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !84, file: !79, line: 337, baseType: !22, size: 32, offset: 5248)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !84, file: !79, line: 338, baseType: !22, size: 32, offset: 5280)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !84, file: !79, line: 339, baseType: !22, size: 32, offset: 5312)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !84, file: !79, line: 340, baseType: !88, size: 32, offset: 5344)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !84, file: !79, line: 344, baseType: !88, size: 32, offset: 5376)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !84, file: !79, line: 356, baseType: !88, size: 32, offset: 5408)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !84, file: !79, line: 364, baseType: !88, size: 32, offset: 5440)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !84, file: !79, line: 367, baseType: !88, size: 32, offset: 5472)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !84, file: !79, line: 368, baseType: !88, size: 32, offset: 5504)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !84, file: !79, line: 369, baseType: !88, size: 32, offset: 5536)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !84, file: !79, line: 375, baseType: !244, size: 64, offset: 5568)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !142}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !80, file: !18, line: 386, baseType: !248, size: 8256, offset: 5632)
!248 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 8256, elements: !249)
!249 = !{!250}
!250 = !DISubrange(count: 129)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !80, file: !18, line: 387, baseType: !88, size: 32, offset: 13888)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !80, file: !18, line: 388, baseType: !88, size: 32, offset: 13920)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !80, file: !18, line: 389, baseType: !88, size: 32, offset: 13952)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !80, file: !18, line: 390, baseType: !88, size: 32, offset: 13984)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !80, file: !18, line: 391, baseType: !88, size: 32, offset: 14016)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !80, file: !18, line: 402, baseType: !257, size: 576, offset: 14080)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !80, file: !18, line: 394, size: 576, elements: !258)
!258 = !{!259, !260, !261, !271, !272, !273}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !257, file: !18, line: 396, baseType: !88, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !257, file: !18, line: 397, baseType: !88, size: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !257, file: !18, line: 398, baseType: !262, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !79, line: 604, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 593, size: 192, elements: !265)
!265 = !{!266, !267, !268, !269}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !264, file: !79, line: 595, baseType: !88, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !264, file: !79, line: 596, baseType: !88, size: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !264, file: !79, line: 599, baseType: !88, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !264, file: !79, line: 603, baseType: !270, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !257, file: !18, line: 399, baseType: !88, size: 32, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !257, file: !18, line: 400, baseType: !270, size: 64, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !257, file: !18, line: 401, baseType: !274, size: 320, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !275, line: 56, baseType: !276)
!275 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !275, line: 47, size: 320, elements: !277)
!277 = !{!278, !279, !280, !281, !285, !286}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !276, file: !275, line: 49, baseType: !270, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !276, file: !275, line: 50, baseType: !270, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !276, file: !275, line: 51, baseType: !270, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !276, file: !275, line: 53, baseType: !282, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !283, line: 87, baseType: !284)
!283 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!284 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !276, file: !275, line: 54, baseType: !88, size: 32, offset: 256)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !276, file: !275, line: 55, baseType: !88, size: 32, offset: 288)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !80, file: !18, line: 404, baseType: !270, size: 64, offset: 14656)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !80, file: !18, line: 405, baseType: !88, size: 32, offset: 14720)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !80, file: !18, line: 410, baseType: !88, size: 32, offset: 14752)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !80, file: !18, line: 411, baseType: !88, size: 32, offset: 14784)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !80, file: !18, line: 413, baseType: !88, size: 32, offset: 14816)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !80, file: !18, line: 415, baseType: !88, size: 32, offset: 14848)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !80, file: !18, line: 416, baseType: !88, size: 32, offset: 14880)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !80, file: !18, line: 418, baseType: !88, size: 32, offset: 14912)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !80, file: !18, line: 419, baseType: !88, size: 32, offset: 14944)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !80, file: !18, line: 420, baseType: !88, size: 32, offset: 14976)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !80, file: !18, line: 421, baseType: !88, size: 32, offset: 15008)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !80, file: !18, line: 422, baseType: !88, size: 32, offset: 15040)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !80, file: !18, line: 424, baseType: !88, size: 32, offset: 15072)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !80, file: !18, line: 425, baseType: !88, size: 32, offset: 15104)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !80, file: !18, line: 427, baseType: !88, size: 32, offset: 15136)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !80, file: !18, line: 430, baseType: !303, size: 10400, offset: 15168)
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 10400, elements: !390)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !305, line: 154, baseType: !306)
!305 = !DIFile(filename: "x264_src/common/set.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "36bc2db0356ac829288e85d371259e00")
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !305, line: 52, size: 10400, elements: !307)
!307 = !{!308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !325, !326, !327, !328, !329, !330, !331, !332, !333, !340, !341, !389}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !306, file: !305, line: 54, baseType: !88, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !306, file: !305, line: 56, baseType: !88, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !306, file: !305, line: 57, baseType: !88, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !306, file: !305, line: 59, baseType: !88, size: 32, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !306, file: !305, line: 60, baseType: !88, size: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !306, file: !305, line: 61, baseType: !88, size: 32, offset: 160)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !306, file: !305, line: 63, baseType: !88, size: 32, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !306, file: !305, line: 65, baseType: !88, size: 32, offset: 224)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !306, file: !305, line: 67, baseType: !88, size: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !306, file: !305, line: 69, baseType: !88, size: 32, offset: 288)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !306, file: !305, line: 70, baseType: !88, size: 32, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !306, file: !305, line: 71, baseType: !88, size: 32, offset: 352)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !306, file: !305, line: 72, baseType: !88, size: 32, offset: 384)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !306, file: !305, line: 73, baseType: !322, size: 8192, offset: 416)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 8192, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !306, file: !305, line: 75, baseType: !88, size: 32, offset: 8608)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !306, file: !305, line: 76, baseType: !88, size: 32, offset: 8640)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !306, file: !305, line: 77, baseType: !88, size: 32, offset: 8672)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !306, file: !305, line: 78, baseType: !88, size: 32, offset: 8704)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !306, file: !305, line: 79, baseType: !88, size: 32, offset: 8736)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !306, file: !305, line: 80, baseType: !88, size: 32, offset: 8768)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !306, file: !305, line: 81, baseType: !88, size: 32, offset: 8800)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !306, file: !305, line: 83, baseType: !88, size: 32, offset: 8832)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !306, file: !305, line: 90, baseType: !334, size: 128, offset: 8864)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !306, file: !305, line: 84, size: 128, elements: !335)
!335 = !{!336, !337, !338, !339}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !334, file: !305, line: 86, baseType: !88, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !334, file: !305, line: 87, baseType: !88, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !334, file: !305, line: 88, baseType: !88, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !334, file: !305, line: 89, baseType: !88, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !306, file: !305, line: 92, baseType: !88, size: 32, offset: 8992)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !306, file: !305, line: 150, baseType: !342, size: 1344, offset: 9024)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !306, file: !305, line: 93, size: 1344, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !380, !381, !382, !383, !384, !385, !386, !387, !388}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !342, file: !305, line: 95, baseType: !88, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !342, file: !305, line: 96, baseType: !88, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !342, file: !305, line: 97, baseType: !88, size: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !342, file: !305, line: 99, baseType: !88, size: 32, offset: 96)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !342, file: !305, line: 100, baseType: !88, size: 32, offset: 128)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !342, file: !305, line: 102, baseType: !88, size: 32, offset: 160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !342, file: !305, line: 103, baseType: !88, size: 32, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !342, file: !305, line: 104, baseType: !88, size: 32, offset: 224)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !342, file: !305, line: 105, baseType: !88, size: 32, offset: 256)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !342, file: !305, line: 106, baseType: !88, size: 32, offset: 288)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !342, file: !305, line: 107, baseType: !88, size: 32, offset: 320)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !342, file: !305, line: 108, baseType: !88, size: 32, offset: 352)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !342, file: !305, line: 110, baseType: !88, size: 32, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !342, file: !305, line: 111, baseType: !88, size: 32, offset: 416)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !342, file: !305, line: 112, baseType: !88, size: 32, offset: 448)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !342, file: !305, line: 114, baseType: !88, size: 32, offset: 480)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !342, file: !305, line: 115, baseType: !22, size: 32, offset: 512)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !342, file: !305, line: 116, baseType: !22, size: 32, offset: 544)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !342, file: !305, line: 117, baseType: !88, size: 32, offset: 576)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !342, file: !305, line: 119, baseType: !88, size: 32, offset: 608)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !342, file: !305, line: 120, baseType: !88, size: 32, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !342, file: !305, line: 137, baseType: !366, size: 384, offset: 672)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !342, file: !305, line: 122, size: 384, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !366, file: !305, line: 124, baseType: !88, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !366, file: !305, line: 125, baseType: !88, size: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !366, file: !305, line: 126, baseType: !88, size: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !366, file: !305, line: 127, baseType: !88, size: 32, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !366, file: !305, line: 128, baseType: !88, size: 32, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !366, file: !305, line: 129, baseType: !88, size: 32, offset: 160)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !366, file: !305, line: 130, baseType: !88, size: 32, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !366, file: !305, line: 131, baseType: !88, size: 32, offset: 224)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !366, file: !305, line: 133, baseType: !88, size: 32, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !366, file: !305, line: 134, baseType: !88, size: 32, offset: 288)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !366, file: !305, line: 135, baseType: !88, size: 32, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !366, file: !305, line: 136, baseType: !88, size: 32, offset: 352)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !342, file: !305, line: 139, baseType: !88, size: 32, offset: 1056)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !342, file: !305, line: 140, baseType: !88, size: 32, offset: 1088)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !342, file: !305, line: 141, baseType: !88, size: 32, offset: 1120)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !342, file: !305, line: 142, baseType: !88, size: 32, offset: 1152)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !342, file: !305, line: 143, baseType: !88, size: 32, offset: 1184)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !342, file: !305, line: 144, baseType: !88, size: 32, offset: 1216)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !342, file: !305, line: 145, baseType: !88, size: 32, offset: 1248)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !342, file: !305, line: 146, baseType: !88, size: 32, offset: 1280)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !342, file: !305, line: 147, baseType: !88, size: 32, offset: 1312)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !306, file: !305, line: 152, baseType: !88, size: 32, offset: 10368)
!390 = !{!391}
!391 = !DISubrange(count: 1)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !80, file: !18, line: 431, baseType: !393, size: 64, offset: 25600)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !80, file: !18, line: 432, baseType: !395, size: 960, offset: 25664)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !396, size: 960, elements: !390)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !305, line: 186, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !305, line: 156, size: 960, elements: !398)
!398 = !{!399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !397, file: !305, line: 158, baseType: !88, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !397, file: !305, line: 159, baseType: !88, size: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !397, file: !305, line: 161, baseType: !88, size: 32, offset: 64)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !397, file: !305, line: 163, baseType: !88, size: 32, offset: 96)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !397, file: !305, line: 164, baseType: !88, size: 32, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !397, file: !305, line: 166, baseType: !88, size: 32, offset: 160)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !397, file: !305, line: 167, baseType: !88, size: 32, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !397, file: !305, line: 169, baseType: !88, size: 32, offset: 224)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !397, file: !305, line: 170, baseType: !88, size: 32, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !397, file: !305, line: 172, baseType: !88, size: 32, offset: 288)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !397, file: !305, line: 173, baseType: !88, size: 32, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !397, file: !305, line: 175, baseType: !88, size: 32, offset: 352)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !397, file: !305, line: 177, baseType: !88, size: 32, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !397, file: !305, line: 178, baseType: !88, size: 32, offset: 416)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !397, file: !305, line: 179, baseType: !88, size: 32, offset: 448)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !397, file: !305, line: 181, baseType: !88, size: 32, offset: 480)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !397, file: !305, line: 183, baseType: !88, size: 32, offset: 512)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !397, file: !305, line: 184, baseType: !417, size: 384, offset: 576)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 384, elements: !419)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64)
!419 = !{!420}
!420 = !DISubrange(count: 6)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !80, file: !18, line: 433, baseType: !422, size: 64, offset: 26624)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !80, file: !18, line: 434, baseType: !88, size: 32, offset: 26688)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !80, file: !18, line: 437, baseType: !88, size: 32, offset: 26720)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !80, file: !18, line: 440, baseType: !426, size: 256, offset: 26752)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 256, elements: !38)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 512, elements: !64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !80, file: !18, line: 441, baseType: !430, size: 128, offset: 27008)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 128, elements: !31)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 2048, elements: !61)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !80, file: !18, line: 443, baseType: !426, size: 256, offset: 27136)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !80, file: !18, line: 444, baseType: !430, size: 128, offset: 27392)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !80, file: !18, line: 446, baseType: !436, size: 256, offset: 27520)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 256, elements: !38)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 256, elements: !64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !80, file: !18, line: 447, baseType: !440, size: 128, offset: 27776)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 128, elements: !31)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 1024, elements: !61)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !80, file: !18, line: 448, baseType: !436, size: 256, offset: 27904)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !80, file: !18, line: 449, baseType: !440, size: 128, offset: 28160)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !80, file: !18, line: 454, baseType: !446, size: 5888, offset: 28288)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 5888, elements: !448)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!448 = !{!449}
!449 = !DISubrange(count: 92)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !80, file: !18, line: 455, baseType: !451, size: 23552, offset: 34176)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 23552, elements: !452)
!452 = !{!449, !39}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !80, file: !18, line: 457, baseType: !418, size: 64, offset: 57728)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !80, file: !18, line: 460, baseType: !455, size: 53376, offset: 57856)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !18, line: 364, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !18, line: 302, size: 53376, elements: !457)
!457 = !{!458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !486, !515, !516, !517, !523, !524, !525, !526, !527, !528, !529, !530}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !456, file: !18, line: 304, baseType: !393, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !456, file: !18, line: 305, baseType: !422, size: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !456, file: !18, line: 307, baseType: !88, size: 32, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !456, file: !18, line: 308, baseType: !88, size: 32, offset: 160)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !456, file: !18, line: 309, baseType: !88, size: 32, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !456, file: !18, line: 311, baseType: !88, size: 32, offset: 224)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !456, file: !18, line: 313, baseType: !88, size: 32, offset: 256)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !456, file: !18, line: 315, baseType: !88, size: 32, offset: 288)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !456, file: !18, line: 316, baseType: !88, size: 32, offset: 320)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !456, file: !18, line: 317, baseType: !88, size: 32, offset: 352)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !456, file: !18, line: 319, baseType: !88, size: 32, offset: 384)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !456, file: !18, line: 321, baseType: !88, size: 32, offset: 416)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !456, file: !18, line: 322, baseType: !88, size: 32, offset: 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !456, file: !18, line: 324, baseType: !182, size: 64, offset: 480)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !456, file: !18, line: 325, baseType: !88, size: 32, offset: 544)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !456, file: !18, line: 327, baseType: !88, size: 32, offset: 576)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !456, file: !18, line: 329, baseType: !88, size: 32, offset: 608)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !456, file: !18, line: 330, baseType: !88, size: 32, offset: 640)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !456, file: !18, line: 331, baseType: !88, size: 32, offset: 672)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !456, file: !18, line: 333, baseType: !88, size: 32, offset: 704)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !456, file: !18, line: 334, baseType: !88, size: 32, offset: 736)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !456, file: !18, line: 339, baseType: !480, size: 2048, offset: 768)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !481, size: 2048, elements: !485)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !456, file: !18, line: 335, size: 64, elements: !482)
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !481, file: !18, line: 337, baseType: !88, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !481, file: !18, line: 338, baseType: !88, size: 32, offset: 32)
!485 = !{!32, !65}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !456, file: !18, line: 342, baseType: !487, size: 49152, align: 128, offset: 2816)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 49152, align: 128, elements: !512)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !489, line: 36, baseType: !490, align: 128)
!489 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !489, line: 26, size: 512, elements: !491)
!491 = !{!492, !498, !499, !502, !503, !504}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !490, file: !489, line: 30, baseType: !493, size: 128, align: 128)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 128, elements: !54)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !495, line: 25, baseType: !496)
!495 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !25, line: 39, baseType: !497)
!497 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !490, file: !489, line: 31, baseType: !493, size: 128, offset: 128)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !490, file: !489, line: 32, baseType: !500, size: 32, offset: 256)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !495, line: 26, baseType: !501)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !25, line: 41, baseType: !88)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !490, file: !489, line: 33, baseType: !500, size: 32, offset: 288)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !490, file: !489, line: 34, baseType: !500, size: 32, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !490, file: !489, line: 35, baseType: !505, size: 64, offset: 384)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !489, line: 25, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !270, !88, !270, !88, !510, !88}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!512 = !{!513, !514}
!513 = !DISubrange(count: 32)
!514 = !DISubrange(count: 3)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !456, file: !18, line: 344, baseType: !88, size: 32, offset: 51968)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !456, file: !18, line: 345, baseType: !88, size: 32, offset: 52000)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !456, file: !18, line: 350, baseType: !518, size: 1024, offset: 52032)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 1024, elements: !64)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !456, file: !18, line: 346, size: 64, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !519, file: !18, line: 348, baseType: !88, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !519, file: !18, line: 349, baseType: !88, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !456, file: !18, line: 352, baseType: !88, size: 32, offset: 53056)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !456, file: !18, line: 354, baseType: !88, size: 32, offset: 53088)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !456, file: !18, line: 355, baseType: !88, size: 32, offset: 53120)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !456, file: !18, line: 356, baseType: !88, size: 32, offset: 53152)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !456, file: !18, line: 357, baseType: !88, size: 32, offset: 53184)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !456, file: !18, line: 360, baseType: !88, size: 32, offset: 53216)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !456, file: !18, line: 361, baseType: !88, size: 32, offset: 53248)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !456, file: !18, line: 362, baseType: !88, size: 32, offset: 53280)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !80, file: !18, line: 463, baseType: !532, size: 4096, offset: 111232)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !533, line: 46, baseType: !534)
!533 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !533, line: 27, size: 4096, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !534, file: !533, line: 30, baseType: !88, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !534, file: !533, line: 31, baseType: !88, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !534, file: !533, line: 34, baseType: !88, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !534, file: !533, line: 35, baseType: !88, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !534, file: !533, line: 37, baseType: !270, size: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !534, file: !533, line: 38, baseType: !270, size: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !534, file: !533, line: 39, baseType: !270, size: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !534, file: !533, line: 42, baseType: !88, size: 32, align: 128, offset: 384)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !534, file: !533, line: 45, baseType: !545, size: 3680, offset: 416)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 3680, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 460)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !80, file: !18, line: 494, baseType: !549, size: 2112, offset: 115328)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !80, file: !18, line: 465, size: 2112, elements: !550)
!550 = !{!551, !689, !691, !692, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !705, !706, !707, !708}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !549, file: !18, line: 468, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !555, line: 146, baseType: !556)
!555 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !555, line: 31, size: 125056, elements: !557)
!557 = !{!558, !559, !560, !561, !564, !565, !566, !567, !568, !569, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !588, !589, !590, !591, !592, !593, !595, !597, !598, !599, !600, !601, !604, !606, !607, !609, !614, !615, !619, !620, !624, !628, !631, !633, !634, !636, !637, !639, !640, !641, !644, !646, !647, !648, !650, !651, !652, !653, !654, !655, !656, !657, !659, !660, !661, !670, !674, !676, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !556, file: !555, line: 34, baseType: !88, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !556, file: !555, line: 35, baseType: !88, size: 32, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !556, file: !555, line: 36, baseType: !88, size: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !556, file: !555, line: 37, baseType: !562, size: 64, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !495, line: 27, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !25, line: 44, baseType: !284)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !556, file: !555, line: 38, baseType: !562, size: 64, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !556, file: !555, line: 39, baseType: !88, size: 32, offset: 256)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !556, file: !555, line: 40, baseType: !88, size: 32, offset: 288)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !556, file: !555, line: 41, baseType: !88, size: 32, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !556, file: !555, line: 42, baseType: !88, size: 32, offset: 352)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !556, file: !555, line: 43, baseType: !570, size: 64, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !556, file: !555, line: 45, baseType: !88, size: 32, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !556, file: !555, line: 46, baseType: !88, size: 32, offset: 480)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !556, file: !555, line: 47, baseType: !88, size: 32, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !556, file: !555, line: 48, baseType: !88, size: 32, offset: 544)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !556, file: !555, line: 49, baseType: !88, size: 32, offset: 576)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !556, file: !555, line: 50, baseType: !88, size: 32, offset: 608)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !556, file: !555, line: 51, baseType: !88, size: 32, offset: 640)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !556, file: !555, line: 52, baseType: !35, size: 8, offset: 672)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !556, file: !555, line: 53, baseType: !35, size: 8, offset: 680)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !556, file: !555, line: 54, baseType: !35, size: 8, offset: 688)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !556, file: !555, line: 55, baseType: !178, size: 32, offset: 704)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !556, file: !555, line: 56, baseType: !178, size: 32, offset: 736)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !556, file: !555, line: 57, baseType: !88, size: 32, offset: 768)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !556, file: !555, line: 60, baseType: !88, size: 32, offset: 800)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !556, file: !555, line: 61, baseType: !586, size: 96, offset: 832)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 96, elements: !587)
!587 = !{!514}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !556, file: !555, line: 62, baseType: !586, size: 96, offset: 928)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !556, file: !555, line: 63, baseType: !586, size: 96, offset: 1024)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !556, file: !555, line: 64, baseType: !88, size: 32, offset: 1120)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !556, file: !555, line: 65, baseType: !88, size: 32, offset: 1152)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !556, file: !555, line: 66, baseType: !88, size: 32, offset: 1184)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !556, file: !555, line: 67, baseType: !594, size: 192, offset: 1216)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 192, elements: !587)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !556, file: !555, line: 68, baseType: !596, size: 256, offset: 1408)
!596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 256, elements: !38)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !556, file: !555, line: 69, baseType: !596, size: 256, offset: 1664)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !556, file: !555, line: 70, baseType: !447, size: 64, offset: 1920)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !556, file: !555, line: 74, baseType: !596, size: 256, offset: 1984)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !556, file: !555, line: 75, baseType: !596, size: 256, offset: 2240)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !556, file: !555, line: 77, baseType: !602, size: 24576, align: 128, offset: 2560)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 24576, align: 128, elements: !603)
!603 = !{!65, !514}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !556, file: !555, line: 78, baseType: !605, size: 1024, offset: 27136)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 1024, elements: !64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !556, file: !555, line: 79, baseType: !88, size: 32, offset: 28160)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !556, file: !555, line: 80, baseType: !608, size: 64, offset: 28224)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !556, file: !555, line: 83, baseType: !610, size: 64, offset: 28288)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !495, line: 24, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !25, line: 37, baseType: !613)
!613 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !556, file: !555, line: 84, baseType: !270, size: 64, offset: 28352)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !556, file: !555, line: 85, baseType: !616, size: 128, offset: 28416)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 128, elements: !31)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 32, elements: !31)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !556, file: !555, line: 86, baseType: !617, size: 64, offset: 28544)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !556, file: !555, line: 87, baseType: !621, size: 2176, offset: 28608)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 2176, elements: !622)
!622 = !{!32, !623}
!623 = !DISubrange(count: 17)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !556, file: !555, line: 92, baseType: !625, size: 20736, offset: 30784)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 20736, elements: !626)
!626 = !{!627, !627}
!627 = !DISubrange(count: 18)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !556, file: !555, line: 96, baseType: !629, size: 2176, offset: 51520)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 2176, elements: !622)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !556, file: !555, line: 97, baseType: !632, size: 128, offset: 53696)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 128, elements: !31)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !556, file: !555, line: 98, baseType: !182, size: 64, offset: 53824)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !556, file: !555, line: 99, baseType: !635, size: 1024, offset: 53888)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 1024, elements: !485)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !556, file: !555, line: 100, baseType: !618, size: 32, offset: 54912)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !556, file: !555, line: 105, baseType: !638, size: 10368, offset: 54944)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 10368, elements: !626)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !556, file: !555, line: 106, baseType: !638, size: 10368, offset: 65312)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !556, file: !555, line: 107, baseType: !88, size: 32, offset: 75680)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !556, file: !555, line: 108, baseType: !642, size: 576, offset: 75712)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 576, elements: !643)
!643 = !{!627}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !556, file: !555, line: 109, baseType: !645, size: 20736, offset: 76288)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 20736, elements: !626)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !556, file: !555, line: 110, baseType: !630, size: 64, offset: 97024)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !556, file: !555, line: 111, baseType: !630, size: 64, offset: 97088)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !556, file: !555, line: 112, baseType: !649, size: 64, offset: 97152)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !556, file: !555, line: 113, baseType: !649, size: 64, offset: 97216)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !556, file: !555, line: 114, baseType: !649, size: 64, offset: 97280)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !556, file: !555, line: 115, baseType: !88, size: 32, offset: 97344)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !556, file: !555, line: 116, baseType: !447, size: 64, offset: 97408)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !556, file: !555, line: 117, baseType: !447, size: 64, offset: 97472)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !556, file: !555, line: 118, baseType: !447, size: 64, offset: 97536)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !556, file: !555, line: 119, baseType: !88, size: 32, offset: 97600)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !556, file: !555, line: 120, baseType: !658, size: 576, offset: 97632)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 576, elements: !643)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !556, file: !555, line: 121, baseType: !22, size: 32, offset: 98208)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !556, file: !555, line: 122, baseType: !45, size: 64, offset: 98240)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !556, file: !555, line: 125, baseType: !662, size: 256, offset: 98304)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !79, line: 503, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !79, line: 496, size: 256, elements: !664)
!664 = !{!665, !667, !668, !669}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !663, file: !79, line: 498, baseType: !666, size: 64)
!666 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !663, file: !79, line: 499, baseType: !666, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !663, file: !79, line: 500, baseType: !666, size: 64, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !663, file: !79, line: 502, baseType: !666, size: 64, offset: 192)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !556, file: !555, line: 128, baseType: !671, size: 2008, offset: 98560)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2008, elements: !672)
!672 = !{!673}
!673 = !DISubrange(count: 251)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !556, file: !555, line: 129, baseType: !675, size: 8032, offset: 100576)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 8032, elements: !672)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !556, file: !555, line: 130, baseType: !677, size: 16064, offset: 108608)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 16064, elements: !672)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !556, file: !555, line: 131, baseType: !88, size: 32, offset: 124672)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !556, file: !555, line: 132, baseType: !88, size: 32, offset: 124704)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !556, file: !555, line: 135, baseType: !88, size: 32, offset: 124736)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !556, file: !555, line: 136, baseType: !88, size: 32, offset: 124768)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !556, file: !555, line: 137, baseType: !88, size: 32, offset: 124800)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !556, file: !555, line: 138, baseType: !88, size: 32, offset: 124832)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !556, file: !555, line: 139, baseType: !88, size: 32, offset: 124864)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !556, file: !555, line: 142, baseType: !178, size: 32, offset: 124896)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !556, file: !555, line: 143, baseType: !88, size: 32, offset: 124928)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !556, file: !555, line: 144, baseType: !88, size: 32, offset: 124960)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !556, file: !555, line: 145, baseType: !88, size: 32, offset: 124992)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !549, file: !18, line: 470, baseType: !690, size: 128, offset: 64)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 128, elements: !31)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !549, file: !18, line: 473, baseType: !552, size: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !549, file: !18, line: 476, baseType: !693, size: 1152, offset: 256)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 1152, elements: !643)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !549, file: !18, line: 478, baseType: !88, size: 32, offset: 1408)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !549, file: !18, line: 480, baseType: !88, size: 32, offset: 1440)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !549, file: !18, line: 482, baseType: !88, size: 32, offset: 1472)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !549, file: !18, line: 483, baseType: !88, size: 32, offset: 1504)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !549, file: !18, line: 484, baseType: !88, size: 32, offset: 1536)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !549, file: !18, line: 485, baseType: !88, size: 32, offset: 1568)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !549, file: !18, line: 486, baseType: !88, size: 32, offset: 1600)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !549, file: !18, line: 487, baseType: !562, size: 64, offset: 1664)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !549, file: !18, line: 488, baseType: !562, size: 64, offset: 1728)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !549, file: !18, line: 489, baseType: !704, size: 128, offset: 1792)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 128, elements: !31)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !549, file: !18, line: 490, baseType: !562, size: 64, offset: 1920)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !549, file: !18, line: 491, baseType: !562, size: 64, offset: 1984)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !549, file: !18, line: 492, baseType: !88, size: 32, offset: 2048)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !549, file: !18, line: 493, baseType: !88, size: 32, offset: 2080)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !80, file: !18, line: 497, baseType: !553, size: 64, offset: 117440)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !80, file: !18, line: 500, baseType: !553, size: 64, offset: 117504)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !80, file: !18, line: 503, baseType: !88, size: 32, offset: 117568)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !80, file: !18, line: 504, baseType: !713, size: 1216, offset: 117632)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 1216, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 19)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !80, file: !18, line: 505, baseType: !88, size: 32, offset: 118848)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !80, file: !18, line: 506, baseType: !713, size: 1216, offset: 118912)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !80, file: !18, line: 507, baseType: !182, size: 64, offset: 120128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !80, file: !18, line: 510, baseType: !88, size: 32, offset: 120192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !80, file: !18, line: 511, baseType: !88, size: 32, offset: 120224)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !80, file: !18, line: 512, baseType: !562, size: 64, offset: 120256)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !80, file: !18, line: 522, baseType: !723, size: 10624, offset: 120320)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !80, file: !18, line: 515, size: 10624, elements: !724)
!724 = !{!725, !727, !730, !733}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !723, file: !18, line: 517, baseType: !726, size: 256, align: 128)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 256, elements: !64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !723, file: !18, line: 518, baseType: !728, size: 128, align: 128, offset: 256)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 128, elements: !729)
!729 = !{!32, !39}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !723, file: !18, line: 520, baseType: !731, size: 4096, align: 128, offset: 384)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 4096, elements: !732)
!732 = !{!39, !62}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !723, file: !18, line: 521, baseType: !734, size: 6144, align: 128, offset: 4480)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 6144, elements: !735)
!735 = !{!736, !65}
!736 = !DISubrange(count: 24)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !80, file: !18, line: 732, baseType: !738, size: 82688, offset: 130944)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !80, file: !18, line: 525, size: 82688, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !767, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !785, !788, !792, !793, !794, !799, !800, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !868, !899, !900, !901, !902, !903, !904, !905, !906, !907, !910, !911, !912, !915, !918, !920, !923, !925, !926}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !738, file: !18, line: 527, baseType: !88, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !738, file: !18, line: 530, baseType: !88, size: 32, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !738, file: !18, line: 531, baseType: !88, size: 32, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !738, file: !18, line: 532, baseType: !88, size: 32, offset: 96)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !738, file: !18, line: 535, baseType: !88, size: 32, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !738, file: !18, line: 536, baseType: !88, size: 32, offset: 160)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !738, file: !18, line: 537, baseType: !88, size: 32, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !738, file: !18, line: 538, baseType: !88, size: 32, offset: 224)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !738, file: !18, line: 539, baseType: !88, size: 32, offset: 256)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !738, file: !18, line: 542, baseType: !88, size: 32, offset: 288)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !738, file: !18, line: 543, baseType: !88, size: 32, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !738, file: !18, line: 544, baseType: !88, size: 32, offset: 352)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !738, file: !18, line: 545, baseType: !88, size: 32, offset: 384)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !738, file: !18, line: 546, baseType: !88, size: 32, offset: 416)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !738, file: !18, line: 547, baseType: !88, size: 32, offset: 448)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !738, file: !18, line: 548, baseType: !88, size: 32, offset: 480)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !738, file: !18, line: 549, baseType: !88, size: 32, offset: 512)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !738, file: !18, line: 551, baseType: !88, size: 32, offset: 544)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !738, file: !18, line: 554, baseType: !182, size: 64, offset: 576)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !738, file: !18, line: 555, baseType: !182, size: 64, offset: 640)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !738, file: !18, line: 558, baseType: !182, size: 64, offset: 704)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !738, file: !18, line: 559, baseType: !182, size: 64, offset: 768)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !738, file: !18, line: 561, baseType: !182, size: 64, offset: 832)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !738, file: !18, line: 562, baseType: !182, size: 64, offset: 896)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !738, file: !18, line: 565, baseType: !7, size: 32, offset: 960)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !738, file: !18, line: 566, baseType: !766, size: 128, offset: 992)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !38)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !738, file: !18, line: 567, baseType: !768, size: 512, offset: 1120)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !738, file: !18, line: 568, baseType: !7, size: 32, offset: 1632)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !738, file: !18, line: 569, baseType: !7, size: 32, offset: 1664)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !738, file: !18, line: 570, baseType: !88, size: 32, offset: 1696)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !738, file: !18, line: 571, baseType: !88, size: 32, offset: 1728)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !738, file: !18, line: 572, baseType: !88, size: 32, offset: 1760)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !738, file: !18, line: 573, baseType: !88, size: 32, offset: 1792)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !738, file: !18, line: 574, baseType: !88, size: 32, offset: 1824)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !738, file: !18, line: 575, baseType: !88, size: 32, offset: 1856)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !738, file: !18, line: 576, baseType: !88, size: 32, offset: 1888)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !738, file: !18, line: 577, baseType: !88, size: 32, offset: 1920)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !738, file: !18, line: 578, baseType: !88, size: 32, offset: 1952)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !738, file: !18, line: 585, baseType: !610, size: 64, offset: 1984)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !738, file: !18, line: 586, baseType: !270, size: 64, offset: 2048)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !738, file: !18, line: 587, baseType: !610, size: 64, offset: 2112)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !738, file: !18, line: 588, baseType: !784, size: 64, offset: 2176)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !738, file: !18, line: 589, baseType: !786, size: 64, offset: 2240)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 64, elements: !54)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !738, file: !18, line: 591, baseType: !789, size: 64, offset: 2304)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 192, elements: !791)
!791 = !{!736}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !738, file: !18, line: 592, baseType: !610, size: 64, offset: 2368)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !738, file: !18, line: 593, baseType: !616, size: 128, offset: 2432)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !738, file: !18, line: 594, baseType: !795, size: 128, offset: 2560)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 128, elements: !31)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 128, elements: !798)
!798 = !{!55, !32}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !738, file: !18, line: 595, baseType: !632, size: 128, offset: 2688)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !738, file: !18, line: 596, baseType: !801, size: 4096, offset: 2816)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 4096, elements: !802)
!802 = !{!32, !513}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !738, file: !18, line: 597, baseType: !610, size: 64, offset: 6912)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !738, file: !18, line: 598, baseType: !610, size: 64, offset: 6976)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !738, file: !18, line: 599, baseType: !447, size: 64, offset: 7040)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !738, file: !18, line: 603, baseType: !605, size: 1024, offset: 7104)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !738, file: !18, line: 606, baseType: !88, size: 32, offset: 8128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !738, file: !18, line: 607, baseType: !88, size: 32, offset: 8160)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !738, file: !18, line: 608, baseType: !34, size: 32, align: 32, offset: 8192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !738, file: !18, line: 609, baseType: !88, size: 32, offset: 8224)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !738, file: !18, line: 611, baseType: !88, size: 32, offset: 8256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !738, file: !18, line: 612, baseType: !88, size: 32, offset: 8288)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !738, file: !18, line: 614, baseType: !88, size: 32, offset: 8320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !738, file: !18, line: 615, baseType: !88, size: 32, offset: 8352)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !738, file: !18, line: 621, baseType: !88, size: 32, offset: 8384)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !738, file: !18, line: 624, baseType: !88, size: 32, offset: 8416)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !738, file: !18, line: 626, baseType: !88, size: 32, offset: 8448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !738, file: !18, line: 627, baseType: !88, size: 32, offset: 8480)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !738, file: !18, line: 671, baseType: !820, size: 60672, offset: 8576)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !738, file: !18, line: 629, size: 60672, elements: !821)
!821 = !{!822, !826, !830, !832, !833, !836, !840, !842, !843, !844, !845, !846, !849, !853, !856, !857, !858, !859, !860, !863, !865, !867}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !820, file: !18, line: 634, baseType: !823, size: 3072, align: 128)
!823 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 3072, elements: !824)
!824 = !{!825}
!825 = !DISubrange(count: 384)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !820, file: !18, line: 635, baseType: !827, size: 6912, align: 128, offset: 3072)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 6912, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 864)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !820, file: !18, line: 638, baseType: !831, size: 2048, align: 128, offset: 9984)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !35, size: 2048, elements: !323)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !820, file: !18, line: 639, baseType: !831, size: 2048, align: 128, offset: 12032)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !820, file: !18, line: 640, baseType: !834, size: 3072, align: 128, offset: 14080)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 3072, elements: !835)
!835 = !{!514, !62}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !820, file: !18, line: 641, baseType: !837, size: 3840, align: 128, offset: 17152)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, size: 3840, elements: !838)
!838 = !{!839, !65}
!839 = !DISubrange(count: 15)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !820, file: !18, line: 642, baseType: !841, size: 128, offset: 20992)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 128, elements: !38)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !820, file: !18, line: 643, baseType: !841, size: 128, offset: 21120)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !820, file: !18, line: 644, baseType: !88, size: 32, offset: 21248)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_cbp", scope: !820, file: !18, line: 645, baseType: !88, size: 32, offset: 21280)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct8", scope: !820, file: !18, line: 648, baseType: !731, size: 4096, align: 128, offset: 21376)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_dct4", scope: !820, file: !18, line: 649, baseType: !847, size: 4096, align: 128, offset: 25472)
