; ModuleID = 'x264_src/common/set.c'
source_filename = "x264_src/common/set.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

@dequant4_scale = internal unnamed_addr constant [6 x [3 x i8]] [[3 x i8] c"\0A\0D\10", [3 x i8] c"\0B\0E\12", [3 x i8] c"\0D\10\14", [3 x i8] c"\0E\12\17", [3 x i8] c"\10\14\19", [3 x i8] c"\12\17\1D"], align 16, !dbg !0
@quant4_scale = internal unnamed_addr constant [6 x [3 x i16]] [[3 x i16] [i16 13107, i16 8066, i16 5243], [3 x i16] [i16 11916, i16 7490, i16 4660], [3 x i16] [i16 10082, i16 6554, i16 4194], [3 x i16] [i16 9362, i16 5825, i16 3647], [3 x i16] [i16 8192, i16 5243, i16 3355], [3 x i16] [i16 7282, i16 4559, i16 2893]], align 16, !dbg !60
@quant8_scan = internal unnamed_addr constant [16 x i8] c"\00\03\04\03\03\01\05\01\04\05\02\05\03\01\05\01", align 16, !dbg !72
@dequant8_scale = internal unnamed_addr constant [6 x [6 x i8]] [[6 x i8] c"\14\12 \13\19\18", [6 x i8] c"\16\13#\15\1C\1A", [6 x i8] c"\1A\17*\18!\1F", [6 x i8] c"\1C\19-\1A#!", [6 x i8] c" \1C3\1E(&", [6 x i8] c"$ :\22.+"], align 16, !dbg !79

!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 288, elements: !82)
!82 = !{!70, !70}
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "quant8_scale", scope: !2, file: !3, line: 58, type: !85, isLocal: true, isDefinition: true)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 576, elements: !82)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(scope: null, file: !3, line: 234, type: !88, isLocal: true, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 32, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 4)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(scope: null, file: !3, line: 236, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 40, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 5)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(scope: null, file: !3, line: 236, type: !98, isLocal: true, isDefinition: true)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 88, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 11)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(scope: null, file: !3, line: 239, type: !103, isLocal: true, isDefinition: true)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 24, elements: !104)
!104 = !{!71}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(scope: null, file: !3, line: 247, type: !107, isLocal: true, isDefinition: true)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 240, elements: !108)
!108 = !{!109}
!109 = !DISubrange(count: 30)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(scope: null, file: !3, line: 255, type: !112, isLocal: true, isDefinition: true)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 304, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 38)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "x264_cqm_jvt4i", scope: !2, file: !6, line: 189, type: !74, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "x264_cqm_jvt4p", scope: !2, file: !6, line: 196, type: !74, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "x264_cqm_jvt8i", scope: !2, file: !6, line: 203, type: !121, isLocal: true, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 512, elements: !20)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "x264_cqm_jvt8p", scope: !2, file: !6, line: 214, type: !121, isLocal: true, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 144, elements: !69)
!125 = !{i32 7, !"Dwarf Version", i32 5}
!126 = !{i32 2, !"Debug Info Version", i32 3}
!127 = !{i32 1, !"wchar_size", i32 4}
!128 = !{i32 8, !"PIC Level", i32 2}
!129 = !{i32 7, !"PIE Level", i32 2}
!130 = !{i32 7, !"uwtable", i32 2}
!131 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!132 = !{!"clang version 19.0.0git (git@github.com:QuqqU/GPUISel-llvm.git ed922481952e7fbe7b5da8613bc5ccf78f796536)"}
!133 = distinct !DISubprogram(name: "x264_cqm_init", scope: !3, file: !3, line: 68, type: !134, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1424)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !137}
!136 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_t", file: !139, line: 46, baseType: !140)
!139 = !DIFile(filename: "x264_src/x264.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "0b04871e4f52d5a4d8833c501cba2584")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_t", file: !141, line: 381, size: 266752, elements: !142)
!141 = !DIFile(filename: "x264_src/common/common.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5afac7bf2f5673f1628c455d7d320ad7")
!142 = !{!143, !307, !311, !312, !313, !314, !315, !316, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !451, !453, !479, !481, !482, !483, !487, !491, !492, !493, !497, !501, !502, !503, !508, !511, !512, !590, !607, !770, !771, !772, !773, !777, !778, !779, !780, !781, !782, !783, !798, !990, !994, !1053, !1056, !1058, !1060, !1061, !1064, !1069, !1078, !1079, !1087, !1089, !1094, !1170, !1256, !1300, !1322, !1371, !1400}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !140, file: !141, line: 384, baseType: !144, size: 5632)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_param_t", file: !139, line: 376, baseType: !145)
!145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_param_t", file: !139, line: 176, size: 5632, elements: !146)
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !189, !191, !192, !193, !194, !196, !197, !210, !211, !212, !213, !214, !243, !285, !286, !287, !288, !289, !290, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !145, file: !139, line: 179, baseType: !7, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "i_threads", scope: !145, file: !139, line: 180, baseType: !136, size: 32, offset: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "b_sliced_threads", scope: !145, file: !139, line: 181, baseType: !136, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "b_deterministic", scope: !145, file: !139, line: 182, baseType: !136, size: 32, offset: 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "i_sync_lookahead", scope: !145, file: !139, line: 183, baseType: !136, size: 32, offset: 128)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !145, file: !139, line: 186, baseType: !136, size: 32, offset: 160)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "i_height", scope: !145, file: !139, line: 187, baseType: !136, size: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "i_csp", scope: !145, file: !139, line: 188, baseType: !136, size: 32, offset: 224)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !145, file: !139, line: 189, baseType: !136, size: 32, offset: 256)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_total", scope: !145, file: !139, line: 190, baseType: !136, size: 32, offset: 288)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_hrd", scope: !145, file: !139, line: 198, baseType: !136, size: 32, offset: 320)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !145, file: !139, line: 215, baseType: !159, size: 288, offset: 352)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !145, file: !139, line: 200, size: 288, elements: !160)
!160 = !{!161, !162, !163, !164, !165, !166, !167, !168, !169}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !159, file: !139, line: 203, baseType: !136, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !159, file: !139, line: 204, baseType: !136, size: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "i_overscan", scope: !159, file: !139, line: 206, baseType: !136, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !159, file: !139, line: 209, baseType: !136, size: 32, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !159, file: !139, line: 210, baseType: !136, size: 32, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !159, file: !139, line: 211, baseType: !136, size: 32, offset: 160)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !159, file: !139, line: 212, baseType: !136, size: 32, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !159, file: !139, line: 213, baseType: !136, size: 32, offset: 224)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc", scope: !159, file: !139, line: 214, baseType: !136, size: 32, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_reference", scope: !145, file: !139, line: 218, baseType: !136, size: 32, offset: 640)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_max", scope: !145, file: !139, line: 219, baseType: !136, size: 32, offset: 672)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "i_keyint_min", scope: !145, file: !139, line: 220, baseType: !136, size: 32, offset: 704)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "i_scenecut_threshold", scope: !145, file: !139, line: 221, baseType: !136, size: 32, offset: 736)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_refresh", scope: !145, file: !139, line: 222, baseType: !136, size: 32, offset: 768)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe", scope: !145, file: !139, line: 224, baseType: !136, size: 32, offset: 800)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_adaptive", scope: !145, file: !139, line: 225, baseType: !136, size: 32, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_bias", scope: !145, file: !139, line: 226, baseType: !136, size: 32, offset: 864)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_pyramid", scope: !145, file: !139, line: 227, baseType: !136, size: 32, offset: 896)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter", scope: !145, file: !139, line: 229, baseType: !136, size: 32, offset: 928)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_alphac0", scope: !145, file: !139, line: 230, baseType: !136, size: 32, offset: 960)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "i_deblocking_filter_beta", scope: !145, file: !139, line: 231, baseType: !136, size: 32, offset: 992)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !145, file: !139, line: 233, baseType: !136, size: 32, offset: 1024)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !145, file: !139, line: 234, baseType: !136, size: 32, offset: 1056)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !145, file: !139, line: 236, baseType: !136, size: 32, offset: 1088)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra", scope: !145, file: !139, line: 237, baseType: !136, size: 32, offset: 1120)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !145, file: !139, line: 239, baseType: !136, size: 32, offset: 1152)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "psz_cqm_file", scope: !145, file: !139, line: 240, baseType: !188, size: 64, offset: 1216)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4iy", scope: !145, file: !139, line: 241, baseType: !190, size: 128, offset: 1280)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 128, elements: !50)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4ic", scope: !145, file: !139, line: 242, baseType: !190, size: 128, offset: 1408)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4py", scope: !145, file: !139, line: 243, baseType: !190, size: 128, offset: 1536)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_4pc", scope: !145, file: !139, line: 244, baseType: !190, size: 128, offset: 1664)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8iy", scope: !145, file: !139, line: 245, baseType: !195, size: 512, offset: 1792)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 512, elements: !20)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cqm_8py", scope: !145, file: !139, line: 246, baseType: !195, size: 512, offset: 2304)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pf_log", scope: !145, file: !139, line: 249, baseType: !198, size: 64, offset: 2816)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !14, !136, !201, !203}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !205)
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !204, file: !3, baseType: !7, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !204, file: !3, baseType: !7, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !204, file: !3, baseType: !14, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !204, file: !3, baseType: !14, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "p_log_private", scope: !145, file: !139, line: 250, baseType: !14, size: 64, offset: 2880)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "i_log_level", scope: !145, file: !139, line: 251, baseType: !136, size: 32, offset: 2944)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "b_visualize", scope: !145, file: !139, line: 252, baseType: !136, size: 32, offset: 2976)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "psz_dump_yuv", scope: !145, file: !139, line: 253, baseType: !188, size: 64, offset: 3008)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "analyse", scope: !145, file: !139, line: 287, baseType: !215, size: 800, offset: 3072)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !145, file: !139, line: 256, size: 800, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !237, !238, !239, !241, !242}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "intra", scope: !215, file: !139, line: 258, baseType: !7, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "inter", scope: !215, file: !139, line: 259, baseType: !7, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !215, file: !139, line: 261, baseType: !136, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "i_weighted_pred", scope: !215, file: !139, line: 262, baseType: !136, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !215, file: !139, line: 263, baseType: !136, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "i_direct_mv_pred", scope: !215, file: !139, line: 264, baseType: !136, size: 32, offset: 160)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_offset", scope: !215, file: !139, line: 265, baseType: !136, size: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !215, file: !139, line: 267, baseType: !136, size: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_range", scope: !215, file: !139, line: 268, baseType: !136, size: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range", scope: !215, file: !139, line: 269, baseType: !136, size: 32, offset: 288)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "i_mv_range_thread", scope: !215, file: !139, line: 270, baseType: !136, size: 32, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !215, file: !139, line: 271, baseType: !136, size: 32, offset: 352)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !215, file: !139, line: 272, baseType: !136, size: 32, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "b_mixed_references", scope: !215, file: !139, line: 273, baseType: !136, size: 32, offset: 416)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "i_trellis", scope: !215, file: !139, line: 274, baseType: !136, size: 32, offset: 448)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "b_fast_pskip", scope: !215, file: !139, line: 275, baseType: !136, size: 32, offset: 480)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !215, file: !139, line: 276, baseType: !136, size: 32, offset: 512)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "i_noise_reduction", scope: !215, file: !139, line: 277, baseType: !136, size: 32, offset: 544)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_rd", scope: !215, file: !139, line: 278, baseType: !236, size: 32, offset: 576)
!236 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "f_psy_trellis", scope: !215, file: !139, line: 279, baseType: !236, size: 32, offset: 608)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "b_psy", scope: !215, file: !139, line: 280, baseType: !136, size: 32, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "i_luma_deadzone", scope: !215, file: !139, line: 283, baseType: !240, size: 64, offset: 672)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 64, elements: !40)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "b_psnr", scope: !215, file: !139, line: 285, baseType: !136, size: 32, offset: 736)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "b_ssim", scope: !215, file: !139, line: 286, baseType: !136, size: 32, offset: 768)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "rc", scope: !145, file: !139, line: 327, baseType: !244, size: 1152, offset: 3904)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !145, file: !139, line: 290, size: 1152, elements: !245)
!245 = !{!246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !283, !284}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "i_rc_method", scope: !244, file: !139, line: 292, baseType: !136, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_constant", scope: !244, file: !139, line: 294, baseType: !136, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_min", scope: !244, file: !139, line: 295, baseType: !136, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_max", scope: !244, file: !139, line: 296, baseType: !136, size: 32, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_step", scope: !244, file: !139, line: 297, baseType: !136, size: 32, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitrate", scope: !244, file: !139, line: 299, baseType: !136, size: 32, offset: 160)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant", scope: !244, file: !139, line: 300, baseType: !236, size: 32, offset: 192)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "f_rf_constant_max", scope: !244, file: !139, line: 301, baseType: !236, size: 32, offset: 224)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "f_rate_tolerance", scope: !244, file: !139, line: 302, baseType: !236, size: 32, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_max_bitrate", scope: !244, file: !139, line: 303, baseType: !136, size: 32, offset: 288)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "i_vbv_buffer_size", scope: !244, file: !139, line: 304, baseType: !136, size: 32, offset: 320)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "f_vbv_buffer_init", scope: !244, file: !139, line: 305, baseType: !236, size: 32, offset: 352)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "f_ip_factor", scope: !244, file: !139, line: 306, baseType: !236, size: 32, offset: 384)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "f_pb_factor", scope: !244, file: !139, line: 307, baseType: !236, size: 32, offset: 416)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "i_aq_mode", scope: !244, file: !139, line: 309, baseType: !136, size: 32, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "f_aq_strength", scope: !244, file: !139, line: 310, baseType: !236, size: 32, offset: 480)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_tree", scope: !244, file: !139, line: 311, baseType: !136, size: 32, offset: 512)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "i_lookahead", scope: !244, file: !139, line: 312, baseType: !136, size: 32, offset: 544)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_write", scope: !244, file: !139, line: 315, baseType: !136, size: 32, offset: 576)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_out", scope: !244, file: !139, line: 316, baseType: !188, size: 64, offset: 640)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "b_stat_read", scope: !244, file: !139, line: 317, baseType: !136, size: 32, offset: 704)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "psz_stat_in", scope: !244, file: !139, line: 318, baseType: !188, size: 64, offset: 768)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "f_qcompress", scope: !244, file: !139, line: 321, baseType: !236, size: 32, offset: 832)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "f_qblur", scope: !244, file: !139, line: 322, baseType: !236, size: 32, offset: 864)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "f_complexity_blur", scope: !244, file: !139, line: 323, baseType: !236, size: 32, offset: 896)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "zones", scope: !244, file: !139, line: 324, baseType: !272, size: 64, offset: 960)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_zone_t", file: !139, line: 174, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 167, size: 256, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "i_start", scope: !274, file: !139, line: 169, baseType: !136, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "i_end", scope: !274, file: !139, line: 169, baseType: !136, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "b_force_qp", scope: !274, file: !139, line: 170, baseType: !136, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !274, file: !139, line: 171, baseType: !136, size: 32, offset: 96)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "f_bitrate_factor", scope: !274, file: !139, line: 172, baseType: !236, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !274, file: !139, line: 173, baseType: !282, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "i_zones", scope: !244, file: !139, line: 325, baseType: !136, size: 32, offset: 1024)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "psz_zones", scope: !244, file: !139, line: 326, baseType: !188, size: 64, offset: 1088)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "b_aud", scope: !145, file: !139, line: 330, baseType: !136, size: 32, offset: 5056)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "b_repeat_headers", scope: !145, file: !139, line: 331, baseType: !136, size: 32, offset: 5088)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "b_annexb", scope: !145, file: !139, line: 332, baseType: !136, size: 32, offset: 5120)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !145, file: !139, line: 334, baseType: !136, size: 32, offset: 5152)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "b_vfr_input", scope: !145, file: !139, line: 335, baseType: !136, size: 32, offset: 5184)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_num", scope: !145, file: !139, line: 336, baseType: !291, size: 32, offset: 5216)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !65, line: 26, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !67, line: 42, baseType: !7)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "i_fps_den", scope: !145, file: !139, line: 337, baseType: !291, size: 32, offset: 5248)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_num", scope: !145, file: !139, line: 338, baseType: !291, size: 32, offset: 5280)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "i_timebase_den", scope: !145, file: !139, line: 339, baseType: !291, size: 32, offset: 5312)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "b_dts_compress", scope: !145, file: !139, line: 340, baseType: !136, size: 32, offset: 5344)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "b_tff", scope: !145, file: !139, line: 344, baseType: !136, size: 32, offset: 5376)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct", scope: !145, file: !139, line: 356, baseType: !136, size: 32, offset: 5408)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "b_fake_interlaced", scope: !145, file: !139, line: 364, baseType: !136, size: 32, offset: 5440)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_size", scope: !145, file: !139, line: 367, baseType: !136, size: 32, offset: 5472)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_max_mbs", scope: !145, file: !139, line: 368, baseType: !136, size: 32, offset: 5504)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "i_slice_count", scope: !145, file: !139, line: 369, baseType: !136, size: 32, offset: 5536)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "param_free", scope: !145, file: !139, line: 375, baseType: !304, size: 64, offset: 5568)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !14}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !140, file: !141, line: 386, baseType: !308, size: 8256, offset: 5632)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 8256, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 129)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "thread_handle", scope: !140, file: !141, line: 387, baseType: !136, size: 32, offset: 13888)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "b_thread_active", scope: !140, file: !141, line: 388, baseType: !136, size: 32, offset: 13920)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_phase", scope: !140, file: !141, line: 389, baseType: !136, size: 32, offset: 13952)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_start", scope: !140, file: !141, line: 390, baseType: !136, size: 32, offset: 13984)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "i_threadslice_end", scope: !140, file: !141, line: 391, baseType: !136, size: 32, offset: 14016)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !140, file: !141, line: 402, baseType: !317, size: 576, offset: 14080)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !141, line: 394, size: 576, elements: !318)
!318 = !{!319, !320, !321, !331, !332, !333}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal", scope: !317, file: !141, line: 396, baseType: !136, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "i_nals_allocated", scope: !317, file: !141, line: 397, baseType: !136, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "nal", scope: !317, file: !141, line: 398, baseType: !322, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_nal_t", file: !139, line: 604, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 593, size: 192, elements: !325)
!325 = !{!326, !327, !328, !329}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref_idc", scope: !324, file: !139, line: 595, baseType: !136, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !324, file: !139, line: 596, baseType: !136, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "i_payload", scope: !324, file: !139, line: 599, baseType: !136, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "p_payload", scope: !324, file: !139, line: 603, baseType: !330, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "i_bitstream", scope: !317, file: !141, line: 399, baseType: !136, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "p_bitstream", scope: !317, file: !141, line: 400, baseType: !330, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !317, file: !141, line: 401, baseType: !334, size: 320, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "bs_t", file: !335, line: 56, baseType: !336)
!335 = !DIFile(filename: "x264_src/common/bs.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "5e3e135f4389fadb006d4bc4f2055a86")
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bs_s", file: !335, line: 47, size: 320, elements: !337)
!337 = !{!338, !339, !340, !341, !345, !346}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !336, file: !335, line: 49, baseType: !330, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !336, file: !335, line: 50, baseType: !330, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !336, file: !335, line: 51, baseType: !330, size: 64, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "cur_bits", scope: !336, file: !335, line: 53, baseType: !342, size: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !343, line: 87, baseType: !344)
!343 = !DIFile(filename: "/usr/include/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "a48e64edacc5b19f56c99745232c963c")
!344 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !336, file: !335, line: 54, baseType: !136, size: 32, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "i_bits_encoded", scope: !336, file: !335, line: 55, baseType: !136, size: 32, offset: 288)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer", scope: !140, file: !141, line: 404, baseType: !330, size: 64, offset: 14656)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "nal_buffer_size", scope: !140, file: !141, line: 405, baseType: !136, size: 32, offset: 14720)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !140, file: !141, line: 410, baseType: !136, size: 32, offset: 14752)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !140, file: !141, line: 411, baseType: !136, size: 32, offset: 14784)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "i_thread_frames", scope: !140, file: !141, line: 413, baseType: !136, size: 32, offset: 14816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_type", scope: !140, file: !141, line: 415, baseType: !136, size: 32, offset: 14848)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "i_nal_ref_idc", scope: !140, file: !141, line: 416, baseType: !136, size: 32, offset: 14880)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields", scope: !140, file: !141, line: 418, baseType: !136, size: 32, offset: 14912)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "i_disp_fields_last_frame", scope: !140, file: !141, line: 419, baseType: !136, size: 32, offset: 14944)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_duration", scope: !140, file: !141, line: 420, baseType: !136, size: 32, offset: 14976)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields", scope: !140, file: !141, line: 421, baseType: !136, size: 32, offset: 15008)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !140, file: !141, line: 422, baseType: !136, size: 32, offset: 15040)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !140, file: !141, line: 424, baseType: !136, size: 32, offset: 15072)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !140, file: !141, line: 425, baseType: !136, size: 32, offset: 15104)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "b_queued_intra_refresh", scope: !140, file: !141, line: 427, baseType: !136, size: 32, offset: 15136)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "sps_array", scope: !140, file: !141, line: 430, baseType: !363, size: 10400, offset: 15168)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 10400, elements: !449)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_sps_t", file: !6, line: 154, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 52, size: 10400, elements: !366)
!366 = !{!367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !384, !385, !386, !387, !388, !389, !390, !391, !392, !399, !400, !448}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !365, file: !6, line: 54, baseType: !136, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "i_profile_idc", scope: !365, file: !6, line: 56, baseType: !136, size: 32, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "i_level_idc", scope: !365, file: !6, line: 57, baseType: !136, size: 32, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set0", scope: !365, file: !6, line: 59, baseType: !136, size: 32, offset: 96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set1", scope: !365, file: !6, line: 60, baseType: !136, size: 32, offset: 128)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "b_constraint_set2", scope: !365, file: !6, line: 61, baseType: !136, size: 32, offset: 160)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_frame_num", scope: !365, file: !6, line: 63, baseType: !136, size: 32, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_type", scope: !365, file: !6, line: 65, baseType: !136, size: 32, offset: 224)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_poc_lsb", scope: !365, file: !6, line: 67, baseType: !136, size: 32, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "b_delta_pic_order_always_zero", scope: !365, file: !6, line: 69, baseType: !136, size: 32, offset: 288)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_non_ref_pic", scope: !365, file: !6, line: 70, baseType: !136, size: 32, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_top_to_bottom_field", scope: !365, file: !6, line: 71, baseType: !136, size: 32, offset: 352)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames_in_poc_cycle", scope: !365, file: !6, line: 72, baseType: !136, size: 32, offset: 384)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset_for_ref_frame", scope: !365, file: !6, line: 73, baseType: !381, size: 8192, offset: 416)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 8192, elements: !382)
!382 = !{!383}
!383 = !DISubrange(count: 256)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_frames", scope: !365, file: !6, line: 75, baseType: !136, size: 32, offset: 8608)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "b_gaps_in_frame_num_value_allowed", scope: !365, file: !6, line: 76, baseType: !136, size: 32, offset: 8640)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_width", scope: !365, file: !6, line: 77, baseType: !136, size: 32, offset: 8672)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_height", scope: !365, file: !6, line: 78, baseType: !136, size: 32, offset: 8704)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_mbs_only", scope: !365, file: !6, line: 79, baseType: !136, size: 32, offset: 8736)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "b_mb_adaptive_frame_field", scope: !365, file: !6, line: 80, baseType: !136, size: 32, offset: 8768)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct8x8_inference", scope: !365, file: !6, line: 81, baseType: !136, size: 32, offset: 8800)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "b_crop", scope: !365, file: !6, line: 83, baseType: !136, size: 32, offset: 8832)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !365, file: !6, line: 90, baseType: !393, size: 128, offset: 8864)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !365, file: !6, line: 84, size: 128, elements: !394)
!394 = !{!395, !396, !397, !398}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "i_left", scope: !393, file: !6, line: 86, baseType: !136, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "i_right", scope: !393, file: !6, line: 87, baseType: !136, size: 32, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "i_top", scope: !393, file: !6, line: 88, baseType: !136, size: 32, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "i_bottom", scope: !393, file: !6, line: 89, baseType: !136, size: 32, offset: 96)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "b_vui", scope: !365, file: !6, line: 92, baseType: !136, size: 32, offset: 8992)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !365, file: !6, line: 150, baseType: !401, size: 1344, offset: 9024)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !365, file: !6, line: 93, size: 1344, elements: !402)
!402 = !{!403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "b_aspect_ratio_info_present", scope: !401, file: !6, line: 95, baseType: !136, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_width", scope: !401, file: !6, line: 96, baseType: !136, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "i_sar_height", scope: !401, file: !6, line: 97, baseType: !136, size: 32, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info_present", scope: !401, file: !6, line: 99, baseType: !136, size: 32, offset: 96)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "b_overscan_info", scope: !401, file: !6, line: 100, baseType: !136, size: 32, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "b_signal_type_present", scope: !401, file: !6, line: 102, baseType: !136, size: 32, offset: 160)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "i_vidformat", scope: !401, file: !6, line: 103, baseType: !136, size: 32, offset: 192)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "b_fullrange", scope: !401, file: !6, line: 104, baseType: !136, size: 32, offset: 224)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "b_color_description_present", scope: !401, file: !6, line: 105, baseType: !136, size: 32, offset: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "i_colorprim", scope: !401, file: !6, line: 106, baseType: !136, size: 32, offset: 288)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "i_transfer", scope: !401, file: !6, line: 107, baseType: !136, size: 32, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "i_colmatrix", scope: !401, file: !6, line: 108, baseType: !136, size: 32, offset: 352)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_loc_info_present", scope: !401, file: !6, line: 110, baseType: !136, size: 32, offset: 384)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_top", scope: !401, file: !6, line: 111, baseType: !136, size: 32, offset: 416)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_loc_bottom", scope: !401, file: !6, line: 112, baseType: !136, size: 32, offset: 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "b_timing_info_present", scope: !401, file: !6, line: 114, baseType: !136, size: 32, offset: 480)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_units_in_tick", scope: !401, file: !6, line: 115, baseType: !291, size: 32, offset: 512)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_scale", scope: !401, file: !6, line: 116, baseType: !291, size: 32, offset: 544)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "b_fixed_frame_rate", scope: !401, file: !6, line: 117, baseType: !136, size: 32, offset: 576)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "b_nal_hrd_parameters_present", scope: !401, file: !6, line: 119, baseType: !136, size: 32, offset: 608)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "b_vcl_hrd_parameters_present", scope: !401, file: !6, line: 120, baseType: !136, size: 32, offset: 640)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "hrd", scope: !401, file: !6, line: 137, baseType: !425, size: 384, offset: 672)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !401, file: !6, line: 122, size: 384, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_cnt", scope: !425, file: !6, line: 124, baseType: !136, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_scale", scope: !425, file: !6, line: 125, baseType: !136, size: 32, offset: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_scale", scope: !425, file: !6, line: 126, baseType: !136, size: 32, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_value", scope: !425, file: !6, line: 127, baseType: !136, size: 32, offset: 96)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_value", scope: !425, file: !6, line: 128, baseType: !136, size: 32, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "i_bit_rate_unscaled", scope: !425, file: !6, line: 129, baseType: !136, size: 32, offset: 160)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_size_unscaled", scope: !425, file: !6, line: 130, baseType: !136, size: 32, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "b_cbr_hrd", scope: !425, file: !6, line: 131, baseType: !136, size: 32, offset: 224)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "i_initial_cpb_removal_delay_length", scope: !425, file: !6, line: 133, baseType: !136, size: 32, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_removal_delay_length", scope: !425, file: !6, line: 134, baseType: !136, size: 32, offset: 288)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay_length", scope: !425, file: !6, line: 135, baseType: !136, size: 32, offset: 320)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "i_time_offset_length", scope: !425, file: !6, line: 136, baseType: !136, size: 32, offset: 352)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_struct_present", scope: !401, file: !6, line: 139, baseType: !136, size: 32, offset: 1056)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "b_bitstream_restriction", scope: !401, file: !6, line: 140, baseType: !136, size: 32, offset: 1088)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "b_motion_vectors_over_pic_boundaries", scope: !401, file: !6, line: 141, baseType: !136, size: 32, offset: 1120)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bytes_per_pic_denom", scope: !401, file: !6, line: 142, baseType: !136, size: 32, offset: 1152)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_bits_per_mb_denom", scope: !401, file: !6, line: 143, baseType: !136, size: 32, offset: 1184)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_horizontal", scope: !401, file: !6, line: 144, baseType: !136, size: 32, offset: 1216)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "i_log2_max_mv_length_vertical", scope: !401, file: !6, line: 145, baseType: !136, size: 32, offset: 1248)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_reorder_frames", scope: !401, file: !6, line: 146, baseType: !136, size: 32, offset: 1280)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dec_frame_buffering", scope: !401, file: !6, line: 147, baseType: !136, size: 32, offset: 1312)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "b_qpprime_y_zero_transform_bypass", scope: !365, file: !6, line: 152, baseType: !136, size: 32, offset: 10368)
!449 = !{!450}
!450 = !DISubrange(count: 1)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !140, file: !141, line: 431, baseType: !452, size: 64, offset: 25600)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pps_array", scope: !140, file: !141, line: 432, baseType: !454, size: 960, offset: 25664)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 960, elements: !449)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_pps_t", file: !6, line: 186, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 156, size: 960, elements: !457)
!457 = !{!458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "i_id", scope: !456, file: !6, line: 158, baseType: !136, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "i_sps_id", scope: !456, file: !6, line: 159, baseType: !136, size: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "b_cabac", scope: !456, file: !6, line: 161, baseType: !136, size: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "b_pic_order", scope: !456, file: !6, line: 163, baseType: !136, size: 32, offset: 96)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_slice_groups", scope: !456, file: !6, line: 164, baseType: !136, size: 32, offset: 128)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_default_active", scope: !456, file: !6, line: 166, baseType: !136, size: 32, offset: 160)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_default_active", scope: !456, file: !6, line: 167, baseType: !136, size: 32, offset: 192)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_pred", scope: !456, file: !6, line: 169, baseType: !136, size: 32, offset: 224)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "b_weighted_bipred", scope: !456, file: !6, line: 170, baseType: !136, size: 32, offset: 256)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qp", scope: !456, file: !6, line: 172, baseType: !136, size: 32, offset: 288)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_init_qs", scope: !456, file: !6, line: 173, baseType: !136, size: 32, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_qp_index_offset", scope: !456, file: !6, line: 175, baseType: !136, size: 32, offset: 352)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "b_deblocking_filter_control", scope: !456, file: !6, line: 177, baseType: !136, size: 32, offset: 384)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "b_constrained_intra_pred", scope: !456, file: !6, line: 178, baseType: !136, size: 32, offset: 416)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "b_redundant_pic_cnt", scope: !456, file: !6, line: 179, baseType: !136, size: 32, offset: 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8_mode", scope: !456, file: !6, line: 181, baseType: !136, size: 32, offset: 480)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "i_cqm_preset", scope: !456, file: !6, line: 183, baseType: !136, size: 32, offset: 512)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !456, file: !6, line: 184, baseType: !476, size: 384, offset: 576)
!476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 384, elements: !478)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!478 = !{!70}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !140, file: !141, line: 433, baseType: !480, size: 64, offset: 26624)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !140, file: !141, line: 434, baseType: !136, size: 32, offset: 26688)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "i_dts_compress_multiplier", scope: !140, file: !141, line: 437, baseType: !136, size: 32, offset: 26720)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_mf", scope: !140, file: !141, line: 440, baseType: !484, size: 256, offset: 26752)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 256, elements: !89)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 512, elements: !50)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_mf", scope: !140, file: !141, line: 441, baseType: !488, size: 128, offset: 27008)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !489, size: 128, elements: !40)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 2048, elements: !20)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "unquant4_mf", scope: !140, file: !141, line: 443, baseType: !484, size: 256, offset: 27136)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "unquant8_mf", scope: !140, file: !141, line: 444, baseType: !488, size: 128, offset: 27392)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_mf", scope: !140, file: !141, line: 446, baseType: !494, size: 256, offset: 27520)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 256, elements: !89)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 256, elements: !50)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_mf", scope: !140, file: !141, line: 447, baseType: !498, size: 128, offset: 27776)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 128, elements: !40)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 1024, elements: !20)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "quant4_bias", scope: !140, file: !141, line: 448, baseType: !494, size: 256, offset: 27904)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "quant8_bias", scope: !140, file: !141, line: 449, baseType: !498, size: 128, offset: 28160)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv", scope: !140, file: !141, line: 454, baseType: !504, size: 5888, offset: 28288)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 5888, elements: !506)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!506 = !{!507}
!507 = !DISubrange(count: 92)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "cost_mv_fpel", scope: !140, file: !141, line: 455, baseType: !509, size: 23552, offset: 34176)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 23552, elements: !510)
!510 = !{!507, !90}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !140, file: !141, line: 457, baseType: !477, size: 64, offset: 57728)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sh", scope: !140, file: !141, line: 460, baseType: !513, size: 53376, offset: 57856)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_slice_header_t", file: !141, line: 364, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 302, size: 53376, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !544, !574, !575, !576, !582, !583, !584, !585, !586, !587, !588, !589}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !514, file: !141, line: 304, baseType: !452, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !514, file: !141, line: 305, baseType: !480, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !514, file: !141, line: 307, baseType: !136, size: 32, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "i_first_mb", scope: !514, file: !141, line: 308, baseType: !136, size: 32, offset: 160)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_mb", scope: !514, file: !141, line: 309, baseType: !136, size: 32, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "i_pps_id", scope: !514, file: !141, line: 311, baseType: !136, size: 32, offset: 224)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !514, file: !141, line: 313, baseType: !136, size: 32, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "b_mbaff", scope: !514, file: !141, line: 315, baseType: !136, size: 32, offset: 288)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "b_field_pic", scope: !514, file: !141, line: 316, baseType: !136, size: 32, offset: 320)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "b_bottom_field", scope: !514, file: !141, line: 317, baseType: !136, size: 32, offset: 352)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "i_idr_pic_id", scope: !514, file: !141, line: 319, baseType: !136, size: 32, offset: 384)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !514, file: !141, line: 321, baseType: !136, size: 32, offset: 416)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc_bottom", scope: !514, file: !141, line: 322, baseType: !136, size: 32, offset: 448)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "i_delta_poc", scope: !514, file: !141, line: 324, baseType: !240, size: 64, offset: 480)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "i_redundant_pic_cnt", scope: !514, file: !141, line: 325, baseType: !136, size: 32, offset: 544)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "b_direct_spatial_mv_pred", scope: !514, file: !141, line: 327, baseType: !136, size: 32, offset: 576)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "b_num_ref_idx_override", scope: !514, file: !141, line: 329, baseType: !136, size: 32, offset: 608)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l0_active", scope: !514, file: !141, line: 330, baseType: !136, size: 32, offset: 640)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "i_num_ref_idx_l1_active", scope: !514, file: !141, line: 331, baseType: !136, size: 32, offset: 672)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l0", scope: !514, file: !141, line: 333, baseType: !136, size: 32, offset: 704)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_pic_list_reordering_l1", scope: !514, file: !141, line: 334, baseType: !136, size: 32, offset: 736)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pic_list_order", scope: !514, file: !141, line: 339, baseType: !538, size: 2048, offset: 768)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 2048, elements: !543)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !141, line: 335, size: 64, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "idc", scope: !539, file: !141, line: 337, baseType: !136, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !539, file: !141, line: 338, baseType: !136, size: 32, offset: 32)
!543 = !{!41, !51}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !514, file: !141, line: 342, baseType: !545, size: 49152, align: 128, offset: 2816)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 49152, align: 128, elements: !572)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_weight_t", file: !547, line: 36, baseType: !548, align: 128)
!547 = !DIFile(filename: "x264_src/common/mc.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "04d0fbb98b637fe4174e4cc20d723861")
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_weight_t", file: !547, line: 26, size: 512, elements: !549)
!549 = !{!550, !558, !559, !562, !563, !564}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "cachea", scope: !548, file: !547, line: 30, baseType: !551, size: 128, align: 128)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 128, elements: !556)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !553, line: 25, baseType: !554)
!553 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "", checksumkind: CSK_MD5, checksum: "55bcbdc3159515ebd91d351a70d505f4")
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !67, line: 39, baseType: !555)
!555 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!556 = !{!557}
!557 = !DISubrange(count: 8)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "cacheb", scope: !548, file: !547, line: 31, baseType: !551, size: 128, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "i_denom", scope: !548, file: !547, line: 32, baseType: !560, size: 32, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !553, line: 26, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !67, line: 41, baseType: !136)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "i_scale", scope: !548, file: !547, line: 33, baseType: !560, size: 32, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "i_offset", scope: !548, file: !547, line: 34, baseType: !560, size: 32, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "weightfn", scope: !548, file: !547, line: 35, baseType: !565, size: 64, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "weight_fn_t", file: !547, line: 25, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !330, !136, !330, !136, !570, !136}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!572 = !{!573, !71}
!573 = !DISubrange(count: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_remove_from_end", scope: !514, file: !141, line: 344, baseType: !136, size: 32, offset: 51968)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "i_mmco_command_count", scope: !514, file: !141, line: 345, baseType: !136, size: 32, offset: 52000)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mmco", scope: !514, file: !141, line: 350, baseType: !577, size: 1024, offset: 52032)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 1024, elements: !50)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !141, line: 346, size: 64, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "i_difference_of_pic_nums", scope: !578, file: !141, line: 348, baseType: !136, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !578, file: !141, line: 349, baseType: !136, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "i_cabac_init_idc", scope: !514, file: !141, line: 352, baseType: !136, size: 32, offset: 53056)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp", scope: !514, file: !141, line: 354, baseType: !136, size: 32, offset: 53088)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "i_qp_delta", scope: !514, file: !141, line: 355, baseType: !136, size: 32, offset: 53120)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "b_sp_for_swidth", scope: !514, file: !141, line: 356, baseType: !136, size: 32, offset: 53152)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "i_qs_delta", scope: !514, file: !141, line: 357, baseType: !136, size: 32, offset: 53184)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "i_disable_deblocking_filter_idc", scope: !514, file: !141, line: 360, baseType: !136, size: 32, offset: 53216)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "i_alpha_c0_offset", scope: !514, file: !141, line: 361, baseType: !136, size: 32, offset: 53248)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "i_beta_offset", scope: !514, file: !141, line: 362, baseType: !136, size: 32, offset: 53280)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !140, file: !141, line: 463, baseType: !591, size: 4096, offset: 111232)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_cabac_t", file: !592, line: 46, baseType: !593)
!592 = !DIFile(filename: "x264_src/common/cabac.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "22d062fb0f207ca9dcf17e0003a54ffb")
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !592, line: 27, size: 4096, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600, !601, !602, !603}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "i_low", scope: !593, file: !592, line: 30, baseType: !136, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "i_range", scope: !593, file: !592, line: 31, baseType: !136, size: 32, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "i_queue", scope: !593, file: !592, line: 34, baseType: !136, size: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "i_bytes_outstanding", scope: !593, file: !592, line: 35, baseType: !136, size: 32, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "p_start", scope: !593, file: !592, line: 37, baseType: !330, size: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !593, file: !592, line: 38, baseType: !330, size: 64, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "p_end", scope: !593, file: !592, line: 39, baseType: !330, size: 64, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "f8_bits_encoded", scope: !593, file: !592, line: 42, baseType: !136, size: 32, align: 128, offset: 384)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !593, file: !592, line: 45, baseType: !604, size: 3680, offset: 416)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 3680, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 460)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !140, file: !141, line: 494, baseType: !608, size: 2112, offset: 115328)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !141, line: 465, size: 2112, elements: !609)
!609 = !{!610, !750, !752, !753, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !766, !767, !768, !769}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !608, file: !141, line: 468, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_frame_t", file: !614, line: 146, baseType: !615)
!614 = !DIFile(filename: "x264_src/common/frame.h", directory: "/home/yjs/workspace/x264-test/src", checksumkind: CSK_MD5, checksum: "4a274a9291201f03b4af1f57e6a86f6f")
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "x264_frame", file: !614, line: 31, size: 125056, elements: !616)
!616 = !{!617, !618, !619, !620, !623, !624, !625, !626, !627, !628, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !646, !647, !648, !649, !650, !651, !653, !655, !656, !657, !658, !659, !662, !664, !665, !667, !672, !673, !677, !678, !682, !686, !689, !691, !692, !694, !695, !697, !698, !699, !702, !704, !705, !706, !708, !709, !710, !711, !712, !713, !714, !715, !717, !718, !722, !731, !735, !737, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc", scope: !615, file: !614, line: 34, baseType: !136, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !615, file: !614, line: 35, baseType: !136, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "i_qpplus1", scope: !615, file: !614, line: 36, baseType: !136, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "i_pts", scope: !615, file: !614, line: 37, baseType: !621, size: 64, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !553, line: 27, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !67, line: 44, baseType: !344)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts", scope: !615, file: !614, line: 38, baseType: !621, size: 64, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "i_duration", scope: !615, file: !614, line: 39, baseType: !136, size: 32, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_duration", scope: !615, file: !614, line: 40, baseType: !136, size: 32, offset: 288)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay", scope: !615, file: !614, line: 41, baseType: !136, size: 32, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "i_dpb_output_delay", scope: !615, file: !614, line: 42, baseType: !136, size: 32, offset: 352)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !615, file: !614, line: 43, baseType: !629, size: 64, offset: 384)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame", scope: !615, file: !614, line: 45, baseType: !136, size: 32, offset: 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded", scope: !615, file: !614, line: 46, baseType: !136, size: 32, offset: 480)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "i_field_cnt", scope: !615, file: !614, line: 47, baseType: !136, size: 32, offset: 512)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "i_frame_num", scope: !615, file: !614, line: 48, baseType: !136, size: 32, offset: 544)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "b_kept_as_ref", scope: !615, file: !614, line: 49, baseType: !136, size: 32, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "i_pic_struct", scope: !615, file: !614, line: 50, baseType: !136, size: 32, offset: 608)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "b_keyframe", scope: !615, file: !614, line: 51, baseType: !136, size: 32, offset: 640)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "b_fdec", scope: !615, file: !614, line: 52, baseType: !76, size: 8, offset: 672)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "b_last_minigop_bframe", scope: !615, file: !614, line: 53, baseType: !76, size: 8, offset: 680)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframes", scope: !615, file: !614, line: 54, baseType: !76, size: 8, offset: 688)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_rc", scope: !615, file: !614, line: 55, baseType: !236, size: 32, offset: 704)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_avg_aq", scope: !615, file: !614, line: 56, baseType: !236, size: 32, offset: 736)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "i_poc_l0ref0", scope: !615, file: !614, line: 57, baseType: !136, size: 32, offset: 768)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "i_plane", scope: !615, file: !614, line: 60, baseType: !136, size: 32, offset: 800)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride", scope: !615, file: !614, line: 61, baseType: !645, size: 96, offset: 832)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 96, elements: !104)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "i_width", scope: !615, file: !614, line: 62, baseType: !645, size: 96, offset: 928)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines", scope: !615, file: !614, line: 63, baseType: !645, size: 96, offset: 1024)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "i_stride_lowres", scope: !615, file: !614, line: 64, baseType: !136, size: 32, offset: 1120)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "i_width_lowres", scope: !615, file: !614, line: 65, baseType: !136, size: 32, offset: 1152)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_lowres", scope: !615, file: !614, line: 66, baseType: !136, size: 32, offset: 1184)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !615, file: !614, line: 67, baseType: !652, size: 192, offset: 1216)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 192, elements: !104)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "filtered", scope: !615, file: !614, line: 68, baseType: !654, size: 256, offset: 1408)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 256, elements: !89)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !615, file: !614, line: 69, baseType: !654, size: 256, offset: 1664)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "integral", scope: !615, file: !614, line: 70, baseType: !505, size: 64, offset: 1920)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !615, file: !614, line: 74, baseType: !654, size: 256, offset: 1984)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_lowres", scope: !615, file: !614, line: 75, baseType: !654, size: 256, offset: 2240)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !615, file: !614, line: 77, baseType: !660, size: 24576, align: 128, offset: 2560)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 24576, align: 128, elements: !661)
!661 = !{!51, !71}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "weighted", scope: !615, file: !614, line: 78, baseType: !663, size: 1024, offset: 27136)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 1024, elements: !50)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "b_duplicate", scope: !615, file: !614, line: 79, baseType: !136, size: 32, offset: 28160)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !615, file: !614, line: 80, baseType: !666, size: 64, offset: 28224)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !615, file: !614, line: 83, baseType: !668, size: 64, offset: 28288)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !553, line: 24, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !67, line: 37, baseType: !671)
!671 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "mb_partition", scope: !615, file: !614, line: 84, baseType: !330, size: 64, offset: 28352)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !615, file: !614, line: 85, baseType: !674, size: 128, offset: 28416)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 128, elements: !40)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 32, elements: !40)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mv16x16", scope: !615, file: !614, line: 86, baseType: !675, size: 64, offset: 28544)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mvs", scope: !615, file: !614, line: 87, baseType: !679, size: 2176, offset: 28608)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 2176, elements: !680)
!680 = !{!41, !681}
!681 = !DISubrange(count: 17)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_costs", scope: !615, file: !614, line: 92, baseType: !683, size: 20736, offset: 30784)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 20736, elements: !684)
!684 = !{!685, !685}
!685 = !DISubrange(count: 18)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "lowres_mv_costs", scope: !615, file: !614, line: 96, baseType: !687, size: 2176, offset: 51520)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 2176, elements: !680)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !615, file: !614, line: 97, baseType: !690, size: 128, offset: 53696)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !668, size: 128, elements: !40)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref", scope: !615, file: !614, line: 98, baseType: !240, size: 64, offset: 53824)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ref_poc", scope: !615, file: !614, line: 99, baseType: !693, size: 1024, offset: 53888)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1024, elements: !543)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "inv_ref_poc", scope: !615, file: !614, line: 100, baseType: !676, size: 32, offset: 54912)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est", scope: !615, file: !614, line: 105, baseType: !696, size: 10368, offset: 54944)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 10368, elements: !684)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "i_cost_est_aq", scope: !615, file: !614, line: 106, baseType: !696, size: 10368, offset: 65312)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "i_satd", scope: !615, file: !614, line: 107, baseType: !136, size: 32, offset: 75680)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_mbs", scope: !615, file: !614, line: 108, baseType: !700, size: 576, offset: 75712)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 576, elements: !701)
!701 = !{!685}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satds", scope: !615, file: !614, line: 109, baseType: !703, size: 20736, offset: 76288)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 20736, elements: !684)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_satd", scope: !615, file: !614, line: 110, baseType: !688, size: 64, offset: 97024)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "i_row_bits", scope: !615, file: !614, line: 111, baseType: !688, size: 64, offset: 97088)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "f_row_qp", scope: !615, file: !614, line: 112, baseType: !707, size: 64, offset: 97152)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset", scope: !615, file: !614, line: 113, baseType: !707, size: 64, offset: 97216)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "f_qp_offset_aq", scope: !615, file: !614, line: 114, baseType: !707, size: 64, offset: 97280)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "b_intra_calculated", scope: !615, file: !614, line: 115, baseType: !136, size: 32, offset: 97344)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra_cost", scope: !615, file: !614, line: 116, baseType: !505, size: 64, offset: 97408)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "i_propagate_cost", scope: !615, file: !614, line: 117, baseType: !505, size: 64, offset: 97472)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "i_inv_qscale_factor", scope: !615, file: !614, line: 118, baseType: !505, size: 64, offset: 97536)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "b_scenecut", scope: !615, file: !614, line: 119, baseType: !136, size: 32, offset: 97600)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "f_weighted_cost_delta", scope: !615, file: !614, line: 120, baseType: !716, size: 576, offset: 97632)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, size: 576, elements: !701)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_sum", scope: !615, file: !614, line: 121, baseType: !291, size: 32, offset: 98208)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "i_pixel_ssd", scope: !615, file: !614, line: 122, baseType: !719, size: 64, offset: 98240)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !65, line: 27, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !67, line: 45, baseType: !721)
!721 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_timing", scope: !615, file: !614, line: 125, baseType: !723, size: 256, offset: 98304)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "x264_hrd_t", file: !139, line: 503, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 496, size: 256, elements: !725)
!725 = !{!726, !728, !729, !730}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_initial_arrival_time", scope: !724, file: !139, line: 498, baseType: !727, size: 64)
!727 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_final_arrival_time", scope: !724, file: !139, line: 499, baseType: !727, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_time", scope: !724, file: !139, line: 500, baseType: !727, size: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_time", scope: !724, file: !139, line: 502, baseType: !727, size: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_type", scope: !615, file: !614, line: 128, baseType: !732, size: 2008, offset: 98560)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 2008, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 251)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "i_planned_satd", scope: !615, file: !614, line: 129, baseType: !736, size: 8032, offset: 100576)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 8032, elements: !733)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "f_planned_cpb_duration", scope: !615, file: !614, line: 130, baseType: !738, size: 16064, offset: 108608)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 16064, elements: !733)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "i_coded_fields_lookahead", scope: !615, file: !614, line: 131, baseType: !136, size: 32, offset: 124672)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "i_cpb_delay_lookahead", scope: !615, file: !614, line: 132, baseType: !136, size: 32, offset: 124704)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_completed", scope: !615, file: !614, line: 135, baseType: !136, size: 32, offset: 124736)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "i_lines_weighted", scope: !615, file: !614, line: 136, baseType: !136, size: 32, offset: 124768)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "i_reference_count", scope: !615, file: !614, line: 137, baseType: !136, size: 32, offset: 124800)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !615, file: !614, line: 138, baseType: !136, size: 32, offset: 124832)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "cv", scope: !615, file: !614, line: 139, baseType: !136, size: 32, offset: 124864)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "f_pir_position", scope: !615, file: !614, line: 142, baseType: !236, size: 32, offset: 124896)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_start_col", scope: !615, file: !614, line: 143, baseType: !136, size: 32, offset: 124928)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "i_pir_end_col", scope: !615, file: !614, line: 144, baseType: !136, size: 32, offset: 124960)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "i_frames_since_pir", scope: !615, file: !614, line: 145, baseType: !136, size: 32, offset: 124992)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !608, file: !141, line: 470, baseType: !751, size: 128, offset: 64)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 128, elements: !40)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "blank_unused", scope: !608, file: !141, line: 473, baseType: !611, size: 64, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !608, file: !141, line: 476, baseType: !754, size: 1152, offset: 256)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 1152, elements: !701)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "i_last_keyframe", scope: !608, file: !141, line: 478, baseType: !136, size: 32, offset: 1408)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "i_input", scope: !608, file: !141, line: 480, baseType: !136, size: 32, offset: 1440)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_dpb", scope: !608, file: !141, line: 482, baseType: !136, size: 32, offset: 1472)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref0", scope: !608, file: !141, line: 483, baseType: !136, size: 32, offset: 1504)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "i_max_ref1", scope: !608, file: !141, line: 484, baseType: !136, size: 32, offset: 1536)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "i_delay", scope: !608, file: !141, line: 485, baseType: !136, size: 32, offset: 1568)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay", scope: !608, file: !141, line: 486, baseType: !136, size: 32, offset: 1600)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "i_bframe_delay_time", scope: !608, file: !141, line: 487, baseType: !621, size: 64, offset: 1664)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "i_init_delta", scope: !608, file: !141, line: 488, baseType: !621, size: 64, offset: 1728)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "i_prev_reordered_pts", scope: !608, file: !141, line: 489, baseType: !765, size: 128, offset: 1792)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !621, size: 128, elements: !40)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "i_largest_pts", scope: !608, file: !141, line: 490, baseType: !621, size: 64, offset: 1920)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "i_second_largest_pts", scope: !608, file: !141, line: 491, baseType: !621, size: 64, offset: 1984)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_lowres", scope: !608, file: !141, line: 492, baseType: !136, size: 32, offset: 2048)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "b_have_sub8x8_esa", scope: !608, file: !141, line: 493, baseType: !136, size: 32, offset: 2080)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "fenc", scope: !140, file: !141, line: 497, baseType: !612, size: 64, offset: 117440)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fdec", scope: !140, file: !141, line: 500, baseType: !612, size: 64, offset: 117504)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref0", scope: !140, file: !141, line: 503, baseType: !136, size: 32, offset: 117568)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fref0", scope: !140, file: !141, line: 504, baseType: !774, size: 1216, offset: 117632)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 1216, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 19)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "i_ref1", scope: !140, file: !141, line: 505, baseType: !136, size: 32, offset: 118848)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "fref1", scope: !140, file: !141, line: 506, baseType: !774, size: 1216, offset: 118912)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "b_ref_reorder", scope: !140, file: !141, line: 507, baseType: !240, size: 64, offset: 120128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay", scope: !140, file: !141, line: 510, baseType: !136, size: 32, offset: 120192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_offset", scope: !140, file: !141, line: 511, baseType: !136, size: 32, offset: 120224)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "i_reordered_pts_delay", scope: !140, file: !141, line: 512, baseType: !621, size: 64, offset: 120256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "dct", scope: !140, file: !141, line: 522, baseType: !784, size: 10624, offset: 120320)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !141, line: 515, size: 10624, elements: !785)
!785 = !{!786, !788, !791, !794}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "luma16x16_dc", scope: !784, file: !141, line: 517, baseType: !787, size: 256, align: 128)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 256, elements: !50)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_dc", scope: !784, file: !141, line: 518, baseType: !789, size: 128, align: 128, offset: 256)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 128, elements: !790)
!790 = !{!41, !90}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "luma8x8", scope: !784, file: !141, line: 520, baseType: !792, size: 4096, align: 128, offset: 384)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 4096, elements: !793)
!793 = !{!90, !21}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "luma4x4", scope: !784, file: !141, line: 521, baseType: !795, size: 6144, align: 128, offset: 4480)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 6144, elements: !796)
!796 = !{!797, !51}
!797 = !DISubrange(count: 24)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "mb", scope: !140, file: !141, line: 732, baseType: !799, size: 82688, offset: 130944)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !140, file: !141, line: 525, size: 82688, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !828, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !846, !849, !853, !854, !855, !860, !861, !864, !865, !866, !867, !868, !869, !870, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !930, !959, !960, !961, !962, !963, !964, !965, !966, !967, !970, !971, !972, !975, !978, !980, !983, !985, !986}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_count", scope: !799, file: !141, line: 527, baseType: !136, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_stride", scope: !799, file: !141, line: 530, baseType: !136, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_stride", scope: !799, file: !141, line: 531, baseType: !136, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_stride", scope: !799, file: !141, line: 532, baseType: !136, size: 32, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_x", scope: !799, file: !141, line: 535, baseType: !136, size: 32, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_y", scope: !799, file: !141, line: 536, baseType: !136, size: 32, offset: 160)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_xy", scope: !799, file: !141, line: 537, baseType: !136, size: 32, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "i_b8_xy", scope: !799, file: !141, line: 538, baseType: !136, size: 32, offset: 224)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "i_b4_xy", scope: !799, file: !141, line: 539, baseType: !136, size: 32, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "i_me_method", scope: !799, file: !141, line: 542, baseType: !136, size: 32, offset: 288)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "i_subpel_refine", scope: !799, file: !141, line: 543, baseType: !136, size: 32, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "b_chroma_me", scope: !799, file: !141, line: 544, baseType: !136, size: 32, offset: 352)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "b_trellis", scope: !799, file: !141, line: 545, baseType: !136, size: 32, offset: 384)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "b_noise_reduction", scope: !799, file: !141, line: 546, baseType: !136, size: 32, offset: 416)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "b_dct_decimate", scope: !799, file: !141, line: 547, baseType: !136, size: 32, offset: 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_rd", scope: !799, file: !141, line: 548, baseType: !136, size: 32, offset: 480)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "i_psy_trellis", scope: !799, file: !141, line: 549, baseType: !136, size: 32, offset: 512)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "b_interlaced", scope: !799, file: !141, line: 551, baseType: !136, size: 32, offset: 544)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min", scope: !799, file: !141, line: 554, baseType: !240, size: 64, offset: 576)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max", scope: !799, file: !141, line: 555, baseType: !240, size: 64, offset: 640)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_spel", scope: !799, file: !141, line: 558, baseType: !240, size: 64, offset: 704)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_spel", scope: !799, file: !141, line: 559, baseType: !240, size: 64, offset: 768)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "mv_min_fpel", scope: !799, file: !141, line: 561, baseType: !240, size: 64, offset: 832)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "mv_max_fpel", scope: !799, file: !141, line: 562, baseType: !240, size: 64, offset: 896)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour", scope: !799, file: !141, line: 565, baseType: !7, size: 32, offset: 960)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour8", scope: !799, file: !141, line: 566, baseType: !827, size: 128, offset: 992)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 128, elements: !89)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour4", scope: !799, file: !141, line: 567, baseType: !829, size: 512, offset: 1120)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !50)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_intra", scope: !799, file: !141, line: 568, baseType: !7, size: 32, offset: 1632)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "i_neighbour_frame", scope: !799, file: !141, line: 569, baseType: !7, size: 32, offset: 1664)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_top", scope: !799, file: !141, line: 570, baseType: !136, size: 32, offset: 1696)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_left", scope: !799, file: !141, line: 571, baseType: !136, size: 32, offset: 1728)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topleft", scope: !799, file: !141, line: 572, baseType: !136, size: 32, offset: 1760)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_type_topright", scope: !799, file: !141, line: 573, baseType: !136, size: 32, offset: 1792)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_prev_xy", scope: !799, file: !141, line: 574, baseType: !136, size: 32, offset: 1824)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_left_xy", scope: !799, file: !141, line: 575, baseType: !136, size: 32, offset: 1856)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_top_xy", scope: !799, file: !141, line: 576, baseType: !136, size: 32, offset: 1888)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topleft_xy", scope: !799, file: !141, line: 577, baseType: !136, size: 32, offset: 1920)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "i_mb_topright_xy", scope: !799, file: !141, line: 578, baseType: !136, size: 32, offset: 1952)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !799, file: !141, line: 585, baseType: !668, size: 64, offset: 1984)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "partition", scope: !799, file: !141, line: 586, baseType: !330, size: 64, offset: 2048)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "qp", scope: !799, file: !141, line: 587, baseType: !668, size: 64, offset: 2112)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "cbp", scope: !799, file: !141, line: 588, baseType: !845, size: 64, offset: 2176)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "intra4x4_pred_mode", scope: !799, file: !141, line: 589, baseType: !847, size: 64, offset: 2240)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 64, elements: !556)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "non_zero_count", scope: !799, file: !141, line: 591, baseType: !850, size: 64, offset: 2304)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 192, elements: !852)
!852 = !{!797}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_pred_mode", scope: !799, file: !141, line: 592, baseType: !668, size: 64, offset: 2368)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "mv", scope: !799, file: !141, line: 593, baseType: !674, size: 128, offset: 2432)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "mvd", scope: !799, file: !141, line: 594, baseType: !856, size: 128, offset: 2560)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !857, size: 128, elements: !40)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 128, elements: !859)
!859 = !{!557, !41}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ref", scope: !799, file: !141, line: 595, baseType: !690, size: 128, offset: 2688)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "mvr", scope: !799, file: !141, line: 596, baseType: !862, size: 4096, offset: 2816)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 4096, elements: !863)
!863 = !{!41, !573}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "skipbp", scope: !799, file: !141, line: 597, baseType: !668, size: 64, offset: 6912)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "mb_transform_size", scope: !799, file: !141, line: 598, baseType: !668, size: 64, offset: 6976)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "slice_table", scope: !799, file: !141, line: 599, baseType: !505, size: 64, offset: 7040)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "p_weight_buf", scope: !799, file: !141, line: 603, baseType: !663, size: 1024, offset: 7104)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "i_type", scope: !799, file: !141, line: 606, baseType: !136, size: 32, offset: 8128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "i_partition", scope: !799, file: !141, line: 607, baseType: !136, size: 32, offset: 8160)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "i_sub_partition", scope: !799, file: !141, line: 608, baseType: !871, size: 32, align: 32, offset: 8192)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 32, elements: !89)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "b_transform_8x8", scope: !799, file: !141, line: 609, baseType: !136, size: 32, offset: 8224)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_luma", scope: !799, file: !141, line: 611, baseType: !136, size: 32, offset: 8256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "i_cbp_chroma", scope: !799, file: !141, line: 612, baseType: !136, size: 32, offset: 8288)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "i_intra16x16_pred_mode", scope: !799, file: !141, line: 614, baseType: !136, size: 32, offset: 8320)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "i_chroma_pred_mode", scope: !799, file: !141, line: 615, baseType: !136, size: 32, offset: 8352)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "i_skip_intra", scope: !799, file: !141, line: 621, baseType: !136, size: 32, offset: 8384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "b_skip_mc", scope: !799, file: !141, line: 624, baseType: !136, size: 32, offset: 8416)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "b_reencode_mb", scope: !799, file: !141, line: 626, baseType: !136, size: 32, offset: 8448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ip_offset", scope: !799, file: !141, line: 627, baseType: !136, size: 32, offset: 8480)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "pic", scope: !799, file: !141, line: 671, baseType: !882, size: 60672, offset: 8576)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !799, file: !141, line: 629, size: 60672, elements: !883)
!883 = !{!884, !888, !892, !894, !895, !898, !902, !904, !905, !906, !907, !908, !911, !915, !918, !919, !920, !921, !922, !925, !927, !929}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "fenc_buf", scope: !882, file: !141, line: 634, baseType: !885, size: 3072, align: 128)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 3072, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 384)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "fdec_buf", scope: !882, file: !141, line: 635, baseType: !889, size: 6912, align: 128, offset: 3072)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 6912, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 864)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_fdec_buf", scope: !882, file: !141, line: 638, baseType: !893, size: 2048, align: 128, offset: 9984)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 2048, elements: !382)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_fdec_buf", scope: !882, file: !141, line: 639, baseType: !893, size: 2048, align: 128, offset: 12032)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_dct_buf", scope: !882, file: !141, line: 640, baseType: !896, size: 3072, align: 128, offset: 14080)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 3072, elements: !897)
!897 = !{!71, !21}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_dct_buf", scope: !882, file: !141, line: 641, baseType: !899, size: 3840, align: 128, offset: 17152)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 3840, elements: !900)
!900 = !{!901, !51}
!901 = !DISubrange(count: 15)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_nnz_buf", scope: !882, file: !141, line: 642, baseType: !903, size: 128, offset: 20992)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 128, elements: !89)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "i8x8_nnz_buf", scope: !882, file: !141, line: 643, baseType: !903, size: 128, offset: 21120)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "i4x4_cbp", scope: !882, file: !141, line: 644, baseType: !136, size: 32, offset: 21248)
